{"submission": {"author": "omtothenom", "author_created_utc": 1347828615, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9127o", "created_utc": 1350740046, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/11sowa/did_any_of_the_mothers_here_not_want_children/", "gilded": 0, "id": "11sowa", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/11sowa/did_any_of_the_mothers_here_not_want_children/", "retrieved_on": 1413476897, "score": 26, "secure_media_embed": {}, "selftext": "I'm wondering about the experiences of mothers who didn't want kids before getting pregnant as compared to those who have always wanted to become moms.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Did any of the mothers here not want children before a certain age/before they got pregnant?", "url": "http://www.reddit.com/r/Mommit/comments/11sowa/did_any_of_the_mothers_here_not_want_children/", "user_reports": []}, "comments": [{"archived": true, "author": "apunkcatinspace", "author_flair_css_class": "red", "author_flair_text": "Lilou´s mom", "body": "I went through everything, originally I wanted to have kids at 21. then I grew up up and said screw that! I later decided I didn't want any and for a few years that was the case, even after I got married (we both agreed), eventually though we started to want a family and started trying o get pregnant, especially because I always said I wanted no kids after 35. After about 2 years we were told our chances of bringing a child into this world were practically nil if we didn't use IVF or some treatment, this time I said \"screw that\" as well ( I had seen a friend go through treatments) and decided I would prefer to be childless than feel like shit, have so many possible complications, maybe lose the child, then theres the cost of it all (with or without complications) so life kept going. After 5 years married, we decided to buy a house, nice, decently stylish, we said \"fuck it, it's not like we're having kids\". One day before we signed on the house BAM! I go have some blood tests taken aften some weird bleeding... obviously I was now pregnant, so I ended up having our girl at 34 after all, and I am considering raising that 35 year mark to have another so my baby can know the agony of having a sibling lol.", "controversiality": 0, "created_utc": 1350742548, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p9092", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196066, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SarahResolute", "author_flair_css_class": null, "author_flair_text": null, "body": "*sigh* yeah, and I'm not proud of it.\n\nI never hated kids, and I knew that I would want kids later in my life, but I wasn't ready yet. It was difficult for me. I wasn't quite done with my degree, my husband had just gotten accepted to medical school, and I just didn't feel ready.  I really didn't have much time to prepare myself for a baby either.  I found out that I was pregnant three days after my husband's acceptance to medical school.  Within those nine months I had an 18 credit semester, my husband's graduation, the death of two family members, a move halfway across the country, and a terrible storm where we lost power and potable water the week before my baby was born. I felt so bad because even when I first held him in my arms I didn't feel the connection that I had heard about. It wasn't until a couple weeks after he was born where I felt... content.  I wasn't happy yet, but I had finally felt that deep, unexplainable love for my son. He had just eaten and had fallen asleep on my chest and I felt like my heart was going to explode.  \n\nSo yes, even though I wish that I would've gotten pregnant later (maybe after medical school), I wouldn't trade it for anything.", "controversiality": 0, "created_utc": 1350742674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p90wn", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196075, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lindsayamber", "author_flair_css_class": "lightcoral", "author_flair_text": "Kieran 8/30/10, Aria 3/27/13", "body": "All I ever wanted was to be a mommy. When other girls talked about becoming singers and actresses, I just wanted to have a family. I was weird...\n\nMy husband and I were married at 19 and had no plans of rushing into having children, but knew we wanted to eventually. Three years later, our son came along. He was unexpected but by no means unwanted. A year after that, we decided it was as good a time as any to try to expand our family, but ended up having trouble. It took us a year and the help of Clomid, but we're now expecting number two! I don't know if we'll have any more due to some complications, but I'm so happy to have the family I've always wanted :)\n\n(I know you're asking for moms who didn't want kids, but thought I'd provide a glimpse of the complete opposite for comparison. It is completely normal to not want kids, though. I have a friend who adamantly declared that she never wanted kids, but is now completely in love with motherhood, with two small kids.)", "controversiality": 0, "created_utc": 1350743101, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p939m", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196105, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pipeen", "author_flair_css_class": null, "author_flair_text": null, "body": "I hated kids and up until about 27 was never, ever gonna have one. Now I have a two year old and one on the way. \n\nWtf happened?!? Haha. But I love being a mother so much and really wanted to be a mom before my first was conceived so somewhere between 27 and 31 I changed completely. \n\nEta: I'm still not keen on \"kids\" in general.  I don't really like them on a whole. Which is why I try to avoid places on the weekends.  I love my kid(s) and my those of my friends. But en masse? Nu-uh. You don't have to be a 100% completely OMG I LOVE ALL KIDS AND EVERYTHING ABOUT THEM to be a good mother. ", "controversiality": 0, "created_utc": 1350743861, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p97n8", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196163, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inderpwetrust", "author_flair_css_class": "green", "author_flair_text": "JJ 03-09-12", "body": "Didn't plan on kids or marriage. Met a guy that just so happened to be my soul mate. We eloped, as I still had no desire for a big wedding (I have a huuuuge Catholic family, and after sitting through wedding after wedding... Bleh.)\n\nFast forward nine years. I find out I'm pregnant. Think to myself, sure, it won't be so bad. I now cannot imagine my life without my little guy.", "controversiality": 0, "created_utc": 1350743945, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p984b", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196170, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whyunogivemegoodname", "author_flair_css_class": null, "author_flair_text": null, "body": "I really didn't want to have kids at the age I got pregnant but it was mostly because I was immature, working a minimum wage job and wasn't married. I was worried about not being able to provide. But I ended up marrying my then boyfriend when I was five months along (something I was also kind of worried about- we'd only been dating for about 6 or 7 months and most of our relationship I'd spent pregnant). However, everything worked out better than expected. We've been together about eight years an have one other child as well now.", "controversiality": 0, "created_utc": 1350744089, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p98wz", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196181, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JustSayinSM86", "author_flair_css_class": "purple", "author_flair_text": "Girl 6/5/10 Boy 14/10/11", "body": "I didn't really want kids until after 25. But when I was 22 my gyn/onc said \"If you were my sister I'd tell you to have a baby.\" So the next year, I concieved my daughter (in October 2009, we wanted to concieve January 2010, nevermind!) and since she's been here, life has been that much more awesome. I'm so glad we didn't wait. And now we have our beautiful son and are planning to start trying for a third (and 99.9% final) in August 2013. ", "controversiality": 0, "created_utc": 1350744202, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p99jz", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196189, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "halochick117", "author_flair_css_class": "lightcoral", "author_flair_text": "5yo daughter, 2yo son", "body": "I was never a fan of kids and after being diagnosed with PCOS, I never expected it to happen. I had a tarot card reading years ago and was informed that after our third anniversary, something would happen with regards to children and I just blew it off since it was a tarot reading and hey, I wasn't able to have kids! I got pregnant on our third anniversary. That was four years ago and now I have a daughter and a son and can't imagine my life without them.", "controversiality": 0, "created_utc": 1350745036, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p9efs", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196253, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "invioletlight", "author_flair_css_class": "blue", "author_flair_text": "1 boy under 1yr", "body": "I admit that I was very immature in my teens and early twenties. I'm glad my first was born to me at 28, when I was more mature and much more financially stable. Having a child changed my life for the better as I now no longer do drugs, I exercise and I eat better. My body image and self worth has improved greatly. I felt like a kid till I was 25,haha.", "controversiality": 0, "created_utc": 1350747669, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p9v6m", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196476, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i went back and forth, and i'm embarrassed to admit it depended largely on the attitude of the guy i was with. high school - no kids. college, boyfriend had 2 awesome nephews, wanted kids - i wanted kids. we broke up, next couple of boyfriends were anti-kid - no kids. met fiance, he LOVES kids and definitely wanted several, we got engaged, and as i was warming up to the idea of kids, i got pregnant. i probably would've aborted if it hadn't been for his excitement at having kids and his assurances that i'd be a good mom. i have days where i think he's so, so very wrong, but i'm trying to just roll with it.", "controversiality": 0, "created_utc": 1350747798, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p9w20", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196489, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll answer first on behalf of a non-Redditor friend who is 100% what you're looking for.\n\nShe did not want kids, absolutely hated them, and her husband didn't want kids either. They were married young, at 19, and ten years later, her boss denied her leave for a doctor's appointment. The appointment would have been to renew her birth control prescription. In any case, between then and when the prescription was renewed and filled, she became pregnant (so yeah, she was on the pill for at least part of her pregnancy). \n\nThey decided to keep the child and I watched her morph from \"I hate kids\" to \"I hate kids that aren't mine\" to a total momma bear. Her son is three now and she loves him to pieces.\n\nAs for the parents, they're considering having another. :)", "controversiality": 0, "created_utc": 1350748341, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p9zoc", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196531, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kogasha", "author_flair_css_class": null, "author_flair_text": null, "body": "I never wanted kids. As I child, I played with animals, as a teen, I avoided babies as often as I could. I rarely touched my roommate's daughter after she was born. I had a list in my head of reasons not to have babies.\n\nWhen I found out I was pregnant, I actually had a backup plan just in case I didn't feel anything for my baby.\n\nOf course, then I had her, and I love her more than anything. Figures.\n\nI still can't stand other people's kids though.", "controversiality": 0, "created_utc": 1350748362, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6p9ztn", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "removal_reason": null, "retrieved_on": 1435676903, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kogasha", "author_flair_css_class": null, "author_flair_text": null, "body": "My SO had a tarot card reading that said I was pregnant; three pregnancy tests and a clinic later, I wasn't.\n\nHe got the reading in December. I had her in May.", "controversiality": 0, "created_utc": 1350748645, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pa1s2", "link_id": "t3_11sowa", "parent_id": "t1_c6p9efs", "retrieved_on": 1430196557, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "halochick117", "author_flair_css_class": "lightcoral", "author_flair_text": "5yo daughter, 2yo son", "body": "I found out I was pregnant in November and had her in April. Going from not liking kids and never planning on having them to having our own in 5 months was quite the shocker. \n\nI will say, I didn't bond immediately with my daughter because I was still in shock over everything. I had pre-e and after 24 hours of induced labor on mag, I had a c-section under general anesthesia. It took me several weeks to warm up to the idea I had a child. \n\nMy son, I had a c-section under general anesthesia again but the entire situation with him couldn't have been more different. ", "controversiality": 0, "created_utc": 1350750793, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pah9k", "link_id": "t3_11sowa", "parent_id": "t1_c6pa1s2", "retrieved_on": 1430196760, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarochka", "author_flair_css_class": null, "author_flair_text": null, "body": "I couldn't agree more. I generally dislike everyone else's children and can only tolerate them in small doses. There are exceptions, but generally I try to avoid them if I can. ", "controversiality": 0, "created_utc": 1350751129, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pajsp", "link_id": "t3_11sowa", "parent_id": "t1_c6p97n8", "retrieved_on": 1430196795, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadySybilVimes", "author_flair_css_class": null, "author_flair_text": null, "body": "I remember sitting in a bar in Hong Kong smoking Chinese cigarettes and knocking back dirty martinis wearing a foxy dress and grey patent stilettos. I remember the topic of conversation. Kids or no? I was emphatic. No, never. Not part of the plan.\nFast forward three weeks. I book an appointment to see the doctor as I can't shake the jet lag. I'm worried I picked something up. I realised my ridiculously irregular period still hadn't shown up so I knew they would ask. So I peed on a stick before heading to work. Turns out I was 8 weeks pregnant.\nFast forward four years. My daughter is watching spiderman and my 5 month old is asleep in my arms. \nIt took a great deal to accept the pregnancy and becoming a mother. I'm now a SAHP and I love it. I'd even consider a third or even a fourth....... 28 year old me would be horrified.", "controversiality": 0, "created_utc": 1350751795, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6paotu", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196859, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "techno_for_answers", "author_flair_css_class": null, "author_flair_text": null, "body": "As a (stupid) teen I did. When my sister got pregnant and as I got older I realized the potential hardships. I was at a wreckless point and experimenting with drinking and a few drugs around 23. I met a guy, we slept together for 8 months, and I woke up out of a dead sleep and thought: I'm pregnant and need to have an abortion. I had NO idea that in 4 weeks I would test positive and at that point I couldn't deal with the mental ramifications of abortion. I considered adoption and debated the first three months if I could do be a mom. 4 years later and she's been the motivation for me to get off of my ass and do something with my life. \n\nI never want to be pregnant again, but the idea of a larger family appeals to me. I'd be happy with a step-child of some sort and I love babies now like I never did before. \n", "controversiality": 0, "created_utc": 1350751849, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pap8c", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196866, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadySybilVimes", "author_flair_css_class": null, "author_flair_text": null, "body": "I completely agree. I love my children. I struggle with other people's. \nI can't stand it when another mother asks me to take their child to the toilet. I really don't want to be wiping another Childs bum. Refusal often offends.", "controversiality": 0, "created_utc": 1350752160, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6parnv", "link_id": "t3_11sowa", "parent_id": "t1_c6p97n8", "retrieved_on": 1430196907, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadySybilVimes", "author_flair_css_class": null, "author_flair_text": null, "body": "How old is your baby? Babies are hard. I was so much happier once I could have a conversation with daughter.", "controversiality": 0, "created_utc": 1350752670, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pavn2", "link_id": "t3_11sowa", "parent_id": "t1_c6p9w20", "retrieved_on": 1430196960, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeegeek", "author_flair_css_class": "blue", "author_flair_text": "Gideon's Momma", "body": "I never wanted kids, until I married my husband. It wasn't just about being married, either; I was engaged to a guy a few years before I got together with my Husband and we broke up because he wanted 4 kids and I wanted zero kids.  Once my husband and I got together we weren't sure if we wanted kids at all. Once we were more settled  we made the decision to have kids. we now have a son and I love being a Mom. Being a MOm is awesome, but it has never completely dfined who I am.\n", "controversiality": 0, "created_utc": 1350752985, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pay1m", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196980, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "torreneastoria", "author_flair_css_class": "purple", "author_flair_text": "2 years!!", "body": "Until I got pregnant with my little girly I didn't ever want to have kids. I had already had a very heavy hand in raising my little brother. I had been a live in nanny for 6 kids. I have spent most of my life taking care of my parents because they are of ill health. I was perfectly content not having a child at all. Then I found out I was pregnant for certain. It was like a happy little flame of joy came on inside me. Which is why I insisted on her middle name being Luminary. I love her more than I thought I could love another person and I wouldn't give her up for anything. ", "controversiality": 0, "created_utc": 1350753048, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6payjo", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430196987, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pipeen", "author_flair_css_class": null, "author_flair_text": null, "body": "What? Why on earth would people ask you to take their child to the toilet?! That's just weird. Unless you're a teacher to pre school aged children or something. ", "controversiality": 0, "created_utc": 1350753282, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pb0ci", "link_id": "t3_11sowa", "parent_id": "t1_c6parnv", "retrieved_on": 1430197011, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rainjur", "author_flair_css_class": "lightcoral", "author_flair_text": "almost done baking child 1!", "body": "I wasn't going to have kids. I decided with the career I wanted to do, I wasn't even going to bother. I wanted no family, no strings attached, so I could do whatever it was that would please me in my field.\n\nLo and behold, I got pregnant and that quickly changed. I switched my major from astrophysics to secondary education in physics so I could be with my daughter more often. I couldn't have been more in love with something I previously had not wanted. I had a wonderful support system and a wonderful lover and I couldn't ask for better.\n\nPretty much, I just stop trying to be a hardass on most things. Just when things get nice and comfy, God came up and was like LOL NO and ruined everything I planned for, haha.", "controversiality": 0, "created_utc": 1350753761, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pb416", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430197066, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadySybilVimes", "author_flair_css_class": null, "author_flair_text": null, "body": "Lots of the mothers we know now have more than one child. If there is a big group and my child asks to go to the toilet you can guarantee another child will want to go to. Often the response from the other parent is \"you go, take my kid and I'll watch your baby\". This really isn't that weird a request but it makes me uncomfortable every time. \nI also hate anyone taking my daughter to the toilet so it could just be my problem.\nI have seen other parents who will quite happily let/expect a total stranger to escort their child into the bathroom. I think the attitude is that because that woman has children it's fine. ", "controversiality": 0, "created_utc": 1350754043, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pb68b", "link_id": "t3_11sowa", "parent_id": "t1_c6pb0ci", "retrieved_on": 1430197090, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pipeen", "author_flair_css_class": null, "author_flair_text": null, "body": "You're a lot nicer than I am. For sure. Lol. ", "controversiality": 0, "created_utc": 1350754278, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pb82f", "link_id": "t3_11sowa", "parent_id": "t1_c6pb68b", "retrieved_on": 1430197112, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I was the oldest of 6 kids, and was 10, 12, and 14 when my Mom had her last 3 so I was helping with them a majority of the time.I never ever wanted kids after that. I'd had enough with babies. I only have one (oops!), and it'll stay that way. My husband wants more but I can't do it. I generally dislike kids unless they're related to me and now that mine is almost 4 I've gotten past the bullshit stage and into the more interactive stage which I prefer.", "controversiality": 0, "created_utc": 1350754726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pbbjd", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430197157, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "I didn't really want kids until i met my husband. I always had the feeling of wanting a family, but couldn't imagine the whole process. after 2 years of marriage it was all i could think about... a year later we have an awesome 3 month old!", "controversiality": 0, "created_utc": 1350755043, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pbdzg", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "removal_reason": null, "retrieved_on": 1435676889, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "For me, having grown up very poor, the most important thing to me was achieving financial stability before having kids.  Luckily, we reached that goal (through hard work and wise saving/spending),by the time I was 29.  I doubt my husband and I would've had any kids if our careers hadn't panned out or if we'd had a financial catastrophe of some sort.  So no, not an age, just the ability to easily afford our spawn! ;)", "controversiality": 0, "created_utc": 1350755449, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pbh5v", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430197231, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "Are you glad that you had a baby after all?", "controversiality": 0, "created_utc": 1350757352, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pbvzt", "link_id": "t3_11sowa", "parent_id": "t1_c6p9092", "retrieved_on": 1430197440, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "that's so interesting to hear! thank you for your response :)", "controversiality": 0, "created_utc": 1350759411, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pccad", "link_id": "t3_11sowa", "parent_id": "t1_c6p97n8", "retrieved_on": 1430197642, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "that sounds like such a rough time. I'm sorry you had to go through it, but it's great that you wouldn't trade it for anything. ", "controversiality": 0, "created_utc": 1350759525, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcd6i", "link_id": "t3_11sowa", "parent_id": "t1_c6p90wn", "retrieved_on": 1430197650, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! that's such an interesting perspective that I don't really understand at all (yet?)", "controversiality": 0, "created_utc": 1350759586, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcdmz", "link_id": "t3_11sowa", "parent_id": "t1_c6p939m", "retrieved_on": 1430197656, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "That's such a huge change in perspective! hard to fathom\n\nI'm really glad you love being a mom!", "controversiality": 0, "created_utc": 1350759834, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcflq", "link_id": "t3_11sowa", "parent_id": "t1_c6paotu", "retrieved_on": 1430197694, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "it's so great that it doesn't completely define you. Definitely healthy, imo", "controversiality": 0, "created_utc": 1350759913, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcg7p", "link_id": "t3_11sowa", "parent_id": "t1_c6pay1m", "retrieved_on": 1430197700, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "goldenpandora", "author_flair_css_class": null, "author_flair_text": null, "body": "Why did your gyn tell you to have a baby so early? Doesn't that advice usually come later, like near 30?\n", "controversiality": 0, "created_utc": 1350760997, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcoob", "link_id": "t3_11sowa", "parent_id": "t1_c6p99jz", "retrieved_on": 1430197813, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "goldenpandora", "author_flair_css_class": null, "author_flair_text": null, "body": "Your baby has a ridiculously awesome name. Clearly, you are doing something right :)\n", "controversiality": 0, "created_utc": 1350761087, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcpe2", "link_id": "t3_11sowa", "parent_id": "t1_c6p9w20", "retrieved_on": 1430197817, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Cayterri", "author_flair_css_class": "lightcoral", "author_flair_text": "4yo girl, 20 mo boy", "body": "I didn't want kids at 27, by 31 we are trying for our second. I got pregnant on purpose with my daughter and I am so in love with her and being a mom. ", "controversiality": 0, "created_utc": 1350761353, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pcrjv", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430197840, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadziads9", "author_flair_css_class": "brown", "author_flair_text": "baby girl b. Feb-7-12", "body": "A month before my 30th birthday my gyno asked \"what are you waiting for\" when I said I didn't have kids yet. I had been seeing my bf-at-the-time for a week. WTF ? She's like \"you're not getting any younger\". Thanks.\n\nHad my girl earlier this year at 33, and everything was fine. :p", "controversiality": 0, "created_utc": 1350764669, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pdhus", "link_id": "t3_11sowa", "parent_id": "t1_c6pcoob", "retrieved_on": 1430198182, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mashuplover", "author_flair_css_class": null, "author_flair_text": null, "body": "It's completely normal to bond with your baby gradually--the magic moment of connection at birth doesn't happen for everyone, or even a majority of moms. ", "controversiality": 0, "created_utc": 1350773580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pffow", "link_id": "t3_11sowa", "parent_id": "t1_c6p90wn", "retrieved_on": 1430199096, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "I never wanted kids. I pretty much hated kids, until my niece was born and then I hated all kids but her. I didn't even want to get married. It wasn't until I met my now husband that when the thought popped into my head that I would consider having babies with him that I knew I'd marry him. Post wedding we still wanted kids but not for a while. I recall swearing up and down that we'd be waiting 2 more years before a baby, the next week found out I was pregnant. We now have two and things are pretty good! ", "controversiality": 0, "created_utc": 1350774996, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pfqm2", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430199314, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alamanderz", "author_flair_css_class": "green", "author_flair_text": "7 yo &amp; 5 yo", "body": "I never wanted babies or marriage. As long as I can remember I dreamed of growing up becoming an architect and living on the east coast alone - PERHAPS a dog if I was feeling lonely... I had siblings who were 12 years younger than me and I think that contributed to this for awhile because I was sick of being the babysitter - Honestly I probably still would have kept that belief but one accidental teenage pregnancy later and I was all aboard the baby marriage train! ", "controversiality": 0, "created_utc": 1350775367, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pftgc", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430199350, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JustSayinSM86", "author_flair_css_class": "purple", "author_flair_text": "Girl 6/5/10 Boy 14/10/11", "body": "He wasn't a gynaecologist, he was a gynaecologist/ oncologist, hence \"gyn/onc\". I had carcinoma in situ of the cervix at such a high level, ideally they'd have done a hysterectomy. However, given my age and the fact I had no children, they decided against it, but next time (and he predicts in my case there will be a next time) that's what they'll do. ", "controversiality": 0, "created_utc": 1350778419, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pgh1x", "link_id": "t3_11sowa", "parent_id": "t1_c6pcoob", "retrieved_on": 1430199669, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JustSayinSM86", "author_flair_css_class": "purple", "author_flair_text": "Girl 6/5/10 Boy 14/10/11", "body": "It wasn't a gynaecologist. Australia's don't see random specialists for day to day things, including vaginal health. We see someone called a General Practioner, or GP. If you see a specialist, including a paeditrition, it means there's a problem. I saw a \"gyn/onc\" which is short for gynaecologist/ oncologist, which is a gynaecologist specialising in cancer. We see ob/gyns for babies and fertility, and only once those are actually an issue for you. \n\nFTR, I saw my gyn/onc the afternoon I got my positive pap back. ", "controversiality": 0, "created_utc": 1350778711, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pgja9", "link_id": "t3_11sowa", "parent_id": "t1_c6pdhus", "retrieved_on": 1430199689, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1350781862, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6ph7re", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430200009, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadySybilVimes", "author_flair_css_class": null, "author_flair_text": null, "body": "I think if we hadn't had our first by accident I wonder where we would be now. I don't think we would be married and I really don't think we would have children. \nI am quite shocked when I think how free and selfish I was. Having my babies has turned everything in my life up to an 11. It's louder, messier and certainly poorer but so much better. \nIt was so hard adjusting to motherhood though. The first 8 weeks were a nightmare (seriously) and then I fell in love. Each day I fall in love with them a little more. ", "controversiality": 0, "created_utc": 1350787473, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pie46", "link_id": "t3_11sowa", "parent_id": "t1_c6pcflq", "retrieved_on": 1430200564, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1350788926, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pip1x", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430200706, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LittleMischa", "author_flair_css_class": null, "author_flair_text": null, "body": "I never wanted children and I really dislike children aside from my own.\n\nOnce I met my husband, we both felt that it was just 'right' to have a child. Now we have a 2 year old son and he is amazing.\n\nDo I want another kid? Nope.\n\nWas he planned? Nope.\n\nWas I happy I had him? Each and every day, yes.\n\n", "controversiality": 0, "created_utc": 1350793592, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pjnc0", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430201158, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kimeros", "author_flair_css_class": null, "author_flair_text": null, "body": "I planned not to have children and I was happy with that decision. \n\nThen I had my daughter and I am so happy I did.  I wouldn't want my life any other way. ", "controversiality": 0, "created_utc": 1350793848, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pjp46", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430201178, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "apunkcatinspace", "author_flair_css_class": "red", "author_flair_text": "Lilou´s mom", "body": "Best thing ever! ", "controversiality": 0, "created_utc": 1350794373, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pjsw4", "link_id": "t3_11sowa", "parent_id": "t1_c6pbvzt", "retrieved_on": 1430201228, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "she's 10 months. on more than one occasion i've wondered how much longer until i can actually reason with her.", "controversiality": 0, "created_utc": 1350795335, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pjzk3", "link_id": "t3_11sowa", "parent_id": "t1_c6pavn2", "retrieved_on": 1430201316, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "goldenpandora", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah, that makes more sense. Thank you for the clarification.", "controversiality": 0, "created_utc": 1350798491, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pkjle", "link_id": "t3_11sowa", "parent_id": "t1_c6pgh1x", "retrieved_on": 1430201584, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "l33tbot", "author_flair_css_class": "lightcoral", "author_flair_text": "Neve 3y Marcel 5m", "body": "Ah shit, thanks for reminding me to get my pap done.  I had my baby one year and one fortnight after getting my all clear after cervical surgery, but gotta keep on top of it!  I'm glad all sounds to be working out for you.", "controversiality": 0, "created_utc": 1350800877, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pkxaf", "link_id": "t3_11sowa", "parent_id": "t1_c6pgja9", "retrieved_on": 1430201756, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JustSayinSM86", "author_flair_css_class": "purple", "author_flair_text": "Girl 6/5/10 Boy 14/10/11", "body": "It is! February marks 4 years clear!\n\nI do struggle with incomeptent cervix, but other than that every thing is perfect.", "controversiality": 0, "created_utc": 1350802530, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pl62t", "link_id": "t3_11sowa", "parent_id": "t1_c6pkxaf", "retrieved_on": 1430201872, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "eukaryote_30", "author_flair_css_class": "purple", "author_flair_text": "knocked up!", "body": "I feel like I posted in my sleep or something, cos this sounds like me! Oh, except I don't have a 2 year old, just a little girl on the way. Yay!\n\nI hope my SO and I will make good parents... that remains to be seen. We don't like strangers' kids, especially groups of them (just the idea of kids' birthday parties gives me a headache). One thing's for sure though, we certainly love our daughter and will do our best for her. ", "controversiality": 0, "created_utc": 1350804668, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6plg6n", "link_id": "t3_11sowa", "parent_id": "t1_c6p97n8", "retrieved_on": 1430202007, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "Having a child has warmed me to other children, but greatly hardened me to shitty parents.  Because I now have personal proof that you don't have to be a selfish, inconsiderate person to raise a child, my blood boils even more when I see it.  I know that the stresses of a child are no excuse.", "controversiality": 0, "created_utc": 1350814702, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pmevd", "link_id": "t3_11sowa", "parent_id": "t1_c6p97n8", "retrieved_on": 1430202458, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I was always pretty certain I would want a child one day, for the adventure and the experience of parenting.  However, I had significant fears it would never happen for me (there's some infertility in the family) so I put it on a back burner.\n\nI absolutely did not want children in my twenties.  I was travelling, working overseas, partying, having a wonderful life.\n\nBy my thirties, several things changed.\n\n1.  Bars etc are full of 20-something.  You grow out of that lifestyle.\n\n2.  Travel is still brilliant.  But in your thirties you are often at a stage that you can probably buy a home/get a mortgage.  That does two things: the expense restricts your travel, and it gives you a new project to focus on.  I got really into gardening (on my little balcony) in my early thirties.\n\n3.  Your childhood gets further away, and you start to miss it, and want to do it over.  The twenties thrill of adulthood and freedom has become customary, and you start missing your earlier years.  Maybe a little rose-coloured, maybe not.  Having a child means you can pass on and relive a lot of that fun. \n\n4.  People start dying.  In my case my mother.  Bringing new life into the world is one way to - not to replace them - but to fill the gaps a little.  The only way you get your wonderful family christmases back with (now long dead) grandparents and uncles and aunts etc is by becoming parents, making your siblings aunts and uncles, and your parents grandparents.  It's about renewal.\n\n5.  Because of the house and mortgage, and the settling down with a permanent partner, things can get a little static/stale/a bit of a rut.  Having a child is a wonderful new project and experience that keeps your life really dynamic.  I realise that sounds kind of weird, to describe a child as a \"project\", but in many ways starting a family is like that.  There is a lot of planning, a lot of work, and a lot of change.  And you are creating and building something.", "controversiality": 0, "created_utc": 1350815568, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6pmha9", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430202489, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lgalikhan", "author_flair_css_class": null, "author_flair_text": null, "body": "i am so happy to read all of these. all of my friends had kids really young or always wanted kids. i never wanted to deal with it and planned to live vicariously through my students as i am a teacher. i had a work hours and could do anything in the world for 2-3 months at a time. then one year i went to Brazil with my bestie. something in the air changed. i had an epiphany on that trip. i told them i could just feel it. the world was going to topple over and flip inside out and upside down...they all thought i was crazy and losing my mind since i couldnt explain what was going to happen. i just knew it would be HUGE!!! - three months later i found out i was pregnant. :) life has never been the same.  ", "controversiality": 0, "created_utc": 1350886799, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6q15tc", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430209543, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I never wanted kids, in fact I was pretty obnoxious about it ( like the child free folks) until about 28. Then I was just ambivalent. Then around 34 I reeeeaaally started to want a baby. Finally had one at 37. Now (at 39) I'd like another, but I don't think we can afford two. It's a bummer.", "controversiality": 0, "created_utc": 1350958503, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6qbiw4", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430214564, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsminigig", "author_flair_css_class": "lightcoral", "author_flair_text": "entering the Terrible 2's", "body": "I just had my baby in may, I am 21 and I was not ready. I really wasn't to sure about kids, but it just kinda happened as it tends to. My husband and I got married when I was just about 15 weeks, no one knew but us. It was a very hard pregnancy and traumatic c-section delivery. I am currently having a really hard time bonding with my daughter. I take care of her and would not just stop doing that because that is now my responsibility. But I feel like she's just a baby not specifically my baby. I think she's a little cuter then other babies I see, so I know there is something there. I do care about her. My husband has 2 older kids and keep telling me it will get easier to relate once she can do more. I do feel like it was a mistake to have kids this early. It is hard to be a parent when you do not feel fulfilled or rewarded by it. It really makes me sad to feel that way and I know it's not her fault, I don't blame her for how I feel at all. It's very compacted feelings and hard to deal with. I don't think it will be a forever feeling though. I feel like I'm just still waiting for that clicking moment where I feel like a mother, like this is my child. Some people have told me it's because I wasn't ready, because I didn't have some instinctual maternal want to be a mother, because of the pregnancy and delivery; really I am unsure of the reason. I think it just takes some mothers longer. It takes dad a while to build a bond why can't that happen to mothers too? It's hard when people make me feel like there is something wrong with me because of my feelings. It kinda makes me take 2 steps back in the process. It makes it hard to be honest and open about my feelings when I feel like I'll be marked by the beast and burned at the stake. That's more or less how my family makes me feel about it. My husband has really been my rock and he has bonded with her so well. He isn't so new at this though so that probably helps. I would be really lost and doing a lot worse without him. He is really helping me and encouraging me about this. I think even if women are feeling like I do, having someone there to help that is really good at it makes a world of difference. I read all these books about how the mother is the life line of the child, but my body hated pregncey, failed me in the area of natural labor and refused to allow me connect with my daughter through breastfeeding. I wish I had read a book about how to bond with out those things, but you never expect it to happen any other way. ", "controversiality": 0, "created_utc": 1351007315, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6qk6l4", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430218710, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "I was never in a hurry to become a mother. Growing up I had two MUCH younger brothers, so had quite a bit of experience with the day to day care of babies, and knew how much work it would be.  Through most of my twenties I sort of assumed I'd eventually do it but wasn't with the right person, plus I was SO busy and really enjoyed my life so much, it was hard to imagine a baby.  As I entered my thirties I actually started to come down more on the \"no children\" side of things.  I had a great life - I LOVED living on my own.  I was deeply involved in things I loved. I really was living exactly the life I wanted for myself - if you had asked me what I wanted for myself when I was younger, I was exactly there.  I had found an amazing guy, and though we'd talked a little about kids it was always in the \"oh someday\" column, not something I was as serious about as I should have been.\n\nWhen I found out I was pregnant I really didn't know how to take it.  I was 33, and knew exactly how much I'd be giving up.  I considered going to planned parenthood.  I cried, a lot.  I was totally overwhelmed because I knew I would have to give up so much of what I loved about my life if I was going to be a good parent.  Fortunately I am with an amazing, amazing man who challenges me all the time to be a better person, and who has turned out to be a great dad.  In the end I decided after spending time with a friend's daughter, that maybe, just maybe, I could do this thing.  Once I made that decision I still wouldn't say I was ecstatic about it. I was very torn between feeling deep love and wonder at being pregnant, and being depressed.  I spent a good deal of time being scared out of my wits.\n\nHe is ten months old now and he is magic.  I love everything about him, I live and breath him.  He is amazing and I guess after a few bumps I've settled into being a mother quite well.  \n\nI won't lie - it's been hard to adapt to some things. I am very far away from people I used to think were close friends, and don't hear much from them anymore.  I feel lonely sometimes.  The day to day work is exhausting (every day I get home from work and start getting ready for the next).  Because I'm breastfeeding it's hard for me to go get \"me\" time and do the things I enjoy independently.  Daddit is wonderful and is totally there for that, but I'm never fully \"away\" since I have to lug the pump everywhere if I go to get time for myself.   Every once in a while I get in an actual funk, because a lot of what I predicted when I was newly pregnant has come true.  I miss people, I miss my old lifestyle, I miss a lot. I feel totally removed from my old life now, kind of like it was some dream. \n\nIt's simultaneously the hardest and most wonderful thing I've ever done.  Sometimes I love him so much I feel like my chest is going to explode with the force of it.  I've never experienced this kind of emotion and connection with anybody ever before.  And that is something pretty amazing.  I don't think I ever knew it was possible to feel this way :)  \n\n", "controversiality": 0, "created_utc": 1351022580, "distinguished": null, "downs": 0, "edited": 1351023059, "gilded": 0, "id": "c6qogxf", "link_id": "t3_11sowa", "parent_id": "t3_11sowa", "retrieved_on": 1430220756, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "why are some people that were in your life before not a part of it now? ", "controversiality": 0, "created_utc": 1351092240, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6r2llg", "link_id": "t3_11sowa", "parent_id": "t1_c6qogxf", "retrieved_on": 1430227479, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "omtothenom", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for being so honest about your feelings and experiences. I hope you start to feel that bond soon. ", "controversiality": 0, "created_utc": 1351092359, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6r2mte", "link_id": "t3_11sowa", "parent_id": "t1_c6qk6l4", "retrieved_on": 1430227495, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Most of them were people I saw every day because we were involved in the same things.  When I got close to having the baby I moved in with my SO, well over an hour away.  So I'm geographically far from everyone, which is a problem in itself.\n\nPlus none of them have kids, and in fact it's generally an anti-baby group of people (common for folks living that lifestyle), so we don't relate as well.  \n\nI tried for a while to keep up with things, I managed to make it to book clubs, dinners, or other events, would go visit on weekends, tried to text and email people to keep up, but mothering has been exhausting too, and it seems like if I don't do those things, they don't happen.  Which has led me to feel a little abandoned and lonely.  I've been surprised by who, among that group (who I thought were all very close and I love them all) has actually bothered to do little things, like the occasional text to see how I'm doing.  I admit being disappointed at who hasn't.\n\nI think that as things slow down, I'm not tied to the pump as much, and he is more independent, etc, we'll all be able to reconnect a bit.\n\nThis last weekend was weird, I was out with a friend I had just seen a couple weekends ago.  When I saw her then we had a great time, but it was just me as baby was home with dad.  When I saw her this weekend (met up at an event), with baby in tow, it was totally different, and we ended up hardly spending time together. Or maybe I'm different when I'm with him, because I'm so consumed by him, and she can't relate to that. I dunno.  \n\nOr maybe everyone just gets caught up in their own life, time passes quickly, and out of sight is out of mind.  Whatever is driving it, I'm sad about it.  \n", "controversiality": 0, "created_utc": 1351094970, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6r3ce2", "link_id": "t3_11sowa", "parent_id": "t1_c6r2llg", "retrieved_on": 1430227903, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inthepalemoonlight", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh love, you need a hug! Your body is full of raging hormones, you need time to settle.", "controversiality": 0, "created_utc": 1351134428, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6rdrea", "link_id": "t3_11sowa", "parent_id": "t1_c6qk6l4", "retrieved_on": 1430232874, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}