{"submission": {"author": "MsBud", "author_created_utc": 1318464796, "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy", "author_fullname": "t2_615l3", "created_utc": 1351465239, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/128qv9/to_plug_or_not_to_plug/", "gilded": 0, "id": "128qv9", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 57, "over_18": false, "permalink": "/r/Mommit/comments/128qv9/to_plug_or_not_to_plug/", "retrieved_on": 1413454352, "score": 8, "secure_media_embed": {}, "selftext": "Hi Mommit. I'm just a few weeks from officially joining your ranks, so my concerns are starting to move from pregnancy to motherhood. I'm pretty experienced with babies and kids, and have a lot of family support- especially my mom. She'll be down the whole month of December to help me out. \n\nHowever, we're having a conflict over pacifiers. My reading and thinking has led me to the conclusion that I'd like to avoid them if possible and if not, limit their use. I plan to exclusively breastfeed, and I know that pacifiers have been associated with some difficulty getting a good pattern established. Ear infections, dental problems, etc, all seem like good reasons not to plug. \n\nI'm not judging anyone's decisions here, I know that no plan survives contact with the enemy, and I am well aware that at 3am when I haven't slept for a week that pacifier might be just what I need- but my PLAN is to not use pacifiers. I'd really like to avoid using them until breastfeeding is well established at least, and then wean her from them before she's a year old. My mother basically says I'm being silly, that pacifiers are awesome for self-soothing and giving mom a break and that the benefits outweigh the risks.\n\nTL;DR: I've read the articles and the books. What I'd really like is feedback from you. Did you use a pacifier? Is there *anyone* who didn't? What are your experiences with weaning from them? *Am* I being silly? Thanks.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "To plug or not to plug?", "url": "http://www.reddit.com/r/Mommit/comments/128qv9/to_plug_or_not_to_plug/", "user_reports": []}, "comments": [{"archived": true, "author": "AeroMom", "author_flair_css_class": null, "author_flair_text": null, "body": "We caved at about a week old because my son Would. Not. Sleep. We weaned him to only naps and nighttime when he turned 2. Didn't seem to affect his nursing.", "controversiality": 0, "created_utc": 1351465609, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t362l", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430262384, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thank you.\n\nDid he have any problems with ear infections?", "controversiality": 0, "created_utc": 1351466217, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t3b9w", "link_id": "t3_128qv9", "parent_id": "t1_c6t362l", "retrieved_on": 1430262458, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AeroMom", "author_flair_css_class": null, "author_flair_text": null, "body": "Surprisingly not! I had them all the time but he has had two in his whole existence, haha.", "controversiality": 0, "created_utc": 1351466320, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t3c4g", "link_id": "t3_128qv9", "parent_id": "t1_c6t3b9w", "retrieved_on": 1430262471, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lazyjane", "author_flair_css_class": null, "author_flair_text": null, "body": "We only used a pacifier with our son when he was cutting his first teeth; he never really took to one, even in the hospital. You can use them for especially hard times without making it a habit. \n\nYou might want to make that clear to your nurses if you give birth in a hospital: no pacifiers. Ours had Soothies on hand and gave one to my son in the NICU. I wasn't planning on using them unless he was a super fussy baby, but it surprised me that I wasn't even asked. ", "controversiality": 0, "created_utc": 1351467147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t3izx", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430262552, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thank you. I know sometimes they're just so easy to use and can keep me sane. Nice to know that its possible to have them used occasionally. \n\nGood to know about the nurses, its in our birth plan but it sounds like its second-nature for them to just pop one in their mouth. We're at a hospital that supports rooming in, so unless there's a health issue she'll be in the room with me. If she has to go to the NICU we'll try to remember to pin a note to her!", "controversiality": 0, "created_utc": 1351467816, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t3ov2", "link_id": "t3_128qv9", "parent_id": "t1_c6t3izx", "retrieved_on": 1430262627, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pypur", "author_flair_css_class": null, "author_flair_text": null, "body": "We used one for 5 months with our first &amp; we're using one now with our 3 week old. I pump milk for our baby because his latch was evil (even before the pacifier). ", "controversiality": 0, "created_utc": 1351469270, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t41ng", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430262802, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "What was weaning your first from it like? My mom said that at under a year the baby won't understand and it will just be more difficult.", "controversiality": 0, "created_utc": 1351469626, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t44rc", "link_id": "t3_128qv9", "parent_id": "t1_c6t41ng", "retrieved_on": 1430262850, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "animalcrackers1", "author_flair_css_class": "green", "author_flair_text": "Mom to an 18 Month old Daughter!", "body": "I used a pacifier when my girl was 2 days old.  I also breastfed and there was no confusion or issue at all.\n\nHowever, all babies are different - see how it goes.  You might be blessed with a little angel who sleeps peacefully and may not need a pacifier.  But I just wanted to let you know that we didn't experience any issues at all breastfeeding and using one.\n\nCongrats and I hope everything goes well with the rest of the pregnancy! xo", "controversiality": 0, "created_utc": 1351470249, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t4a6o", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430262911, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks. Good to know the two can work together. I am worried I'm going to have problems breastfeeding, so I don't want to risk anything getting in the way. (No particular reason, I just don't know a lot of women that have made it last) I know that ultimately we'll make the decision in the moment- I just like to be prepared.", "controversiality": 0, "created_utc": 1351470909, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t4g1n", "link_id": "t3_128qv9", "parent_id": "t1_c6t4a6o", "retrieved_on": 1430262975, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "animalcrackers1", "author_flair_css_class": "green", "author_flair_text": "Mom to an 18 Month old Daughter!", "body": "You're wise to ask the question!  All babies are different.  While my daughter didn't confuse the nipple for the pacifier and had no issue, others may.  \n\nAs a side note, I wish you the best of luck with breastfeeding.  I read every book on the topic and was fully prepared for a huge struggle and amazingly, my girl latched on like a pro right from the start - and it never hurt one bit!  \n\nYou might get chapped nipples at first and if you do [this product](http://www.motherlove.com/product/1001-Nipple-Cream.html) is wonderful and will help you heal quickly.  Good luck!", "controversiality": 0, "created_utc": 1351471135, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t4i2t", "link_id": "t3_128qv9", "parent_id": "t1_c6t4g1n", "retrieved_on": 1430263003, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "I plan to wait until we've got a bit of confidence on breastfeeding before introducing a plug, if we do decide to for whatever reason. I've read a lot about breastfeeding and watched videos, I'm subscribed to /r/breastfeeding... I'm just worried about it.", "controversiality": 0, "created_utc": 1351471698, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t4mzg", "link_id": "t3_128qv9", "parent_id": "t1_c6t4i2t", "retrieved_on": 1430263067, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "annalatrina", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, make sure that your mother doesn't undermine you no matter what you decide. You are responsible for the baby and she is helping you, not the other way around. \n\n As far as my own experiences go, I was planning on waiting the recommended 4-6 weeks before introducing a pacifier to my twins so we all could firmly establish breastfeeding. I think we lasted 8 or 9 days before giving in.  For the record, they are both breastfeeding like champs. Knowing when to compromise is part of parenting. \n\nI've read some of the studies regarding ear infections and the study that found the strongest link   specifically found that pacifier use in the first 10 months is fine and doesn't increase the rate of ear infections in babies that young, but they strongly suggest weaning the baby off pacifiers after 10 months of age.\n\nDon't forget that pacifiers can prevent SIDS.\n\nAlso, babies love to suck, would you prefer for your baby to suck on a pacifier or his hands? Finger and thumb sucking can cause mouth formation problems as well as pacifiers and you can't take his thumb away. I have seen kids that finger suck well into puberty, whereas I've never seen a twelve year old with a pacifier.\n\nAs far as I'm concerned the only real drawbacks of pacifiers are that they can mask hunger cues and if you are feeding on demand that can be a problem. Also, if the baby is not weaned off of them by the time they learn to speak, they can cause speech impediments.\n\nThere are issues that I'm sticking to my guns on and issues that I'm flexible on, the key is to know when it's worth the fight.\n\nEdit: It might be worth your time to look into different types of pacifiers, some claim to be breastfeeding friendly because the shape of the nipple. ", "controversiality": 0, "created_utc": 1351472025, "distinguished": null, "downs": 0, "edited": 1351472933, "gilded": 0, "id": "c6t4pyn", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430263110, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gddess", "author_flair_css_class": "blue", "author_flair_text": "Two Year Old Son", "body": "We use a pacifier and breastfed for 16 months. My pediatrician told us that as long as baby has a good latch before introducing a pacifier, there shouldn't be any nipple confusion ", "controversiality": 0, "created_utc": 1351472650, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t4vlo", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430263181, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "famousamongdozens", "author_flair_css_class": null, "author_flair_text": null, "body": "My baby won't take a pacifier. Or a bottle. \n\nShe knows which is the nipple and which is the fake crap and won't settle for anything less than mum. It can be trying at times, because it's difficult being her one main source of comfort sucking as well as the feeding station - so my advice is if you are going to introduce the pacifier, or bottle for that matter - do it sooner rather than later \"nipple confusion\" be damned. There are ways to help a baby through nipple confusion, there is no way to make a baby drink from a bottle or take a pacifier if they don't want to.\nThis may well help you save your sanity and not feel resentful at being the only one who can soothe your baby at 3am. ", "controversiality": 0, "created_utc": 1351473069, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t4zhc", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430263240, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "We never had any problems with breastfeeding. You are much, MUCH more likely to get through the first couple of months (and any problems that come up after that) if you have a good lactation consultant. Check with your hospital; the one where my daughter was born provided consulting for free. They can help you through just about any problem you're likely to have and it's wonderful to be able to check how much you're producing (they weigh the baby before and after, because pumping doesn't necessarily give you the same amount) and to go in for a little pep talk.\n\nI do wish, though, that we'd gotten rid of the pacifier when she didn't seem terribly attached to it -- when, if we forgot to give it to her, she wouldn't get upset -- because when we did forget 4 months later just after she turned 2, she'd pitch a fit. But I'm very glad we had it during the first year.\n\nConsider this: they *need* to suck. A pacifier is a mom substitute. No pacifier = you can't step away while baby is in sucking mode.", "controversiality": 0, "created_utc": 1351474257, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t5a63", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430263371, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks. From the responses I'm getting so far it sounds like this is a very individual-to-baby thing. That's the reasoning my mom has mentioned- that if we don't introduce the plug early the baby will never take it. I'd like her to take a bottle too, so that my husband can help feed her. Thanks for the feedback.", "controversiality": 0, "created_utc": 1351474613, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t5ddm", "link_id": "t3_128qv9", "parent_id": "t1_c6t4zhc", "retrieved_on": 1430263413, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thank you. How was the weaning experience? Did you wean from both at the same time?", "controversiality": 0, "created_utc": 1351474947, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t5gco", "link_id": "t3_128qv9", "parent_id": "t1_c6t4vlo", "retrieved_on": 1430263452, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks for the in-depth response. My mom shouldn't be too bad, she just has a lot of opinions and for some reason this one about the pacifiers is a particularly strong one. \nLike I said, I know the plan is to wait but I know it might not work out that way. Wow, you're breastfeeding twins too! That's very encouraging :) I'd read about the SIDS connection too, but I'd forgotten, that's a compelling reason to introduce the pacifier after breastfeeding is established and then wean before a year. My mother pointed out the hand-sucking vs pacifier thing too. I guess if we can successfully wean before she's a year old, there are some benefits.\nThere's a lot of good stuff here to think about, thank you. \n\nI've bought bottles that have breastfeeding friendly nipples, didn't realize there were pacifiers with the same design, thanks.", "controversiality": 0, "created_utc": 1351475496, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t5ljz", "link_id": "t3_128qv9", "parent_id": "t1_c6t4pyn", "retrieved_on": 1430263524, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks. I have a doula and plan to connect with the local LLL, hopefully the hospital has a consultant too. My mom breastfed all 4 of her kids too, and my husband is very supportive. I'm not working for the first 12 weeks either. \nIt sounds like weaning before a year might help with a lot of that attachment issue. Maybe we'll only use it during nap-time/nighttime. Hopefully breastfeeding is established easy and I won't have to worry about it.", "controversiality": 0, "created_utc": 1351476366, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t5tpk", "link_id": "t3_128qv9", "parent_id": "t1_c6t5a63", "retrieved_on": 1430263630, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lazyjane", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly. I know that every baby is different, but I think going into it with the mindset that a bink was more of a last resort helped.\n\nIf he was unhappy, we went down the list: Is he hungry? Diaper clean? Does he want snuggles? Not too hot or cold? Nothing crazy going on around him? Doesn't want to play or read or hear a song? OK... try a bink. If it worked, great. He just didn't get used to always having it. \n\nOh... Forgot to mention that he was bottle-fed; latching issues from the start. I doubt if the bink had anything to do with it, though. He was born at 33 weeks via emergency c-section; I got knocked out and didn't get to even hold him for almost a day. Boo. I hope you get to have your original plan! I am still kinda angsty that mine didn't work out on several levels. ", "controversiality": 0, "created_utc": 1351477788, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t674c", "link_id": "t3_128qv9", "parent_id": "t1_c6t3ov2", "retrieved_on": 1430263803, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "That's good advice, thank you.\nI'm sorry your birth wasn't all you wanted. That must have been really tough to have it work out that way. Sounds like he did pretty good for being so early though! Its crazy to think that she's a *person* in there and could survive without me!", "controversiality": 0, "created_utc": 1351478237, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t6be9", "link_id": "t3_128qv9", "parent_id": "t1_c6t674c", "retrieved_on": 1430263857, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "My first refused all pacifiers. Wasted so much money on them. Never sucked her thumb and comfort nursed a lot. She was a slow gainer, so it was probably for the best that she never took one.\n\nCause I never had to deal with weaning a kid off one we were not planning on introducing one to our second. At 5 weeks we did though. She had reflux, would not comfort nurse (actually hated nursing at times from pain). Our PED said to try a paci as some kids respond well to it and it may control the reflux without daily meds. I was nervous. Did I really want to have worry about weaning her off it? Do I want to be stressed over weaning? Well she would not take one. We tried 10 different brands. Finally she liked one (avent orthodontic silicone) and it helped her reflux! Within 3 days what a change! Almost no forceful spit up anymore, arching and crying while eating and she liked nursing again. Marvelous. We always tried to comfort her without it first or offered breast to make sure she was not hungry, but if that did not work we gave the paci. Also after she fell asleep and was in a deep sleep we took it out. About a month ago during teething, she refused to take it. Decided she hated it and weaned herself off. She must have grown out of the reflux as well (which usually happens between 6-9 months), there is no issues there. She does not suck her thumb either. Has not increased her nursing sessions at all. It was a very good tool for us to use. She is 8 months on Saturday.\n\nI think it does have to do with the personality of kids. Some love the paci and some just don't.I personally would loved to not have had to use it, but it was really needed. If you do end up using one make sure babe is gaining well, try other soothing first (nursing, walking etc) and if that does not work then give the paci. Good luck and stay open to the idea just in case :)", "controversiality": 0, "created_utc": 1351478598, "distinguished": null, "downs": 0, "edited": 1351478849, "gilded": 0, "id": "c6t6esa", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430263903, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "You can get on the forums www.llli.org now if you have any questions about pregnancy, child birth and breast feeding. It is nice mom to mom. You can ask questions and a lot of moms have btdt, lots of encouragement and support. It is nice too if you can't get to a meeting ( I always forgot to go)", "controversiality": 0, "created_utc": 1351478777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t6gfj", "link_id": "t3_128qv9", "parent_id": "t1_c6t5tpk", "retrieved_on": 1430263924, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "I went into parenthood thinking \"no I'd NEVER give my kid a paci\"...boy was I wrong. Even though I was exclusively breastfeeding and I know babies should do most of their comfort sucking at the breast, it just didn't work out for us. My son loves to comfort suck. In the first few weeks he was at the breast almost 24/7. I felt like a human pacifier. Then...THEN!!! One day he FREAKED OUT. He was comfort nursing and all of a sudden stopped. He pulled off but would latch back on only to pull off again and wail. This happened over and over again. I had no clue why. Finally I gave him my finger and he was so happy and immediately fell asleep. After many days of this happening over and over again I learned my LO hates getting even the smallest amount of milk while comfort sucking. That's why he loved sucking in my finger instead. Of course he couldn't always have my finger so I gave in and got him a paci. It's used only for sleep now (when he wants to suck the most). \nI was starting to hate breastfeeding because of how much he wanted to just suck. Now I still happily breast feed and he gets his comfort sucking on and we are both happy. There has been no issues with nipple confussion. He is very aware which nipple is which. Eventually I'll take the paci away and hopefully it isn't too hard. \nI think it depends on how baby is and how mama is as well. Maybe you'll get lucky and have a baby who doesn't even want the paci. Having a plan is good, just doesnt always go the way you planned. ;) ", "controversiality": 0, "created_utc": 1351481475, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t7594", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430264324, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BOSTONDANIELLE", "author_flair_css_class": null, "author_flair_text": null, "body": "I've been giving my son a binky since he was two days old and he is also ebf and doesn't have any issues. And if I didn't he wouldn't be able to soothe himself, poor kid has the sucking need of a shop vac. ", "controversiality": 0, "created_utc": 1351482465, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t7dy2", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430264438, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "We actually wanted my son to use a pacifier to help with his reflux, but he never took to them. He never really had a strong need to suck, either. He loves them now as teething toys though!", "controversiality": 0, "created_utc": 1351483905, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t7qay", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430264599, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pandaplusone", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the info on pacifiers and ear infections with regards to the first ten months vs. after- I hadn't heard that before! Do you remember which studies you looked at?", "controversiality": 0, "created_utc": 1351486056, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t873n", "link_id": "t3_128qv9", "parent_id": "t1_c6t4pyn", "retrieved_on": 1430264819, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MissPippi", "author_flair_css_class": null, "author_flair_text": null, "body": "Alright, let me start with saying I really have no business being here at all as I am not a mother and know a minimal amount about raising babies. HOWEVER. I am currently a college student who has been dealing with some dental issues which *may* have been caused from using a pacifier. \nI have TMJ, which is a disorder having to do with the jaw and surrounding muscles. I grind my teeth at night, which is probably caused by/related to the fact that most of the time during the day I create suction in my mouth with my tongue, as if I were sucking on a pacifier or thumb. \n\nNow, I have no evidence this habit (which I am currently trying to break, but with little success) is from using a pacifier as a baby, and even if I did, I would never blame my parents for using one, as I realize there are few other options when a baby won't stop screaming. But I just wanted to say that you are definitely not crazy for at least considering this dilemma. \n\nMy suggestion: Use it as needed, but don't abuse it. ", "controversiality": 0, "created_utc": 1351487663, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t8iea", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430264968, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "annalatrina", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm on my phone (breastfeeding) but I'll try.\n\nHere it is:\n\nhttp://www.ncbi.nlm.nih.gov/m/pubmed/7478830/?i=3&amp;from=/8056494/related\n", "controversiality": 0, "created_utc": 1351490440, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6t9002", "link_id": "t3_128qv9", "parent_id": "t1_c6t873n", "retrieved_on": 1430265196, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "usofunnie", "author_flair_css_class": "lightcoral", "author_flair_text": "Mary's mom, 1/6/12", "body": "We had an interesting time with binkies and our baby girl. The first few weeks we skipped them altogether. We were having latching issues due to edema and positioning because of my breast size. However, we quickly found that a binky would calm her down when she was in the carseat, but she couldn't keep the right suction on it, so we would (gasp horror) use a burp cloth to hold it in for her while she relaxed. This was with the \"orthodontic\" style. \n\nThe lactation consultant we had suggested switching to the Soothie type binky, where the nipple is more of a column, because it mimics mom and keeps her tongue used to curling around the nipple rather than pushing against it. Same issue, we'd help her with a cloth, then once she was calm, remove it and let the binky fall out.\n\nWe eventually stopped trying. When she started moving her head a lot, the cloth no longer helped. She just doesn't use a binky at all. She still has them around (I spent good money on the things!) but they are more toys than pacifiers now. \n\nSide note: we wound up doing a hybrid breastfeeding/formula thing, because I just couldn't match her demand for milk. I pondered quitting bf'ing altogether but didn't want to give it up, I enjoy it too much. So there's no nipple confusion, just no preference for binkies. \n\nYou are right; each baby is different, and it all comes down to you. You will know your baby best. You are Mommy. Keep an open mind... If you decide to try to wait on pacifiers, then do it. But don't get down on yourself if you can't hang! I'm finding that parenting has got to be flexible. In the end, a happy baby an happy mommy is all you are looking for. ", "controversiality": 0, "created_utc": 1351501961, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tacau", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430265844, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "angelamm10", "author_flair_css_class": null, "author_flair_text": null, "body": "I've been using a pacifier with my second for weeks...she's 6 weeks old now. She really liked to suck and both our lactation consultant and our pediatrician said that at week 2 when my nipples killed and I hated the sound of the baby crying because her comfort sucking hurt so muh, to use the bink to give my breasts a break! That being said, she had an awesome latch right from the get go, I knew we weren't going to have trouble getting it right once I got over the initial pain. Also, my pediatrician told me at the 1 month appointment that \"they\" (the AAP-?) no longer advise against waiting to use a pacifier. I didn't check into it. Another option that got old real fast was offering a finger, but then your tied to baby in an odd and uncomfortable position. \nWe used a pacifier with my son too, and had a difficult-ish time giving it up. And at his first dentist appointment the dentist knew before I told her that he had used one...but at the second appointment (when we had been bink free for a year) she said that his teeth were perfectly normal, so no lasting effects. \nBottom line, buy one or two and hide them, it's not good to make decisions when you're desperate and exhausted, but then again, if they can help with the desperate and exhausted feeling, it might be worth it. Best of luck!", "controversiality": 0, "created_utc": 1351507560, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tatr0", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430266068, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pandaplusone", "author_flair_css_class": null, "author_flair_text": null, "body": "You're awesome! Thanks!", "controversiality": 0, "created_utc": 1351507590, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tatuq", "link_id": "t3_128qv9", "parent_id": "t1_c6t9002", "retrieved_on": 1430266059, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "starly", "author_flair_css_class": "blue", "author_flair_text": "Mom to two sons (2009/2011)", "body": "My firstborn is a pacifier-using baby, my baby doesn't like them. Both have pros and cons.\n\nFirstborn had a pacifier when crying without any reason we found and for sleeping for the first couple of months, then when nearing first birthday, we gave him the pacifier much more often and shortly after first birthday only for sleeping (and sometimes in the car). Around second birthday, he discontinued use at home (but for napping at daycare still uses one) and now around third birthday wants to use a pacifier again (I think mostly for show). Baby used one for a couple of times as young baby, but dislikes them, along with bottles, sippy cups, any silicone....\n\nSo, you may deide for your baby if she'll use a pacifier, but she may decide the other way (as with many many decisions).\n\nPros on being pacifier-less: one thing less to worry about taking wherever you go, no tedious weaning off the pacifier, no nightly searches for the pacifier\n\nCons on being pacifier-less: no easy 'pop paci in to shut up for a minute' (this is a apreciated when in the car or tending other immediate needs (here it would be tending toddlers need, if baby took one), maybe harder time of introducing bottles/sippy cups, maybe harder time getting to sleep by herself (nurse, pop in paci, steal away is a bit harder without paci)\n\nedit: when you should decide on using a pacifier, pretend to not understand your daughter whenever she talks with a pacifier in her mouth (and tell her you don't understand her because of the pacifier), this worked really well with our firstborn and talking with a pacifier is generally a bad habit", "controversiality": 0, "created_utc": 1351508047, "distinguished": null, "downs": 0, "edited": 1351508481, "gilded": 0, "id": "c6tavbb", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430266085, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "osenic", "author_flair_css_class": "purple", "author_flair_text": "Boy 11-11-11", "body": "I also planned not to use pacifiers, but within the first couple of weeks my son started sucking his thumb.  Thumb-sucking is a **much** harder habit to break, so we started giving him a pacifier to soothe him.  He only gets it if he needs help calming down (ex. fell and bumped his head) or when he's going to sleep.  Never had any (pacifier related) problems with breast feeding.  After his birthday we plan to start weaning him off of it.", "controversiality": 0, "created_utc": 1351517310, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tc484", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430266666, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "griptight", "author_flair_css_class": null, "author_flair_text": null, "body": "I have 4 children and only one of them would take a pacifier, all were breastfed. \nIn my experience, it didn't cause any interference but I did wait a little while to introduce it. The main reason(as I understand it) for delaying pacifier introduction is establishing supply. Frequent nursing in the early days is important to establish a good supply. \nHowever, I didn't personally experience any supply issues with my baby who took the pacifier so I don't know. \nEvery baby is different, every mom is different. Find what feels right and works for you and your family and go with it. :)", "controversiality": 0, "created_utc": 1351517800, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tc7l6", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430266710, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "osenic", "author_flair_css_class": "purple", "author_flair_text": "Boy 11-11-11", "body": "We did the burp cloth thing too, glad to know we aren't the only ones!", "controversiality": 0, "created_utc": 1351517986, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tc8xu", "link_id": "t3_128qv9", "parent_id": "t1_c6tacau", "removal_reason": null, "retrieved_on": 1435674262, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "nipple friendly pacifiers have worked for us, the long ones not the flattened out mouth filler ones. She had one from day one, and never had a problem with latch because she refused to latch at all, ever! But my daughter only took one for about 3 months. She was never attached or NEEDED to have it, when she was upset she'd take it if she wanted it but if not, oh well. She would only take one kind and one day I couldn't find any of the 6 she had so I went to go get more. The store was out of her kind so I got the most similar shaped pacifier they had, came home, tried it out, she wouldn't take it. After two days of trying to get her to take a paci that wasn't her favorite, and then trying the ones she liked after finding them, she refused it all together! She hasn't had one since! At about 4-5months she started sucking her thumb when she gets tired.", "controversiality": 0, "created_utc": 1351518264, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tcaxv", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430266758, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks for the insight- varied experiences from moms is what I wanted so I have a broad idea of what we might expect. I have a few plugs around the house, so they're available if for some reason we decide its needed.", "controversiality": 0, "created_utc": 1351522854, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdcl3", "link_id": "t3_128qv9", "parent_id": "t1_c6t7594", "retrieved_on": 1430267247, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks. I hadn't really considered them as teething toys!", "controversiality": 0, "created_utc": 1351522886, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdcuw", "link_id": "t3_128qv9", "parent_id": "t1_c6t7qay", "retrieved_on": 1430267251, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks. My mom scoffed when I mentioned the nipple-confusion/breastfeeding issues but it comes up all the time in the readings.", "controversiality": 0, "created_utc": 1351522954, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tddfx", "link_id": "t3_128qv9", "parent_id": "t1_c6t7dy2", "retrieved_on": 1430267258, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks for the insight.", "controversiality": 0, "created_utc": 1351522984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tddq5", "link_id": "t3_128qv9", "parent_id": "t1_c6t8iea", "retrieved_on": 1430267262, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks for the good advice. As long as we've established breastfeeding well, I'll be more comfortable giving her a plug. Its been pointed out that it helps prevent SIDS and can help with teething as well as the soothing, so if it seems like the right choice, so be it. I'm trying to keep an open mind about parenting :) I'm still on the side of things where I can say \"I'll never do THAT\" lol- I know that's all about to change!", "controversiality": 0, "created_utc": 1351523143, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdf3m", "link_id": "t3_128qv9", "parent_id": "t1_c6tacau", "retrieved_on": 1430267283, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ValarDohaeris", "author_flair_css_class": "brown", "author_flair_text": "Dashiell's mom, 8/14/2012", "body": "We used a pacifier starting when he was a few days old. I'd wanted to avoid it, but this kid seriously wanted to suck all the time and my nipples were damaged to the point of bleeding (he was a piranha - he'd latch well, suck for a while, then unlatch and chomp). He started getting the paci when he was fed but still wanted to nom on something.\n\nHe's 2.5 months old now, still EBF, and still uses a paci. It's not like we stick it in for no reason. If he's gassy, he'll overeat to the point of puking over and over but he still wants to suck. If he's in the car, I can't very well give him my boob. Sometimes he's just a little grumpy and wants to suck on something and stare at the world. \n\nThe thing you have to watch out for with a pacifier is OTHER PEOPLE giving the pacifier for no reason. You don't need to plug the kid when you have an otherwise content baby on your hands. My SO's parents would stick the pacifier in for no reason even after we'd explained not to use the pacifier until AFTER he's fed/changed/has absolutely no reason to be crying and clearly just wants to suck.\n\nMy son refuses the pacifier about half the time. He would MUCH rather be on the boob.", "controversiality": 0, "created_utc": 1351523171, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdfcn", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430267286, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks for the advice, that's interesting about the dentist. It sounds like most babies don't have any issue with breastfeeding and pacifiers. We'll just make sure pacifiers are used after breastfeeding is good to go, and as a last resort. ", "controversiality": 0, "created_utc": 1351523262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdg58", "link_id": "t3_128qv9", "parent_id": "t1_c6tatr0", "retrieved_on": 1430267293, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks- good advice. I'll be saving this thread for sure.", "controversiality": 0, "created_utc": 1351523348, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdgw1", "link_id": "t3_128qv9", "parent_id": "t1_c6tavbb", "retrieved_on": 1430267302, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks, that sounds like a good compromise. If we can use the pacifier as a limited tool and not a default condition, I'll be a lot more comfortable with it.", "controversiality": 0, "created_utc": 1351523402, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdhcb", "link_id": "t3_128qv9", "parent_id": "t1_c6tc484", "retrieved_on": 1430267310, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks. \nThat is my understanding as well- my mom said that if we don't introduce the pacifier early the baby won't ever take to it. It doesn't sound like that's the case. ", "controversiality": 0, "created_utc": 1351523453, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdhu0", "link_id": "t3_128qv9", "parent_id": "t1_c6tc7l6", "retrieved_on": 1430267315, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks for the feedback.", "controversiality": 0, "created_utc": 1351523536, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdika", "link_id": "t3_128qv9", "parent_id": "t1_c6tcaxv", "retrieved_on": 1430267326, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MsBud", "author_flair_css_class": "blue", "author_flair_text": "Addy's Mommy Trying for #2", "body": "Thanks, that's a great point about not having other people stick it in. One poster already pointed out that nurses at the hospital will do this as a default soothing technique. Last resort only :) ", "controversiality": 0, "created_utc": 1351523827, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdl8h", "link_id": "t3_128qv9", "parent_id": "t1_c6tdfcn", "retrieved_on": 1430267359, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "osenic", "author_flair_css_class": "purple", "author_flair_text": "Boy 11-11-11", "body": "That's exactly how I feel.  I always hate seeing little kids who constantly have a pacifier in their mouths.  (Nothing against parents who choose to use pacifiers all the time, just personal preference.)", "controversiality": 0, "created_utc": 1351524285, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tdph8", "link_id": "t3_128qv9", "parent_id": "t1_c6tdhcb", "retrieved_on": 1430267415, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "montosaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "I was vehemently against pacifiers prior to having my son.\n\nMy story isn't exactly normal, but my son was born following just over a minute of shoulder dystocia - he was unresponsive and unable to breathe on his own.  Following intubation and three days of intensive \"CoolCap\" therapy (cooling of the brain to prevent swelling), he lost his instinctive ability to suck.  When, at one week, we were finally able to start feeding him via a nasogastric tube, I would shove that pacifier in his mouth and I would use all of my will to get him to suck it!!!  It was a long process.  A few days later we tried a bottle and eventually moved to the breast (he was actually a natural breastfeeder!).\n\nSince then (he's 9 months now), I have wanted him to take a pacifier SO many times - usually at 3am!  But he refused.  Now, of course, I'm glad he isn't a pacifier baby :)\n\nAnyway, I just wanted to share that despite whatever you think now, your circumstances will ultimately impact your final decisions.  It sounds like you're already expecting the unexpected, so just go with the flow. It's ok if things don't go as planned :)", "controversiality": 0, "created_utc": 1351618007, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6tx9bn", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430276861, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loves_dogs", "author_flair_css_class": null, "author_flair_text": null, "body": "Just going to add my limited experience!  I don't know if it's a decision you really need to make since you can just follow your baby's lead if you're not outright opposed. \nI waited until 2 weeks old to offer a pacifier. After she had established a great latch and things were going smoothly with breast feeding. I offered it because my daughter was extremely fussy/colicky. I would have given her anything that had a chance to soothe her!  Poor little thing. I tried it often and I tried several different kinds. She was just not into it. She still won't take one. She did just start sucking her finger/thumb though. And the fussiness/colic has been gone for approx 2 weeks. :). \nGood luck!  ", "controversiality": 0, "created_utc": 1351629153, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6u0e78", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430278319, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": " Neither of my kids really \"took\" to a pacifier. We'd put it in their mouths and hold it there and as soon as we took our finger away it'd just fall out. We really did try for the pacifier to work. I didn't want to deal with thumb sucking. There was no problem with breast feeding, bottle feeding, and trying a pacifier with my daughter. We made it 5 months before the boobs just gave up. My son however, he definitely had nipple confusion with the pacifier and bottle and breast feeding only lasted 3 months because he was a moose and my boobs just couldn't keep up with how fast he grew! (I'm talking doubling his weight by 2.5 months!) We now have two lovely little thumb suckers (3.5, &lt;17 months). Really each baby is different on how they deal with it. It's what you can handle from your baby and how they react to your goals with breastfeeding. ", "controversiality": 0, "created_utc": 1351642906, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6u46dz", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430280204, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "I disagree on this wholeheartedly! Babies forget. Toddlers don't. My good friend took her son's plug away the same time she stopped breastfeeding when he was about one, and he barely cared at all, it was like he assumed it was another one of those things you give up once you start eating solids. I was a sucker and let my daughter keep hers, and trying to get her to let go of it was a nightmare. I finally had to bribe her to give it up when she was potty trained and almost in preschool. She hasn't had an ear infection yet, and she only had it at night, so speech was never an issue, but when I taught young toddlers in daycare there was a very clear difference in the vocabulary of the ones that did and didn't use pacifiers during the day. I would strongly reccomend weaning her off of it at the same time and the same pace as you wean her off of nursing, it will save you a lot of grief and about $10 on a present from the \"binky fairy\" later on :)", "controversiality": 0, "created_utc": 1351648784, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6u5pd8", "link_id": "t3_128qv9", "parent_id": "t1_c6t44rc", "retrieved_on": 1430280902, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sheri22h", "author_flair_css_class": null, "author_flair_text": null, "body": "i never really used a pacifier and i breast fed for a year the only times i ever really used one was those strawberry ones with the little bumps on it for teething and then he mostly just chewed on it and at night time when ever he woke up i just nursed till he was done and when he was finished he was asleep and went back into his crib.", "controversiality": 0, "created_utc": 1351694552, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6ucxq1", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430284454, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "diskdragon", "author_flair_css_class": null, "author_flair_text": null, "body": "my 3.5 month old isn't interested in them at all, she is breast and bottle fed \n", "controversiality": 0, "created_utc": 1352316223, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6xwn4z", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430345988, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "IamAwareofthat", "author_flair_css_class": null, "author_flair_text": null, "body": "Never wanted/had to use them, thankfully! I have friends who had a TERRIBLE time weaning their little ones off pacifiers. If you can, I would say avoid it. But we all know that loss of sleep which makes pacifiers more tempting! :o)", "controversiality": 0, "created_utc": 1352322177, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6xyelf", "link_id": "t3_128qv9", "parent_id": "t3_128qv9", "retrieved_on": 1430346796, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}