{"submission": {"author": "TerrifyingTurd", "author_created_utc": 1352547464, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9k8y6", "created_utc": 1352548738, "domain": "self.Mommit", "edited": 1352552750, "full_link": "https://www.reddit.com/r/Mommit/comments/12yl6b/mommit_my_wife_is_having_an_extremely_hard_time/", "gilded": 0, "id": "12yl6b", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 63, "over_18": false, "permalink": "/r/Mommit/comments/12yl6b/mommit_my_wife_is_having_an_extremely_hard_time/", "retrieved_on": 1413388614, "score": 30, "secure_media_embed": {}, "selftext": "Whenever I ask her the same question, she becomes very emotional and insists she can do it 'all by herself'.  She feels like she *needs* to be supermom, but shes mad at herself that she can't juggle everything perfectly.\n\nWhat are some things that you may be too proud to admit but had ever wanted/needed someone to take care of for you?  How can I make her day easier?\n\nEdit: Derp, I didn't mention the age of our son.  He is 2yrs old.  \n\nThings I already have picked up:\n\nWhen I get home, I take him off her hands until he goes to bed\n\nI do most of the cleaning (but not laundry)\n\nOn my days off I let her sleep in\n\nI tell her most every day how proud of her I am and how beautiful she is\n\nBut it just seems there is some wall that I'm not getting through.  Finances are tight to say the least, but thats a long term goal I'm already working on.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Mommit, my wife is having an extremely hard time with our son while I'm at work.  She is an absolute wreck when I get home, and its taking its toll. What can I do to help her?", "url": "http://www.reddit.com/r/Mommit/comments/12yl6b/mommit_my_wife_is_having_an_extremely_hard_time/", "user_reports": []}, "comments": [{"archived": true, "author": "antiphobia", "author_flair_css_class": null, "author_flair_text": null, "body": "Take the child off her hands. You didn't mention how old he is. But seriously, take him away and be responsible for him, even if it's under the guise of \"I want to play with him for a while\" so she doesn't feel like you're throwing her a sop. If you can manage it, take him out of the house, somewhere else, be gone with him for a while. This will help. ", "controversiality": 0, "created_utc": 1352549718, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z89c3", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430368883, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "usofunnie", "author_flair_css_class": "lightcoral", "author_flair_text": "Mary's mom, 1/6/12", "body": "Tell her you'd like a turn playing. How old is he? Is it possible she is suffering from a touch of post partum depression? If so it couldn't hurt to talk to a doctor. \n\nMaybe see if there is a play group on your area with similar aged kids she could go to. So she can get out of the house for a while once of twice a week. \n\nTell her you appreciate what she does all day. Tell her she's doing a wonderful job as mommy. Tell her you want some time with her, too, even if it's just a little cuddle time after baby is asleep. \n\nAdjusting to life with baby is rough. For some reason, we seem to think that stay at home moms *should* be able to do it all… but we eventually learn we can't. Maybe also let her know it's fine by you if the dishes stay in the sink one more night, or that you have to put in a load or two of laundry yourself. Remind her you are here to help her, and that it would make you happy if you could. \n\nHope something here helps. Don't give up!", "controversiality": 0, "created_utc": 1352550741, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8ccg", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430368925, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Munchees", "author_flair_css_class": null, "author_flair_text": null, "body": "First of all, you're awesome. \n\nYou didn't mention the age of your son, so you may have to adjust a few suggestions. If she's overwhelmed while you're at work, make dinner. My daughter is only 3 weeks old, but I swear to Jesus if my SO came home and made dinner it would make my life about 10x easier. Also, if you see laundry that needs to be done, throw it in, move it, fold it, wherever it may be. Little things around the house that she'd be trying to balance with baby can help ease the frustration.\n\nVerbalizing how great of a job she's doing may help. Simple appreciation goes so very far. If you see her being supermom, tell her. I never, ever tire of hearing my SO tell me how great of a Mom I am, even if I'm having a moment where I'm not being such a great Mom.\n\nLastly, don't be afraid to confiscate the baby. When Adrienne is riled up, (like last night, up for 7+ hours and just fighting sleep all the way) it means a lot to just have somebody take a turn holding the baby for a while. Whether your son is little and that situation fits, or you say \"I think I'm gonna play with him for a while\" or \"snuggle for a while\", whatever gets you and your son face time without the pressure being all on Mommy.", "controversiality": 0, "created_utc": 1352551903, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8frf", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430368968, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "I haven't thought about that.  Thats usually been her jig since we've been together.  I'm not the greatest of cooks but would even getting together hotdogs or sandwiches help?", "controversiality": 0, "created_utc": 1352552881, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8iub", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8frf", "retrieved_on": 1430369007, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tectonicus", "author_flair_css_class": null, "author_flair_text": null, "body": "Does she have friends? Playdates? Does she take the kid out to the library/park/wherever, or is she stuck at home all day?\n\nCould you get a babysitter for a little bit, or (cheaper) a mother's helper for a few hours a week -- a high school student who comes and plays with your son while she takes a nap in another room? \n\nIs your son especially difficult? Does he take a nap during the day?\n\nHow long has this been going on? Could there be untreated postpartum depression?", "controversiality": 0, "created_utc": 1352553007, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8j9r", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369015, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "She gets out of the house to go out with friends maybe 2-3x a month.  This has been going on for quite a while (~6-8 months?), and it sort of seems the more I do the worse it gets.", "controversiality": 0, "created_utc": 1352553283, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8k9e", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8j9r", "retrieved_on": 1430369026, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "I work 6am-2pm, from 2:30 until the time he goes to bed, I take him upstairs and watch him. Every now and then he'll wander downstairs to see her, but I'm right behind him and take him back up when he starts getting too energetic for her.  But I don't take him out very often unless its going to the store or something. \n\nWould 'having the house to herself' for a few hours a week help do the trick?", "controversiality": 0, "created_utc": 1352553447, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8kt9", "link_id": "t3_12yl6b", "parent_id": "t1_c6z89c3", "retrieved_on": 1430369033, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rocking_chair", "author_flair_css_class": null, "author_flair_text": null, "body": "Does she have an experienced mother to talk to? Maybe even a counselor? It isn't normal for you to keep him away from his mother for hours everyday. ", "controversiality": 0, "created_utc": 1352554370, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8o6i", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369078, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "She has a few friends who are moms that she can relate to.  When I take him off her hands, she is free to (and does) come upstairs on her own volition to spend time with him, but I try to make sure she is *free* to do it and doesn't *have* to do it.", "controversiality": 0, "created_utc": 1352554641, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8p6r", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8o6i", "retrieved_on": 1430369090, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Saravi", "author_flair_css_class": null, "author_flair_text": null, "body": "In addition to the advice that has been given, take your wife out of the house, too - with your son, and if possible, without him.  Walk somewhere.  Go to a park.  It doesn't have to cost anything.  Just time.\n\nSpend quality time around the house with her when the little guy is sleeping.  Do things that make you both smile and laugh.  Be a carefree married couple sometimes.\n\nWhile your son is two, having a child drastically alters your life, and parents, particularly those who stay home with the child, can feel like they've lost themselves to that change.  Everything is about the baby/toddler.  Every day is about when he's going to wake up, when he needs to eat, when he's going to sleep, what's going to keep him busy, what he needs to be happy, etc.\n\nThis can take awhile to hit home.  It's expected when they're babies, but then slowly, it starts to sink in that you're in it for the long haul - those early mornings, the incredible responsibility, the sacrifices of time, energy, and sometimes sanity.  Will it ever end?  Does it ever get easier?  WHEN!?\n\nThat's not to say that kids aren't worth it, but being a parent can be stressful, and as much as we love our kids, there can be a lot of love-hate going on towards the responsibility, sacrifices, and limitations that family life imposes.  It wears you down and can slowly burn you out.  Sounds to me like your wife is feeling that, to some degree.  Possibly, she's a little depressed.  It happens.", "controversiality": 0, "created_utc": 1352554873, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8q3j", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369103, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "She might resent (as unfair as it seems) that you get to go to work and you still have energy left over to take care of the baby. I know that seems silly but it can almost feel like you're not good enough. Another thing i haven't seen in your posts is whether you are making any time for the two of you. When the last time you went on a date? How about getting a babysitter once a week or every other week for a night out? Have the sitter arrive two hours before you're going to go out so you both have time to get ready. On weekends, take the baby out to do things- museums, fairs, kid friendly restaurants, etc. And definitely raise the possibility of PPD. Try talking to the pediatrician as to how to approach her about it without offending her (some women feel like PPD=failure. Good luck.\n\nEdit: also, getting meals together for her to take out of the fridge could help. Small things like taking for and cutting it into toddler portions and putting it in containers, boiling pasta and putting it in containers to be used for easy pasta dishes, cooking a few chicken breasts, etc. Let her know that you're inspired what a great job she's doing and you want to help as much as you can, not that she's struggling and you need to help because she's incapable.", "controversiality": 0, "created_utc": 1352554883, "distinguished": null, "downs": 0, "edited": 1352556618, "gilded": 0, "id": "c6z8q4x", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8k9e", "retrieved_on": 1430369103, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "She sounds depressed to me. I have a 3 and a 4 year old with one more on the way and my husband isn't nearly as interested in helping as you seem to be. If I ask him specifically to do something he helps without complaint, but he's not much of a self motivator in that dept.;) I'm a SAHM and it can definately be frustrating on a daily basis. I've put myself in tears more then a few times and that's totally normal, but if you're doing the cleaning and taking your son from 2-bedtime then her frustration level seems excessive. I'm not trying to criticize or suggest that she's failing in any way. If you're truly helping as much as you say you are then I have to think there's a deeper emotional issue at play.", "controversiality": 0, "created_utc": 1352554903, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8q72", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369103, "score": 37, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "...What? It isn't normal for a father to help in the care of his own child for a few hours to give mom a break after more than 12 hours straight? That's... i don't agree with that at all.", "controversiality": 0, "created_utc": 1352555085, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8qww", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8o6i", "retrieved_on": 1430369115, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mattiMom", "author_flair_css_class": "green", "author_flair_text": "Mom of 3 year old boy and 18 month old girl", "body": "That's not 12 hours straight.  He works from 6-2, he's home at 2:30 every day.  Add in the fact that her kid is probably up after 6, and takes a nap, she's alone with her son for maybe 6-7 hours max which is full of play times, snack times and lunch times.  Having her husband keep the child away from her until bed time is highly unusual, and that's what it sounds like he does.  Does he not deserve an hour to himself as well because he works?  Both are stressful and tiring, but only she gets the break - including sleeping in on weekends.  I dunno, to me personally it seems very weird that she's a wreck when he gets home after such a short day - there might be something else going on here than just the fact that she needs a break.", "controversiality": 0, "created_utc": 1352555680, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8t9m", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8qww", "retrieved_on": 1430369143, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kalypso95", "author_flair_css_class": null, "author_flair_text": null, "body": "Any chance she has someone else putting her down or making her feel inadequate? Is her mother always criticizing her parenting or does she have very competitive mommy friends? ", "controversiality": 0, "created_utc": 1352555708, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8tdd", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369144, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rigamarolly", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you spend much time alone with your wife?  My first thought was maybe she wants time with you?  When I get worn out, it's because I get worried I'm not being a good enough wife, or I feel lonely from lack of adult time.  I know you said finances are tight, but if there is someone who could give you guys alone time, you should try a stay at home vacation together.", "controversiality": 0, "created_utc": 1352556172, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8vb4", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369169, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "This is how I feel too. I feel stretched incredibly thin, but I love her and am running out of ideas of how to make her feel better. I simply don't know what else to do.", "controversiality": 0, "created_utc": 1352556184, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8vcq", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8t9m", "retrieved_on": 1430369170, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;Small things like taking for and cutting it into toddler portions and putting it in containers, boiling pasta and putting it in containers to be used for easy pasta dishes, cooking a few chicken breasts, etc.\n\nI can do that, and that is a wonderful idea.  Thank you!", "controversiality": 0, "created_utc": 1352556268, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8vpk", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8q4x", "retrieved_on": 1430369175, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah we spend maybe 2-3 hours a day together.  Nothing serious, just hanging out or talking, watching a tv show or whatever.", "controversiality": 0, "created_utc": 1352556335, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8w0n", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8vb4", "retrieved_on": 1430369179, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antiphobia", "author_flair_css_class": null, "author_flair_text": null, "body": "possibly, but if you're already taking him off her hands that much there may be something else bothering her. does she ever get out on her own anymore? does she have any social network? do you two spend time together without the little guy?", "controversiality": 0, "created_utc": 1352556480, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8wp6", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8kt9", "retrieved_on": 1430369187, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ms_illia", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a 2.5 year old and both my husband and I work full time, so I have no idea what a sahm is like. However, I think it sounds like you are going above and beyond what most husbands do.  I don't know how you come home and take the child all evening by yourself - that's tough. You also do almost all the housework - that's crazy. I do cooking and cleaning while I'm watching my kid in the eve or weekends. Seems like you are already doing a lot!  Maybe your wife Might be happier working - daycare is good for kids, especially when they get to this age and start cultivating friendships with their classmates. ", "controversiality": 0, "created_utc": 1352556518, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8wui", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8t9m", "retrieved_on": 1430369189, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "joispeachy", "author_flair_css_class": "green", "author_flair_text": "2 yr old girl", "body": "Wow!!  I wish I had that setup. I work, and am a full-time stay at home mom.  By that I mean I watch my daughter all day every day and work from home. It's sooooo stressful. My husband works 9-7 most days. When he gets home, he usually takes care of her without me for an hour or so before she goes to bed. I cannot imagine having someone to help me from 2:30 to bedtime. That would be a dream. \n\nDoes your wife maybe have anxiety problems?  Left unchecked, mine is horrible. I'm on anxiety meds.  You should maybe have her talk to someone about her anxiety levels. ", "controversiality": 0, "created_utc": 1352556546, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8wz4", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8kt9", "retrieved_on": 1430369191, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1352556899, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8ykl", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369213, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "Well, while i think it's not a great situation, and PPD or some other issue may be at hand, i don't think it's all that unusual for parents to share responsibilities, especially when one works and the other doesn't. Plus he works 6-2, but we all know at most jobs, you have to get ready, go there, and come back, so add another hour or two to the time she's with baby.\n\nEDIT:  Holy Swype typos.", "controversiality": 0, "created_utc": 1352556991, "distinguished": null, "downs": 0, "edited": 1352730670, "gilded": 0, "id": "c6z8yyr", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8t9m", "retrieved_on": 1430369218, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "unplural", "author_flair_css_class": null, "author_flair_text": null, "body": "so let me get this straight OP, you go to work every day, and then come home and take over basically all of her responsibilities, and she's still overwhelmed? something is going on here and it's not your son (otherwise you wouldn't be able to handle him either, i'm thinking). \n\ntalk to her. she might not even realize what's really wrong and is just projecting. if she's CONSTANTLY having trouble taking care of her kid then there is something wrong. be it depression or some other mental issues or some outside force making her feel this way.", "controversiality": 0, "created_utc": 1352557141, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8zo4", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369227, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TerrifyingTurd", "author_flair_css_class": null, "author_flair_text": null, "body": "Her dad was very demanding when she was growing up, as far as being excellent all the time. She is not very close with him, but she still has 'that voice' in the back of her head, if that makes sense.", "controversiality": 0, "created_utc": 1352557192, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z8zwg", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8tdd", "retrieved_on": 1430369230, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Punkergirl14", "author_flair_css_class": null, "author_flair_text": null, "body": "I am in exactly the same position as your wife, and it's EXHAUSTING! Trying to keep the house in one piece while watching my boy is very difficult.\n\nThe best thing my husband did for me was insist on hiring a cleaner, who comes in twice weekly for 2 hours. It gives me a chance to do fun things with the boy and forces me to get out of the house. I would strongly suggest it, even if it's only once a week, it takes so much pressure off.\n\nAlso, does she see much of other mums and kids? It helps me so much to vent to other women in the same position as me, and the kids have a great time crashing about while we chat. \n\nI have to make a real effort to stay on top of things at home, but I have learnt that it's near impossible to be a perfect housewife when you've got a 2 year old boy! Some rare women can do it, but not me. Once you accept that things do get easier.", "controversiality": 0, "created_utc": 1352557251, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z907d", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369234, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Alliebeth", "author_flair_css_class": "blue", "author_flair_text": "2 boys- 2011 and 2014", "body": "Okay, take this with a grain of salt, because I know everyone handles things differently. I'm home with my son who's 19 months monday-friday from 7am-5:30pm. I do all the cleaning, laundry, cooking, and shopping, plus playdate/park time at least 3x a week...and I still have a lot of time to sit on my ass and do nothing (while my husband isn't home). \n\nIs your wife especially unorganized? I'm a pretty organized person, so that keeps me from feeling overwhelmed. Does she follow a schedule? We have a day to day schedule and a weekly one. It keeps my son calm and happy knowing that meals, nap, play, bed are at the same time every day. Tuesdays are for the park, Thursdays are the library, and Fridays we go to a friends house. \n\nFrom the bits of information given, I think something more than just frustration is going on. Have a heart to heart with her and if it persists, make sure she talks to a doctor about depression issues. You sound like a great husband, I'm sure it will get better for you both!", "controversiality": 0, "created_utc": 1352557328, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z90kk", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369239, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "My take:\n\n1.  She needs to be getting out every day, and meeting with other mothers.  It is not normal for a mother and child to spend all their time alone together.  Primitive/traditional societies are far more communal\n\n2.  It may make more sense for your wife to get a job, full or part time, and put your son in daycare.  That way her time with him will be quality time, she will get her adult headspace back, and she will enjoy him more", "controversiality": 0, "created_utc": 1352557721, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z92hz", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369265, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "Been there done that. *hugs* for your wife. \n\nI'm the same way and since we have a special needs kiddo, I feel even MORE pressure to get it right because the world is hard enough on normal kids and downright brutal for the spedies.", "controversiality": 0, "created_utc": 1352558021, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z940b", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8zwg", "retrieved_on": 1430369295, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kalypso95", "author_flair_css_class": null, "author_flair_text": null, "body": "ooh, that could be a tough situation, if she's already internalized all of her father's criticisms. If you try all of the other tips suggested in this thread and nothing seems to help at all, she might need therapy. It's possible, if she's been raised with the idea that nothing she does is good enough, that it won't make a huge difference how much you help out. Her subconscious could be telling her that she's messing up the most important job of her life and she's failing you and her son. Imagine how stressful it would be to feel that way. It could help her to have an objective third party (like a therapist) help her to see that she is not judging herself fairly. Not saying that this is def the case, but if nothing else seems to be working, this could be your problem. Anyhow, good luck!", "controversiality": 0, "created_utc": 1352558504, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z96cj", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8zwg", "retrieved_on": 1430369317, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bettyrumble", "author_flair_css_class": null, "author_flair_text": null, "body": "Butting in here to say... absolutely! I'd love it if there was a night or two a week where I didn't have to think about dinner, let alone cook it. ", "controversiality": 0, "created_utc": 1352558936, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z98k2", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8iub", "retrieved_on": 1430369344, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "k_hall_313", "author_flair_css_class": null, "author_flair_text": null, "body": "Its hard for me to relate to this. I am a stay at home mom to a 13 month old but my husband is deployed. He has been gone from august of last year til march of this year. And now gone for another 8 months that started 2 months ago. I have no friends here and all my family is 2500 miles away. Some days are very stressful as he is getting older and more mischievous but my hands are tied. When I get stressed I leave the room for a bit or take my son for a drive since driving relaxes me. I can only imagine how nice it'd be to have someone here from 2-bedtime! Maybe she has postpartum ? She should really see a doctor because that is really serious. That would be my only advice really because its hard to put myself in that situation (considering that situation *to me* would be so nice to have!).", "controversiality": 0, "created_utc": 1352559255, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9a72", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369365, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ThunderLilac", "author_flair_css_class": "purple", "author_flair_text": "Mommy of 2 girls", "body": "PPD, if left untreated, can last for years. I know, I've been there. After my first child was born, I had a severe case. Unfortunately, my husband's job didn't allow for him to help me out the way you're doing. Most of the time, I was left to do it all myself 24/7 while he was out of state for his job, and only home on weekends. I was also determined not to admit that I had PPD because, as someone else mentioned, admitting it made me feel like I was a failure. It sounds like your wife might be suffering from PPD or anxiety or something along those lines. I know that if my husband was able to help with our girls in the capacity that you are, I'd be far from stressed out. Is there a way that you can approach the subject without upsetting her too much? Or does she maybe have a close friend that she feels safe confiding in? Perhaps another mom who can commiserate with her? Maybe have them mention something like \" You seem kinda blue lately, are you feeling okay? I know when my child was born, I had some blues after.\" Sometimes it helps just knowing that you're not the only person in the world suffering from it. Also gather some resources for her, or at least know where she can go to get resources to help. My OBGYN office this time around was a great resource for me. By the time that I got pregnant with my second, I was ready to admit that I had a problem when my first was little. This went in my file, so by the time my second was born, they knew. My midwife gave me a list of numbers right before I had my daughter  \"just in case\" and said that if all else failed, I could call her if I felt overwhelmed. We also talked about some of the signs and symptoms and things to look out for, since I didn't get help or even admit there was a problem the first time around. It definitely left me feeling more confident this time. We mommies are proud creatures. Sometimes it just takes a gentle push in the right direction to get us to admit that we need help without feeling like complete failures. ", "controversiality": 0, "created_utc": 1352559637, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9c6p", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "removal_reason": null, "retrieved_on": 1435669915, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meggymoo8", "author_flair_css_class": "purple", "author_flair_text": "Bradley August  born Nov.2011", "body": "You are an amazing husband and father for doing these things. Keep it up. I hope this doesn't come off too harsh, but is she one of these people who are just never satisfied? Like no matter how much you help she will always feel overwhelmed? As a working mom , I know that women can feel that way. If that's the case she needs to figure out how to be content. It sounds like a personal problem, not a 'you' problem.  Keep it up and maybe remind her of what a happy great life you guys have. Keep in mind, not all moms are cut out to stay at home. Maybe mention that. I WANT to go to work everyday. Ask her how she feels about getting a job.", "controversiality": 0, "created_utc": 1352559734, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9cp6", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "removal_reason": null, "retrieved_on": 1435669922, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mattiMom", "author_flair_css_class": "green", "author_flair_text": "Mom of 3 year old boy and 18 month old girl", "body": "The sharing responsibilities is not what is unusual, it's him keeping her son away from her for so long once he gets home from work. On top of his job he does many of the chores, has indicated he wouldn't mind cooking though not great at it, and plays with his son from when he gets home until his son goes to bed. That to me is above and beyond sharing responsibilities, so it seems like there is something else bothering her than simply needing a break.", "controversiality": 0, "created_utc": 1352560405, "distinguished": null, "downs": 0, "edited": 1352561996, "gilded": 0, "id": "c6z9g9r", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8yyr", "retrieved_on": 1430369455, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mattiMom", "author_flair_css_class": "green", "author_flair_text": "Mom of 3 year old boy and 18 month old girl", "body": "I think you need to sit down and have a long talk with her about why it is she feels this way, and what she may want or need that you won't know about unless you ask her.  ", "controversiality": 0, "created_utc": 1352560664, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9hpf", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8vcq", "retrieved_on": 1430369475, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamacarly", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you're doing all the right things and there is no \"trick\" to stopping the exhaustion and frustration of motherhood. \n\nKeep supporting her emotionally, valuing her and doing what you're doing and make sure you are both focused on YOU having a relationship with your child as well. \n\nI was a martyr mom at first and wish I'd realized earlier that letting Dad take over wasn't just good for me - it was good for my child and husband also. I still feel guilty when I'm away from my kids, even though I really need that time away from them. It helps me if I remind myself that it's good for all of them (kids and husband) too. ", "controversiality": 0, "created_utc": 1352561001, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9joz", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8kt9", "retrieved_on": 1430369489, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "that's what it's starting to sound like to me, and the more OP \"helps,\" the more it is probably reinforcing that notion that she isn't good enough, that she can't do it. i wonder to what extent her dad would take over something for her because she wasn't meeting his expectations, and if she feels that is happening with her family now. i agree that the situation probably isn't going to improve until she gets some therapy to change her internal monologue.", "controversiality": 0, "created_utc": 1352561276, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9lby", "link_id": "t3_12yl6b", "parent_id": "t1_c6z96cj", "retrieved_on": 1430369511, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "Even a frozen pizza might help. Check the frozen food section for some ready made meals. They have frozen veggies that steam tight in the bag as well as frozen brown rice. There is even precooked frozen chicken you heat up in the microwave and can be tossed on salads, in sandwiches, or served with rice and veggies. Don't forget spaghetti. Box of pasta and a jar of ragu are an really easy fix. :)", "controversiality": 0, "created_utc": 1352562189, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6z9qwp", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8iub", "retrieved_on": 1430369584, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsfoote", "author_flair_css_class": null, "author_flair_text": null, "body": "Being social and meeting other moms has made a world of difference in my life as a SAHM. In MN there is a great program for families called ECFE, Early Childhood Family Education. I've met so many moms and babies. We're given time together to play and sing and than we separate and moms have class and babies play with the teachers. I would look for something like that. Just getting out of the house everyday made a difference. \n\nI also take anti-depressants and had my dosage upped. I had many days of staring blankly at my son and the meds and talking to a professional helped. \n\nGood luck - you are an amazing dad and partner to your wife to be so active in helping and for your concern for her well being. ", "controversiality": 0, "created_utc": 1352564405, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6za6io", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430369788, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rocking_chair", "author_flair_css_class": null, "author_flair_text": null, "body": "Helping in the care is not what this father is doing! Say Jr goes to bed at 7, that's 3-4 hours every day that he takes Jr upstairs so mom doesn't have to deal with him.  ", "controversiality": 0, "created_utc": 1352565594, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zafk5", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8qww", "retrieved_on": 1430369910, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "So what is helping with care to you? Half an hour? One hour? Also he's said that she does come and spend time with them upstairs. It's not like he comes home and she runs out the door.", "controversiality": 0, "created_utc": 1352565947, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zai6c", "link_id": "t3_12yl6b", "parent_id": "t1_c6zafk5", "retrieved_on": 1430369941, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "Toddlers thrive on schedules. Do not underestimate the importance of a daily schedule as a SAHP.\n\nThat being said, it's important to deviate from the schedule now and then, just so the kid can handle a change.", "controversiality": 0, "created_utc": 1352566077, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zaj5i", "link_id": "t3_12yl6b", "parent_id": "t1_c6z90kk", "retrieved_on": 1430369954, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "What the hell isn't normal about that? He's his kid too!", "controversiality": 0, "created_utc": 1352566863, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zap0p", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8o6i", "retrieved_on": 1430370035, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brenders", "author_flair_css_class": null, "author_flair_text": null, "body": "You sound like my hubby. We have a 3&amp;1/2 year old and a 7 month old. He does all the same things for me as you do for your wife. And I still get upset all the time. Keep doing what you are doing. Try to get a babysitter and get a bit of you and her time. Not a movie, somewhere to talk. And/or exercise. Although it seems she may take your help for granted, she appreciates it. It will get better. Kids, although awesome, are little jerks. But one day, when they go to school, things will be much better. I hope. ", "controversiality": 0, "created_utc": 1352567971, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zaxez", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430370157, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brenders", "author_flair_css_class": null, "author_flair_text": null, "body": "Upvote here! Playgroup is awesome. We just started last month. The kid interacts with kids his age, &amp; mom gets to hear other moms complain about the same stuff. Unity = sanity sometimes. ", "controversiality": 0, "created_utc": 1352568327, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zb05w", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8ccg", "retrieved_on": 1430370197, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "Does she do any \"group\" activities with your son? Maybe some mommy &amp; me play groups or other activities like at the library would help break up her day. Also if he's two now perhaps he is old enough for some activities in his own where there's like an instructor but all the parents stay and watch. Like a dance class? Or just supervised play? \n\nIf she's already doing all of this I think she might need to go talk to a professional. I'm finding it interesting that you have him from 230 pm until he goes to bed (so like 7-830 or something?) and she is still so overwhelmed. I'm not saying this is her fault or anything like that of course. It just throws up a red flag for me. \n\nI really think you should consider counseling or something like that for her. Perhaps the two of you could go together if that would make her more comfortable. Good luck! I really hope your wife feels better soon! ", "controversiality": 0, "created_utc": 1352572650, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zbym7", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "removal_reason": null, "retrieved_on": 1435669858, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Posh_d", "author_flair_css_class": null, "author_flair_text": null, "body": "So she watches the child from 6-2:30 while you work, then you watch him and clean from 2:30-bedtime. Wow, she should be telling you that you are wonderful and letting you sleep in. I think she has it better than about 99% of moms, both working and stay at home (I've done both). If only I was given a six hour \"break\" or \"help\" each day! Seriously, I've never known any mother to have a husband that does all that. And what exactly is she doing from 2:30 until she goes to sleep that is so overwhelming if its not running the house or raising the child? I'm not trying to be mean, but the reality is that most of us are lucky if we get any time at all, any day, not hours and hours every day. I'm just having a hard time understanding how having a fraction of the workload is too much to handle. On a different note, two year olds love school and being around other kids their age that have the same energy and interests. Look into a part time program. ", "controversiality": 0, "created_utc": 1352572907, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zc0pr", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430370689, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "everydayrebellion", "author_flair_css_class": null, "author_flair_text": null, "body": "What about a part-time job? I know it may seem crazy to add another thing to her plate, but hear me out... It will give her more adult interaction and conversation, could potentially get her back to something she enjoyed before she became a mom, and might help her feel like all the home/kid stuff isn't her responsibility since she has outside responsibilities, too (I realize you're helping a lot, but it sounds like she still feels the weight of everything on her shoulders.). Also, it could potentially help the financial situation a bit, if child care doesn't take up the money she earns. ", "controversiality": 0, "created_utc": 1352574084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zca1z", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430370804, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BruinsMom", "author_flair_css_class": "lightcoral", "author_flair_text": "Baby Emma due 1/23/13!", "body": "You're doing a great job. Just continue to be there to support her. The way she's feeling is normal and the way you're feeling is completely normal as well; it will pass and you'll both eventually get into the swing of things.\n\nDrop baby off at grandma's for a night and go out on a date, maybe to a place you took her when you first started dating. It will give her a chance to relax and she'd really appreciate the effort.", "controversiality": 0, "created_utc": 1352575579, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zclkd", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430370927, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rocking_chair", "author_flair_css_class": null, "author_flair_text": null, "body": "To me it should be together. Yes mom should take some of that time to nap, shower, whatever. But I am having a hard time veiwing this as shared.  She might not be running out the door, but it sure sounds like she is emotionally checking out. But this man is also doing most of the housework. This isn't shared responsibility. I know because I've been in her shoes. ", "controversiality": 0, "created_utc": 1352583114, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6ze3k8", "link_id": "t3_12yl6b", "parent_id": "t1_c6zai6c", "retrieved_on": 1430371693, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Two year olds are hard boys age 2/3 are REALLY hard. She may be depressed. Does she get out to moms groups? Encourage her to do so. Sometimes having a weekly meetup with other parents and kids is a huge stress releif. Meetup.org should have something near you. \nBut it really sounds like there is more going on. My husband almost never takes the kids, does no house work and I never sleep in or hit the hay early. My kids are 6 months, 3 and 6. Ya I'm frazzled and even overwhelmed at times but it sounds like you do A LOT. Not sure how to you should ask her to get checked, maybe on of those depression check list? ", "controversiality": 0, "created_utc": 1352583308, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6ze4w0", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430371710, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ter702", "author_flair_css_class": null, "author_flair_text": null, "body": "Very much agree.  Your description could have been of me with PPD.  Please see if you can get her to talk to a therapist or a counselor.  There is help to be had for this.", "controversiality": 0, "created_utc": 1352599146, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zhq2s", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8q72", "retrieved_on": 1430373401, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mashuplover", "author_flair_css_class": null, "author_flair_text": null, "body": "She needs to have the kid taken away from her for at least one day per week -- either sent to a daycare or out with a sitter. She won't give herself time to relax and recuperate, so you might have to make her take that time.\n\nYour wife clearly has a strong martyr complex, which is unhealthy. She'll pickle herself in her resentment and exhaustion if you don't take more drastic measures to ensure she has time to relax.\n\nIs your wife a perfectionist as well? If that's the case, the house will never be clean enough for her, the kid will never be developing fast enough. Even with a sitter and one day to herself per week, she'll still feel like she's not good enough. ", "controversiality": 0, "created_utc": 1352600475, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zi04g", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430373533, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mashuplover", "author_flair_css_class": null, "author_flair_text": null, "body": "Ditto on the community thing. If she's trapped in the house alone with him, she'll obviously become depressed--it would be hard not to. She needs friends and interaction outside you and the kiddo.", "controversiality": 0, "created_utc": 1352600535, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zi0kj", "link_id": "t3_12yl6b", "parent_id": "t1_c6z92hz", "retrieved_on": 1430373539, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Munchees", "author_flair_css_class": null, "author_flair_text": null, "body": "Hot dogs, Tuna Mac, Crockpot Chili (SUPER easy and delicious), sandwiches, whatever. Also, from reading through some of your responses, it DOES seem like there is more going on with her than just being overwhelmed by baby. Tread carefully, but try to get her to open up. It sounds like PPD or something similar. ", "controversiality": 0, "created_utc": 1352633645, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zn9ku", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8iub", "retrieved_on": 1430376110, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "This is exactly what I was thinking.  I only have a 6 month old but for the first 3 months I was constantly crying and I refused to let anyone help because of all the stories I had heard about \"supermoms\" I had to be one too.  Now I'm on medication and Grandma takes him whenever she wants, cause Momma needs sleep damnit lol.", "controversiality": 0, "created_utc": 1352669791, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zu9t0", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8q72", "retrieved_on": 1430379517, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hydrogenbound", "author_flair_css_class": "blue", "author_flair_text": "boy wonder 2.5", "body": "Yes, I have to get out of the house, doesn't matter where, but I can focus on my son sooo much better and really enjoy play time. ", "controversiality": 0, "created_utc": 1352671783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c6zusnh", "link_id": "t3_12yl6b", "parent_id": "t1_c6z8q3j", "retrieved_on": 1430379787, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Q-Kat", "author_flair_css_class": null, "author_flair_text": null, "body": "More than anything I think it helps me to know that my friends who are mums are, completely independently, going through the EXACT same troubles as I have and am having with my boys as well as they are coping with the same mechanisms too XD\n\nToday a friend was talking about her boy not eating his dinner at all recently after being such a good eater. She mentioned that when he refuses she's told him he can just go to bed instead then and asked if that was too harsh and i'm like.. nope, I do the exact same thing. And wrap up the plate for if they change their mind later - no way Am I making them something else. \n\nJust felt nice to know that i'm not alone and must be reasonably sane if other's are trying out the same things. I would hate to bring something up as a method of dealing and have everyone stare at me like I was completely nuts. ", "controversiality": 0, "created_utc": 1352738976, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c708aoo", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430386253, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Give her lots of praise for the things she does do and always tell her what a great Mom you think she is.  This worked wonders for me.", "controversiality": 0, "created_utc": 1352754921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c70cujg", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430388408, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with this - how much does she get out of the house, and where are her friends?  If she's even slightly prone to depression or anxiety, if she's not doing this odds are loneliness and isolation will add to it, and make everything worse.  \n\nI don't have PPD and when I've had more than a couple days where all I do is take care of our son and I don't really get out, I start to get really twitchy and overwhelmed.  Getting days where SO takes care of him so I can get out and get fresh air that is NOT related to grocery shopping, target, or getting stuff for the baby can refresh me - it doesn't take much, I get one or two days a month to go enjoy fresh air and play with the horses (a lifelong passion, and when I don't get my fix I can get very very grumpy), and that can put me in a much better mental place for weeks.\n\nAnd finally, it does sound a little more serious than typical - so I think she may want to talk to a medical professional as well, about PPD or general depression.", "controversiality": 0, "created_utc": 1352817302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c70pakk", "link_id": "t3_12yl6b", "parent_id": "t1_c6z92hz", "retrieved_on": 1430394426, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "luv4bunnies79", "author_flair_css_class": "purple", "author_flair_text": "3 year old's zookeeper, newb 9/13", "body": "Most people said what I was. Props to being an awesome dad! The fact you even came to the mommy web site to ask advice says a lot about your commitment and care. Sounds like she may need mom friends, or just be too hard on herself, or PPD. I had PPD and this was so me all the time. It helped me to get out. I got passes to anything I could and took my son there during the day. Also, was she working and now isn't? I know for me, my whole identity changed. It was really hard to swallow leaving my WHOLE past life behind and having a new one. Even if it was for an awesome one.", "controversiality": 0, "created_utc": 1353009309, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c71whrc", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430415208, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "virgin_mojito", "author_flair_css_class": "lightcoral", "author_flair_text": "Elsa's Mummy", "body": "Can we get an update? ", "controversiality": 0, "created_utc": 1356658282, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n2ezy", "link_id": "t3_12yl6b", "parent_id": "t3_12yl6b", "retrieved_on": 1430787004, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}