{"submission": {"author": "loki93009", "author_created_utc": 1262229966, "author_flair_css_class": "purple", "author_flair_text": "2 years old", "author_fullname": "t2_3ssx7", "created_utc": 1354486873, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1463m7/ive_seen_askreddits_opinions_on_spanking_and_now/", "gilded": 0, "id": "1463m7", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 146, "over_18": false, "permalink": "/r/Mommit/comments/1463m7/ive_seen_askreddits_opinions_on_spanking_and_now/", "retrieved_on": 1413325729, "score": 24, "secure_media_embed": {}, "selftext": "I can only know how I feel about my child and my reaction to spanking, but as mothers I feel you have a more real idea of what you'd do when it comes o spanking. Some people are all for it but they haven't met or even decided of they are having children.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I've seen askreddit's opinions on spanking, and now I want to hear actual mothers opinions. Were you spanked as a child? Would you/ do you spank your child? Why or why not?", "url": "http://www.reddit.com/r/Mommit/comments/1463m7/ive_seen_askreddits_opinions_on_spanking_and_now/", "user_reports": []}, "comments": [{"archived": true, "author": "LadyEmbora", "author_flair_css_class": null, "author_flair_text": null, "body": "My parents spanked only when necessary. Nonetheless, it never made sense to me. If I were to hit someone for doing something *I* found bad, *I* would get in trouble. Why, then, can my parents?\nEverytime I got a spanking, I felt that it was unjustified (ie I say a bad word and you can physically punish me? THAT makes no sense!). What do we do to people who break the law? We put them in adult time out.\nSince having babies in my life, I see how easy it is to resort to slapping/smacking/spanking. Hell, I've flicked my nephew's cheek when he was biting his older brother. I felt seriously guilty afterwards.\nI have two women in my life that I'm close to. Both are mothers.\nMomma 1 is the mother to two. She has physically punished her children since they could reach (grab hair = smack on the hand, etc). Once, when her oldest pushed me as he was running out of the room (I was an obstacle in the doorway), he wouldn't apologize, wouldn't stay in his room, etc. All because I was in his way as he was running out (devastated he couldn't have sweets prior to dinner), he ended up getting SMACKED at least 8 times. (once for not going to his room, once for coming out too early, once for telling his mother no, a couple of times for not apologizing to me when prompted) it was ridiculous, and completely unnecessary.\nMomma 2 is the mother of one. Anytime her child has done something punishable (grabbed hair, thrown toys, slapped, scratched, screamed), M2 is there, picks her up, talks to her, explains what she did was wrong and WHY it was wrong. It takes longer for this type of guidance to take effect, sure...but isn't instant gratification a total issue in our society, anyways? It took a couple of months for her to break the habit of hitting, but M2's child has NOT hit anyone since the change took place.\nM1's children constantly hit each other and her, still! \n\nI've decided what I'm going to do when I raise my children. Spanking WILL be a last resort (not proverbial, but REAL last resort). Again, sure what has been deemed \"nonviolent parenting\" takes longer to instill a message into the child, it has proven time and time again that it's the choice for me.\n\nNo judgment on anyone who has differing views, please don't attack mine.", "controversiality": 0, "created_utc": 1358549409, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zg09d", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1431007112, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "This is the best thought out response I've read. I completely agree with you. Thank you for this.", "controversiality": 0, "created_utc": 1358630703, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zx34q", "link_id": "t3_1463m7", "parent_id": "t1_c7zg09d", "retrieved_on": 1431015336, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354490141, "distinguished": null, "downs": 0, "edited": 1354490679, "gilded": 0, "id": "c7a7s00", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560310, "score": 36, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gddess", "author_flair_css_class": "blue", "author_flair_text": "Two Year Old Son", "body": "I was spanked twice as a child and I don't think those two times did anything to affect me. \n\nI, personally, am not a fan of spanking, it would only be used as a last resort maybe. I won't spank because I'm kind of a pacifist but also if I would not physical altercations happen between my husband and I, I think it would be hypocritical to hit my child. \n\nSpanking is like cio because it works for some and others not and as parents, you gotta do what works for your family. ", "controversiality": 0, "created_utc": 1354490280, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a7t04", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560323, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Thank you. I'm going through this myself. My sister just informed me how she's spamming her son and it makes me so heart broken. He's the sweetest little boy. ", "controversiality": 0, "created_utc": 1354490344, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a7thx", "link_id": "t3_1463m7", "parent_id": "t1_c7a7s00", "retrieved_on": 1430560329, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nikkiyoz", "author_flair_css_class": null, "author_flair_text": null, "body": "My mom would smack us on the butt if we were mouthy or misbehaving, but it was never an official, over-the-knee, pants down spanking.  As a mom, I never have and never will do it.  I think it's really important to lead by example for your children.  You wouldn't, I assume, want your children to hit others, so why would you hit them?  Kids don't understand why you are hurting them.  If you can't keep your calm as a parent, why would you expect a child to be calm and rational in return?  On a side note, I always remembered my mom losing her temper and yelling or smacking our butts in a negative light.  I don't remember ever learning any lessons that way, except maybe what not to do as a parent.", "controversiality": 0, "created_utc": 1354491013, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a7yii", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560396, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kryssanth", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked as a child. Only rarely, because usually the threat was enough to bring my brother and I to a halt. But Mum had a wooden tool that she had used for pottery, and it was \"The Stick\". When we were kids, it looked like a friggin 2x4.\n\nI don't think the spanking badly affected me. I know that I would hit other people when I was a teenager, but my boyfriend (now husband) made it very clear that he wouldn't tolerate it at all, and so I've stopped completely now.\n\nThat said, my Mum has always told me that she had to spank me because I was a particularly difficult child. She would tell me all these horrible things I would do, and so I've always grown up with this notion that I was particularly difficult. Now that I have a child of my now, not only do I see her doing the exact same things, but I see lots of other kids her age doing those things as well, and worse. I'm coming to the conclusion that it wasn't that I was particularly difficult, it was that my Mum couldn't cope with me.\n\nIt never made sense to me to hit a child. It stops them in the moment, sure, but in the longer term, the child just learns that hitting is an acceptable method of dealing with anger and frustration. In particular, at the moment, my daughter is two and tries to hit me out of frustration. My response to that cannot be to hit her back. \n\nSo we aren't a spanking family now, and probably won't ever be. We have a \"naughty chair\" in the corner, and just the mention of it is usually enough to stop her in her tracks. She even goes and sits in it herself when she knows she's been naughty. So I find it to be effective, so far. It's harder when we're out, because there can't be an immediate response to her bad behavior, but I just either pick her up and walk off, or walk away from her and wait for her to catch up. \n\nBut anyway, that's my experience. I hated being spanked at the time but my Mum had me convinced it was necessary because I was difficult. I'm coming to find that that may not have been the case. ", "controversiality": 0, "created_utc": 1354494141, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a8lnw", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560697, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nessasayswhat", "author_flair_css_class": null, "author_flair_text": null, "body": "As far as I can remember I was never spanked, I do know for sure that I was a very well behaved child. My parents weren't really great parents either, but if I ever did get In Trouble my Nonnie would give me some crazy chore no one in their right mind would do so that kept me in line. I do not plan on laying a hand on my daughter ever. I don't think hitting gets the proper message across. ", "controversiality": 0, "created_utc": 1354495176, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a8t6m", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560797, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ValarDohaeris", "author_flair_css_class": "brown", "author_flair_text": "Dashiell's mom, 8/14/2012", "body": "I was hit whenever I hit my brother, because I was bigger/stronger than him (\"How do you like it?\"). And it only ever made me feel MORE angry and resentful because he was an absolute terrorist when we were kids, and they would never interfere with his nonstop harassment of me until AFTER I was fed up and hit him because it was the ONLY way to make him stop and get away from me. \n\nI really don't plan on spanking my son. I don't want to be a hypocrite when I explain that hitting people is wrong. ", "controversiality": 0, "created_utc": 1354495462, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a8v3l", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560821, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "I posted in the askreddit as well, but here it is with some changes to fit this thread better. \"I grew up getting hit as a kid for being bad, with whatever was at hand (belt, paint stick, etc). I had tons of issues with hitting people, all the way through high school. I'm 27 now and my Mom still says I \"was always a hitter\", and I have video proof of me all smiley at my 5th birthday and my sister walks by and WAM! I just punch her for no reason. My sister always got most of the hits, and I wonder where I got the inspiration to always be mean to her... Needless to say I'm very thankful to a dear friend who helped me work through my issues last year or two in high school! When I had my daughter 3.5 years ago, all the over tired and strained nerves brought back all the old issues and it took a lot of effort to handle the aggression. Luckily I had sense enough to see it's a baby and if things got overwhelming it was better to leave her in her crib crying and walk away for 5 minutes. Now that she's older and has a 1.5 year old brother I find myself swatting her butt now (not spanking) quite a bit because she's causing harm to her brother. Only a few times have I actually given her a spanking because she's pushed him over/done something that caused him to cut his lip open or left serious bite marks. I've recognized that I need to quit with the swatting and have been working on being a lot calmer again and I've really restricted it to only really important times, but just putting her in her room is a lot more effective punishment than a swat!\"\n\nOverall I don't think spanking is effective, and it only leads to a bad example of how to deal with emotions. (As if a young child doesn't already have problems with dealing with emotions!) Every time I've hit her I felt terrible, although it felt so justified at the moment when she could have really caused serious pain (and caused blood) to her brother. I think the biggest thing for me to stop is knowing how even though it felt like I had dealt with everything years ago, it still is something I have to constantly deal with today whenever they get too much.  ", "controversiality": 0, "created_utc": 1354495573, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a8vxp", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560833, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I am probably going to be one of the few people here who say that I will (my child is 9 weeks old now, so obviously they are future plans)\n\nWill I spank for everything? Absolutely not. Not even close. Most things will be other punishments, toys taken away, a serious talking to, time outs, \"groundings\" etc etc... however, there are circumstances where you need to get the message through ASAP. and hard. Your child runs into the street. The first 2 times, you sit them down, explain why they shouldnt do it, its dangerous, etc etc. The third time? NO. This cannot happen. If I smack your ass, you will not be running into the street again. I think spanking should only be used in circumstances such as this... and I see absolutely no problem with it.", "controversiality": 0, "created_utc": 1354496344, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a91fa", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560911, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "well i guess i'm gonna be in the minority here. i was spanked as a child, and i would spank my child under certain circumstances. i don't see myself using it as a punishment, like \"you broke a dish, now you get a spanking,\" (like my mom did) but more like if they're tearing around a store screaming and running in front of people/trying to run out in the parking lot, they get one swat on the butt to get their attention/show i mean business and then i explain what i expect of them and what will happen if they continue to act up. yes, i feared my mom, but she didn't just spank as punishment, she also generally hit us whenever she was frustrated - on the arm or leg or even upside the head. and i did obey out of that fear; i still have a hard time saying \"no\" to her. i think my mom either missed or didn't care about a lot of the cues that would've signaled to her that i feared her and if i saw my own child reacting to me in that way, i would change the way i handled discipline.", "controversiality": 0, "created_utc": 1354497051, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a96ak", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430560989, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked as a child by *everyone*: my mom, dad, aunts, uncles, a teacher, and a principle, and you know what's really fucked up?  I wasn't a bad kid.  I was completely cowed by the adults who ruled over me (it was a small southern town full of authoritarians).\n\nI don't spank.  Not because I'm not tempted at times, but because there's plenty of studies proving that it has a negative effect.  Why would I do something that could make my kids more violent and angry?  That's insane, but I'm also more of an authoritative versus authoritarian parent.  I yell, occassionally, but usually I coax my kids into good behavior with praise, consequences, and asking them nicely instead of bullying them.  It's harder, but it moves us toward the ultimate goal of happy, well-adjusted, responsible adults.  ", "controversiality": 0, "created_utc": 1354497320, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a982d", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561005, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ClaraKelley", "author_flair_css_class": null, "author_flair_text": null, "body": "I do not spank, I was spanked as a kid.  I saw how it accomplished nothing in my brother, and it was a great source of fear for me, since my dad was already scary when he was mad, let alone when he had a stick.\n\nI never touch my child when I am angry except to pick her up and put her someplace else if necessary.  We use words and consequences.", "controversiality": 0, "created_utc": 1354497339, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a986k", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561006, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "The first time I yelled at my kids was when they toddled into the street.  They were maybe 18 months, i knew they knew better, so I made the decision to really raise my voice, and it made a BIG impression.  Anyway,  doubt you will feel the need to hit your 1 year old when the time comes.   I felt awful just for screaming and I think it'd take a psychopath to hit a baby and this lesson *needs* to be taught when they're really little. ", "controversiality": 0, "created_utc": 1354497815, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9bcx", "link_id": "t3_1463m7", "parent_id": "t1_c7a91fa", "retrieved_on": 1430561042, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked a few times when I was little. While I clearly remember that actual spanking part, I dont remember what I did wrong or what I was suppose to learn from it. Over all it didnt seem very effective.", "controversiality": 0, "created_utc": 1354498053, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9cvz", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561057, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PChuu22", "author_flair_css_class": "lightcoral", "author_flair_text": "3.5-year-old boy, 10-month-old girl", "body": "My parents spanked me...both with a flat hand and with a belt. I hated them every time it happened and forgave them as soon as they came to my room to release me from my post-spank time out. What choice did I have? They were my parents, my life support. I had to forgive them,v even if I still resented the violence.\n\nAs an adult, I've noticed my first reaction is violence. Someone makes me mad? I want to hit them.  Looking back at ex-boyfriends, or even now with my husband, I tend to do a lot of playful slaps on the arm in joking situations.\n\nI'm fighting against the knee-jerk reaction to hit my now-three-year-old son....for example, he hits me with a toy (accidentally) and I immediately strike back and slap his arm, leg, butt...whatever I can reach. Or he's been extra-spirited and opinionated all day and I'm at the end of my patience and he snaps at me one more time so I \"pop\" his bottom. I hate myself every time it happens, and I know he hates the violence he's subjected to and that it injures out relationship.\n\nI fight not to be that person. Sometimes, I lose that fight....but its one I fight every day, regardless. I want to be a violence-free household.", "controversiality": 0, "created_utc": 1354498166, "distinguished": null, "downs": 0, "edited": 1354498522, "gilded": 0, "id": "c7a9dmj", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561064, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe you should just take it off the menu of consequences.  I, like you, feel like my anger issues started with being spanked and bullied by adults.   If there's even the slightest chance, (and the research proves there's actually a very good chance), that it will turn your sweet kid into an angry one, you probably shouldn't do it.  ", "controversiality": 0, "created_utc": 1354498361, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9eyi", "link_id": "t3_1463m7", "parent_id": "t1_c7a8vxp", "retrieved_on": 1430561087, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354498669, "distinguished": null, "downs": 0, "edited": 1354503772, "gilded": 0, "id": "c7a9h41", "link_id": "t3_1463m7", "parent_id": "t1_c7a91fa", "retrieved_on": 1430561115, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I totally understand where your coming from. It's really hard when you've been taught all your life to smack or swat people when you feel they were bad and then even when you think you broke that cycle it comes back when you're tired and over whelmed.", "controversiality": 0, "created_utc": 1354498802, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9i3j", "link_id": "t3_1463m7", "parent_id": "t1_c7a8vxp", "retrieved_on": 1430561125, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "To all of you spankers.  No matter how loving, or gentle, or swatting it is.. Remember it is child abuse.  Teachers are not allowed to touch children's heads never mind spank them! (Edit- i forget there are states where it is ok for another adult to abuse your child.. im spoiled living in the NE). Think of pre schools with 3 and 4 year olds who misbehave, they NEVER spank them and yet survive each day.  Spanking is for the uneducated parent who's frustration gets in the way of how to handle a situation.  I was spanked with a wooden spoon and slapped across the face by my mothers hand when I was 12.  Taught nothing but fear.  No respect, no authority, no love, but fear.  \n\nTo those who say you we're a difficult child and they had no other option, shame on them for being a bad parent and not finding another solution.  Think of again, schools with 25 children and one teacher maintaining control.  Kids with ADHD, kids who hit, kids with mental issues.. They do not spank to keep order!   If you think there are no other options, well you have the Internet!  Google proper discipline techniques, read a goddamned parenting book.  There's tons out there!  Don't do it for me, do it for your child!\n\nI am appalled and sickened at all of you who PLAN to physically harm your child as a punishment, and don't say \"a swat on the butt is not harming them\".  While there might not be bruises It is still you physically hitting your child for a negative reason no matter how gentle YOU think it is.   The mental developmental wounds can go far deeper than physical ones.  \n\nTo those of you spanked who turned out fine, great! And i think im ok too, but let me tell you about the night my mother cried hours on end when she realized I wouldn't sit in the front of the car anymore because she was in slapping distance of my face.   She felt so guilty because I now feared her touch instead of wanting it.  Is that how you want to earn your child's respect?  Down vote if you like.  As others have mentioned, studies back my point and when I'm not on my phone I will gladly provide links.  \n\n", "controversiality": 0, "created_utc": 1354498846, "distinguished": null, "downs": 0, "edited": 1354590122, "gilded": 0, "id": "c7a9ifm", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561128, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Why do you feel it's effective? I'm not try to attack you I generally want to know people who are pro it's reasoning because I don't understand.\n\nI was spanked and hit a lot as a kid and I never understood how or why my parents would hit me.\n\nFor me I feel like there's no real reason for it because I feel like there's an underlying problem when \"those situation where there's a big problem come up.  Since I was a difficult child and I know I had serious reasons for acting that way ie I was being abused, I was scared, felt unloved, etc. so it's a big concern of mine to prevent my child from ever feeling that way but its not like most children can come out and say help me I'm lonely.", "controversiality": 0, "created_utc": 1354499112, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9kgr", "link_id": "t3_1463m7", "parent_id": "t1_c7a91fa", "retrieved_on": 1430561156, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lilaooo", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked and hit, hard. I still have problems feeling comfortable around my dad. I know the day will come that he'll be a dick and reprimand me for not spanking my child (I'm technically still pre-mommit... sorry haha). That will be an awkward and super emotional conversation for me but there is a growing body of empirical evidence that suggests that violence begats violence and children who are spanked are more likely to find themselves in emotionally, physically or sexually abusive relationships. It is possible that what my dad did was more abusive than \"punishment\" but I don't know where that line is nor do I plan on getting anywhere near it so no I will not be spanking my child.", "controversiality": 0, "created_utc": 1354499176, "distinguished": null, "downs": 0, "edited": 1354541185, "gilded": 0, "id": "c7a9kxw", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561163, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I like that. What I've started Doing with my daughter and people in general is when I'm angry or frustrated I take a few minutes to collect myself.", "controversiality": 0, "created_utc": 1354499241, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9lhv", "link_id": "t3_1463m7", "parent_id": "t1_c7a986k", "retrieved_on": 1430561168, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "I was spanked and yes spanking can be used in certain situations, like the kid isn't listening in a dangerous situation (horsing around in the kitchen when the stove is on, not staying in the back yard or away from the road when playing outside, not waiting for me or running ahead when crossing the road).\n\nA quick smack on the bum is much better than third degree burns or death by a car who didn't see them.", "controversiality": 0, "created_utc": 1354499652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7a9onx", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561208, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kinopela", "author_flair_css_class": "purple", "author_flair_text": "Quinn, Kayla, Kelsey", "body": "i was spanked a handful of times by my mom, grandma, and dad, and it was a successful deterrent.  BUT.  it taught me at a young age that there are severe consequences for some actions and the best thing to always do is please everybody all the time.  this has led to a less-than-happy life for me.  i'm not blaming being spanked for all of my problems as that's ridiculous, but i don't believe spanking teaches children anything more 'if i do x, it can and will be preceded by violence.'  and spanking is violence. i started tapping the hands of my one year old when she would do something really bad, and very soon she began to to hit me back when i would do it.  so i believe it sets a bad example and is ultimately a useless punishment.  a firm no while making them look into your eyes goes a much longer way as a behavioral deterrent.", "controversiality": 0, "created_utc": 1354501326, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aa1m5", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561378, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with this. I'm always shocked at how people try to justify hurting their children. There is no excuse.", "controversiality": 0, "created_utc": 1354501372, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aa1xx", "link_id": "t3_1463m7", "parent_id": "t1_c7a9ifm", "retrieved_on": 1430561391, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked as a child and so was my husband. I was spanked with a wooden spoon and it just made me resentful and it didn't teach me lessons, it taught me not to get caught.\n we've decided not to spank. I have lost my temper on a couple of occasions when I was pregnant and spanked my child. I felt absolutely terrible, it certainly didn't teach him anything except to be angry right back at me and it strengthened my resolve that I would not let it happen again. It is very easy to lose your temper, but honestly most people I know who spank do it out of anger and frustration. I don't know anyone who calmly spanks their child. I think most of the moms I know who spank (and me too, when I was pregnant and overwhelmed!) would benefit from learning other tools to discipline their children and cope with the frustration that naturally comes with being a parent.", "controversiality": 0, "created_utc": 1354502235, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aa8dy", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561475, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "auroranoel", "author_flair_css_class": null, "author_flair_text": null, "body": "I knew this whole thread would be anti-spanking. Screw this. ", "controversiality": 0, "created_utc": 1354502260, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aa8km", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561472, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "Why are you pro? Reasoning? \n\nYou feel better after hitting your child? More in control? That they learned a valuable lesson? Proud that your violence keeps them in line? It's a fast effective solution so why bother with situation removal or other more timely less violent approaches? They're not really getting hurt with bruises do there's no long term damage? Screw this alright.  The one person on the planet that is supposed to love and protect you by any means possible is the only person that hits you, for your own good. Your parent.  Right. ", "controversiality": 0, "created_utc": 1354502832, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aacoq", "link_id": "t3_1463m7", "parent_id": "t1_c7aa8km", "retrieved_on": 1430561526, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "How is a smack better after the situation is over!!?! You didn't hold my hand so I'm going to smack your bottom??? Better I hit you than the car? Why not work harder on holding onto your child.. When my daughter gets away from me that is MY fault and if she ever got injured it is ultimately my fault.. Why would I hit her for acting like a kid? I just hold into her tighter or raise my voice and practice rules with her until she understands safety.. \n\nIn the kitchen horsing around? Get the kids out if the kitchen!!!! Removal from the situation is the safety concern, not hitting them because they didn't realize they were in danger because they don't listen to you.  Spanking will teach them to avoid you, not come closer to you. No matter how sparingly you do it for their \"safety\". ", "controversiality": 0, "created_utc": 1354503250, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aafmw", "link_id": "t3_1463m7", "parent_id": "t1_c7a9onx", "retrieved_on": 1430561562, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "OhYeahThat", "author_flair_css_class": null, "author_flair_text": null, "body": "I wasn't totally against spanking when I had my kids, I figured I wouldn't do it often, only when necessary, etc.   I spanked my kids twice and both times I felt it was completely ineffective as discipline.\n\nI found that being 100% consistent, following through when I said something worked much better.  \n\nOne bit of advice I'd give to parents is follow through! For example:  your kid climbs on the table, you tell them to get down, they don't get down and challenge you to do something about it.  You start to walk over there to take them off the table and then they start to climb down.  The temptation may be to stop walking over to the table because now they did what you said, but my advice is don't stop- Follow through.  You walk over to that table and even if they are on the floor, you take them over and set them on the couch or whatever.  \"The table is not for climbing.\" Always follow through, none of that counting crap, that's for the lazy.  Say what you mean once, then do what you would have done as if you had said it a million times.  Kids learn quickly that what you say is what you mean and they will not test.----  ooops, sorry got off on a tangent there...", "controversiality": 0, "created_utc": 1354503465, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aah6k", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561591, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thomasbeagle", "author_flair_css_class": "green", "author_flair_text": "OMG I have a daughter!", "body": "Spanking your child for the purpose of punishment is illegal in New Zealand.\n\nSo I hope none of you pro-spanking people live here...", "controversiality": 0, "created_utc": 1354504640, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aapq2", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561695, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HappyGiraffe", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked once as a child, and apparently my mom cried harder than I did. So, yeah, I was not spanked as a child. \n\nI don't understand spanking. It really baffles me. It doesn't make sense to me, I suppose. I don't ever want my child to think it's okay to put his hands on anyone, ever, in order to hit or hurt them. It's never okay to hit someone, especially someone who is a lot smaller or weaker than you. \n\nMaybe my perspective is different because I was a teacher, and I had to control my classroom without hitting (obviously). And there were plenty of times when I had to \"put my foot down\" or manage unruly students (or several). I learned how to do it then, and I will learn how to do it as a parent. ", "controversiality": 0, "created_utc": 1354505306, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aaum3", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561756, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "People use the \"running into the street\" analogy a lot when it comes to spanking. Very interesting.", "controversiality": 0, "created_utc": 1354505404, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aavd4", "link_id": "t3_1463m7", "parent_id": "t1_c7a91fa", "retrieved_on": 1430561766, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like you weren't just spanked, you were abused and neglected. That is different than spanking.", "controversiality": 0, "created_utc": 1354505514, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aaw5k", "link_id": "t3_1463m7", "parent_id": "t1_c7a9kgr", "retrieved_on": 1430561776, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "As a child, I was only spanked twice in my entire life. I remember both times. I'm not scarred for life. I wasn't \"afraid\" of the people who raised me. Didn't ruin me. When my little one grows up I'll probably spank him if something severe happens. Shrug. \n\nIts all circumstantial. People give hypothetical situations. \"I will spank if...\" Just say yes. Yes you will. The end.\n\nPeople get all self righteous, \"Oh well I would never spank a child, I dont want to be a hypocrite.\" Well hopefully you wont raise your child to be such a pompous asshole either.", "controversiality": 0, "created_utc": 1354505817, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aaye2", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561807, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kryssanth", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not anti-spanking. It's just that my experience has taught me that I don't want to do it in my family. If you want to spank your child, find it effective and are capable of doing it in a way that doesn't creep into abuse, I'm not going to tell you you can't do that. ", "controversiality": 0, "created_utc": 1354506453, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ab320", "link_id": "t3_1463m7", "parent_id": "t1_c7aa8km", "retrieved_on": 1430561868, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh good grief it isn't even like that. I knew when I was spanked as a child my parents weren't doing it because they hated me, because it made them feel better, because it made them in control. Not even close! They were doing it to leave an impression that would STICK. I learned not to do shit I wasn't supposed to because I didn't want to get spanked. Sorry but it has nothing to do with your whacko reasoning. I knew that my parents spanking me was teaching me a lesson *because* they love me and were protecting me not the opposite. And it DID NOT hurt. This isn't child abuse we're talking about, this is a smack on the butt. This isn't beatings that last more than a minute. It's one quick whap.  I'm glad my parents did that. I didn't grow up to be a fuck-up.", "controversiality": 0, "created_utc": 1354506649, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ab4ik", "link_id": "t3_1463m7", "parent_id": "t1_c7aacoq", "retrieved_on": 1430561887, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "unplural", "author_flair_css_class": null, "author_flair_text": null, "body": "no one will ever lay a hand on my child if i have anything to do about it. i was spanked AND hit as a child. i was hit in the face constantly for \"talking back\" and it fucked me up, quite frankly. my parents will even tell you that i used to be the sweetest, most gentle little girl and then \"they don't know what happened.\" i'll tell you what happened, i hit puberty and was an intelligent person and started to question some of the fucked up, controlling and mentally abusive shit they used to say and do to me and i got hit for it. i started to not respect a damn thing they said, self-harm, and have anger and depression issues that i still deal with to this day.\n\nthere is NOTHING that a child could ever do that would warrant any kind of physical violence from the people that they are supposed to look up to and learn from. violence has never beget anything other than more violence. if you are resorting to violence to get your point across then you need to step back and reevaluate how you communicate with your children. ", "controversiality": 0, "created_utc": 1354506846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ab5zg", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430561905, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "I wasn't and don't plan on doing so with my son. I've noticed even at 22 months he is such a copy cat, making me realize he learns the most by watching me. The last think I want to model for him is that violence is ok. ", "controversiality": 0, "created_utc": 1354507346, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ab9k3", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562013, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354507737, "distinguished": null, "downs": 0, "edited": 1354509215, "gilded": 0, "id": "c7abc9w", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562048, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Im well aware of what I was. But the spanking still didnt work. \n\nIve heard of many people who were abused as children and it started with spanking.", "controversiality": 0, "created_utc": 1354507788, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abco5", "link_id": "t3_1463m7", "parent_id": "t1_c7aaw5k", "retrieved_on": 1430562054, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm going to relay to you the story my dad always shares from my childhood. I was playin with a friend and we both went to dart into the road. The little boy's mom spanked him and told him not not run into the road again. My dad put me in the car and went looking for road kill. He showed it to me and explained the danger of running into the road. The next time me and my pal were playing he starts to run toward the road but first looks to see if his mom is watching. Whereas I learned about the natural consequence and wouldn't go near that road. \n\nNow don't ask me why the hell they let us repeatedly play near traffic. Stupid hippies ;) But besides the lesson my dad makes in his story is also one where if a child is too young to rationally learn the natural consequence of an action (spanking is an artificial consequence), then they're too young to be unsupervised too. ", "controversiality": 0, "created_utc": 1354507870, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abd89", "link_id": "t3_1463m7", "parent_id": "t1_c7a91fa", "retrieved_on": 1430562064, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "yes Yes yes.\n\nYou are so right. I dont understand this running in the street business very well, do people not know how to hold onto their child? You hold their wrist as well, then they cant get away.", "controversiality": 0, "created_utc": 1354507971, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abdxe", "link_id": "t3_1463m7", "parent_id": "t1_c7aafmw", "retrieved_on": 1430562073, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "not everyone defines spanking the way you do. I mean lucky for you thats what your parents considered a spanking.\n\nMany parents use belts or wooden objects, so yes yes spanking can be child abuse.", "controversiality": 0, "created_utc": 1354508113, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abf0i", "link_id": "t3_1463m7", "parent_id": "t1_c7ab4ik", "retrieved_on": 1430562082, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "its only anti spanking because people who are \"pro\" spanking dont want to voice their opinion", "controversiality": 0, "created_utc": 1354508146, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abf9f", "link_id": "t3_1463m7", "parent_id": "t1_c7aa8km", "retrieved_on": 1430562087, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antigravity_x", "author_flair_css_class": "lightcoral", "author_flair_text": "She says she's gonna be the next Ringo Starr", "body": "99.9% of the time, we are a no spanking household.  There are times, and I always regret them, that she does receive a spanking. The last time, she was in her bedroom and I had turned something of hers off before we left the house. We came home and she thought it would still be on. When she asked why it wasn't and I told her she screamed **STUPID MOMMY** and I just ran in there and swatted her butt.\n\nI never hit her out of anger. Sometimes I find myself feeling those urges and I have to excuse myself. Basically mommy time-out, to calm myself down and realize she's only fucking 3 years old and there is no reason in the world for me to hurt her. But when I *do* hit her, I make sure it is for something that she needs to realize right off the bat that is never, ever, ever will happen again.\n\nAnd honestly, anytime I swat her, I feel terrible inside for weeks. Absolutely hate doing it.\n\n/Edit: Sorry, I forgot to answer the first question. Yes, I was spanked and hit frequently as a child. My mother was an exhausted single mother with two children and more often than not, the only way she knew how to get us to listen to her was fear and pain. I don't hold it against her, I just do my best to not be her in any way.", "controversiality": 0, "created_utc": 1354508181, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abfj4", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562089, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "i like that.\n\nbut when is spanking your child legal in new zealand?", "controversiality": 0, "created_utc": 1354508191, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abfm0", "link_id": "t3_1463m7", "parent_id": "t1_c7aapq2", "retrieved_on": 1430562091, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so impressed with your insight and the hard work you're doing to stop hitting your daughter. What lucky kids to have a mom willing to stop the cycle of hitting. I can imagine how hard it must be when it's always been a natural mpulse during stress. And believe me, I know how kids can stress you. Ive never been hit in my life and I still sometimes have to stop myself from grabbing my son roughly. Good luck!", "controversiality": 0, "created_utc": 1354508511, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abhwx", "link_id": "t3_1463m7", "parent_id": "t1_c7a8vxp", "retrieved_on": 1430562122, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "katyshel", "author_flair_css_class": "purple", "author_flair_text": "3 girls", "body": "My husband and I both we're spanked as a kid and have agreed that we might spank our girls if we feel it would be effective. Mainly reserving it for a moment where they've put themself in danger or if they need to straighten up immediately. I hope to never have to spank. Our twins are 21 months and we have a 4 month old. Right now it's all about redirecting their behavior since they are so curious and don't understand limits and rules. The girls often fight which can lead to one biting the other. I've tried biting the biter but I can't bring myself to bite very hard and she usually thinks its funny. Same with timeouts, they are sad for a second then they sit there and have a grand old time like only a toddler can do. ", "controversiality": 0, "created_utc": 1354508556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abi7r", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562125, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "Bravo for your insight and struggle to change!", "controversiality": 0, "created_utc": 1354508678, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abj43", "link_id": "t3_1463m7", "parent_id": "t1_c7a9dmj", "retrieved_on": 1430562137, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "poopoomoo", "author_flair_css_class": null, "author_flair_text": null, "body": "I remember being spanked on three occasions in my childhood. No more, as it wasn't really effective for me, nor was it my parents' style. My daughter is still a baby, but my (and my fiance's) plan is to only use spanking when the child is doing something naughty that is DANGEROUS. Such as playing with fire, or dashing out toward the street, those types of things. Otherwise, I'm big on time-outs for younger children, and otherwise relating the punishment to the crime.", "controversiality": 0, "created_utc": 1354508803, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abk0s", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562148, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "august_first", "author_flair_css_class": "blue", "author_flair_text": "boy est. 26 jan 2011", "body": "I was spanked. The only thing it taught me to do was avoid getting caught. I know most pro-spankers say, \"Well, your grandparents/mom did it wrong; spanking should come with an explanation and should never be done out of anger.\" Right. \"Son, I'm about to spank you. Here is why\" never really sounded like a plausible - let alone logical or effective - scenario. Why not skip the hitting and go straight to the communication?  It's a wretched form of parenting and I will never hit my son. ", "controversiality": 0, "created_utc": 1354508876, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abkk5", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562155, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "poopoomoo", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you! Keep it up. You're doing a great thing.", "controversiality": 0, "created_utc": 1354508884, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abkmc", "link_id": "t3_1463m7", "parent_id": "t1_c7a7s00", "retrieved_on": 1430562157, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kika988", "author_flair_css_class": "blue", "author_flair_text": "Mom to 2 year old Nathan", "body": "I was spanked as a child, in two different ways. \n\nWhen my mother spanked me, it was done in anger. I learned to behave for her to avoid the consequences, but I never respected her for it. \n\nThe more normal circumstance was for Mama to tell me I was going to get a spanking when Daddy got home. I think she did this to AVOID spanking me in anger, which in retrospect was probably much harder than I gave her credit for at the time. Honestly, WAITING for the spanking was the worst part -- that and the look on my dad's face before he did it. He always talked to me about what I had done wrong, and made sure I knew why I was being punished, and I always knew without a doubt that he was more disappointed than angry, and that he HATED spanking me. Needless to say, I respected my Dad. \n\nAs for my son, he's almost a year old, so he's getting to the age where we'll have to decide this sort of thing. I'm not anti-spanking at all, but I am NOT going to do like my mom did -- I will never spank him in anger. A quick pop to his hand if he's reaching for something he shouldn't, sure, but never an honest-to-god spanking. Those will be a last resort, after time-outs and talking-to's and taking away the toys hasn't worked -- and they will be something he knows is coming, so he has plenty of time to reflect on what he did, and I and/or my husband have plenty of time to calm down so we aren't doing it in anger. I have a much worse temper than my husband, so I have a feeling he'll end up doing most of the spankings, just like my dad did... and will hate it just as much, which Nathan will surely realize, just like I did.", "controversiality": 0, "created_utc": 1354509322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abnvh", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562199, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "Can I genuinely ask you a question, since I grew up in a very different environment? When or how did you start making decisions based on rationality versus the deterrent of punishment? I ask because my dad never punished me but just explained his reasoning. I either then understood his reasoning or would usually defer to my respect for his opinion (or sometimes still defied his request). \n\nSo I'm just curious how the lessons reinforced by spanking stick once you were no longer spanked? Just force of habit? Thanks for any response :)", "controversiality": 0, "created_utc": 1354509330, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abny3", "link_id": "t3_1463m7", "parent_id": "t1_c7ab4ik", "retrieved_on": 1430562200, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Menelly", "author_flair_css_class": "blue", "author_flair_text": "16 yo son, 3 yo daughter, newborn son", "body": "It's literally the only time I did spank my son.  (Who's now 14.)  \n\nHe darted into the street as a car was coming.  Grabbed him by the wrist, yanked him back, smacked his butt, got down on his level, and said \"don't you EVER run into the street again!  You hold Mommy's hand!  Not safe!\"\n\nAnd, ya know?  He remembered.  It was 2 years or so before he'd stop going up to a curb, sticking one foot over the line, bring his foot back, and go \"you no wun in stweet!  Hod hand!  No safe!\"  \n\nSo, yeah.  He got spanked once.  It was for running in the street.  And the message was through loud and clear.\n\nBut in general, he's the type of kid that grounds himself for being bad and you can say \"I'm very disappointed in you.  That was a really bad decision\" and he's devastated.  Spanking has never been necessary.  (The running in the street HONESTLY likely wasn't necessary.  I was freaked out and went for \"get this in his head pronto\".)", "controversiality": 0, "created_utc": 1354509930, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abs9f", "link_id": "t3_1463m7", "parent_id": "t1_c7aavd4", "retrieved_on": 1430562257, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354510404, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abvgn", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562298, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RatSandwiches", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked I think once or twice as a kid, but I don't even remember it. I do not want to spank ny daughter, who is a baby now, because I don't feel like it's a very productive means of discipline. But we will see when she gets older I guess. ", "controversiality": 0, "created_utc": 1354510595, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7abwra", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562315, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "offbeatchicken", "author_flair_css_class": null, "author_flair_text": null, "body": "I remember only one instance where I was punished by spanking as a child. Every other punishment involved me doing a number of push-ups (my Dad was a Drill Sergeant in the Army) or taking a time out.\n\nMy husband, on the other hand, was physically punished constantly by his single mother. I have heard stories where he was literally thrown across the room, and she openly admits that she constantly drank while he was younger. \n\nOur upbringings were very different, he being from the Southern U.S. and I from the North. We originally disagreed about physical punishment when I was pregnant with our son. He was okay with some amount of spanking if needed, and I was completely against it. After much debate, and research, we finally agreed that spanking was not for us. \n\nI personally do not feel that physical discipline is an effective means of punishment for children. We will talk to them about their choices, offer better options, and explain consequences, in hopes that they will understand that every decision they make is important. If that doesn't work Ill lock em in their rooms for a week. ;P\n\n\n", "controversiality": 0, "created_utc": 1354510792, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aby6v", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562335, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "justhewayouare", "author_flair_css_class": null, "author_flair_text": null, "body": "I could never understand those who were spanked saying they found hitting acceptable as a kid. I was spanked maybe 3-4 times tops as a kid my parents went mostly for the talk and other punishments. However, I've never seen spanking as a reason to hit or as anything other than a punishment for especially bad behaviour. As far as my husband and I go we have no plans to spank but that's because we know children understand reason to an extent and we want them to learn to be better thinkers etc. We were both spanked and nothing bad happened to either one of us we are completely average non-violent people. Our parents spanked but rarely and never enough to do anything more than make a bottom pink. Both of my parents came from abusive homes they could never treat us the way they were treated and they never have. A lot of you saying you would not spank come from abusive homes so i wonder if you can give a fair opinion.  I can understand where you guys are coming from though for the most part. My parents rarely spanked and it was only for things that put us in danger that we knew were wrong and they'd repeatedly told us not to do. However, OP asked and that's my answer to each their own as they see fit. Unless I see a patent abusing their child I don't judge those who spank its not my job to tell them how to parent.", "controversiality": 0, "created_utc": 1354511161, "distinguished": null, "downs": 0, "edited": 1354511485, "gilded": 0, "id": "c7ac0nv", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430562367, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354512056, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ac6t3", "link_id": "t3_1463m7", "parent_id": "t1_c7abf0i", "retrieved_on": 1430562448, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DingoesAteMyBaby", "author_flair_css_class": null, "author_flair_text": null, "body": "I hope I have the strength you have to stand my ground when I reach those times. Kudos to you and your consistency!", "controversiality": 0, "created_utc": 1354513239, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acess", "link_id": "t3_1463m7", "parent_id": "t1_c7a9h41", "retrieved_on": 1430562553, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354513262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aceyi", "link_id": "t3_1463m7", "parent_id": "t1_c7a9ifm", "retrieved_on": 1430562558, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "I'm actually very close to my mom thank you, she has spanked me but honestly it was so long ago I don't even remember it. Let me tell you about the last incident I actually remember that ended in a spank.\n\nMy youngest sister came into the kitchen, you have to go through the kitchen to get from the living room to the back yard. My mom says, \"Stay out of the way, the stove is hot.\"\n\nMy sister, \"Okay.\"\n\nMy mom turns to pour water off the pasta and hears a chair move, looks over to see my sister about to touch the stove. Drops the pot in the sink swoops over rips her hand away as it was inches from the burner and strikes her bum once. \"No, what did I just say?\"\n\n\"But I wanted to see how hot it was.\"\n\n\"If I say it's hot then it's hot and will hurt you...\" and further explanation of why what she did was stupid and she should never attempt it again.\n\nShe said, stay away, my sister deliberately disobeyed her and put herself in a situation where she could've been seriously hurt. It got her attention and she never tried that again.\n\nIn the moment is the key, not after the moment. ", "controversiality": 0, "created_utc": 1354513448, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acg4s", "link_id": "t3_1463m7", "parent_id": "t1_c7aafmw", "retrieved_on": 1430562568, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "auroranoel", "author_flair_css_class": null, "author_flair_text": null, "body": "Fahk offfff", "controversiality": 0, "created_utc": 1354513461, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acg72", "link_id": "t3_1463m7", "parent_id": "t1_c7aacoq", "retrieved_on": 1430562569, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "There were four kids in my family, I am aware that when you have more than two children there are only so many hands when a trip to the store or park is made. If you read the original thread referenced in the title there was a story about a 3 year old someone was babysitting who was playing chicken with traffic. In my mind, they need to learn that that's a boundary that should not be pushed, and in the moment it's a way to get the message across, no this is not a game this is serious, smarten up.", "controversiality": 0, "created_utc": 1354513838, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acin2", "link_id": "t3_1463m7", "parent_id": "t1_c7abdxe", "retrieved_on": 1430562605, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "Thank you this exactly what I said. ", "controversiality": 0, "created_utc": 1354514142, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ackkb", "link_id": "t3_1463m7", "parent_id": "t1_c7a91fa", "retrieved_on": 1430562627, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thomasbeagle", "author_flair_css_class": "green", "author_flair_text": "OMG I have a daughter!", "body": "It's still legal to use force for things like restraining a child from running on to the road. It's just not allowed to use it for \"the purpose of correction\".", "controversiality": 0, "created_utc": 1354514265, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aclc3", "link_id": "t3_1463m7", "parent_id": "t1_c7abfm0", "retrieved_on": 1430562636, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354514295, "distinguished": null, "downs": 0, "edited": 1354514557, "gilded": 0, "id": "c7acli5", "link_id": "t3_1463m7", "parent_id": "t1_c7acess", "retrieved_on": 1430562638, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "i did read that. There are other ways, and that child clearly has some issues, as well as the parents must.", "controversiality": 0, "created_utc": 1354515293, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acrji", "link_id": "t3_1463m7", "parent_id": "t1_c7acin2", "retrieved_on": 1430562728, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "makes sense, force to prevent injury.", "controversiality": 0, "created_utc": 1354515322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acrpw", "link_id": "t3_1463m7", "parent_id": "t1_c7aclc3", "retrieved_on": 1430562723, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "Please tell me your other way the third time your child attempts something dangerous and they are laughing like it's a game? You can raise your voice and ground them till they are 18 with nothing but a potato sack to play with, but when they try it again and this time they are hurt.\n\nI'd rather get the message across the first time, it's dangerous, no, not a game.", "controversiality": 0, "created_utc": 1354515739, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7acuc1", "link_id": "t3_1463m7", "parent_id": "t1_c7acrji", "retrieved_on": 1430562758, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "You sound like my uncle, he would get the belt all the time for doing dumb stuff and the same just tried not to get caught the next time. My mom pretty much learned what not to do by watching him get in shit all the time.\n\nMy mom spanked us, but I honestly can't remember it, but it was situations where she needed to get our attention right at that moment or else worse things could've happened (like the much cited running into traffic).\n\nYeah, my grandparents were inconsistent at best with their punishments, my mom could get away with murder cause of my uncle acting out and my uncle ended up getting into a bad crowd. My mom went on to raise us weirdos and we're alright. I am aware there is a way to do it and a way not to do it. Spanking for every little problem isn't the way to do it.", "controversiality": 0, "created_utc": 1354516841, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ad16l", "link_id": "t3_1463m7", "parent_id": "t1_c7abkk5", "retrieved_on": 1430562850, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "interplanetjanet", "author_flair_css_class": null, "author_flair_text": null, "body": "Your experience with spanking is not the only type of experience with spanking. It is certainly possible to use spanking as a tool for its shock value and never spank out of anger. My husband's family is a perfect example of this. His upbringing was fantastic, and his parents spanked when they needed to. They also used other methods and weren't lax with discipline.", "controversiality": 0, "created_utc": 1354517901, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ad7di", "link_id": "t3_1463m7", "parent_id": "t1_c7a7s00", "retrieved_on": 1430562925, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "orkneydays", "author_flair_css_class": null, "author_flair_text": null, "body": "you should do an AMA.  I'm curious to hear some more details.", "controversiality": 0, "created_utc": 1354521478, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7adqf3", "link_id": "t3_1463m7", "parent_id": "t1_c7acli5", "retrieved_on": 1430563174, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "armitageshanks", "author_flair_css_class": null, "author_flair_text": null, "body": "You are absolutely right.  It is abuse.  Justifying spanking in any way is justifying child abuse. Down-voting won't change that. ", "controversiality": 0, "created_utc": 1354527270, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aefaq", "link_id": "t3_1463m7", "parent_id": "t1_c7a9ifm", "retrieved_on": 1430563502, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Frida123", "author_flair_css_class": null, "author_flair_text": null, "body": "I want to do this when my son is old enough, but I wonder how to explain it when we are out with friends. I feel as though I would be inconveniencing them in order to discipline my child. Of course, saftey of my child is the most important, I am just wondering how to put it across to friends that I have to leave immediately.", "controversiality": 0, "created_utc": 1354534158, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7af3rq", "link_id": "t3_1463m7", "parent_id": "t1_c7a9h41", "retrieved_on": 1430563821, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Everyone here is worried that their child will fear them. Maybe I'm old school, but I think they should. Not fear to the point of, I'm afraid to do anything, my momma doesn't love me... But fear to the point of, if I really step out of line my butts gonna get smacked. I guess I didn't mention this ay first but I would only ever use my hand. People also treat me as if I won't sit my child down and explain why what they did was wrong, which is absolutely false. Of course it doesn't make sense to punish your child without explaining why they were punished. I feel like I got attacked here and that's not fair. I am a mother just like the rest of you and I can parent however I think right. Spanking my child does not make me a psychopath, a bad person or a bad mother. I didn't say anything to a single person who chooses to not spank their child. That is your prerogative and I don't shame you, belittle you or make you out to be a bad mother just because your parenting style isn't the same as mine...", "controversiality": 0, "created_utc": 1354535032, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7af718", "link_id": "t3_1463m7", "parent_id": "t1_c7a9kgr", "retrieved_on": 1430563864, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "While I respect your parenting style and you have all right to it, its not my personal cup of tea. I would never spank my child for throwing a tantrum. I would remove my child as well. However I think there are circumstances where it is necessary.", "controversiality": 0, "created_utc": 1354535177, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7af7k5", "link_id": "t3_1463m7", "parent_id": "t1_c7a9h41", "retrieved_on": 1430563871, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you.", "controversiality": 0, "created_utc": 1354535264, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7af7wr", "link_id": "t3_1463m7", "parent_id": "t1_c7abs9f", "retrieved_on": 1430563875, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I was spanked as a child with just about anything my mother could grab that was handy--wooden/plastic spatula, coat hanger, small tree branch (we called them switches) and her open hand. I hated it because she did it just to be mean..we didn't even have to do anything to get a whipping. We'd get whippings for the smallest of infractions. Burp and say \"Excuse me\" a beat too late? Whipping. Failing grade on a test? Whipping. \n\nI do not spank my son..well. Ok. Let me clarify that. If he REALLY gets out of hand, I will give him one pop on the butt before sending him to his room. But that's the extent of it. I know that if I ever really started spanking him, I could potentially lose control so I don't even give him that one pop unless he's REALLY out of control. It's more to get his attention than anything else because when he's in the deep throes of a meltdown, he doesn't realize that anybody else is even in the room sometimes. All he can see is himself, kicking, screaming, lashing out, thrashing on the floor. I am not physically strong enough to pick him up and potato-sack him to his room, he's just too heavy for me to pick up. So I pop him to get his attention and it's enough to snap him out of his meltdown JUST long enough for me to get him up, walk him to his room and tell him he has to stay there until he's finished with his meltdown.", "controversiality": 0, "created_utc": 1354536386, "distinguished": null, "downs": 0, "edited": 1354537119, "gilded": 0, "id": "c7afc50", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430563931, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I always tell my DS, \"Hey, when you grow up if you get thrown in jail, they won't be as nice as I am to you. So you better learn now.\"\n\n", "controversiality": 0, "created_utc": 1354536636, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7afd3w", "link_id": "t3_1463m7", "parent_id": "t1_c7af718", "retrieved_on": 1430563943, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354540835, "distinguished": null, "downs": 0, "edited": 1354544035, "gilded": 0, "id": "c7afvh2", "link_id": "t3_1463m7", "parent_id": "t1_c7ad7di", "retrieved_on": 1430564183, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354541011, "distinguished": null, "downs": 0, "edited": 1354565082, "gilded": 0, "id": "c7afwdl", "link_id": "t3_1463m7", "parent_id": "t1_c7adqf3", "retrieved_on": 1430564200, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "This. Yes.", "controversiality": 0, "created_utc": 1354541057, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7afwly", "link_id": "t3_1463m7", "parent_id": "t1_c7ad7di", "retrieved_on": 1430564204, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354541133, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7afx0o", "link_id": "t3_1463m7", "parent_id": "t1_c7af7k5", "retrieved_on": 1430564208, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354541700, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ag03g", "link_id": "t3_1463m7", "parent_id": "t1_c7af3rq", "retrieved_on": 1430564245, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "We have different parenting styles and thats okay. What's not okay is your you to belittle me. Different styles are fine. Mine is no better than yours and yours is no better than mine.", "controversiality": 0, "created_utc": 1354542091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ag28l", "link_id": "t3_1463m7", "parent_id": "t1_c7afx0o", "retrieved_on": 1430564272, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "If he has the types of meltdowns regularly I would look into SPD (sensory processing disorder) sometimes it comes out into intense meltdowns and there are ways to help", "controversiality": 0, "created_utc": 1354542146, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ag2jy", "link_id": "t3_1463m7", "parent_id": "t1_c7afc50", "retrieved_on": 1430564277, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354542578, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ag4xu", "link_id": "t3_1463m7", "parent_id": "t1_c7ag28l", "retrieved_on": 1430564308, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "He does have sensory issues and sometimes, when he's overloaded, he does meltdown. \n\nMy usual way to handle this is to get him to his room to have it in there, if I can get him there. But if he's thrashing and screaming and kicking and refuses to listen, I give him that single pop to get his attention more than anything. It's usually enough to get his attention so that I can get him off the floor and propel him towards his room where it's safe for him to kick and thrash and scream all he wants.", "controversiality": 0, "created_utc": 1354543787, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agc3c", "link_id": "t3_1463m7", "parent_id": "t1_c7ag2jy", "retrieved_on": 1430564404, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354543972, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agd9f", "link_id": "t3_1463m7", "parent_id": "t1_c7aceyi", "retrieved_on": 1430564424, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "If the child is doing something dangerous. If you have a kid that is running near a street or jumping off of things dangerously a spanking can be a pretty good tool and I'm sure that it's much less traumatizing than being hit by a car or breaking bones. ", "controversiality": 0, "created_utc": 1354544074, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agdx1", "link_id": "t3_1463m7", "parent_id": "t1_c7afvh2", "retrieved_on": 1430564431, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you seen this website? http://www.sensory-processing-disorder.com/  it could be helpful for you. Also maybe look into seeing someone. Some SPD therapists can give you great tools to use that will help minimize/eliminate  the meltdowns and both your child and you could benefit greatly from it. Does not hurt to look into or try", "controversiality": 0, "created_utc": 1354544322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agfkb", "link_id": "t3_1463m7", "parent_id": "t1_c7agc3c", "retrieved_on": 1430564453, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354544420, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agg9b", "link_id": "t3_1463m7", "parent_id": "t1_c7agd9f", "retrieved_on": 1430564457, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354545047, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agkl2", "link_id": "t3_1463m7", "parent_id": "t1_c7agdx1", "retrieved_on": 1430564512, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "Since when is purposely inflicting pain on your child not child abuse? ", "controversiality": 0, "created_utc": 1354546382, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agu8i", "link_id": "t3_1463m7", "parent_id": "t1_c7ac6t3", "retrieved_on": 1430564641, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I don't want you to feel attacked. \n\nThey are your children as long as you are abusing them I believe you can raise then how you want. \n\nI personally believe spanking to be ineffective but that is just my experience, since mainly I hated my parents more and more every time.\n\nDo I wish everyone felt how I do about spanking? A little. Mostly so my sisters wouldn't try to write off every time I got smacked as just spanking. Because getting back handed across the face by a man three times your size is not spanking. And a father grabbing his child and hitting her as hard as he can in the basic butt area is not spanking either. That's just cruel.", "controversiality": 0, "created_utc": 1354546436, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agunh", "link_id": "t3_1463m7", "parent_id": "t1_c7af718", "retrieved_on": 1430564648, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "Go New Zealand. At least one country in this ridiculous world is rational.", "controversiality": 0, "created_utc": 1354546501, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agv5v", "link_id": "t3_1463m7", "parent_id": "t1_c7aapq2", "retrieved_on": 1430564653, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "My problem with children fearing their parents is, it makes it hard to come to your parent when you need them.\n\nFor example when I was a teenager I was raped. I was so scared of my dad hitting me and blaming me for being alone with a boy that I've never told then. I've had to cope and get better all on my own. I acted out something fierce after it happened and they didn't know why and just assumed I was a horrible daughter and hit me more and harder. So for me I believe hitting just leads to secrets which leads to misunderstandings which leads to more secrets.", "controversiality": 0, "created_utc": 1354546735, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agwwn", "link_id": "t3_1463m7", "parent_id": "t1_c7af718", "retrieved_on": 1430564674, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "I was never spanked.  And I tend to think spanking is one of those things people do when they just are out of other ideas or are angry. Neither of which make it particularly useful.\n\nI also watched my little brothers growing up - they did get spanked, usually by their dad.  Granted I was a lowly teenager, but my observation on the spankings was that it was usually the result of their dad not being attentive. You could see most of the misbehavior coming a mile away - it would slowly ratchet up, until suddenly it was obvious and stepdad would spank.  What seemed pretty obvious to me at the time was that it was probably a lot easier and more effective to redirect things before they reached the point of getting out of control.  When I watched them by myself, had NO problems with them and never had to resort to it.  But it took being very attentive.\n\nThe other observation I made is that there are subtexts to spanking.  1 - that people who are bigger can use their size - might makes right, and it's OK to hit people who are smaller than you  and 2 - when you're angry it's OK to hit.\n\nThe dumbest thing I ever saw was stepdad spanking because middle brother hit baby brother.  Um, yeah, you're teaching him hitting people smaller than you is bad by... hitting people smaller than you? \n\nNow both boys turned out great, I don't think they were scarred for life or anything, but watching that stuff just made it seem like spanking was not the best choice to making ones point.  \n\nI understand the frustration that comes with getting little kids to listen sometimes, but my goal is to be attentive, so I can head things off as often as possible, and creative, so that I can find a more positive way to shape behavior.  \n\nI think whether people spank or not, it is really, really important to lay down LOTS of positive reinforcement and reward for good behavior.  Much more important to have kids WANT to do the right things than simply afraid of doing the wrong things.", "controversiality": 0, "created_utc": 1354546889, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agy2k", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430564689, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah. I can understand. I just found it amusing that even people who havent had kids yet refer to this scenario. :) \nIt's interesting to me. \nAnd in my opinion, you didn't do anything out of the ordinary, or anything I wouldnt of done i that situation. ", "controversiality": 0, "created_utc": 1354547030, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agz50", "link_id": "t3_1463m7", "parent_id": "t1_c7abs9f", "retrieved_on": 1430564706, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354547043, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7agz8g", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430564706, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "No bueno. No one likes child abuse. especially ppd mothers. \nI needed to cry anyway...  ", "controversiality": 0, "created_utc": 1354547190, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ah0cq", "link_id": "t3_1463m7", "parent_id": "t1_c7abco5", "retrieved_on": 1430564719, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354547589, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ah3hq", "link_id": "t3_1463m7", "parent_id": "t1_c7abd89", "retrieved_on": 1430564760, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BruinsMom", "author_flair_css_class": "lightcoral", "author_flair_text": "Baby Emma due 1/23/13!", "body": "This might be long because in the past few months it's become something that's been on my mind, so TL;DR- Spanking your child is the worst possible thing you can do for them and yourself.\n\nBoth of my parents spanked me as a child. They used some shit from the bible to justify it, but the truth of the matter is that them spanking me only increased my desire to rebel as I got older. It also made me afraid to go to them with questions, concerns, fears, etc. that I had. It is also my firm belief that their views on spanking and violence also contributed to their divorce later in life, but that's another story.\n\nNow, let's look at my husband. He and his sister were never spanked as children, and they are both smarter than me, more emotionally stable, and have an awesome relationship with their parents (who, I might add, are still happily married). His sister is also in her mid-teens and is not 'rebellious' at all.\n\nWe will not be spanking our daughter. I've seen firsthand the damage that it's done. Honestly, when I think about her (she's still cooking-due Jan 23rd) I think about holding her, watching her develop a relationship with her dad, talking to her, and doing the best I can to make sure that she had everything that I never had. I don't think about smacking her around because she wanted a cookie before dinner.", "controversiality": 0, "created_utc": 1354547991, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ah6nl", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430564801, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354548011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ah6ti", "link_id": "t3_1463m7", "parent_id": "t1_c7a9kgr", "retrieved_on": 1430564811, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354548197, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ah8ch", "link_id": "t3_1463m7", "parent_id": "t1_c7af718", "retrieved_on": 1430564825, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "I got the same results you did without spanking/swatting/tapping my 3.5 year old. We never baby proofed or anything like that. I also followed her around and if she reached for something that was dangerous. I removed her and said no touch, danger. It did not take long for her to get it. Same thing we are doing with my 9 month old. We are consistent. She understands that she will be removed if she touches. She has even started  stopping mid reach to a cord, looked at me and crawled away from it. ", "controversiality": 0, "created_utc": 1354548861, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ahdxm", "link_id": "t3_1463m7", "parent_id": "t1_c7ah6ti", "retrieved_on": 1430564896, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354549508, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ahjiy", "link_id": "t3_1463m7", "parent_id": "t1_c7ahdxm", "retrieved_on": 1430564969, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Thats my SO's birthday :)", "controversiality": 0, "created_utc": 1354550168, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ahp83", "link_id": "t3_1463m7", "parent_id": "t1_c7ah6nl", "retrieved_on": 1430565056, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354551502, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ai1i9", "link_id": "t3_1463m7", "parent_id": "t1_c7agu8i", "retrieved_on": 1430565205, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "What if you do have a particularly strong-willed child (thinking of my brother here) who will do it no matter how many times you remove them and try to redirect? In fact, they would make a game of it? (i.e. rushing toward socket to stick a finger in it, etc... I realize you can purchase socket blockers, but say you're guests in another person's home?)", "controversiality": 0, "created_utc": 1354552430, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aiaiv", "link_id": "t3_1463m7", "parent_id": "t1_c7ahdxm", "retrieved_on": 1430565322, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ModerSvea", "author_flair_css_class": null, "author_flair_text": null, "body": "We are raised to see it as child abuse. In 1979 spanking or striking your child for any reason was made illegal in Sweden. And I'm glad. My generation (I was born in 1982) was never struck, meaning our parents had to use their minds creatively to discipline us instead of using physical violence and we turned out just fine. Spanking is the easy way out, scaring the child into fearing you instead of respecting you, I don't think that's good parenting. ", "controversiality": 0, "created_utc": 1354552574, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aibzd", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430565341, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "i agree, i feel it is our job as parents to understand why our child is acting how they are acting even if the child doesnt know. It is our job to figure it out and help them not have to do that anymore.", "controversiality": 0, "created_utc": 1354553399, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aik3k", "link_id": "t3_1463m7", "parent_id": "t1_c7aibzd", "retrieved_on": 1430565454, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Then we would leave that persons home or the kid becomes my shadow and no longer participates in anything fun till they earned the right to go off and play again. Playing and hanging out is a privilege, if they choose not to listen that privilege is taken away via time out, removal from situation, helping to do chores etc.", "controversiality": 0, "created_utc": 1354553416, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aik9e", "link_id": "t3_1463m7", "parent_id": "t1_c7aiaiv", "retrieved_on": 1430565455, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354553523, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ailci", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430565466, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "&gt; Same thing happened for tantrums in the grocery store or where ever. She got one warning and then she was removed. \n\nisn't being removed from the grocery store what most kids want, though? to me that seems to be teaching \"if you throw a tantrum, you don't have to go on boring errands with mommy.\" what i want to teach is \"you do not have the option of going home, and you do not have the option of pitching a tantrum because you want to go home. you will be quiet and stay near me or the consequences will be painful.\"", "controversiality": 0, "created_utc": 1354559324, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ak96i", "link_id": "t3_1463m7", "parent_id": "t1_c7a9h41", "retrieved_on": 1430566319, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "that sounds like just as much punishment for you as the kid. \"sorry, i can't visit my friends because my kid makes a game of trying to kill himself.\"", "controversiality": 0, "created_utc": 1354560715, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7akoxx", "link_id": "t3_1463m7", "parent_id": "t1_c7aik9e", "retrieved_on": 1430566526, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "Um, yes, you are purposely inflicting pain on your child when you spank. You can argue legal definitions all you want, but if you don't think that hitting your child (on their butt or anywhere else) is purposely inflicting pain on them, you are very confused. Just because the pain isn't severe doesn't mean you can pretend that's not what you're doing.", "controversiality": 0, "created_utc": 1354561226, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7akunc", "link_id": "t3_1463m7", "parent_id": "t1_c7ai1i9", "retrieved_on": 1430566601, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354561596, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7akyqk", "link_id": "t3_1463m7", "parent_id": "t1_c7akunc", "retrieved_on": 1430566653, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "not_a_woodpecker", "author_flair_css_class": null, "author_flair_text": null, "body": "My mom gave me permission to bite my brother if he bit me (he's younger).  Apparently that worked and he stopped biting.  I was too young to remember, so I'll take her word for it.", "controversiality": 0, "created_utc": 1354563528, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7alkjl", "link_id": "t3_1463m7", "parent_id": "t1_c7abi7r", "retrieved_on": 1430566939, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "My kid loves the grocery store. or any errand. She loves helping and loves learning about everything. Helped us teach colors, numbers etc. So it is a punishment to leave. She would get very upset when we left, cause she wanted to be in the store. Also when we get home we go out of our way to make it extra dull and boring. There is no we leave just to come home and play and have tons of fun.", "controversiality": 0, "created_utc": 1354564725, "distinguished": null, "downs": 0, "edited": 1354565061, "gilded": 0, "id": "c7aly43", "link_id": "t3_1463m7", "parent_id": "t1_c7ak96i", "retrieved_on": 1430567116, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "It only took a few times to sink in. She learned quickly that fun times end if she acts out. When she got home there was no movies and we did boring stuff at home to really drive it home. There was no going home and playing. It was dull and boring", "controversiality": 0, "created_utc": 1354564876, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7alzqv", "link_id": "t3_1463m7", "parent_id": "t1_c7akoxx", "retrieved_on": 1430567138, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "I have a similar experience. I and my husband were spanked as children. We have a loose scale of punishment and it's a last resort: Doing something that is sometimes permissible with parental supervision-redirection Doing something specifically against the rules-time out Doing something life threatening or that will injure some one else and cannot ever happen again- hand smack We've never needed to go past that. That said I am strict and consistent with my child and rarely have to do more than tell him to stop now because he knows I'll follow through. We still have lots of redirection and time outs because he's curious and active, but I think spanking is a reasonable last resort if nothing else works, and the parent can use it calmly. You have to know yourself though, I would never hit a child if I was angry and my parents always modeled that to me.", "controversiality": 0, "created_utc": 1354565498, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7am6ow", "link_id": "t3_1463m7", "parent_id": "t1_c7a96ak", "retrieved_on": 1430567229, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "You've for one chance you're done. I hate that kids think they can do something 3 times before anyone will react.", "controversiality": 0, "created_utc": 1354565825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7amadl", "link_id": "t3_1463m7", "parent_id": "t1_c7a9h41", "retrieved_on": 1430567276, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "It depends on the kid. Because my guys would like out we sit down and have a time out in the store until he's calm, it prolongs the experience so he's learned to behave. different children mean different strategies.", "controversiality": 0, "created_utc": 1354566016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7amck8", "link_id": "t3_1463m7", "parent_id": "t1_c7ak96i", "retrieved_on": 1430567306, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "My respect for other people's parenting styles does not extend to people hurting their kids. Just because the law hasn't caught up does not mean that spanking is not abuse, and I will not refrain from passing judgement on people who abuse their children, no matter how well-intentioned. If we all stopped trying to \"respect\" one another and actually educated/advocated for what is statistically proven to be effective and best for children, the world would be a much better place.", "controversiality": 0, "created_utc": 1354566066, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7amd41", "link_id": "t3_1463m7", "parent_id": "t1_c7akyqk", "retrieved_on": 1430567312, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354566377, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7amgq9", "link_id": "t3_1463m7", "parent_id": "t1_c7amd41", "retrieved_on": 1430567360, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Creaturepreacher", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed!", "controversiality": 0, "created_utc": 1354566729, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7amkss", "link_id": "t3_1463m7", "parent_id": "t1_c7amgq9", "retrieved_on": 1430567413, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Boys should be discouraged from liking princesses\" is an opinion. \"Nuk bottles are better than Playtex\" is an opinion. \"Buying your teenager their own car is a bad idea\" is an opinion. \"Hitting your child on their butt is physically causing them pain on purpose\" is actually a very simple fact. Maybe \"hurting your child on purpose is never okay\" is an opinion, but then let the pro-spanking parents be honest and say \"I think it's okay to hurt my child sometimes.\"", "controversiality": 0, "created_utc": 1354573066, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aonnd", "link_id": "t3_1463m7", "parent_id": "t1_c7amgq9", "retrieved_on": 1430568393, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354574438, "distinguished": null, "downs": 0, "edited": 1354575011, "gilded": 0, "id": "c7ap32b", "link_id": "t3_1463m7", "parent_id": "t1_c7aonnd", "retrieved_on": 1430568595, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "animalcrackers1", "author_flair_css_class": "green", "author_flair_text": "Mom to an 18 Month old Daughter!", "body": "Oh boy was I spanked as a child.  My mother would hit me with a wooden spoon and my father had no qualms in giving me a solid smack across the face.\n\nIt's funny because *before* I had my daughter, I honestly thought I would give her a swift smack across the butt if she ever misbehaved.  But now that I am a mother, I wouldn't dream of hitting her for *any* reason.\n\nShe's only 10 months old, so I'm still figuring out what I will do when she gets to the age where she needs reprimanding, but I will certainly not be hitting her.  \n\nI'm a 40 year old woman today and I will be honest, I'm still irritated by the fact I got hit so much as a child.", "controversiality": 0, "created_utc": 1354577777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7aq3y2", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430569078, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "calico_cat", "author_flair_css_class": "green", "author_flair_text": "Has at least one kidlet", "body": "If a parent chooses to spank, it must be done when you have clearly explained \"If you do that again, I will spank you\". When the child clearly understands why and is given fair warning. Never out of anger or spur-of-the-moment. And never in front of siblings. I say now that I do not wish to do it but things may change.", "controversiality": 0, "created_utc": 1354579487, "distinguished": null, "downs": 0, "edited": 1354613032, "gilded": 0, "id": "c7aqmff", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430569387, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "That's a smart way of thinking about spanking.", "controversiality": 0, "created_utc": 1354585879, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7asiz9", "link_id": "t3_1463m7", "parent_id": "t1_c7aqmff", "retrieved_on": 1430570283, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "Sources.  And look I get it that the swat on the bum is to make an impression, but it is still hitting your child.  There are other ways!!!\n\nSources-\nhttp://www.theatlantic.com/health/archive/2012/02/the-long-term-effects-of-spanking/253425/\n\nhttp://www.psychologytoday.com/blog/the-me-in-we/201202/how-spanking-harms-the-brain\n\nhttp://umaine.edu/publications/4357e/\n\nhttp://www.webmd.com/parenting/news/20120702/spanking-linked-long-term-mental-health-issues\n\n http://www.huffingtonpost.com/susan-kaiser-greenland/more-science-to-support-w_b_1649770.html\n\nhttp://www.askdrsears.com/topics/discipline-behavior/spanking/10-reasons-not-hit-your-child\n\nI can keep going.  Last one says it well \"You may have a hug-hit ratio of 100:1 in your home, but you run the risk of your child remembering and being influenced more by the one hit than the 100 hugs, especially if that hit was delivered in anger or unjustly, which happens all too often.\"\n\nLike I said. I welcome the controversy to educate.  There are other ways.  Even with the burning stove.  Obviously there is a following direction/respect issue.  This problem seems like it could have been prevented. ", "controversiality": 0, "created_utc": 1354587140, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7asx3e", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430570470, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "Many. Take some early childhood education courses and you'll read about some of the older studies.  The links are to newer ones. ", "controversiality": 0, "created_utc": 1354587291, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7asyue", "link_id": "t3_1463m7", "parent_id": "t1_c7aceyi", "retrieved_on": 1430570500, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "linalennon", "author_flair_css_class": null, "author_flair_text": null, "body": "Hilarious typo. ", "controversiality": 0, "created_utc": 1354593199, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7autd5", "link_id": "t3_1463m7", "parent_id": "t1_c7a7thx", "retrieved_on": 1430571363, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "linalennon", "author_flair_css_class": null, "author_flair_text": null, "body": "How do you deal with it if you have a cart full of groceries?  Do you put them back, or leave the cart?  I like the idea, but I have a hard time imagining being able to give instant feedback to my child by leaving the store.", "controversiality": 0, "created_utc": 1354593382, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7auvcf", "link_id": "t3_1463m7", "parent_id": "t1_c7a9h41", "retrieved_on": 1430571389, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Abandon the cart or if daddy is at home or with us then he either comes and gets her while we wait at the door or he takes her home. It has not happened in a long time. At least 6 months. She knows after a bit of testing that we mean what we say. She gets one warning and that is it. She still tests over other stuff and some stuff we can compromise on (like dressing appropriately for weather)\n\n\nBut let someone know if you abandon or bring it to customer service it so they can get the perishable's back before they spoil. ", "controversiality": 0, "created_utc": 1354594248, "distinguished": null, "downs": 0, "edited": 1354594545, "gilded": 0, "id": "c7av4qy", "link_id": "t3_1463m7", "parent_id": "t1_c7auvcf", "retrieved_on": 1430571512, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dalgal412", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a similar background (worked in group homes, went on to teach students with autism in public schools), and second what was said, especially the part about offering choices. I would also add that setting expectations ahead of time can make a world of difference. For example, my toddler knows that if she wants to walk at the store, she has to stay with me &amp; the cart. If she doesn't, she has to ride in the cart, and we'll try again next time. I remind her what the consequences/expectations are each time. Obviously we don't do this for safety things-running into the street, for example-but she has enough choices during her day that she's pretty compliant when it is a safety thing. (So far, knock wood, etc.)", "controversiality": 0, "created_utc": 1354595579, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7avium", "link_id": "t3_1463m7", "parent_id": "t1_c7adqf3", "retrieved_on": 1430571700, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "My opinion isn't about feeling, it's about science: http://www.parentingscience.com/spanking-children.html", "controversiality": 0, "created_utc": 1354598345, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7awaux", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430572062, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "It depends on the kid and the age of the kid. At 2? Pretty much everywhere they go is a fun adventure. At 6? Or 11? Not so much. But you have different expectations of their behavior and different methods for dealing with them. For the 2 year old, reasoning doesn't work and tantrums are not usually about trying to get what they want, but rather being overtired, hungry or upset for some other reason. If it's a prolonged tantrum (usually they only last 30 seconds or so) removing them from the situation (whether that is a time out on the curb or actually removing the from the store) the best thing you can do. \n\nAt older ages, you can reason with them and so move on to actual punishments and reward systems. And hopefully the training you've done in the earlier ages has left you with a kid who listens to you most of the time. And then the teenage years and hormones hit, and who the fuck knows at that point?\n\n", "controversiality": 0, "created_utc": 1354600769, "distinguished": null, "downs": 0, "edited": 1354600986, "gilded": 0, "id": "c7awx28", "link_id": "t3_1463m7", "parent_id": "t1_c7ak96i", "retrieved_on": 1430572354, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "You basically stand overtop of them, making sure they don't do anything they shouldn't. Taking a toddler places can be exhausting because it calls for constant vigilance. It isn't because they are defiant - it's because they just don't know anything yet. They invent dangerous things to do that you never in a million years considered! So those first few years are tiring, and you learn to bring toys and divide your attention. And some places we just don't go anymore, because they are toddler death/mess traps (glass coffee tables, breakable knicknacks everywhere, delicate furniture, sharp and pointy corners on everything, white upholstery - this is just one person's house, mind you).", "controversiality": 0, "created_utc": 1354601543, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ax3iq", "link_id": "t3_1463m7", "parent_id": "t1_c7aiaiv", "retrieved_on": 1430572438, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Turns out, disciplining your kid *is* just as much a punishment for you (or more) as it is for the kid. That's why so many people suck at it or give up. It's hard, frustrating, repetitive and irritating. ", "controversiality": 0, "created_utc": 1354601734, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ax522", "link_id": "t3_1463m7", "parent_id": "t1_c7akoxx", "retrieved_on": 1430572458, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "And I was thinking of toddler + newborn. How the hell am I ever going to have two!? &lt;facepalm&gt;", "controversiality": 0, "created_utc": 1354626357, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b0dum", "link_id": "t3_1463m7", "parent_id": "t1_c7ax3iq", "retrieved_on": 1430574051, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "Then I would be VERY interested to see this alternate reality you live in in which an adult smacking a child's butt is entirely painless. And no. I won't stop judging adults who can't think of any better way to make a child a fourth their size behave than hitting them. Respect has it's limits. ", "controversiality": 0, "created_utc": 1354628082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b0mem", "link_id": "t3_1463m7", "parent_id": "t1_c7ap32b", "retrieved_on": 1430574169, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "luv4bunnies79", "author_flair_css_class": "purple", "author_flair_text": "3 year old's zookeeper, newb 9/13", "body": "We were but when we were it was serious business. I use it now but ONLY when he is in danger.  I only do it on the diaper or a light on the hand if its cause he is touching something (like when he tried to something in the socket at a nonchild proof house) dangerous. \nI know I will get flack, but the thing is in a moment where there can be no scale, it can be effective. If its something you can do anything else with, well of course do that. I also talk to him about it after I get him out of the situation, and that helps a lot. \nEDIT: I was spanked and I am fine.", "controversiality": 0, "created_utc": 1354635690, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b24cm", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "removal_reason": null, "retrieved_on": 1435662027, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Creaturepreacher", "author_flair_css_class": null, "author_flair_text": null, "body": "Spanking isn't hitting. Enough said. \n\nThe last thing other parents need is some ridiculous person judging them for an acceptable cultural and socital norm. You choose to parent one way, others choose to parent another. You have no business telling them what is right and what is wrong. How you parent could be horrible to someone. ", "controversiality": 0, "created_utc": 1354637276, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b2hsx", "link_id": "t3_1463m7", "parent_id": "t1_c7b0mem", "retrieved_on": 1430575159, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354637487, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b2jfe", "link_id": "t3_1463m7", "parent_id": "t1_c7b2hsx", "retrieved_on": 1430575173, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354637890, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b2mmx", "link_id": "t3_1463m7", "parent_id": "t1_c7asyue", "retrieved_on": 1430575199, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grandtheftautumn", "author_flair_css_class": null, "author_flair_text": null, "body": "Then obviously I'm very confused, and maybe you should explain to me the mechanics of spanking a child. Because I was pretty sure it involved raising your arm and bringing your hand down on a child's butt, which I was pretty sure is also the exact mechanics involved in hitting. If you know something I don't, please enlighten me. And I'm quite sure the way I parent could be horrible to someone, but no one could ever argue even remotely that I purposely caused my child any physical pain, regardless of how mild and fleeting. ", "controversiality": 0, "created_utc": 1354639017, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b2vsk", "link_id": "t3_1463m7", "parent_id": "t1_c7b2hsx", "retrieved_on": 1430575300, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Haha stupid iPhone. :)", "controversiality": 0, "created_utc": 1354639453, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b301h", "link_id": "t3_1463m7", "parent_id": "t1_c7autd5", "retrieved_on": 1430575346, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "I do believe this study specifically says that.  \n\nhttp://pediatrics.aappublications.org/content/early/2012/06/27/peds.2011-2947.full.pdf", "controversiality": 0, "created_utc": 1354641275, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b3jla", "link_id": "t3_1463m7", "parent_id": "t1_c7b2mmx", "retrieved_on": 1430575540, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Hah - you'll manage just fine. Most people will help you wrangle the toddler or will hold the newborn while you do it. Or you'll start to only take your kids to friends houses who also have kids. It's just easier.", "controversiality": 0, "created_utc": 1354642315, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b3vct", "link_id": "t3_1463m7", "parent_id": "t1_c7b0dum", "retrieved_on": 1430575695, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354644970, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7b4pne", "link_id": "t3_1463m7", "parent_id": "t1_c7b3jla", "retrieved_on": 1430576090, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354652156, "distinguished": null, "downs": 0, "edited": 1354652548, "gilded": 0, "id": "c7b70da", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430577299, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cordieco", "author_flair_css_class": null, "author_flair_text": null, "body": "Not a mom here, but a Human Developmental and Family Sciences major at the University of Texas.\n\nI am currently in a Family Relationships class and we talked about corporal punishment today, actually. Basically this is the generally consensus from an academic point of view:\n\nDo. Not. Spank.\n\nThe research is overwhelming. It also increases the likelihood that a child will become a victim of right out child abuse. There are many more negative consequences that I would be happy to add if anyone is interested in knowing.", "controversiality": 0, "created_utc": 1354673994, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bdqq9", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430580543, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "Could you provide those sources please. Everyone talks about them but no one provides them. The links provided are mostly trashy magazine fodder. ", "controversiality": 0, "created_utc": 1354687994, "distinguished": null, "downs": 0, "edited": 1354689220, "gilded": 0, "id": "c7bhfnd", "link_id": "t3_1463m7", "parent_id": "t1_c7bdqq9", "retrieved_on": 1430582285, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "I should have you know my sister does respect my mother very much. Kids do stupid shit all the time, they are kids that's what they do. You have something to say to you reply to the thread.\n\nI did a skim of some of the studies many of them are flawed because it does depend on recollection, as they cannot do double blind studies with children to see what level of punishment is appropriate. As I said I do not remember my own spankings, but I know I got them because this  a time old debate and my mother has mentioned them. \n\nPlease tell me how you would've prevented it.", "controversiality": 0, "created_utc": 1354688566, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bhjx1", "link_id": "t3_1463m7", "parent_id": "t1_c7asx3e", "retrieved_on": 1430582338, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "&gt; Ordinarily, the best way to get answers is to run controlled, randomized, double-blind experiments. But that would be unethical. So researchers have tried another approach—the prospective study.\n\nBy their own admission not the best sources. And you can't spank a child \"for science\". Thing is many of these links say there **may** be a link, and with the people who spank their children for every infraction until they are 18 I can see these kids having problems, but if you can count on one hand the times your child has been spanked, then I don't see how we have a problem.", "controversiality": 0, "created_utc": 1354689590, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bhrat", "link_id": "t3_1463m7", "parent_id": "t1_c7awaux", "retrieved_on": 1430582440, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "I can see your situation. There are situations where I feel I cannot trust myself, (I'm a nervous driver so I hate driving with passengers, if I run into a pole I'd rather just crashing me not everyone else in the car). Trying to remove yourself from a dangerous situation seems fair enough.\n\nThough if you are worried about your temper maybe get some preventative measures in there, especially if you are striking out on your own? I'm trying to better myself by getting lessons. I'm not sure what you could do to help yourself in stressful situations though, not all of us can afford the massage and yoga lessons after all. ", "controversiality": 0, "created_utc": 1354690175, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bhvb5", "link_id": "t3_1463m7", "parent_id": "t1_c7ailci", "retrieved_on": 1430582487, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Q-Kat", "author_flair_css_class": null, "author_flair_text": null, "body": "I have smacked their hands when they were that 1-2 age where they're getting around and being cheeky but just that bit too young to submit to time outs. \n\nOne was particularly determined to touch hot items and honestly I gave up batting his hand out the way and trying to demonstrate \"hot\" that he did end up with a lovely burn on his palm. He never made the same mistake again though. \n\nI currently find time outs are enough these days but honestly it's not the smacking that's ineffectual it's the \"getting used to it\" and the \"empty threats\" part that creep in. If you rely on smacking there's be times you say you will then don't for whatever reason and there will be a point where the child is so used to it that they stop caring. \n\nEither of these situations is not good for anyone.", "controversiality": 0, "created_utc": 1354715233, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bkudr", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430583889, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RhinoTattoo", "author_flair_css_class": "blue", "author_flair_text": "Mom to twins, 4 years apart", "body": "I can count on one hand the number of times I ever spanked my son, but they were definitely for his benefit.  I'm sure people who are 100% anti-spanking will not believe that, but let me explain.\n\nSomewhere between 18 months and 30 months, my son went through a period where, every once in a while, he would get so upset and worked up that he could not calm himself down.  Just full-blown meltdowns where he was thrashing, trying to hit, kick, etc., and these \"tantrums\" for lack of a better word would seemingly come out of nowhere.  Ignoring him did no good, as he would just try to follow and continue attempting to hit or kick.  Shutting him in his room wouldn't work as he would just destroy things and risk injury to himself.\n\nOn a few of those occasions, I swatted his leg, just hard enough to sting.  Every time he would just burst into tears and fall into my arms for a hug, and I would rock him a minute or two until he stopped crying.  Then he would be perfectly fine and happy.\n\nIt was almost exactly like someone slapping a hysterical person in a movie.  Just the shock of that little pop was enough to get his attention and help him re-focus himself.", "controversiality": 0, "created_utc": 1354742011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bsfww", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430588767, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "grlnextdoor", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly, I don't even know how else you could react to that. Do you think talking about why she shouldn't disrespect you is even effective at that age? My first instinct would have been definitely a slap to the mouth, just as it was done to every kid when I was a child. But then again, I was spanked and hit a lot as a child, and it was only after I read the askreddit that I made the connection that perhaps that's why my first instinct with my kid would be to hit as well.\n\nThen again, everyone around me got spankings. This \"no spanking\" thing is a new thing. What if it's not a good thing, and we are making a generation of spoiled brats by not spanking once in a while?", "controversiality": 0, "created_utc": 1354743437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7bsy8o", "link_id": "t3_1463m7", "parent_id": "t1_c7abfj4", "retrieved_on": 1430589022, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cordieco", "author_flair_css_class": null, "author_flair_text": null, "body": "Our teacher doesn't give us the powerpoints, which have the sources attached to them, but what I can do is type out my notes here from that day?\n\nEdit: I used a search engine that the university pays for, and I found [this](http://web.ebscohost.com.ezproxy.lib.utexas.edu/ehost/pdfviewer/pdfviewer?vid=5&amp;hid=125&amp;sid=be89621f-fc3d-49f2-9733-e4075e799a74%40sessionmgr114) among many others\n", "controversiality": 0, "created_utc": 1354746003, "distinguished": null, "downs": 0, "edited": 1354746339, "gilded": 0, "id": "c7bttsg", "link_id": "t3_1463m7", "parent_id": "t1_c7bhfnd", "retrieved_on": 1430589431, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "It's behind a paywall but I know if I go to my local library and log in I can probably access it. Can you provide the citation? There should be a button that auto does the citation in ebsco if I remember right (it was either them or proquest).", "controversiality": 0, "created_utc": 1354814174, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7c8deh", "link_id": "t3_1463m7", "parent_id": "t1_c7bttsg", "retrieved_on": 1430596521, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I was spanked, and I'm grateful for it. I love my parents to death and I hold no negative feelings toward spanking at all. I spank also. \n\nBy spank, I mean one swat on the butt. Afterward, I always get down to her level and tell her, \"We know that when Mommy says, 'No', that means we don't do it. You a a big girl and big girls do what their mommies tell them. I love you and I want you to be a good, big girl, ok?\" Then I give her a hug and we do something together, like look at a book or I'll have her help me with chores.\nThat's basically what my parents did to me also, and I was known as a very well behaved kid. I pushed limits occasionally, but they handled it well, and I hope that I can model that and have the same relationship with my daughter as I do them when she's an adult. \n\nGranted, when I got older, my mom opted for the \"cold shoulder\" discipline that was much less effective and left me with depression issues. I would have rather she swatted my hind end than that. ", "controversiality": 0, "created_utc": 1356070016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7jzv17", "link_id": "t3_1463m7", "parent_id": "t3_1463m7", "retrieved_on": 1430733771, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I hate the cold shoulder. I would just yell at my mom that she was acting like a fucking child and I was glad not to hear her stupid voice.\n\nI wasn't the nicest child but there is only so\nMany times you can watch your mom\nLet your dad hit you before you give up if they even have emotions.", "controversiality": 0, "created_utc": 1356108385, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7k5rl9", "link_id": "t3_1463m7", "parent_id": "t1_c7jzv17", "retrieved_on": 1430736628, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so sorry about that. I don't understand how someone can watch their child be abused. That kills me... I was blessed in that spankings were handled in the way they should be handled in my house. I never felt terror or fear, aside from the normal \"Oh, crap, I'm in trouble\" fear that every child gets when they're disciplined. I always felt loved and cherished.\n\nUp until the cold shoulder thing. That's when things went downhill for me. ", "controversiality": 0, "created_utc": 1356115901, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7k7wpy", "link_id": "t3_1463m7", "parent_id": "t1_c7k5rl9", "retrieved_on": 1430737637, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "That's lucky for you. But a lot if people don't realize there's a good amount of children who do not feel the positive way you did about spanking and your parents. \n\nFor me personally even if its a 1 in 100 odds that my kid will feel unloved by me because of spanking even if I'm perfect in all other aspects, I just don't want to risk it.", "controversiality": 0, "created_utc": 1356137838, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7kdltv", "link_id": "t3_1463m7", "parent_id": "t1_c7k7wpy", "retrieved_on": 1430740389, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Different stroke for different folks, I suppose. :) We are *very* old fashioned and pretty laid back in the child rearing business. I got into the newer way to do things for a little while, but it just went against my personal instincts. Not that it's bad for anyone else. It just didn't work for our family. \n\n Any discipline can cause negativity if handled in any way other than out of love. I feel confident in our decision, and I'm happy that many parents who don't feel comfortable with it can find a way to discipline that works for them. Different doesn't mean bad. :) Not that I think you're saying that. I just like to leave everything on a positive note. :)", "controversiality": 0, "created_utc": 1356143985, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7key9v", "link_id": "t3_1463m7", "parent_id": "t1_c7kdltv", "retrieved_on": 1430741023, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": ":)", "controversiality": 0, "created_utc": 1356207389, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7kp720", "link_id": "t3_1463m7", "parent_id": "t1_c7key9v", "retrieved_on": 1430745998, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}