{"submission": {"author": "curiouslywanting", "author_created_utc": 1317566135, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_5ytas", "created_utc": 1354900840, "domain": "self.Mommit", "edited": 1355117159, "full_link": "https://www.reddit.com/r/Mommit/comments/14gac2/how_do_you_manage_going_out_for_appointments/", "gilded": 0, "id": "14gac2", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/14gac2/how_do_you_manage_going_out_for_appointments/", "retrieved_on": 1413310371, "score": 33, "secure_media_embed": {}, "selftext": "First time mom looking for advice on how to manage a newborn and heading outside for appointments and errands.\n\nI've done:\nBy my baby's schedule.  Make sure that he's fed and newly diapered and then head out.\n\nNot by my baby's schedule.  Head out when you need to a pray that he doesn't have a meltdown in the car seat or get a blowout when you need to get something done at a certain time.\n\nAny pro tips for me?  My baby is now 7 weeks old and I definitely have anxiety about heading out with the little guy.\n\nUpdate:  Thanks for all the posts and replies. I have appointments scheduled for Monday, Tuesday, and Wednesday.  So it'll be good practice for me to put your advice to use!  ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How do you manage going out for appointments &amp; errands with a newborn?", "url": "http://www.reddit.com/r/Mommit/comments/14gac2/how_do_you_manage_going_out_for_appointments/", "user_reports": []}, "comments": [{"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Just do what you can when you can.  If you know that you've got to run to the store or whatever, go as soon as you've finished feeding and changed his diaper.  But avoid stressing yourself out to much, if at all possible.  The more stressed you become, the harder it will be to keep baby calm. \n\nIf there is a time where you just HAVE to go out, you just do the best you can with what you have.  ", "controversiality": 0, "created_utc": 1354901167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cs6rn", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430606568, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meatloaf_again", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha - I am still trying to figure this out with my five month old! Mostly I try not to schedule things during nap time and try to be flexible the rest of the time! ", "controversiality": 0, "created_utc": 1354901804, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7csdkc", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430606659, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "k_hall_313", "author_flair_css_class": null, "author_flair_text": null, "body": "Ummm you just do it? Sorry I am just confused. I know you're a first time mom, but I was also a new mom nearly 14 months ago and my husband was deployed then and is again. You do the best you can. New diaper, fed, head out. If the baby gets hungry again, feed them in the back seat (assuming you're breast feeding) or have bottles of warm water ready and throw in formula. Have diapers and wipes ready and change them on the seat of your car or in a bathroom at a store. If they have a meltdown, that's fine. That's what babies do. If they have a blow out explosive diaper, that's why you bring an extra set of clothes. Believe me, I had plenty of explosive diapers at stores or while out and you just deal with them. That's about the best advice I can give. You can't just not live your life and be a shut in because you have a baby. They will learn to adapt to your needs, too. Hope that helped.\n\nEdit: I can tell this came across as bitchy. However I am honestly just confused about the post itself? I guess I can be down voted to oblivion for having a genuine confusion on this, but oh well. Babies don't come with manuals, at least mine didn't. You just learn what they need and adapt to it. And they adapt to what you need as well. ", "controversiality": 0, "created_utc": 1354901911, "distinguished": null, "downs": 0, "edited": 1354904258, "gilded": 0, "id": "c7cseqw", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430606671, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coveredinstars", "author_flair_css_class": null, "author_flair_text": null, "body": "When my children were tiny a baby carrier (sling) was really helpful.  They do take a little time to get comfortable with, but you can let your little one sleep in it while you're at the grocery store or whatnot.  You can nurse them in it.  You can bottlefeed them in it.  They can see things and be entertained in it.  They are close to you and usually much more happy.  \n\nAlso having the stroller available to snap their car seat into when they were asleep when we arrived.  Packing up the diaper bag with anything I might possibly need.  Everything takes twice as long to do with an infant (this holds true for toddlers as well, my 9 year old doesn't slow me down very much anymore at least) and if you plan that into your timetable and expect it that can help reduce stress :)  ", "controversiality": 0, "created_utc": 1354903571, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cswll", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430606909, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sjtlm", "author_flair_css_class": null, "author_flair_text": null, "body": "My kids are at their best in the morning at every age (who isn't, I guess) so I try to go out as early as possible.  Stores are less crowded so errands are faster, too. \n\nI keep a sling in my diaper bag at all times because it will nearly always stop a meltdown in its tracks regardless of the cause, and then my hands are free enough to still finish up.\n\nBring anything else you migh need like a pacifier. When they are a little older I start bringing a small toy they don't normally get to play with, a bottle with a little water in it (my breastfed boys wouldn't take a bottle but were intrigued by this), and a snack.  The key is to have something distracting enough to keep them occupied even if they are unhappy.", "controversiality": 0, "created_utc": 1354903615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7csx2m", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430606920, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SaShayLaLu", "author_flair_css_class": null, "author_flair_text": null, "body": "Two words - Baby wearing. It was the only way to get things done with a child under 1. They'd go into the car seat if we had to drive anywhere, but as soon as we had to get out and do something/go somewhere into the bjorn they went. They would ether be happily content looking around being snuggled by mom or dad, or would go to sleep. at 7 weeks your babe is still on a high demand of eating and diaper changes, but that's what a well loaded diaper bag are for. First time parenting is rough, but soon enough you'll get the hang of being able to change even the worst diapers in a minute flat. just make sure you have a wipeable changing pad (or a receiving blanket as a cheaper method, since those can be washed) a fistful of clean diapers, travel bag of wipes, and a couple bottles if you're bottle feeding. \n\nWe've all been there, we've all had to take our babies out, it's just something that right is probably still feeling strange and foreign to you but will be second nature soon enough. I'll never forget with my first I wasn't sure how to ride a bus with her! do I bring the car seat? the stroller? what do I DO?! looking back it's kinda funny, but at the time I thought for sure I was going to screw it up. ", "controversiality": 0, "created_utc": 1354903887, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cszxs", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430606956, "score": 41, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "skylar_rose", "author_flair_css_class": "purple", "author_flair_text": "Baby bug 02/21/12", "body": "I was out and about with my daughter when she was 8 days old. Life doesn't stop, it adjusts. I agree with you. You just deal with it.\n\nNow I can travel at any point in the day, armed with a bottle and snacks (she's now 9 months old), and life is good. She also sleeps through anything because I didn't always have the time to wait for her first nap of the day to happen. She sleeps just fine in her stroller or carseat if she needs a nap. \n\nYou just make it work and keep going.", "controversiality": 0, "created_utc": 1354904537, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ct70c", "link_id": "t3_14gac2", "parent_id": "t1_c7cseqw", "retrieved_on": 1430607042, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "_Pliny_", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think there are any special protips, except to have your supplies ready (extra set of clothes, diapers, wipes, formula/milk) and don't go if your baby is already overtired. \nNewborns are the easy ones to go out with, but unfortunately you don't realize that until they're older. :)\n\nAs others have said, just relax and do it, and don't rush. You will learn what works with your baby, and only a absolute asshole wouldn't completely understand that sometimes babies fuss. ", "controversiality": 0, "created_utc": 1354905257, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctetr", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607144, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "luv4bunnies79", "author_flair_css_class": "purple", "author_flair_text": "3 year old's zookeeper, newb 9/13", "body": "Being aware that you will not keep to a schedule. If you try to schedule it just doesn't seem to happen. I left myself plenty of time and wore him or used a carrier. Getting out was the thing that kept me sane. Also if I was too tired that day, oh well stay home. Also made sure to have plenty of supplies. You don't have to bog yourself down carrying them, but keeping extra clothes and diapers in the car is a lifesaver. Also keep extra clothes for you, nothing worse than smelling like puke all day. In short, just go and know it could take 10 minutes or 2 hours, and try not to worry about it :)", "controversiality": 0, "created_utc": 1354905580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctib3", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607194, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "griptight", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't really get into babywearing until my second was born. I was amazed at how much I could get done with him in a carrier.", "controversiality": 0, "created_utc": 1354905966, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctmg4", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607245, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Goders", "author_flair_css_class": null, "author_flair_text": null, "body": "Try to leave a bit earlier than you usually would. When I first had my daughter, we were at the doctor's office 30 minutes before the appointment, this way if she needed to be fed or changed, we weren't rushing. We planned out our route before we left, because when we were out, we decided to do all of our running around then, instead of making multiple trips in one day.\n\nWe got everything ready to go the night before. We had her outfit that she was going to wear laid out, with a fresh diaper and wipes, we had her diaper bag packed with more diapers than we'd ever need, an extra set of clothes, an extra blanket, and extra pair of shoes.\n\nWhen I was breastfeeding, we had a bottle of pumped milk with us in case we were driving, this way one of us could sit in the back with her and feed her in her car seat. When I was unable to breastfeed (I wasn't producing enough milk), we always had extra bottles, a can of formula and a gallon of water with us.\n\nThe main thing is to try and relax. If your baby starts having a meltdown in the car, pull over (this is where leaving early saved us) and try to calm them down.\n\nWe also kept a sling with us in case she got fussy in stores and such, which never became an issue with us, but we had it just in case! Just remember, other parents will usually be sympathetic. Those who aren't, don't matter. You probably won't ever see judgmental people in stores ever again, they can get over themselves.", "controversiality": 0, "created_utc": 1354906051, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctnd7", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607255, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "blurplemonster", "author_flair_css_class": null, "author_flair_text": null, "body": "Have a diaper bag stocked. Plenty of bottles, diapers and a couple changes of clothes. A toy or two when they are interested in that sort of thing. If your baby is still small carry them in a carseat and everything is much more manageable. I am having a harder time since I do not use the bucket carseat any more and when my little one gets tired she falls over in a cart. I bring the stroller or moby at all times. \nJust be prepared for whatever they will need and go do what you have to do. Dirty diapers happen, and babies get hungry. Just help them and continue what you are doing. The more you go out the easier it will be. Also having a helper with you makes it much easier, if possible. ", "controversiality": 0, "created_utc": 1354906080, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctnpt", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607260, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smallstakes", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is 9 weeks and we get out quite regularly (otherwise I would go crazy at home). Where possible I make sure she's been fed and changed just before going out, that way she's less likely to be cranky in the car. She usually falls asleep as soon as we start driving or if she's being pushed in the pram, so she's pretty easy to take out. Just make sure you're organised with spare clothes, nappies, wipes and food if needed and you'll be fine. ", "controversiality": 0, "created_utc": 1354906241, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctpiz", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607283, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "itsthateasy", "author_flair_css_class": null, "author_flair_text": null, "body": "leave way earlier than you think you need to, carry a moby wrap at all times, be comfortable with feeding him anywhere, carry at least one extra outfit.\n\nit's not necessary, but i usually have a changing pad with me so i don't have to put baby down on a nasty baby changing table. also, i've changed her in the car i don't know how many times. i usually have a blanket with me. ive changed her on the grass in the middle of the park before, too. just be prepared. i have a backpack instead of a diaper bag", "controversiality": 0, "created_utc": 1354906409, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctrbt", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607308, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "Basically just do what you need to do. There is no way to get around a baby's unpredictable nature. Sometimes the errands go smoothly and nothing happens. Sometimes the kid has a huge screaming fit, or pukes on everything, or fills their sleepers with poop from neck to toes. And sometimes it's in between. Carry a diaper bag with clothes, diapering supplies, new blankets, plastic bags, and whatever else you think you might need so you'll be ready for anything, and just go do what you need to do. There's no way to prevent things from happening. Embrace the chaos. You'll be fine.", "controversiality": 0, "created_utc": 1354906920, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctwuy", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "removal_reason": null, "retrieved_on": 1435660778, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "redmapleleaf", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is now 8 months old, what I did (and still do) is get everything ready that I need feed her change her diaper and get her into her jacket and go. She has been fully satisfied before we go out. When she was new-new she could go out at nap time and sleep through almost anything. Now that she is older she is too aware to nap when I am out so the carrier is my saviour as she is not a fan of the stroller. ", "controversiality": 0, "created_utc": 1354907083, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ctyoj", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607406, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lindsayamber", "author_flair_css_class": "lightcoral", "author_flair_text": "Kieran 8/30/10, Aria 3/27/13", "body": "I just want to highlight a few things others have said here:\n1. Bring extra of everything.\n2. If you can, go when baby is fed, changed, and not overtired.\n3. Go with the flow, don't let things get to you, be flexible.\n\nReally, that's all you can do. Also, I hear baby wearing helps a lot, but that can be different for everyone. Most importantly, remember that this is the easy time. I just had the WORST experience in Wal-mart with my two year old, and I long for the days when he was a newborn and would just sleep the whole time. It will get much harder before it gets easier, so try not to stress too much at this point.", "controversiality": 0, "created_utc": 1354907512, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cu381", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430607467, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ShannonOh", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, oh my god did I ever sing the praises of my ring sling when I discovered it around 8 weeks. I went from avoiding every trip to relishing going out and about. Nursing in it in public was a breeze (built-in cover and almost hands-free), and I felt so incredibly liberated that my spirits were through the roof.\n\nNever had to deal with blowouts though. My boy pooped about four times a day at that stage, so never too huge.", "controversiality": 0, "created_utc": 1354910277, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cuxme", "link_id": "t3_14gac2", "parent_id": "t1_c7cszxs", "retrieved_on": 1430607891, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lass0_0f_truth", "author_flair_css_class": "purple", "author_flair_text": "Fiona Emilie 8/15/12", "body": "I'm sorry that you're being downvoted for not coddling the OP. \n\nI had the same types of anxiety issues about going out that OP did, but I had to buck up and go because as a single mom there wasn't anyone around to run my errands for me. Baby screeched up and down the aisles of the grocery store. I was so embarrassed by the crying but then I realized that most people have children, and they more than understand. ", "controversiality": 0, "created_utc": 1354910516, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cv0ar", "link_id": "t3_14gac2", "parent_id": "t1_c7cseqw", "retrieved_on": 1430607923, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lass0_0f_truth", "author_flair_css_class": "purple", "author_flair_text": "Fiona Emilie 8/15/12", "body": "This is off topic, but I absolutely love your flair.", "controversiality": 0, "created_utc": 1354910558, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cv0rk", "link_id": "t3_14gac2", "parent_id": "t1_c7ctib3", "retrieved_on": 1430607927, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "If you breast feed, have a few bottles prepped and ready. If not, make sure you have a bottle or 2 ready. I used to keep a bottle of water in the diaper bag (you can buy them in 8oz sizes) and a bottle with the measured out formula ready to mix. \n\nGet a toy or 2 that will hang from the baby's carrier. My son LOVED a set of jingly squirrels I found at Target and a cow that would vibrate and bounce some beads in its belly when a string was pulled.\n\nTry and work around the kid. My son did better in the morning, so I would try and get as much done before noon or so as I could, sometimes that meant 2 days of errands instead of one.\n\nTry and do them all in one day or designate a day or 2 as \"errand\" day. I used to try and get everything done on Wednesdays. I avoided the \"have to have it done first of the week\" crowd as well as the \"waited till the last minute to have it done this week\" crowd. \n\nWhenever possible, use a cart. I'd park next to cart corrals, it might mean walking a bit farther, but I could pull a cart out right next to my car and put the carrier in the cart. When he was bigger and could ride without his carrier, I bought a cart cover (they're GREAT to protect against cold/hot seats and a barrier for germs at cold season.) \n\nSnacks and a couple pacifiers when that time comes. \n\nAlso, just know, sometimes it's not going to work. Prioritize what you're willing to do with a screaming kid, do those things, and try again later for the rest. ", "controversiality": 0, "created_utc": 1354911747, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cvdtw", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430608097, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sendCookiesSTAT", "author_flair_css_class": null, "author_flair_text": null, "body": "I second the extra supplies suggestion, and I will add a \"two diaper bags\" suggestion.  We have an official bag in our car with double supplies, clothes, etc, (always be prepared), then a diaper roll-up in my purse.  The diaper roll up has only the most basic supplies so it is easy to carry, but the scout's bag has everything we could need and can also be carried into a store in a pinch.\n\nEdit: Rollup example- http://www.amazon.com/The-First-Years-Deluxe-Diapering/dp/B003ZK5O4Y/ref=pd_cp_ba_1", "controversiality": 0, "created_utc": 1354911951, "distinguished": null, "downs": 0, "edited": 1354912302, "gilded": 0, "id": "c7cvg0y", "link_id": "t3_14gac2", "parent_id": "t1_c7ctib3", "retrieved_on": 1430608113, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I came here to say this, too.  There is no surefire way of ensure that it will go smoothly every single time.\n\nBest thing to do is just try to be prepared, give yourself extra time to get everything ready, do as much as you can before you leave (feeding, changing), and then hope for the best.  And then just laugh when it doesn't go off without a hitch.  Because it won't.  :)", "controversiality": 0, "created_utc": 1354913396, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cvvwi", "link_id": "t3_14gac2", "parent_id": "t1_c7ctwuy", "retrieved_on": 1430608310, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "46xx", "author_flair_css_class": "lightcoral", "author_flair_text": "10 month baby girl", "body": "My baby used to cry ALL THE DAMN TIME at 7 weeks.  Being a new mom I was terrified of going out with her.  What kept her calm enough to eventually go to sleep was swaddling.  The ones by [Summer Infant](http://www.summerinfant.com/Products/Nursery/Swaddle-Me---Speciality-Blankets/SwaddleMe/SwaddleMe-Three-Pack.aspx) have a slit in the back so you can buckle them in the carseat.  You have to lay the swaddle in the car seat and pull through the buckles, put baby in and then wrap swaddle.  I'd do that and head out the door.  The car ride would usually put her to sleep and the swaddle helped her to stay asleep while I ran my errands.  Here's my [LO asleep](http://i.imgur.com/FpLFa.jpg) while I'm at Target.\n\nAlso make sure diaper bag is packed with everything and then some like extra clothes.  Have everything ready so that after you fed and change the baby you can head right out the door.  Time is of the essence.  White noise helps too so download an app for your phone if you haven't already.  ", "controversiality": 0, "created_utc": 1354914673, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cw9qy", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430608502, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nycmommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I just remind myself that everything does not have to be perfect. If I am 10-15 minutes late to an appointment its not the end of the world. I plan out my errands every Sunday night for the entire week, that way if I don't have time to get to one, no big deal and I can push it back until another day. Don't let your errands and chores own you - plan, take charge, and attack them one at a time. I find looking at things I have to do one at a time makes things much more manageable in my head. ", "controversiality": 0, "created_utc": 1354916697, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cwvbt", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430608775, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "Schedule all appointments for when your baby will be awake already. Feed and diaper before leaving. I went out weekly when my twins were little (and still do). Baby wearing didn't work for me because of back issues so I just had a decent double stroller. ", "controversiality": 0, "created_utc": 1354917375, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cx2h5", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430608873, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "3yo &amp; 2yo girls", "body": "My daughter refused to be put in a carrier from the start. She also hated being swaddled and would scream until you undid the blankets or would undo them herself. At six months, she refuses to use a blanket. \n\nShe's weird, \n\nI just carried her around in her carseat a lot. ", "controversiality": 0, "created_utc": 1354918329, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cxcfg", "link_id": "t3_14gac2", "parent_id": "t1_c7cszxs", "removal_reason": null, "retrieved_on": 1435660712, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "Just go. Have a change of clothes, plenty of diapers, wipes, cream, snacks for you, etc, and go.\n\nYou can't be sure there won't be a blowout. Could happen at any time. It'd be nice if he got it over with with just enough time for you to clean him up before you leave the house, but waiting for it just means you'll spend a lot of time sitting around instead of living.\n\nThe more you go out, the more you'll get used to it and the more relaxed you'll be. Practice if you have to -- go out every day, if only for a little walk or to the grocery store. I used to take my daughter to Starbucks a few days a week. I'd get a coffee or tea and nurse her, and we'd leave when she started to get fussy.\n\nAlso, they just cry in the car. They want you, but they can't see you and you're not holding them, so they cry. I used to take little side-trips down residential streets and alternate pressing firmly on gas and brake pedals. I was just waiting for a cop to pull me over, hear the baby cry as s/he came up to the car, and then just tell me \"nevermind, carry on.\"", "controversiality": 0, "created_utc": 1354919527, "distinguished": null, "downs": 0, "edited": 1354919808, "gilded": 0, "id": "c7cxold", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430609156, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "usofunnie", "author_flair_css_class": "lightcoral", "author_flair_text": "Mary's mom, 1/6/12", "body": "One of the things that made newborn outings good for me was feeding her before we left. I reserved a good hour to hour and 15 minutes before go time to just sit with her and nurse her into giddy oblivion. \n\nI always pack the diaper bag in advance. If we are going out in the morning, the bag is packed the night before. \n\nI also used my moby wrap to snuggle her close so she could snooze and listen to my heartbeat and my voice through my chest. This was especially useful at parties. ", "controversiality": 0, "created_utc": 1354919679, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cxq3f", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430609176, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "Your post is funny to me because it is totally how I feel, after three kids. However, when my first was born, I was like OP. \n\nI was the youngest in my family and never really babysat for babies. My son's diaper was the first I ever changed so going out by myself, with a baby in tow was a big deal.\n\nI started off with little trips. Walks around the block or a drive to the grocery store were great to start.\n\nYou will find a way, OP!", "controversiality": 0, "created_utc": 1354922687, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cyjnd", "link_id": "t3_14gac2", "parent_id": "t1_c7cseqw", "retrieved_on": 1430609634, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "k_hall_313", "author_flair_css_class": null, "author_flair_text": null, "body": "Right! I didn't mean it as rude. I had my little boy with my husband gone on deployment. We live in Washington state and have no family for 2,500 miles. I had one friend that took pics but left soon after. I literally just had to figure it out. But eventually you can't just plan around the baby's naps or feedings, you have to just do what you gotta do. Even with a 14 month old, now that he drinks actual cows milk it is difficult because he likes it slightly warm and obviously I don't carry a jug of milk with me in the car, we just figure it out. Honestly there have been times I had too much stuff with me in preparation, and other times I didn't being enough! It's all just a learning process. We have a second on the way and won't know what the gender is until we have the baby, so if its a girl we will be learning all over again! :)", "controversiality": 0, "created_utc": 1354923276, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cypgr", "link_id": "t3_14gac2", "parent_id": "t1_c7cyjnd", "retrieved_on": 1430609710, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "And each kid is so different! My first was easy going, my second was picky and fussy and my third is a dream baby. No matter what, you gotta do what you gotta do.", "controversiality": 0, "created_utc": 1354923545, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cyrzh", "link_id": "t3_14gac2", "parent_id": "t1_c7cypgr", "retrieved_on": 1430609746, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "zmary", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not going to stay this hard. You're going to find what works for you, and pretty soon you'll be a pro. In the meantime, just keep trying things. The posts that mention baby wearing are right on. Several people also mentioned keeping extra of everything in the car. I kept a box in the back of the car with extra of all diapering supplies, plus a full outfit for me and for baby (even though there was also a full baby outfit in the diaper bag). Also put a full container of wipes, some plastic bags,  and a couple of bath towels in the box. There will come a time when you're glad you have them. :)\n\nPractically, try to do most of your shopping at one place for awhile (like a Target or Walmart). It's worth compromising on favorite brands if you can just be done in one stop. If anyone in your area does grocery delivery, that can be awesome when your baby is really small.\n\nChanging rooms in any department store (including Target and Walmart) can be a quiet refuge if you need to comfort the baby, want to breast feed in private, or just need a minute to collect yourself with a cranky little one. Tell the attendant you'd like to feed the baby and they'll set you up with a room. I've never had a single person refuse, or even look at me funny.\n\nThere's also a lot of truth from the gal who said you've just got to do it. That's true. You just power on and learn more each day. Then a day comes when you think, \"I so have this!\" :)", "controversiality": 0, "created_utc": 1354924003, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7cyw2x", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430609793, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1354927437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7czqvl", "link_id": "t3_14gac2", "parent_id": "t1_c7cypgr", "retrieved_on": 1430610195, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "k_hall_313", "author_flair_css_class": null, "author_flair_text": null, "body": "Aww that is sweet of your husband, talking to the baby like that! And thank you. We are getting used to it now. His ship is one of the unfortunate ones that had back to back deployments, so he missed the first 4 months of our sons life as well as all first holidays and all second major holidays. But second baby is supposed to be born when he's home so hopefully! :) ", "controversiality": 0, "created_utc": 1354927601, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7czsai", "link_id": "t3_14gac2", "parent_id": "t1_c7czqvl", "retrieved_on": 1430610215, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BOSTONDANIELLE", "author_flair_css_class": null, "author_flair_text": null, "body": "And don't forget, it's kinda scary now but my son will be 4 months next week and I got this whole mom thing down pat. I go pretty much everywhere by myself and if he poops everywhere or is fussy, I just deal with it. No one really cares, and if they did well to bad for them. ", "controversiality": 0, "created_utc": 1354929868, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d0bgs", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "removal_reason": null, "retrieved_on": 1435660664, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thefeesh", "author_flair_css_class": "green", "author_flair_text": "Mama to Atlas &amp; Violet", "body": "I would try to go out when Baby is ready for a nap. that way, he'll sleep in the car. or even right after a nap, so you don't need to worry about waking him up as you get in and out of the car. if Baby loves music, try playing that while you're in the car. figure out what he likes to listen to, or just try different things. this works for our daughter. also, always be prepared! I know others have already said it, but make sure you pack EVERYthing you may need before you head out. also, another random tip: if you're ever out somewhere and you need to change Baby, look for a Family restroom before the Women's; some places only have the changing table in the Family rr for whatever reason. :]", "controversiality": 0, "created_utc": 1354933111, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d117x", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430610808, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PInkNinjaCow", "author_flair_css_class": null, "author_flair_text": null, "body": "I never wore my son. We loved the snap and go! Not too expensive, can find it on Craigslist! But it's awesome for those heavy car seats! I've heard great things about the moby wrap too? You just have to learn your kid. Some babies cry no matter what you do. Some are super care free. Just try to relax. They're like dogs, they sense panic. Lol good luck!", "controversiality": 0, "created_utc": 1354934995, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d1g4r", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430610998, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CREAMY_CHICKEN", "author_flair_css_class": null, "author_flair_text": null, "body": "How did you bring your baby on the bus?", "controversiality": 0, "created_utc": 1354936153, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d1pgi", "link_id": "t3_14gac2", "parent_id": "t1_c7cszxs", "retrieved_on": 1430611119, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nacho-bitch", "author_flair_css_class": "purple", "author_flair_text": "Girl 7, boy 3", "body": "This soooo much. I didn't wear my first and that was a huge mistake. With my son I just put him in my ergo carrier and he would sleep and eat the whole time. So much easier than when I would drag a stroller into a changing room at Target to feed my daughter. ", "controversiality": 0, "created_utc": 1354936300, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d1qp6", "link_id": "t3_14gac2", "parent_id": "t1_c7cszxs", "retrieved_on": 1430611136, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "deltadawn6", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously newborns are the least of your worries (I am just finding this out after having my 2nd child 3 weeks ago)  Its the toddlers that are the challenge!  I have found baby wearing to be a great help, they tend to fall asleep while being worn.  ", "controversiality": 0, "created_utc": 1354937895, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d23at", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430611300, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "floodsymalone", "author_flair_css_class": null, "author_flair_text": null, "body": "Use an Ergo! (or other back friendly baby carrier)", "controversiality": 0, "created_utc": 1354939775, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d2ibu", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430611510, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "katyshel", "author_flair_css_class": "purple", "author_flair_text": "3 girls", "body": "i hear what you're saying. ", "controversiality": 0, "created_utc": 1354940009, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d2k7k", "link_id": "t3_14gac2", "parent_id": "t1_c7cseqw", "retrieved_on": 1430611526, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "celtlass", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes!  Ergo is great for breastfeeding on the fly, and it works great for carrying a 2 y/o on your back, too.  I would add a change of clothes and a gallon ziplock or two (for dirty diapers and/or clothes) to the diaper/wipes/changing pad necessities. Also a wallet, phone and camera, because you never know when those moments will happen and you'll wish you'd taken a picture.  The bare necessities for a 4-hour trip can be crammed into a medium-sized purse, around 1'x1'.", "controversiality": 0, "created_utc": 1354941920, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d2z0f", "link_id": "t3_14gac2", "parent_id": "t1_c7d1qp6", "retrieved_on": 1430611720, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beyond_binary", "author_flair_css_class": null, "author_flair_text": null, "body": "My sleepywrap was a lifesaver. I could practically go anywhere, anytime! Well not really, but I could at least do laundry with her very easily. And the dishes once or twice. I still babywear while grocery shopping, tho now we've upgraded to the Ergo. ", "controversiality": 0, "created_utc": 1354944457, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d3hyc", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430611977, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Shadylane85", "author_flair_css_class": "maroon", "author_flair_text": "Mom to 3 boys", "body": "\"Newborns are the easy ones to go out with\" - as the mom of a 5 and 2 year old and a newborn I can vouch for this. \n\nGet a good sling or carrier. If you're nursing invest in a nursing cover. Bring diapers, wipes, change of clothes and bibs or burp cloths. And just don't stress. If the baby gets hungry, grab your cover and fees him. If he's fussy put him in the sling and rock him a little. And don't worry about what anyone else thinks, most people you will encounter understand that babies cry and fuss. ", "controversiality": 0, "created_utc": 1354944748, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d3k2c", "link_id": "t3_14gac2", "parent_id": "t1_c7ctetr", "retrieved_on": 1430611999, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SaShayLaLu", "author_flair_css_class": null, "author_flair_text": null, "body": "I ended up using the bjorn baby carrier. I didn't even think about it until the friend who gifted it to me was like \"DUH! that's why I gave it to you!\" and it made it so much easier! I wore my first until she was able to walk on her own, and then I got one of the dreaded leash packs (IMO it's a must have for city living if you are going anywhere with a toddler who wants to walk) and a easy to carry combi stroller for when she wanted a break from walking (nice because they are far more sturdy than a umbrella stroller, but lightweight enough and had a carrying strap that I could stow it under the bus seat if need be) ", "controversiality": 0, "created_utc": 1354947871, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d45bw", "link_id": "t3_14gac2", "parent_id": "t1_c7d1pgi", "retrieved_on": 1430612272, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SaShayLaLu", "author_flair_css_class": null, "author_flair_text": null, "body": "I ditched the diaper bags by the time baby #2 came along for a small leather laptop carry all. I found it was way easier to clean out (because sooner or later your bag is going to get NASTY from spilled bottles and forgotten diapers, not to mention sippy cuts and crushed cheerios) which was nice because I could use it as my everyday bag even when I didn't have the kids in tow - I just took out the diapers and wipes and was on my way. Plus my husband didn't feel completely silly carrying it around when he was in charge of the kids for the day. ", "controversiality": 0, "created_utc": 1354948119, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d46yy", "link_id": "t3_14gac2", "parent_id": "t1_c7d2z0f", "retrieved_on": 1430612291, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SaShayLaLu", "author_flair_css_class": null, "author_flair_text": null, "body": "my arms ache just thinking about it! but I know how fickle babies can be. My first was only happy swaddled as tight as can be or in the bjorn (no other wrap or sling would do) and my second luckily was a easy going baby and didn't care about anything. ", "controversiality": 0, "created_utc": 1354948181, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d47e3", "link_id": "t3_14gac2", "parent_id": "t1_c7cxcfg", "retrieved_on": 1430612296, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "helendoss", "author_flair_css_class": null, "author_flair_text": null, "body": "TWO extra sets of clothes. Level 5 diapers exist! And can happen more than once in an outing.\n\nAnd give yourself a BIG margin between commitments. If you don't have to hurry, you can relax and care for your baby as he needs it. That is true for toddlers and older too. Allowing a margin really helps you keep your calm.", "controversiality": 0, "created_utc": 1354948440, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d494l", "link_id": "t3_14gac2", "parent_id": "t1_c7ctetr", "retrieved_on": 1430612319, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dourpuss", "author_flair_css_class": "purple", "author_flair_text": "has a little girl", "body": "At 17 months, mine still kicks all the blankets off. It's probably why they make such warm pajamas for kids.", "controversiality": 0, "created_utc": 1354952295, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d4vkj", "link_id": "t3_14gac2", "parent_id": "t1_c7cxcfg", "retrieved_on": 1430612617, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "andrealeeanne", "author_flair_css_class": "purple", "author_flair_text": "Mom of 2 and Doula", "body": "Babywearing does a lot to keep babies calm.", "controversiality": 0, "created_utc": 1354953686, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d52lp", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430612718, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I just had the Ergo (now the Beco) on the front, and my small backpack on my back, with a small packet of wipes, 2-3 nappies, my take-everywhere muslin, and a change of clothes.  That was it.  Now I add some babyfood sachets and a water cup to the mix, but it's still pretty light.\n\nI keep it clean easily: you put the nappies and wipes into a small bag, and then any foodstuffs into another bag, a waterproof \"spongebag\"-style bag can be great.  Or I actually use a little cloth bag at the moment, easy to wash if anything gets on it.\n\nI've always been mystfied by friends loading up prams and pushchairs with these VAST nappy bags and multiple bags of things.  And then they rummage around for ages, and often can't even find/don't even have what they need.", "controversiality": 0, "created_utc": 1354965047, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d67or", "link_id": "t3_14gac2", "parent_id": "t1_c7d46yy", "retrieved_on": 1430613462, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "My Ergo was a dream, I could go shopping/be out with friends for hours in it, and she would sleep/feed/be taken out for a quick nappy change, rinse/repeat.\n\nYou do get a bit of a sore back sometimes, but the more you do it the more your strength grows with their weight.\n\nOnce they're old enough to go on your back (for which I recommend a  Beco Butterfly 2 - just so much easier to do that with, though not good for early breastfeeding) it's like they halve in weight again.", "controversiality": 0, "created_utc": 1354965389, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d68nq", "link_id": "t3_14gac2", "parent_id": "t1_c7cuxme", "retrieved_on": 1430613482, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RatSandwiches", "author_flair_css_class": null, "author_flair_text": null, "body": "I started taking my girl to get groceries every week when she was still really little. For me, it was a case of \"practice makes perfect.\" Just be ready to abandon ship if you have to. ", "controversiality": 0, "created_utc": 1354968012, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d6fzg", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430613570, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Thegivingtreehugger", "author_flair_css_class": null, "author_flair_text": null, "body": "If I have one regret, it's that I didn't learn this soon enough!  My son wanted to be held constantly (and I wanted to hold him!).  I did not get much done!  I tried a Bjorn (didn't like his head against the plastic pieces) and ring sling (he hated it!).  Later I learned about all of the other baby wearing options!  If I have another baby, I will definitely have a Moby Wrap and an Ergo!  Good luck!\nAlso, When I finally bought myself a Bebe AuLait nursing cover, it was incredibly liberating to be able to comfortably nurse everywhere!", "controversiality": 0, "created_utc": 1354974006, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d6zcq", "link_id": "t3_14gac2", "parent_id": "t1_c7d1qp6", "retrieved_on": 1430613815, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Thegivingtreehugger", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes!  Backpack for diaper bag...so much easier to bend and carry baby without something on your shoulder!", "controversiality": 0, "created_utc": 1354974225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d706f", "link_id": "t3_14gac2", "parent_id": "t1_c7d67or", "retrieved_on": 1430613826, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nacho-bitch", "author_flair_css_class": "purple", "author_flair_text": "Girl 7, boy 3", "body": "I had this same problem. A friend gave me a bjorn but it gave me horrible back pain. My daughter would scream bloody murder every time I put her in a sling. The wrap worked great but I hated trying to put it on in a parking lot when I was out shopping so I ended up only using it at home. I got the ergo when my daughter was 2 for a family hike. When our son was born he practically lived in it for the first two months. I even wore him to the park to workout with some of my friends. ", "controversiality": 0, "created_utc": 1354985764, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7d8vcj", "link_id": "t3_14gac2", "parent_id": "t1_c7d6zcq", "retrieved_on": 1430614706, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "techchicmom", "author_flair_css_class": null, "author_flair_text": null, "body": "Try to keep your time out short and sweet. Have a plan before you leave, so you don't waste time and have to leave before you've done everything you wanted to. Try to go out while he's sleeping--you can get a lot more done. Dress as comfortably as possible--leggings and a nursing top was my uniform for months. Good luck! You'll be fine : )", "controversiality": 0, "created_utc": 1355107245, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7e0bo4", "link_id": "t3_14gac2", "parent_id": "t3_14gac2", "retrieved_on": 1430628089, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shmeeblybear", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed- getting out of the house is so important to make a new mom feel like a real person again. Obviously there are exhausting, overwhelming days when it just doesn't happen. But do the best you can, leave the house prepared and enjoy some time outside. My son has always enjoyed being outside himself- he gets cranky when he's cooped up for too long.", "controversiality": 0, "created_utc": 1355115772, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7e2xk2", "link_id": "t3_14gac2", "parent_id": "t1_c7ctib3", "retrieved_on": 1430629828, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pockiiee", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a very big baby, and he gets too hot/hates the carrier for newborns. I will try again at three months with an outward facing, but for now he really dislikes them.  I was so excited to get one and have had no luck with it. \n\nIf this happens to you, I got a stroller with a very cool bassinet attachment - he sleeps everywhere and I take public transit a lot, so he just relaxes in bassinet. Much better than those uncomfortable looking car seat travel systems, he can scooch around - and we also use the bassinet for daytime naps in the house.", "controversiality": 0, "created_utc": 1355273407, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7f46v0", "link_id": "t3_14gac2", "parent_id": "t1_c7cxcfg", "retrieved_on": 1430647816, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "She is about 6 months old now and sits up unsupported really well, so I mostly just put her in her stroller these days. \n\nThings to do next time with the next baby, I suppose. ", "controversiality": 0, "created_utc": 1355273609, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7f490g", "link_id": "t3_14gac2", "parent_id": "t1_c7f46v0", "retrieved_on": 1430647845, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}