{"submission": {"author": "Offonjupiter", "author_created_utc": 1348711371, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_94wzp", "created_utc": 1356285674, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/15c0ky/formula_rant/", "gilded": 0, "id": "15c0ky", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 164, "over_18": false, "permalink": "/r/Mommit/comments/15c0ky/formula_rant/", "retrieved_on": 1413266078, "score": 52, "secure_media_embed": {}, "selftext": "I am unable to breastfeed. There, I said it. I'm not ashamed. I gave it 110% but in the end, it wasn't enough. My daughter wasn't gaining weight, I developed an awful infection and it was affecting my bonding with my child. \nSo now she's on formula. She eats and is happy. She's thriving and alert. It was the best decision. However, the hatred among formula is so thick, it's intimidating to feed her in public for fear of backlash. I get that breast milk is best. I understand that it's \"the perfect food\" for the Baby, but it's out of the cards for us. So why does it seem like everywhere I go, there's something or someone trying to shove it down my throat? Even some formula literature I picked up at the Dr.s office has BREAST IS BEST all over it. That seems incredibly insensitive to people who CAN'T breastfeed, not want to. Am i being overly sensitive?\n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Formula rant", "url": "http://www.reddit.com/r/Mommit/comments/15c0ky/formula_rant/", "user_reports": []}, "comments": [{"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "No your not. I keep getting the same, I was like you I just was not bonding. Breast milk is not perfect. It does not have vitamin D! Breast is best is not best for everyone, if it works for you great. But it did not me , and it was my choice! My daughter is also happy healthy and thriving at 6.5 months she is sitting up army crawling and is a smarty pants! ", "controversiality": 0, "created_utc": 1357697837, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7tkksx", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430900953, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ambomb", "author_flair_css_class": null, "author_flair_text": null, "body": "Whoever gave you Bossypants is a genius.", "controversiality": 0, "created_utc": 1358192925, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7wu1i7", "link_id": "t3_15c0ky", "parent_id": "t1_c7lk6lu", "retrieved_on": 1430958986, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Meg_Shark", "author_flair_css_class": null, "author_flair_text": null, "body": "That person saved my life. Over and over. ", "controversiality": 0, "created_utc": 1358196736, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7wvca2", "link_id": "t3_15c0ky", "parent_id": "t1_c7wu1i7", "retrieved_on": 1430959694, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "For the first three months of my child's life I was terrified of breastfeeding in public. I think new mothers are sensitive no matter the circumstances, hun.", "controversiality": 0, "created_utc": 1356287028, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l3gfz", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430752871, "score": 65, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alleycat24", "author_flair_css_class": null, "author_flair_text": null, "body": "I was the same. I was so determined that I would be viewed as a failure if I didn't that I put too much pressure on myself and it affected my bond with my baby. He's now 14months, has been walking since 11 months and has so far been strong and healthy and is the centre of my world. I had a community midwife that caused the pressure. She made me believe it was easy, natural and wonderful and that I would ONLY bond with my baby through breast feeding. Load of nonsense. I will try to breastfeed the next baby I have because I do think if you can you should try but I am not ashamed to say I will use formula if I need to. No you're not being over sensitive, it is annoying that there is a stigma to it and nobody seems to consider the depression it can cause to a woman who would if she could. I think the bond between you and your baby is the most important thing there is. ", "controversiality": 0, "created_utc": 1356287614, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l3ltb", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430752937, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ZombieinmyHead", "author_flair_css_class": "purple", "author_flair_text": "Sons, 7 and 1", "body": "You're not being over sensitive; I've been there. My milk supply never came in, so while I could feed my son about an ounce or so, most of his nutrition came from formula. I still wince whenever I hear someone rail against formula or see \"breast is best\" on everything, even though I know I did what was best for my son. \n\nBut here's the thing: as a mom, pretty much every action you take is held up to scrutiny. How you feed your child, whether you co-sleep, how you discipline your child, whether or where you send them to preschool--it's all out there, and people think it is okay to judge you for it, because it's all for the good of the child, you know. As you get more experienced at parenting, you will develop more confidence and will be less vulnerable to these criticisms. ", "controversiality": 0, "created_utc": 1356287984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l3pc4", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "removal_reason": null, "retrieved_on": 1435655161, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "roxyskyy", "author_flair_css_class": null, "author_flair_text": null, "body": "I was unable to give my baby breast milk. We tried but he was in the nicu and we weren't able to work on latching. Then the LC here isn't very helpful making it even more stressful when asking for advice. So we tried pumping...which was successful for two days and then my supply was down to half an ounce and I started to feel like a failure. This was no good. We had him on formula which caused him to become constipated causing me to feel horrible because he was pooping perfectly with my milk. I held my breath when the doc asked if I was breast feeding because I know there is stigma with formula but then I realized there is stigma with both so why care? My baby is now on a better formula, poops like a champ, and he's happy and healthy. That's all that matters in the end. You're sanity is worth more when you're happy and they're happy, too. Hope this helps!", "controversiality": 0, "created_utc": 1356288270, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l3s1x", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753012, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whovianinthetardis", "author_flair_css_class": null, "author_flair_text": null, "body": "It is funny you say that because I get shy breastfeeding in public. There is such a stigma about feeding in public I feel weird not giving a bottle. You have to do what is good for you. I couldn't handle breastfeeding my first so for the sake of my sanity I went to formula. I felt so much better, I was able to be a better mother. Good luck", "controversiality": 0, "created_utc": 1356290053, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l48cb", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753231, "score": 35, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cheersfolks", "author_flair_css_class": null, "author_flair_text": null, "body": "You are NOT being oversensitive. People are jackasses.\n\nThis is the thing that gets me. There is nothing wrong with formula. It drives me wild when there is a witch hunt against mothers who formula feed. One critique I hear a lot is that the children will be less intelligent. UGH! Breastfed babies are not smarter because of it. My partner was never breastfed a day in his life. I was breastfed for nine months. He is way smarter than me. He's actually more intelligent than anybody I know personally.\n\nYou end up with these moms who are putting themselves through physical torture, starving their children, and becoming depressed because they think and they are told they are failures if they formula feed.\n\nSure, breastfed kids have a higher immune system in the beginning, but children can develop immunities in other ways.\n\nThis is just the same as cry-it-out and the co-sleeping discussions. People get so heated on both sides of the argument. Newsflash people: neither method is evil. Different things work for different families. As long as your kid is happy and healthy it shouldn't matter how you're raising them. There are so many people who believe that their way is the right and only way. \n\nBreast or formula . . . is your child fed? Yes? Awesome. You are doing a great job as a mom.", "controversiality": 0, "created_utc": 1356290543, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l4cp1", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753296, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "milleniajc", "author_flair_css_class": "maroon", "author_flair_text": "boy junior &amp; baby girl", "body": "As Crimson_Serenity said, we might all be sensitive when we first start off. I was breastfeeding and always scared to go out and do so in public. Even with a cover! And since my son was always big (95th percentile) I felt like people would judge because I was STILL breastfeeding. Why is there always this competition between mothers? As long as we are taking good care of our children we should all be on the same team. ", "controversiality": 0, "created_utc": 1356291758, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l4ndz", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753423, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "Where the hell do you people LIVE to feel the backlash of using formula?\n\nI live really fucking close to SF in CA and I get shit for BF and NOT bottle feeding constantly.\n\n Newsflash, since we became mothers everything we DO is \"wrong\" and critiqued to death because obviously the person who is critiquing us has 110% PERFECT children 110% of the time. ", "controversiality": 0, "created_utc": 1356292606, "distinguished": null, "downs": 0, "edited": 1356292833, "gilded": 0, "id": "c7l4v8e", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753526, "score": 42, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "calyx13", "author_flair_css_class": null, "author_flair_text": null, "body": "With my first son I had plenty of milk and he couldn't latch. I pumped and pumped and pumped, developed super awful PPD and had to go on meds incompatible with breast-feeding. He went on formula. He did great.\n\nWith my second son he had a GREAT latch. I had no milk. I would pump 8 times a day and I would get just over 2 ounces. It was taking a huge toll on everything and I didn't think it was worth the detriment to our family. He went on formula. He did great.\n\nBreast milk is best. Formula works. Both times I had to stop giving breast milk I grieved. I felt like I was failing my children in the most basic way. Now that I look back objectively and see how happy and healthy they are it pisses me off how much time and energy I wasted. \n\nIf your kids are healthy and you're doing the best that you can for them then fuck everyone else. It's none of their business. ", "controversiality": 0, "created_utc": 1356292949, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l4ybj", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753575, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smarty_skirts", "author_flair_css_class": "green", "author_flair_text": "Twin Boys born 4/2012", "body": "But if you are breast feeding in public you can feel like a brave woman doing what is your right to do. The stares and disapproval from other women when you bottle feed in public are humiliating. There is a difference.", "controversiality": 0, "created_utc": 1356293273, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l515z", "link_id": "t3_15c0ky", "parent_id": "t1_c7l3gfz", "retrieved_on": 1430753610, "score": -20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Snugglepuss1", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think you're being overly sensitive, you absolutely have to do what's best for you and your baby. A little perspective may help though. For many years, formula companies with HUGE marketing budgets set out to tell the world that breast milk was inferior to man made formula. A lot of the \"breast is best\" is an attempt to undo that mindset to encourage more women to breastfeed. It's true that ounce for ounce breastmilk is best, BUT babies need to be fed and mammas need to make choices that are reasonable for them as well. \nFor me, I do half and half, because I don't make enough milk. For me the \"breast is best\" hit me hard because I had a lot of emotional attachment to breast feeding and it has taken me some time to acknowledge my own grieving that it has not worked out as planned. That's allowed me to be a little less reactive to the anti-formula messages. ", "controversiality": 0, "created_utc": 1356293282, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l518l", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753610, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HezaNormandy", "author_flair_css_class": "purple", "author_flair_text": "Vinny's mom!", "body": "So glad to find someone else who shares this feeling. I couldn't breastfeed either, luckily never had too much pressure from my family or friends, but god forbid I get on the internet. My mom actually was very supportive of formula feeding because she is a nurse and knew I wouldn't be able to produce much. Either way, as long as the baby is happy and healthy it doesn't matter. People can say whatever they want but breastfeeding or not does not make the child turn out a certain way. You are not being over sensitive, the \"breast is best\" movement has been taken way out of proportion. If anyone gives you crap for formula feeding, tell them to fuck off. Your baby, your decision, and other people should not question you about personal choices, no matter what drove you to make them.", "controversiality": 0, "created_utc": 1356293283, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l5194", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753610, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Alidpayne", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is 6 months old. She was born 5 weeks early &amp; refused to latch no matter how many lactation consultants we saw. I pump &amp; give her breast milk in a bottle. I have also been made to feel inadequate. People firstly assume it is formula (not that it is their business). Other people see me with the bottle &amp; say \"oh. I thought you were breastfeeding.\" Um excuse me. I AM. Why does it matter if she gets it directly from my boob or from a bottle? I thought the point was to give her the milk? I do have a great support group that is amazing though. ", "controversiality": 0, "created_utc": 1356293554, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l53o1", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753645, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "Being harassed and yelled at about how you are indecent, why didn't you cover up etc is not feeling like a \"brave woman doing what is your right to do.\" Having people STARE at you with disgust. It's demoralizing and dehumanizing.Even worse is the comments since BF babies eat more often and are thinner so OBVIOUSLY we are starving them for our sick needs. It causes many women to quit actually.", "controversiality": 0, "created_utc": 1356293903, "distinguished": null, "downs": 0, "edited": 1356294125, "gilded": 0, "id": "c7l56r6", "link_id": "t3_15c0ky", "parent_id": "t1_c7l515z", "retrieved_on": 1430753679, "score": 27, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "Not when people stare at you like you are exposing yourself when you could just as easily feed your child from a bottle because we have the technology or shame on you why don't you stay inside your house... :(\n\nOnly in the last few months have I actually gained the confidence to breastfeed without a cover... mostly because he's now at an age (almost 7 months) where he refuses to allow one to be over his head anymore.", "controversiality": 0, "created_utc": 1356294139, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l58wq", "link_id": "t3_15c0ky", "parent_id": "t1_c7l515z", "retrieved_on": 1430753706, "score": 30, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kimmyKat", "author_flair_css_class": null, "author_flair_text": null, "body": "You tried! I have to admit that I am a little insensitive to women who don't try. Breast is best is just a disclaimer to encourage women and you shouldn't take it personally. I understand though, I would be heartbroken if I couldn't breastfeed and I would feel defensive. Just try and remember that you did what was best for your little one.", "controversiality": 0, "created_utc": 1356294348, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l5atj", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753730, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SuzyGreenberg", "author_flair_css_class": "purple", "author_flair_text": "2 yo girl, #2 due June 2013", "body": "One of my BFFs went through something almost identical. http://www.fearlessformulafeeder.com/ was her lifeline. I hope you'll visit it.", "controversiality": 0, "created_utc": 1356294662, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l5don", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753783, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dmxio", "author_flair_css_class": "orange", "author_flair_text": "9 yr boy 7 yr girl 3 yr boy", "body": "I'm a HUGE breastfeeding supporter and I truly believe that it's not best for everyone. You gave it a really good try and it wasn't working for you and your child. The bond you are creating even with bottle feeding will last a life time. Breast feeding at best is a few weeks to a few years of a child's life. I try to not to judge any one because I don't know the struggles that they have gone to before reaching what ever decision they have come to. Just love you baby as you see best for you and your family and tell the others to screw it. ", "controversiality": 0, "created_utc": 1356294863, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l5fid", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753797, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gnarleyandsnarley", "author_flair_css_class": null, "author_flair_text": null, "body": "What planet is it where people come up and make these comments to you? I get that you might be feeling a little guilty (I am also new to mom guilt - good times) about it or insecure, but my two cents? Breast might be best in general, but that didn't work out so you're doing the best for your baby. You saw there was a problem and you have acted in the best interest of your baby. Anyone has a problem, they can take a long walk off shut the hell up. Even for moms who choose to feed formula right from the get go - that is their choice and no else's business. ", "controversiality": 0, "created_utc": 1356294872, "distinguished": null, "downs": 0, "edited": 1356295493, "gilded": 0, "id": "c7l5flq", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753799, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "knottymommy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is where I get really upset by the whole breastfeeding campaign.  It is important for parents to have all the facts to make informed decisions.   However, we have come from one extreme where people, like my grandmother, who wanted to breastfeed, were told \"No, you don't,\" and given a shot to dry up their milk, to the other extreme where people who can't or don't want to breastfeed feel vilified for bottle-feeding.\n\nFeed your baby.\n\nDo not let anyone make you feel guilty for doing what you need to do for your family.\n\nIf anyone has the nerve to say anything to you, I would ask why they care what your baby eats?  Or just tell them it's none of their business...because it's not.", "controversiality": 0, "created_utc": 1356296518, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l5uav", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430753985, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vmt_nani", "author_flair_css_class": null, "author_flair_text": null, "body": "Your baby's getting fed, and you are healthier and happier. You don't need to justify to anyone but yourself.", "controversiality": 0, "created_utc": 1356296538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l5uhi", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "removal_reason": null, "retrieved_on": 1435655108, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jezebelunicorn", "author_flair_css_class": "green", "author_flair_text": "Wyatt Colm - 6 months", "body": "Yes formula isn't great nutrition wise, but it works. I am 33 and was formula fed, but I am lucky enough to breastfeed my 10 month old. Breastmilk is best, but cow's milk formula works-[it just doesn't compare nutrition wise](http://doublethink.us.com/paala/wp-content/uploads/2012/11/whats-in-breastmilk-poster-canada.jpg). One can always get donor milk from another mama, rather than give the cow formula= [human milk for human babies](http://www.hm4hb.net/).", "controversiality": 1, "created_utc": 1356297558, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l63gk", "link_id": "t3_15c0ky", "parent_id": "t1_c7l4cp1", "removal_reason": null, "retrieved_on": 1435655098, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I live in the Inland Empire of CA (Fort Irwin to be exact.) and people here just are so down on formula feeding. I was at a Christmas party for my husband's work and my baby was hungry. I pulled out a can of formula and I got some nasty looks. I hate that people look down on people for their choices in how a mother chooses to feed her child. They don't know the story behind it, so they should just back the fuck off.", "controversiality": 0, "created_utc": 1356297606, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l63uw", "link_id": "t3_15c0ky", "parent_id": "t1_c7l4v8e", "removal_reason": null, "retrieved_on": 1435655096, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "&gt; They don't know the story behind it, so they should just back the fuck off.\n\nGOD this should be the mantra for everything lol. Seriously. I had a premature baby who is sometimes a \"bit behind\" but was born longer and heavier than most babies in gestational age so people think they know **everything.** What ever happened to take the advice what works for you and what doesn't who cares?", "controversiality": 0, "created_utc": 1356297831, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l65u2", "link_id": "t3_15c0ky", "parent_id": "t1_c7l63uw", "retrieved_on": 1430754157, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunnyjun", "author_flair_css_class": null, "author_flair_text": null, "body": "I totally agree. I feel paranoid like everybody is judging me. What is worse is I was to set on breastfeeding. My daughter does half and half... But most of the time when we aren't home she screams till she gets a bottle. Its so disappointing for me...But you do what you gotta do. I have family that has told me the formula is poison.... &amp; that all I need to do is co sleep &amp; breastfeed her whenever she is hungry. Well I have tried all that &amp; I am not going to starve my baby. \nIt is really sad that people are so judgmental  \nHang in there you are not alone ", "controversiality": 0, "created_utc": 1356297876, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l668q", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754161, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "With all due respect, not everyone feels comfortable with getting milk from other moms without it being screened. Frankly, I would never do it for TONS of reasons but I will spare you since you will feel judged. Also if you were to get it through milk banks it's very expensive. \n\nI also EBF.", "controversiality": 0, "created_utc": 1356297992, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l679c", "link_id": "t3_15c0ky", "parent_id": "t1_c7l63gk", "retrieved_on": 1430754176, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jezebelunicorn", "author_flair_css_class": "green", "author_flair_text": "Wyatt Colm - 6 months", "body": "I don't feel judged for anything I choose to do, also not taking things personally really helps. I'm pretty sure if you EBF, then you would have no need for a donor. The WHO also says #1 food choice is your Breast milk #2 another person's breastmilk #3 formula. People are too quick to give formula without looking into other human milk. No one should feel bad for any choice they make, but I do think many mothers don't even consider the human milk option.", "controversiality": 0, "created_utc": 1356298305, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l69xs", "link_id": "t3_15c0ky", "parent_id": "t1_c7l679c", "retrieved_on": 1430754205, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "adylina", "author_flair_css_class": null, "author_flair_text": null, "body": "No one is comparing you feeding your child a bottle to a sex act or saying that you should do it in a bathroom/under a blanket/in your car. It's very, very different. ", "controversiality": 0, "created_utc": 1356298450, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l6b77", "link_id": "t3_15c0ky", "parent_id": "t1_c7l515z", "removal_reason": null, "retrieved_on": 1435655090, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "&gt;One can always get donor milk from another mama, rather than give the cow formula= human milk for human babies.\n\nYou are basically telling women that using a strangers milk is better than using formula even though there are dangers involved in that. It's coming off judgey and it's bothering me a little bit. I also missed the WHO saying using unregulated BM is a good idea.", "controversiality": 0, "created_utc": 1356299015, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l6g2a", "link_id": "t3_15c0ky", "parent_id": "t1_c7l69xs", "retrieved_on": 1430754296, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "OH MY GOD THANK YOU. When I read \"formula rant\" I thought you were going to shit all over moms who formula feed.\n\nI was in the SAME EXACT POSITION. My heart was SET on exclusively breastfeeding. Well, (VERY) long story short, it just wasn't in the cards for me.\n\nI left (and actually got KICKED OUT) of a few of my mommy groups because I had ***NO CHOICE** but to formula feed. They treated me like I was poisoning my child. Like I wasn't giving her food, I was giving her dirt. I'm ashamed to feed her in public, I have to do it in my car, because I get dirty looks from women (and some men) for feeding her from a bottle.\n\nWell guess what? My baby girl (4 months) is not only the happiest baby on the block, but her doctor said she's extremely healthy, the perfect weight, and VERY ADVANCED physically and mentally.\n\nPeople who are against formula say it will cause ear infections and make them sick (NONE so far!). One of my former mommy groups told me that the more I feed her formula, the more I'm increasing the risk of her dying from SIDS. They actually ACCUSED me of not trying hard enough to breastfeed. \n\nI hate moms who think they're high and mighty because they had no issue breast feeding. I looked into milk donations, they were very hard to come by. How am I suppose to rely on that to feed my child's growing appetite every 2 hours, every day?\n\nMy daughter is only 4 and half months old and she rolls around everywhere, scoots across the room, can sit up on her own for a couple minutes, and stand while holding onto my fingers. TAKE THAT!\n\nAnyway, I ranted. You got my feels!\n\nADDED: Also, one of those mommy groups was a group on facebook called Evolutionary Parenting. The lady who ran the page told me, \"You shouldn't be offended by people who tell you formula is horrible or feel guilty for not breastfeeding, because if you do feel that way, maybe you ARE doing something wrong. Our bodies were meant to feed babies, and our babies were meant to drink our milk. It's our nature. You feel guilty because you are going against nature and you are offended because you know we are right.\" \n\nI left that group immediately.", "controversiality": 0, "created_utc": 1356299952, "distinguished": null, "downs": 0, "edited": 1356300855, "gilded": 0, "id": "c7l6o5f", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754374, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "I live in Southern California, and people give me SO MUCH SHIT for it.", "controversiality": 0, "created_utc": 1356300202, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l6q86", "link_id": "t3_15c0ky", "parent_id": "t1_c7l4v8e", "retrieved_on": 1430754401, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "Where do you live? I am the odd one out for breastfeeding. I don't know anyone my age who breastfeeds.\n\nThe grass is always greener...\n\nEdit: I actually do both breastfeeding and formula. ", "controversiality": 0, "created_utc": 1356300512, "distinguished": null, "downs": 0, "edited": 1356301505, "gilded": 0, "id": "c7l6sx0", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754439, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "First of all, I was very very uncomfortable with getting donor milk, but I looked into it. It is NOT as easy to come by as they tell you. It's expensive, it's a hassle to obtain, there are risks to it, and when you have a baby who has a growing appetite and needs to eat every 2 hours, it gets very cumbersome. I don't want to sound rude, but that is what hurts the most. That we don't have any option but a \"#3\" on the list. That's simply not true.", "controversiality": 0, "created_utc": 1356300596, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l6tmf", "link_id": "t3_15c0ky", "parent_id": "t1_c7l69xs", "retrieved_on": 1430754447, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "Upvote for username.\n\nYou're comment was good, too.\n\nEdit: autocorrect can't grammar...", "controversiality": 0, "created_utc": 1356301408, "distinguished": null, "downs": 0, "edited": 1356355339, "gilded": 0, "id": "c7l70lf", "link_id": "t3_15c0ky", "parent_id": "t1_c7l48cb", "retrieved_on": 1430754538, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jezebelunicorn", "author_flair_css_class": "green", "author_flair_text": "Wyatt Colm - 6 months", "body": "I'm not judging, people really need to get over themselves. I was pointing to facts, yes formula works, I've said that. Human milk for human babies is best, that is all.", "controversiality": 0, "created_utc": 1356301459, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l7119", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6g2a", "retrieved_on": 1430754551, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Wife_approved", "author_flair_css_class": null, "author_flair_text": null, "body": "They kicked you out?  How horrible! ", "controversiality": 0, "created_utc": 1356301889, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l74sx", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6o5f", "retrieved_on": 1430754602, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bttrflysteph", "author_flair_css_class": null, "author_flair_text": null, "body": "You need to do what is best for YOUR child and YOURSELF. I breastfed two out of three of my kids. My second had colic and reflux so badly- that boy cried for the first year and a half of his life. It was hell. We tried numerous formulas before settling on soy. It was the best decision for him, bc it decreased the crying. He started to get better once he was on complete table food. I also got mastitis so badly with him. You tried, I applaud you for trying. Every baby is different. You need to meet your daughter's needs and not let the boob nazis put you down! I understand breast is best, but it's not best for ALL babies! ", "controversiality": 0, "created_utc": 1356301931, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l755p", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754598, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Your name is pretty awesome also.. :)\n", "controversiality": 0, "created_utc": 1356302047, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l765j", "link_id": "t3_15c0ky", "parent_id": "t1_c7l70lf", "retrieved_on": 1430754616, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ShannonOh", "author_flair_css_class": null, "author_flair_text": null, "body": "There is an inherent problem in the issue of both supporting breastfeeding and not being critical of formula users. On the one hand, the majority of women are not set up for success by their support structures, so it is important to kind of \"market\" breast is best, AND to facilitate it. But breast-is-best marketing, while important, also can be quite upsetting for those who need formula. So there's a significant tension that I'm not sure is avoidable until there's an overhaul of the culture surrounding Breastfeeding in the US. \n\nI'm sorry that people seem critical. That super sucks.\n\nI have a cousin who is Breastfeeding her son but gives him formula after each feed because he \"seems hungry.\" This action will eventually ruin her supply, which is already dwindling. But due to sensitivity and the shushing by her MIL, I can't talk about this with her at all. There are so many who use formula in a way that ruins their chances of Breastfeeding that in order to support more successful Breastfeeding the formula gets vilified.\n\nI'm rambling. But the point is that discouraging formula is important to raise Breastfeeding rates and its really unfortunate that as a culture we can't seem to balance that such that we don't make moms who use formula out to be the bad guys.\n\n\nDon't know why autocorrect keeps capitalizing Breastfeeding.", "controversiality": 0, "created_utc": 1356302711, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l7bun", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754687, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inderpwetrust", "author_flair_css_class": "green", "author_flair_text": "JJ 03-09-12", "body": "This can be such a nasty subject from both sides because of one thing: misinformation. Women are told they can't breastfeed because of A, B or C reason when really all they need is some gentle coaching or a latch study. Women are *unable* to breastfeed because of A, B or C reason so they use formula, and they're made to feel like failures because of it.\n\nWomen's breasts are there to feed their children. We are mammals, it's what we do. But, we are also human beings with SCIENCE! on our side. When a woman cannot, or *chooses* not to breastfeed their child, there is a viable alternative, when before there wasn't and children *died*. \n\nWe all need to just stop with the bitchiness and both leave each other alone to raise our children *and* be there for each other. This is getting tired.\n\n-Signed \nHas exclusively breastfed for nine months but was thankful for the formula when she ran into trouble in the beginning.", "controversiality": 0, "created_utc": 1356304195, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l7on1", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754854, "score": 32, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "oskuskaktus", "author_flair_css_class": null, "author_flair_text": null, "body": "Formula is engineered to feed your baby, it is the very best you can possibly give your child. Just as good as breast milk.", "controversiality": 0, "created_utc": 1356304290, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l7pez", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430754863, "score": -12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Yep. This breast vs. Bottle stuff is pulling moms into two groups and it's awful. I mean, we come to mom groups for support, not to be shamed and labled. Because I had to formula feed, I got put into a category with moms who spank and cry it out and stuff (I'm against, but I'm also an AP style mom). I was actually told by one mother that formula feeding is basically child abuse.", "controversiality": 0, "created_utc": 1356304396, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l7qah", "link_id": "t3_15c0ky", "parent_id": "t1_c7l74sx", "retrieved_on": 1430754875, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "Right but you stated human milk from an unknown source that technically hasn't been screened is better than formula. I would never use another woman's milk unless it was screened by a milk bank. That would be financially impossible for only breastfeed for me at the current rates. I think formula is safer in that regards because there is less risk of disease(Microbiologist here). I wish milk banks were as cheap as formula though but stating that human milk from an unknown source is safer than formula is where I call BS because unless the unknown source is healthy- which  for all you know they are HIV positive and the virus isn't testing positive yet- it isn't.\n\nLike I said luckily I managed to breastfeed.", "controversiality": 0, "created_utc": 1356304546, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l7rif", "link_id": "t3_15c0ky", "parent_id": "t1_c7l7119", "retrieved_on": 1430754893, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356305612, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l80ou", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755025, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "&lt;3\n\nBTDT...I chose not to BF either because it was affecting my mental health. I did what you're doing, I posted my issues on a public \"mommy\" board and holy crap, the backlash was amazing. There was a group led by one particular boobie bully who swore she would use my ISP # to locate me so she and her friends could camp out at my (then) place of work and stage a \"nurse in\". O.O", "controversiality": 0, "created_utc": 1356305625, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l80sz", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755028, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xixoxixa", "author_flair_css_class": "blue", "author_flair_text": "Demon (6) Demoness (9)", "body": "I grew up in the inland empire, and I know Irwin still falls under the IE, but holy-hell are you out in the middle of fucking nowhere.  I *hated* going to Irwin.", "controversiality": 0, "created_utc": 1356306270, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l86a4", "link_id": "t3_15c0ky", "parent_id": "t1_c7l63uw", "retrieved_on": 1430755092, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Anthrosaurus", "author_flair_css_class": "blue", "author_flair_text": "Asher 11/12/12", "body": "I'm about six weeks into this whole motherhood thing and if there is one thing that I've learned it's that breastfeeding is *hard.* You are doing your best and your baby is getting what she needs. Don't let anyone make you feel bad about that. I'll pass on the words of wisdom from my pediatrician-do what you need to do right now, in three years no one will give one hoot how you fed your infant now :) \n\nedit: good at sentence structure I am.", "controversiality": 0, "created_utc": 1356306932, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l8bpy", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755156, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Offonjupiter", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! ", "controversiality": 0, "created_utc": 1356308828, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l8rna", "link_id": "t3_15c0ky", "parent_id": "t1_c7l5don", "retrieved_on": 1430755363, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Blahblee", "author_flair_css_class": "green", "author_flair_text": "Liam &lt;3 ~ 7/2/09", "body": "I couldn't breast feed either due to having a breast reduction when I was 16 years old. If it doesn't work, it doesn't work. It's not your fault. It's amazing how others react to things without knowing the whole story. It's ridiculous. We don't know what other people are going through so we shouldn't judge! ", "controversiality": 0, "created_utc": 1356308847, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l8rt6", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755366, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Offonjupiter", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow! I'm shocked at some of the stories on here, but the support has been amazing. It's so nice to know that I'm not alone in this. I love this subreddit. Thank you!!!", "controversiality": 0, "created_utc": 1356309156, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l8ue7", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755401, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Offonjupiter", "author_flair_css_class": null, "author_flair_text": null, "body": "That is so unreal! I can't believe how ballsy some moms get!", "controversiality": 0, "created_utc": 1356309188, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l8unq", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6o5f", "retrieved_on": 1430755403, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "It totally took me off guard! How does someone justify telling a mom that?", "controversiality": 0, "created_utc": 1356309796, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l8zld", "link_id": "t3_15c0ky", "parent_id": "t1_c7l8unq", "retrieved_on": 1430755467, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rationalgia", "author_flair_css_class": null, "author_flair_text": null, "body": "I grew up in the South Bay, and my first was born in Berkeley. I literally never met a single woman who formula fed.", "controversiality": 0, "created_utc": 1356309939, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l90ro", "link_id": "t3_15c0ky", "parent_id": "t1_c7l4v8e", "removal_reason": null, "retrieved_on": 1435655029, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "itsthateasy", "author_flair_css_class": null, "author_flair_text": null, "body": "wow, you didnt deserve all those down votes\n\nthanks for the info. i was lucky to have zero problems breast feeding my little girl, but i admire women who donate milk for needy babies!", "controversiality": 0, "created_utc": 1356311128, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9aif", "link_id": "t3_15c0ky", "parent_id": "t1_c7l63gk", "retrieved_on": 1430755627, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jillsmo", "author_flair_css_class": "purple", "author_flair_text": "2 boys, 10 and 7", "body": "I formula fed both my kids and I live in BERKELEY. I, too, was embarrassed to do it in public and I did get comments and looks. But, just like people who object to breastfeeding in public, those people need to get the hell over it. Your kid needs to eat, no matter the location. And other people are assholes.", "controversiality": 0, "created_utc": 1356311176, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9awn", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755631, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raanne", "author_flair_css_class": "green", "author_flair_text": "2 boys (3 &amp; 1)", "body": "I'm glad someone posted this blog - it was a lifesaver for me with my first after my books dried up while exclusively pumping bc he wouldn't latch. Great blog with respect to dealing with formula guilt.", "controversiality": 0, "created_utc": 1356311268, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9bmr", "link_id": "t3_15c0ky", "parent_id": "t1_c7l5don", "retrieved_on": 1430755644, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hollysglad", "author_flair_css_class": "maroon", "author_flair_text": "2 within 22", "body": "I hear you!  I am unable to breastfeed as well and I'm getting so much crap from other people for it.  I did it for 3 months with my daughter and then got put on a medicine that would get into my supply so I had to stop.  I started exclusively on formula after I had my son so I could take my medicine.  I have been told I'm selfish and that my needs should be put after my kids.  But I look at it this way, if I don't take this stuff and take care of myself, then I can't take care of them properly.  There is no problem with having them on formula.  They are growing well and have the nutrition they need.  Don't feel bad!  It's not for everyone, even if they were able to breastfeed and just didn't want to.  It's not like they are being neglected.", "controversiality": 0, "created_utc": 1356311631, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9ehj", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755663, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LiaWing", "author_flair_css_class": null, "author_flair_text": null, "body": "Similar situation here with the NICU issues causing problems getting started... \n\nRepeat double mastitis was the final straw for us, though.", "controversiality": 0, "created_utc": 1356312691, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9n8f", "link_id": "t3_15c0ky", "parent_id": "t1_c7l3s1x", "retrieved_on": 1430755777, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "zombiesinlondon", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice's mama, Shiloh's rara", "body": "My partner tried her hardest to breastfeed and it just didn't work for her and baby.  She tried until she was in tears and breaking down every time the baby just wasn't getting enough.  We switched to formula.  I'm going to tell you what i told her.  You tried, it didn't work, so you made the best decision for your baby.  Your baby is better for it.  A good mom isn't the boob or the formula, it's doing what's best for your baby.  And you did that.  Don't let anyone take that strength from you.", "controversiality": 0, "created_utc": 1356312732, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9nk5", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755784, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm about to deliver #3, and it's the first time I feel confident about my feeding decisions. My daughter had no interest in latching on or taking a bottle for the first week of her life and then she had acid reflux super bad. I lasted a month before I couldn't take her puking up everything she ate anymore. We switched to a prescription formula and i now have a happy healthy 4 yr old that taught herself to read already:) my son on the other hand, could finish a 4 oz bottle the second day of his life. My milk didn't come in til day 5. I wasn't going to starve him so formula it was. This time around I feel comfortable just saying, I don't know. I'm going to try to breast feed, maybe I'll pump and use a bottle, maybe I'll have to use formula until my milk comes in. Maybe this kid will have allergies like my first did. I'm not worried about it. My baby will be fed. Also my kids have never needed an antibiotic or gotten a single ear infection and they're 3+4 now. Don't let anyone make you feel bad. You know what's best for your child:)", "controversiality": 0, "created_utc": 1356313733, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9w0c", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430755906, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "Really? I grew up in SJ and now live in Pleasanton. My husband is from northern CA(chico area). Was met with rudeness all around especially since he 8 months. My OB works in Walnut Creek and was shocked I still was at 6 months even though she encouraged it. I have never seen a mom hassled for bottle feeding and more often than not I see women buying formula or giving bottles(could be BM i guess) with not so much as a second glance.", "controversiality": 0, "created_utc": 1356313968, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7l9xzq", "link_id": "t3_15c0ky", "parent_id": "t1_c7l90ro", "retrieved_on": 1430755920, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "How premature were your babies? The NICU was awful and the LC there was worse. It's a GD miracle I am breastfeeding talk about a shit start. The only reason I could was my sister did it twice before me and helped me out.", "controversiality": 0, "created_utc": 1356314216, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la01z", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9n8f", "retrieved_on": 1430755955, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rationalgia", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not saying that I've seen women harassed for buying formula; I definitely haven't. I've just only known women who breastfed.", "controversiality": 0, "created_utc": 1356314358, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la1ai", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9xzq", "retrieved_on": 1430755962, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "Was she gaining any weight and having enough wet diapers? Was your doctor using the WHO growth chart or the CDC? For breastfed babies he should have been using the WHO chart. Breastfed babies gain weight differently and more slowly. By a year they tend to be thinner and smaller but it doesn't mean they are starving. Pumping is NOT a good indicator of supply. My sister bfed both her boys and they gained weight perfectly and she could never pump anything at all.\n\nMy son was also a premie. Kids generally catch up by a year.  \n&gt;She will now always be smaller than the other children. She will always be a little bit behind everyone else.\n\nThis is not true she will grow now and catch up to her peers. If she is slender/short it probably has more to do with how she was supposed to be. I know tons of premature babies who are now all grown and over 6ft. Being small in the beginning means NOTHING. Glad your daughter is better and don't feel bad she will not be forever small even if she wasn't getting enough in the beginning.\n\nEdit: Sorry if I sound preachy, it wasn't my intention. I felt a lot of guilt for my membranes rupturing so I did a lot of my own research and spoke to pediatricians and specialists and they told me even babies who get a bad start catch up by 1 or 3 years old and if they are on the smaller side it's more than likely genetics. It helped SO much that I met mommies with grown sons who were smaller than my son and their now healthy and tall as heck. Just wanted to tell your your daughter will be fine.", "controversiality": 0, "created_utc": 1356314562, "distinguished": null, "downs": 0, "edited": 1356315245, "gilded": 0, "id": "c7la308", "link_id": "t3_15c0ky", "parent_id": "t1_c7l80ou", "retrieved_on": 1430755992, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "If you want to try again read breastfeeding made simple, it's a great book but IGNORE the formula chapter it's really irritating lol. Also /r/breastfeeding is great and so is kellymom.com. The first few days of life colostrum is all they need and supplementing is causing your milk to come in later and decreasing supply. Anyway good luck!", "controversiality": 0, "created_utc": 1356314776, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la4so", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756011, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LiaWing", "author_flair_css_class": null, "author_flair_text": null, "body": "He was born on his due date, totally healthy, but had a weird mark on his ear. They panicked and thought it was an infection... Herpes or MRSA.  They put him in isolation, flooded him w antibiotics and antivirals for a couple days, (formula was started as hydration for the meds, not for nutrition since I was pumping) and finally released him due to normal tests.  \n\nThe spot was recognized immediately as a birthmark by one of the other doctors in his pediatrician's office at his first appt after release.\n\nI tried to BF after his release, but I ended up getting double mastitis over and over.... I got so sick we had to give it up after about 3 weeks. My docs were really worried about the my risk of developing an abscess.", "controversiality": 0, "created_utc": 1356314827, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la58d", "link_id": "t3_15c0ky", "parent_id": "t1_c7la01z", "retrieved_on": 1430756023, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "No I believe you it's just weird to me since I have the opposite experience. Oh well people need to mind their own effing business.", "controversiality": 0, "created_utc": 1356314900, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la5ut", "link_id": "t3_15c0ky", "parent_id": "t1_c7la1ai", "retrieved_on": 1430756027, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "i'm sorry you went through that. I only had plugged ducts and mastitis once but I was able to catch it before it got worse. ", "controversiality": 0, "created_utc": 1356315022, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la6v9", "link_id": "t3_15c0ky", "parent_id": "t1_c7la58d", "retrieved_on": 1430756041, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sarahkali08", "author_flair_css_class": null, "author_flair_text": null, "body": "I do have to disagree with part of your post. Yes, formula is fine, it feeds babies and is perfectly acceptable food.\n\nBeing breastfed DOES make you \"smarter\". Your evidence comparing yourself ad SO is irrelevant. I also realize the difference is small, but it is still there. \n\nAlso, people can, and do, develop immunity from the world around them, but breast milk helps IMMENSELY. Breastmilk keeps babies healthier than formula fed babies.  \n\nSo while I agree with your overall point, we shouldn't allow ourselves to believe things aren't true just because we don't want them to be true or want to feel better about or choices.", "controversiality": 0, "created_utc": 1356315251, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la8vc", "link_id": "t3_15c0ky", "parent_id": "t1_c7l4cp1", "retrieved_on": 1430756067, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "&gt;formula feeding is basically child abuse\n\nTotally is. Starving your child to death is the only humane, good parenting solution since you failed to BF. /s", "controversiality": 0, "created_utc": 1356315337, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7la9lr", "link_id": "t3_15c0ky", "parent_id": "t1_c7l7qah", "retrieved_on": 1430756076, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Of course. :p", "controversiality": 0, "created_utc": 1356315445, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7laao1", "link_id": "t3_15c0ky", "parent_id": "t1_c7la9lr", "retrieved_on": 1430756093, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LiaWing", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks.  We've learned our lessons from the experience and will be applying them when our next arrives in March. \n\nI'm hoping BFing will work for us this time, but I have no issues using formula again if that's the way the cookies end up crumbling.", "controversiality": 0, "created_utc": 1356315480, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lab0m", "link_id": "t3_15c0ky", "parent_id": "t1_c7la6v9", "retrieved_on": 1430756095, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smarty_skirts", "author_flair_css_class": "green", "author_flair_text": "Twin Boys born 4/2012", "body": "I stand by my statement. I'd much rather be looked at with disdain for breastfeeding, which I know is good, than being looked at with disdain for bottle feeding as if it were bad for my child, which I know it is not. Every without my preference, I support the OP's feelings and understand them, not even as a \"who has it worse\" but rather as a \"hey this sucks.\"", "controversiality": 0, "created_utc": 1356315883, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7laekf", "link_id": "t3_15c0ky", "parent_id": "t1_c7l58wq", "retrieved_on": 1430756134, "score": -13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smarty_skirts", "author_flair_css_class": "green", "author_flair_text": "Twin Boys born 4/2012", "body": "I would have loved the chance to breastfeed in public or at all. I guess that is why I have less understanding if how uncomfortable it would be.", "controversiality": 0, "created_utc": 1356315985, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7laffv", "link_id": "t3_15c0ky", "parent_id": "t1_c7l56r6", "retrieved_on": 1430756145, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nonpromqueen", "author_flair_css_class": "lightcoral", "author_flair_text": "Cae 08/12/04", "body": "I was going to say, pumps are a terrible indicator of supply. I could never pump anything. ", "controversiality": 0, "created_utc": 1356316125, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lagnf", "link_id": "t3_15c0ky", "parent_id": "t1_c7la308", "retrieved_on": 1430756162, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smarty_skirts", "author_flair_css_class": "green", "author_flair_text": "Twin Boys born 4/2012", "body": "Yes it is different but it isn't spoken about as often how hard it can be to withstand te comments about how feeding your baby formula is bad for them, that you are harming your baby. Being told to breastfeed somewhere else, while terribly wrong, doesn't accuse you if being a bad mother. That's the point I was trying to make.", "controversiality": 0, "created_utc": 1356316168, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lagzq", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6b77", "retrieved_on": 1430756165, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nonpromqueen", "author_flair_css_class": "lightcoral", "author_flair_text": "Cae 08/12/04", "body": "I've never heard the formula causes ear infections thing. Soothers on the other hand...;)", "controversiality": 0, "created_utc": 1356316197, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lah99", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6o5f", "retrieved_on": 1430756168, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "roxyskyy", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine was a week over his due date. He had the cord wrapped around his neck and inhaled meconium. We sent colostrum up to him on a syringe (hand expressing) only to find out they still formula fed him. Thought the nurses are versed in the ways of breastfeeding it started to become stressful for him as they were smashing him on my boob while he screamed out in displeasure. They tried to latch him that way for an hour (which is wrong because you don't want to cause him displeasure while dealing with the boob). I cried and finally told them to being out formula because he just wasn't having it. Every time we tried to latch it was the same. I also have huge, flat nipples that are very difficult. The nipples shield would just get flung off in his fits. The LC was just wow. She even told me if giving him formula was giving him the nutrition he needed then I should just be grateful and work with what I got. This is my first kid and I wanted to be emotionally stable for him and eventually threw my hands up and told my husband I was done. ", "controversiality": 0, "created_utc": 1356316356, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7laio8", "link_id": "t3_15c0ky", "parent_id": "t1_c7la01z", "retrieved_on": 1430756188, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ewoksandcandycorn", "author_flair_css_class": "purple", "author_flair_text": "Many Siblings, No Babies Yet", "body": "There are plenty of reasons why breastfeeding is being pushed to the forefront again, but parents shouldn't be guilt tripped about how they choose to feed their child either way.", "controversiality": 0, "created_utc": 1356316486, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lajrw", "link_id": "t3_15c0ky", "parent_id": "t1_c7l7pez", "retrieved_on": 1430756202, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "I'm sorry you went through that. I wish there was a way to improve NICU nurses/LC's. I didn't even see mine or told when to pump until 3 days later. Thank god I knew my sister who has a baby in the NICU and she told me what to do until they finally told me.", "controversiality": 0, "created_utc": 1356317034, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7laohn", "link_id": "t3_15c0ky", "parent_id": "t1_c7laio8", "retrieved_on": 1430756264, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "roxyskyy", "author_flair_css_class": null, "author_flair_text": null, "body": "It's hard because they're mantra is the same when our babies fragile lives seem to be in danger. \"As long as he's healthy\" which if that means popping a bottle in mouth to give him nutrients then so be it. It happens. I just become super thankful he's here and healthy now when I get discouraged at not being able to give him the best. Sometimes you can feel so shamed. ", "controversiality": 0, "created_utc": 1356317722, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7laujt", "link_id": "t3_15c0ky", "parent_id": "t1_c7laohn", "retrieved_on": 1430756344, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "roxyskyy", "author_flair_css_class": null, "author_flair_text": null, "body": "Edit: \"as long as he's eating\" sorry lol baby brain! ", "controversiality": 0, "created_utc": 1356317810, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lavbh", "link_id": "t3_15c0ky", "parent_id": "t1_c7laujt", "retrieved_on": 1430756413, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ilea316", "author_flair_css_class": "purple", "author_flair_text": "2 girls! Wheeeeeeeeeee!", "body": "Yeah. When I was BFing my girls I didn't know anyone who BFed and I actually got shit from people for not formula feeding.\n\nWay I figure it... Baby fed something nutritious? Awesome. Good job.", "controversiality": 0, "created_utc": 1356317861, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lavsb", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6sx0", "retrieved_on": 1430756420, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gabrielsmama", "author_flair_css_class": null, "author_flair_text": null, "body": "Are you being overly sensitive? No, I don't think so. But, I was in your boat--or at least, a very similar one. We were able to breastfeed for just over 6 months, but I only exclusively breastfed until we discovered he wasn't gaining weight BECAUSE I don't make enough milk. (Less than 1 month.) \n\nWe actually have not had a single problem with people saying anything about giving him formula. (Which I had a lovely speech prepared for, so I am almost disappointed no one has said anything. It seems a waste of a GREAT speech. Well, rant.)\n\nFor anyone that says anything to you--guilt them. If someone has the audacity to be judgmental of you, not knowing that you TRIED, then I think they are basically asking to hear WHY you can't breastfeed. Give details of the infection, if necessary.\n(I am giving away the key point of my 'how dare you be critical of me for giving my child formula' speech, but that's OK.)", "controversiality": 0, "created_utc": 1356319049, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lb5xa", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430756551, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "one_hot_llama", "author_flair_css_class": null, "author_flair_text": null, "body": "/r/formulafeeders and /r/boobsandbottles are some groups you may want to check out!", "controversiality": 0, "created_utc": 1356319118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lb6j2", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430756559, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel your pain.  I was in exactly the same position, except it got all tangled up in my postpartum depression and I *did* blame myself.  I wept the first time I had to feed my daughter formula, and I felt like such a failure that I went to insane extremes to increase my milk supply.  At one point I was taking 34 pills a day (various galactagogues) and hooked up to the pump for several hours a day.  I applaud your decision to use formula, and I deeply regret that I wasn't able to let go and do the same.  My baby had a frazzled, depressed mommy for the first few months, and if I'd just accepted the situation gracefully I think I would have been a much better mother to her.", "controversiality": 0, "created_utc": 1356319595, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbao7", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430756619, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "Christ, that's ridiculous.  I'm so sorry you had to go through that.  \n\nI went through similar issues, and have come to the conclusion that my daughter would have been much better served by having a sane mommy and formula for the first few months instead of the frazzled mess I became while trying to increase my milk supply.  You have to take care of yourself if you're going to take the best possible care of your kid.", "controversiality": 0, "created_utc": 1356319770, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbc8j", "link_id": "t3_15c0ky", "parent_id": "t1_c7l80sz", "retrieved_on": 1430756637, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "paparatti", "author_flair_css_class": null, "author_flair_text": null, "body": "FWIW, my milk didn't come in until day 5, and at no point did anyone tell me I was starving my child or to use formula. In fact, the hospital paediatrician said to not worry about it until day 7 - just put the baby on the boob, and try to relax. Looking back now, I had great support... I doubt I would have made it past the first month otherwise. Not sure if this will apply to you personally, but I wanted to give you a solidarity fistbump anyway. This shit is hard.", "controversiality": 0, "created_utc": 1356320432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbi6d", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756712, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356320490, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbiou", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756719, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356320538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbj3p", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756729, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356320594, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbjl1", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756729, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356320657, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbk5f", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756738, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you are being oversensitive because you tried and couldn't make it work.  Those pamphlets ARE NOT for you.  Those are for moms that are undecided about breastfeeding, uneducated about it, etc.  You did your best.  Don't beat yourself up about it.  Try to not let it get to you.  :)  Happy Holidays!", "controversiality": 0, "created_utc": 1356320827, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbln7", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430756769, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "debtwickedsucks", "author_flair_css_class": "green", "author_flair_text": "boys, 4 &amp; 2", "body": "Mother of two here, and I couldn't produce milk at all. I would pump for an hour and not get half an ounce, with both boys. I had to give up after two weeks of supplementing with formula, and switch completely over. The worst was I got thrush nipple with my first and it HURT. Didn't want to give it up, but I was brought to tears every time I tried to breastfeed. I felt like there was just something wrong with me and that I was a bad mother for switching so soon. There was no other option, though, and if anyone tried to tell me to breastfeed, I'd tell them to screw off. We gave it our best, my boys were healthier on formula, and started gaining weight again when I gave up breastfeeding. \n\nYou can't stop people from judging you, ever. And I know it hurts now, but eventually, when you aren't so drained from lack of sleep, you'll see that you are doing just fine, and so is your child. Anyone who can't see that is the one with the problem, not you. \n\nGood luck!", "controversiality": 0, "created_utc": 1356321535, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbrzg", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430756861, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Loluka", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't read it as preachy at all. :) My husband and I are both tall people and looking back into his and my family lines she has a high chance of being too, but she isn't. The doctor's/specialists have all said what I posted (I went to quite a few).", "controversiality": 0, "created_utc": 1356321939, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbvfc", "link_id": "t3_15c0ky", "parent_id": "t1_c7la308", "retrieved_on": 1430756902, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "I relate to this all too well. I also wasn't able to breastfeed for similar reasons. The week we officially switched to formula was world breastfeeding week. All the parenting boards were full of the breast is best stuff, I cried every time I saw it (my PPD wasn't helping at all). Even now when I tell medical personnel I am not breastfeeding, I get either a look of scorn or pity. It sucks, I really wanted to do it, I invested a lot of time and money in making it work but it didn't.", "controversiality": 0, "created_utc": 1356322368, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lbz90", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430756942, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356322584, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lc169", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430756964, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vidiuk", "author_flair_css_class": null, "author_flair_text": null, "body": "Actually you are the one doing the \"I have it worse\". ", "controversiality": 0, "created_utc": 1356323187, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lc6nf", "link_id": "t3_15c0ky", "parent_id": "t1_c7laekf", "retrieved_on": 1430757032, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "I am on my phone right now and can't find the article, but apparently recent studies show that intelligence is more closely correlated to demand feeding than it is to breast feeding or formula feeding. Apparently people who feed with formula are more likely to do so on a set schedule as opposed to when the baby is hungry.", "controversiality": 0, "created_utc": 1356323617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lcak4", "link_id": "t3_15c0ky", "parent_id": "t1_c7la8vc", "retrieved_on": 1430757084, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "You do realize that baby formula isn't simply cows milk like you implied, right?", "controversiality": 0, "created_utc": 1356323725, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lcbio", "link_id": "t3_15c0ky", "parent_id": "t1_c7l63gk", "retrieved_on": 1430757095, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "Donor milk is extremely expensive and hard to find. At least where I live.", "controversiality": 0, "created_utc": 1356323806, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lcc8e", "link_id": "t3_15c0ky", "parent_id": "t1_c7l69xs", "retrieved_on": 1430757104, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Wife_approved", "author_flair_css_class": null, "author_flair_text": null, "body": "That is terrible. I'm sorry you had that experience. I do not have experience  with mom groups outside of a special needs parent support group and an icu support group. My boy was only on straight ebm for a week before we had to add in high calorie formula. So I pumped for just under 5 months and when he was ready to be released from hospital I didn't have the time to pump anymore given all his care needs.  He has been tube fed his whole life, and he has a trach, and he has a cow-milk protein sensitivity which means his formula is a special kind. It's awful that the places that you are supposed to get help and support from would be so negative towards meeting your child's needs. ", "controversiality": 0, "created_utc": 1356323901, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lcd1w", "link_id": "t3_15c0ky", "parent_id": "t1_c7l7qah", "retrieved_on": 1430757116, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "Yeah..it really freaked me out at the time but it also taught me to toughen up because there is nobody more critical than another mother. Especially on the internet where it's easy to be faceless and just give another person hell without fear of recriminations.", "controversiality": 0, "created_utc": 1356324152, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lcf71", "link_id": "t3_15c0ky", "parent_id": "t1_c7lbc8j", "retrieved_on": 1430757144, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DirtyWhoreMouth", "author_flair_css_class": null, "author_flair_text": null, "body": "The same thing happened to me and my daughter. Don't feel ashamed. All through my pregnancy, I researched the hell out of breastfeeding and knew it was what I wanted to do -100%. But, in my opinion, breastfeeding is ideal for women who are lucky enough to stay at home with their babies. I only got 6 weeks maternity leave *unpaid* so I had to return to work immediately so we could put bread on the table. My husband is disabled and I work 40+ hours a week just to keep our heads above water. I tried *so hard* to keep breastfeeding. Typing this makes me cry. She pretty much got my breastmilk exclusively for the first 6 weeks, and for that, I am grateful. I even tried pumping but I didn't respond well to it. It took me an entire *day* to get out 6 ounces. I literally pumped from my breast every 1-2 hours *like clockwork* and all I got out was 6 oz. The next day, 4 oz. After that, nearly nothing. Then we went to supplementing with formula because nothing was more disheartening than  my baby crying her eyes out and wanting more when my breasts weren't giving her any. Breastfeeding caused a (temporary) rift in my marriage. My husband pushed the formula *hard* and all I could do was cry. I felt like a failure. Please try not to feel like a failure. All you could do was try- and you did. We did the best we could for our babies. With me working 10am-10pm with a 20-minute break inbetween made it damn near impossible to breastfeed her. Some of us just aren't in ideal situations. It will be ok :)\n\nAlso - my daughter wasn't gaining weight at all. Yes, breastfed babies do tend to gain weight slower than formula-fed babies, but she was still at her birth weight (7lbs) at nearly 2.5 months old. Her doctor was concerned. He of course advocated the breastfeeding but he also wanted to be realistic.", "controversiality": 0, "created_utc": 1356324176, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lcfe9", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430757146, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jezebelunicorn", "author_flair_css_class": "green", "author_flair_text": "Wyatt Colm - 6 months", "body": "It's cow milk as a base. It's very hard for a lot of babies to process it as it has a completely different molecular structure than human milk.", "controversiality": 0, "created_utc": 1356324369, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lch36", "link_id": "t3_15c0ky", "parent_id": "t1_c7lcbio", "retrieved_on": 1430757168, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jezebelunicorn", "author_flair_css_class": "green", "author_flair_text": "Wyatt Colm - 6 months", "body": "I don't know the prices, but it's horrible that it would be so expensive!", "controversiality": 0, "created_utc": 1356324407, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lchep", "link_id": "t3_15c0ky", "parent_id": "t1_c7lcc8e", "retrieved_on": 1430757173, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "My daughter had true lactose intolerance (she couldn't digest human milk and definitely not cows milk). She has been exclusively formula fed since around 6 weeks of age on soy formula. There are a few different varieties of formula, including one that is based on meat protein for babies who can not tolerate milk or soy.", "controversiality": 0, "created_utc": 1356324805, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lckuj", "link_id": "t3_15c0ky", "parent_id": "t1_c7lch36", "retrieved_on": 1430757218, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "I3km", "author_flair_css_class": "green", "author_flair_text": "3+1year old", "body": "I fall pretty firmly into the unable to exclusively bf camp. I still breastfeed and make up the difference with formula. Its hard to do but I figured what worked withy first. I'll say that doing both gets you shit from both sides. The bf side seems to think that I did something wrong or the formula is cauding my problems ( just no. I seem to know more about management of serious bf problems than the average ibclc). The ff side doesnt seem to like that I didnt completely stop bf, as if what im doing is a judgement on them. Its not. I wanted to bf so I made the best of my situation. I completely get bf problems and stopping.\n\nThe first time around I was really ate up (that seems grammatically incorrect) about it seeing slights and judgements everywhere (some real some imagined), but this time I've got far more of a fuck you judgy mcjudgypants attitude towards anyone prepared to give me shit. I say get that attitude because this side taking bs *does not stop*.", "controversiality": 0, "created_utc": 1356328148, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldce8", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430757605, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I hate that you have to justify it!!  You are doing what is best for your own child and everyone else can go to hell.  That's why they MAKE formula.  Do what you need to do girlfriend.", "controversiality": 0, "created_utc": 1356330356, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldtcj", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430757843, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I hate it beyond all belief. ", "controversiality": 0, "created_utc": 1356330552, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldurk", "link_id": "t3_15c0ky", "parent_id": "t1_c7l86a4", "retrieved_on": 1430757864, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "I think it speaks to our insecurities as moms that each side thinks they are the most persecuted. I could switch formula and breast milk in your post and it would describe my breastfeeding experience really well. A very small amount of women actually can't breastfeed so I can understand that the world is not really set up for them. MOST women formula feed, but most of them also have the advantage of being confident in their decision. ", "controversiality": 0, "created_utc": 1356330630, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldvcm", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430757873, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xixoxixa", "author_flair_css_class": "blue", "author_flair_text": "Demon (6) Demoness (9)", "body": "You know what the best thing about Ft. Irwin is?\n\nLeaving.", "controversiality": 0, "created_utc": 1356330649, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldvht", "link_id": "t3_15c0ky", "parent_id": "t1_c7ldurk", "retrieved_on": 1430757875, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "buggmuncher", "author_flair_css_class": null, "author_flair_text": null, "body": "The WHO's focus is NOT first-world America - their major concerned with people in third world countries in Africa and Asia. They are so strong on breastfeeding because in those countries getting clean, boiled water is much harder, which causes major problems. Also, these people are using much cheaper formulas. Don't take the WHO recommendation out of context.", "controversiality": 0, "created_utc": 1356330759, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldw97", "link_id": "t3_15c0ky", "parent_id": "t1_c7l69xs", "retrieved_on": 1430757883, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "That might be why. I live in Michigan and I can count on one hand the number of women I know in real life who breastfeed. My cousin (4 months so far), a co-worker (8 months), a former classmate (2 years) and my best friend (8 months with her first and 4 with her second). I also have a cousin across the country who did not breastfeed but pumped breastmilk for 8 months. Most of the women in my area formula feed right from the start. A co-worker was recently telling me that her husband was hoping that she would, but she didn't with her first two and never wants to. My aunt flat out told me that it was gross to her. I have never once seen a woman nursing in public. Actually, I take that back, once at the WIC office (I am a social worker) when I was pregnant and once when I was a kid at an amusement park. ", "controversiality": 0, "created_utc": 1356331073, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ldygq", "link_id": "t3_15c0ky", "parent_id": "t1_c7l63uw", "retrieved_on": 1430757914, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "OH god I just remembered one of my most cringe worthy moments. When I was 17 and stupid, I once \"asked\" (but really I was judging) a mom why her probably 5 year old child had a pacifier. Her child turned out to be severely autistic and would injure her lips by biting them if she didn't have something in her mouth. Lesson learned. I don't judge books by their cover anymore.", "controversiality": 0, "created_utc": 1356331353, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le0ex", "link_id": "t3_15c0ky", "parent_id": "t1_c7l65u2", "retrieved_on": 1430757936, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Seriously? I'm one of 6 people I know in real life who breastfeed. I live in Michigan. ", "controversiality": 0, "created_utc": 1356331418, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le0wh", "link_id": "t3_15c0ky", "parent_id": "t1_c7l90ro", "retrieved_on": 1430757940, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "I understand that the reason that breastfed babies are smarter is because breastfed babies are more likely to have educated parents (which is really where the advantage comes in).", "controversiality": 0, "created_utc": 1356331593, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le24y", "link_id": "t3_15c0ky", "parent_id": "t1_c7lcak4", "retrieved_on": 1430757947, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsunexpected", "author_flair_css_class": "purple", "author_flair_text": "Mama to 3", "body": "I feel no matter what we do, we are wrong.\n\nI formula fed my first exclusively, didn't bother trying to breastfeed. I was young and uneducated. Still young, but more informed I have gone on I nursed my second for 13.5 months and now my 4 month old. I get nervous at time nursing in public because I mostly am surrounded by formula feeders. I just mentally say \"Fuck it. I am feeding my baby. People can kiss my ass.\"\n\nNow I am a pretty strong breastfeeding supporter. I want to support others that want to do so and get the education out there since it wasn't there for me initially.\n\nI don't necessarily think you are being overly sensitive. Sensitive yes which is normal. It equates to how one would feel sitting in an OB waiting room after a miscarriage. Eventually it won't bother you as much anymore. (I found out I was miscarrying just as they played the baby arrival music over the intercom- I was a bit sensitive for awhile.)", "controversiality": 0, "created_utc": 1356331633, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le2f0", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430757948, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "The hospital in my town gives out donated breastmilk to women who give birth there and request it. It is pasturized and free. ", "controversiality": 0, "created_utc": 1356331713, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le2z1", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6g2a", "retrieved_on": 1430757951, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "My aunt told me that breastfeeding was gross. Most people here formula feed out of the hospital. ", "controversiality": 0, "created_utc": 1356331848, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le3um", "link_id": "t3_15c0ky", "parent_id": "t1_c7lavsb", "retrieved_on": 1430757955, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "I have the opposite of the height thing. My daughter hasn't gained a single pound in 9 months, but she is gaining height, her doctor is not concerned. Also, I am still nursing at 16 months and I have never been able to pump more than an ounce from each side, even when I was engorged!", "controversiality": 0, "created_utc": 1356332015, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le50z", "link_id": "t3_15c0ky", "parent_id": "t1_c7lbvfc", "retrieved_on": 1430757960, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jezebelunicorn", "author_flair_css_class": "green", "author_flair_text": "Wyatt Colm - 6 months", "body": "So you're saying Breastfeeding is only best in places where there is no clean water to use formula? I am not taking WHO recommendations out if context. The AAP and every doctor recommends breast first, because everything is fully absorbable to human babies. Cow milk formula is not for humans, it can work, but if you see the chart I posted further up- you will see that there are 20x the bio available nutrients and ingredients in human milk.", "controversiality": 0, "created_utc": 1356332427, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le7s4", "link_id": "t3_15c0ky", "parent_id": "t1_c7ldw97", "retrieved_on": 1430757988, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "I have heard this as well, and it makes sense. Breastfeeding requires a lot of support that isn't readily available for less educated or lower class families. The huge difference between formula and breast milk I see is immune health. ", "controversiality": 0, "created_utc": 1356332469, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le82a", "link_id": "t3_15c0ky", "parent_id": "t1_c7le24y", "retrieved_on": 1430757993, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Milk doesn't usually come in until day five. You're not starving your baby, they don't need milk until then, the colostrum is enough. If you really want to try again, you should know that if you formula feed to supplement that is milk that your body won't make because it doesn't know it needs to (through nipple stimulation). I'm not trying to be preachy, I *really* don't care how people feed their kids (I was formula fed so I know formula fed babies turn out great ;) my main reason for breastfeeding is that it was so much easier). It is super hard to try and give moms support who may want to breastfeed without coming off preachy though. Honestly, about half the moms in this thread who said they couldn't breastfeed list as their reasons issues that are pretty common mistakes, or normal breastfeeding things. I would feel SO uncomfortable telling them though..I only mentioned those things to you because you say you would like to try again. \n\nHonestly, I wish women were more able to say \"I tried breastfeeding and it was hard so I chose formula\" and that is OKAY. (I don't mean to sound snotty there, breastfeeding is SO hard the first 6-8 weeks.) If formula is easier for you (it sounds like a nightmare of making and washing bottles to me) there shouldn't be any shame in choosing it, you shouldn't have to say \"I couldn't breastfeed\" when saying \"I wanted to breastfeed but it didn't work out for us\" should be perfectly fine", "controversiality": 0, "created_utc": 1356332723, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7le9pr", "link_id": "t3_15c0ky", "parent_id": "t1_c7l9w0c", "retrieved_on": 1430758015, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Can I ask (and let me preface this by saying I have absolutely zero problems with formula, I was formula fed and I could read the newspaper when I was 20 months old. I breastfeed out of the sheer laziness of not wanting to prepare or wash bottles) if your doctor was aware that a normal breastfed baby does not gain weight in the same way as a formula fed one and they actually have different growth charts? My daughter gained no weight from 6 months to 14 months (she was gaining height) and I was told it was completely normal and she was healthy.", "controversiality": 0, "created_utc": 1356333080, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lec16", "link_id": "t3_15c0ky", "parent_id": "t1_c7lb5xa", "retrieved_on": 1430758045, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Holy shit. You are a strong mama to even try those measures! Nursing ended up working for us, but if I had had to pump at all I probably would have quit not to mention all the extra stuff you tried! ", "controversiality": 0, "created_utc": 1356333181, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lecnm", "link_id": "t3_15c0ky", "parent_id": "t1_c7lbao7", "retrieved_on": 1430758060, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Thrush sucks I had it once about 7 months in. I did end up breastfeeding (still am), but my body is not cut out for pumping at all. At most I would get an ounce from each side. Meanwhile I have a friend who always breastfeeds during maternity leave and then switches to formula when she goes back to work and she used to get 4 ounces PER BREAST while pumping! There is nothing wrong with formula feeding though, you did just fine. \n\n", "controversiality": 0, "created_utc": 1356333386, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ledzl", "link_id": "t3_15c0ky", "parent_id": "t1_c7lbrzg", "retrieved_on": 1430758071, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AmbyPamby1", "author_flair_css_class": null, "author_flair_text": null, "body": "I wasn't able to either.\n\nI was only making around 5mls, and that was after pumping for 15 minutes on each breast.\n\nThe hospital told me to keep going, but the lactation consultant said really, that's all you're going to be able to make due to a development issue as a teenager.\n\nIn the end i decided to not breastfeed, and just go to bottle feeding.\n\nReally, it really annoys me that 'BREAST IS BEST' is everywhere.\n\nI get it, but some people can't, and being reminded that you can't everyday by assholes who think they know everything is a huge piss off.", "controversiality": 0, "created_utc": 1356334202, "distinguished": null, "downs": 0, "edited": 1356338587, "gilded": 0, "id": "c7lejbe", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430758140, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "emilyamanda88", "author_flair_css_class": null, "author_flair_text": null, "body": "Lots of upvotes for usernames!!!", "controversiality": 0, "created_utc": 1356335945, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7letvo", "link_id": "t3_15c0ky", "parent_id": "t1_c7l70lf", "retrieved_on": 1430758278, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ZombieFaery", "author_flair_css_class": "red", "author_flair_text": "Mommy to Berlynne Liuna", "body": "I don't think you are being overly sensitive at all!\n\n I had to formula feed my child, I pumped what I could but I couldn't physically breast feed her. I have inverted nipples that right after birth wouldn't stick out at all for her to latch on to. Before her birth and since I stopped pumping they pop out again. I had a very hard few months after her birth. The first few days the breast feeding lady came to help and was smashing my daughter's head into my breast (my daughter and I were both crying) and telling me if she didn't get breast milk she would never be healthy, then came other mothers telling me I needed to breast feed, how dare you not breast feed?! \n\nLuckily, I had a lot of good support from my 2 aunts and Oma (all have inverted nipples, couldn't breast feed) they made me realize that she will be healthy and happy, my aunts both have 3 healthy children and my Oma had 4 healthy ones. As great as breast milk is for them if you can't, you can't. ", "controversiality": 0, "created_utc": 1356338655, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lf7zf", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430758462, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AmbyPamby1", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry, but where in the absolute fuck do you live?\n\nI live in New south wales, Australia, and i (and a couple of my friends who also couldn't breast feed) have NEVER encountered anything like that at all! We don't get any looks or comments while bottle feeding our child, we mainly just get comments on how cute / healthy / beautiful our babies look...", "controversiality": 0, "created_utc": 1356338989, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lf9lf", "link_id": "t3_15c0ky", "parent_id": "t1_c7l6o5f", "retrieved_on": 1430758485, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SaShayLaLu", "author_flair_css_class": null, "author_flair_text": null, "body": "Seattle WA. Among anyone I knew, the fact I had to stop breast feeding for medical reasons was beyond what they could handle. I even had friends recommending me to milk banks and offering tips on how to get my milk to come in again since it had been 3 months since I had stopped breast feeding. It didn't matter that I nursed my first till she was 18 months. And the truth? fuck it. I hated nursing. I had no idea how much I hated it until I was forced to stop due to medical issues (I came down with SJS, it's graphic, I don't recommend googling it) I suddenly felt so much better, my PPD cleared up, and I didn't feel so tired and tied down all the time. \n\nTo each their own. I don't bat an eye at a woman nursing in public, and I don't think twice when a woman pulls out a bottle and mixes formula. ", "controversiality": 0, "created_utc": 1356339649, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lfcp1", "link_id": "t3_15c0ky", "parent_id": "t1_c7l4v8e", "retrieved_on": 1430758524, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "oskuskaktus", "author_flair_css_class": null, "author_flair_text": null, "body": "Women who can and will nurse should be supported to do so, but this nonsense that formula isn't as good for babies does nothing but guilt trip women who can't nurse for their babies.", "controversiality": 0, "created_utc": 1356340421, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lfg4o", "link_id": "t3_15c0ky", "parent_id": "t1_c7lajrw", "retrieved_on": 1430758571, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ilea316", "author_flair_css_class": "purple", "author_flair_text": "2 girls! Wheeeeeeeeeee!", "body": "Yes this. I could only pump about an ounce but I had a massive supply with both of my girls and honestly could hand express milk better than the pump.", "controversiality": 0, "created_utc": 1356342049, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lfmo2", "link_id": "t3_15c0ky", "parent_id": "t1_c7lagnf", "retrieved_on": 1430758655, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Offonjupiter", "author_flair_css_class": null, "author_flair_text": null, "body": "Inverted nipples were the bane of my bf existence ", "controversiality": 0, "created_utc": 1356343059, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lfqkn", "link_id": "t3_15c0ky", "parent_id": "t1_c7lf7zf", "retrieved_on": 1430758707, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ilavayou", "author_flair_css_class": "green", "author_flair_text": "Mommy to Molly (3) and Max (3months)", "body": "This is actually the reason I switched.  I had close family members who couldn't understand why I would continue to breast feed while having to take my son in for weight checks.  I wasn't confident enough to continue and I feel very, very guilty for that.  After I stopped I got a lot of 'good's and 'finally's from those same people.  ", "controversiality": 0, "created_utc": 1356347692, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lg654", "link_id": "t3_15c0ky", "parent_id": "t1_c7l56r6", "retrieved_on": 1430758911, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "Also wet nursing is not the viable alternative it once was.", "controversiality": 0, "created_utc": 1356353333, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lgoi1", "link_id": "t3_15c0ky", "parent_id": "t1_c7l7on1", "retrieved_on": 1430759167, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gabrielsmama", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, to get into more detail--he lost 1 pound, and was continuing to lose. Until we started supplementing, he didn't gain ANYTHING, he just kept losing more weight. Turns out, I make &lt;2 ounces per day....and that was when he was about 5 months. \n\nSo no, I never talked to dr about different growth charts, but at one month old when baby continuing to lose weight.... yup, I definitely don't make enough milk. :)", "controversiality": 0, "created_utc": 1356353651, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lgpn0", "link_id": "t3_15c0ky", "parent_id": "t1_c7lec16", "retrieved_on": 1430759180, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "I had one woman accuse me of being a child molester for breastfeeding. \n\nI think there was something wrong with her.", "controversiality": 0, "created_utc": 1356355424, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lgw6v", "link_id": "t3_15c0ky", "parent_id": "t1_c7le3um", "retrieved_on": 1430759252, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Thats too bad. I mean, you did crazy well though. I don't think I would have continued if I had to pump (I don't know what it is with me, my daughter gets enough to eat, but even when I'm engorged barely anything comes out when I pump). My aunt (different one than the one I discussed in this thread earlier who thinks breastfeeding at any age is gross) breastfed her oldest daughter for about 6 months (in 1980), and then when she had her son a few years later he ended up in the hospital from dehydration/malnutrition because he just wasn't getting anything. My grandma said she first noticed that something was wrong when she was changing his diaper and his skin looked like it was sagging off of his little butt. That kid had a super fast metabolism his whole life though (until he hit his late 20's that is!)", "controversiality": 0, "created_utc": 1356362078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lhtd6", "link_id": "t3_15c0ky", "parent_id": "t1_c7lgpn0", "retrieved_on": 1430759692, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "SO weird. Once I ran into this really annoying obese lady on a scooter at Walmart. She has been a regular since at least 2008 which was when I worked there and she was THE WORST (Oh, the picture of the cake you ordered for your daughters first birthday has the \"ABC 123\" pattern around it 10 times, but we only put it on there 8 times...let me issue a full refund even though the cake was already eaten so you can't return it). But she felt like she knew me so she always stops to say hi when she sees me around town. My daughter was about 12 weeks old and crying as we were *trying* to check out and leave. Crazy lady told me \"she's hungry! You should feed her!\" and I told her \"She ate about 45 minutes ago, but shes breastfed so she gets hungry again quick.\" \"Oh, that means you don't make enough milk. You should give her a bottle so she can be full longer.\" \n\nYeah, I'm going to take nutrition advice from a woman who can't even move under her own power anymore. This woman (and her CRAZY skinny husband) once shoved her baby in my Rottie's face at Petco while my back was turned trying to pick up a bag of food. My poor dog was cowering and backing up with her tail between her legs and they were pushing the baby at her saying \"see the doggie!\" I wanted to punch them. ", "controversiality": 0, "created_utc": 1356362603, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lhwkg", "link_id": "t3_15c0ky", "parent_id": "t1_c7lgw6v", "retrieved_on": 1430759727, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Southern California, US. I wish I lived in Australia. ): Everyone seems so chill there.", "controversiality": 0, "created_utc": 1356364872, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7libyh", "link_id": "t3_15c0ky", "parent_id": "t1_c7lf9lf", "retrieved_on": 1430759929, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah they just had me all freaked out with my daughter because even though she was getting the colostrum they made me force feed her formula using a medicine cup. She lost a pound after she was born (which I had read was completely normal) but the LC was freaking out that I couldn't leave the hospital with her \"in that condition\". I think I just had shit luck with lactation consultants. One of them actually told my mom's friend, who had breasted her 7 previous children, that she was \"doing it wrong\".  And then my son was a champ eater. He'd eat and then cry and cry. So I waited a bit, and gave him some formula. He settled down and was happy as could be. Then of course the nurse told me I couldn't give him that much or I'd make him sick. I said look lady- he ate 20 minutes ago, didn't spit up a drop, and is sleeping happily. So you write whatever you need to in your little book and let me decide how much my baby needs. Oh well- this is a new baby in a new hospital, so hopefully people will be more helpful, though I'm tempted to bar everyone but my husband from the room", "controversiality": 0, "created_utc": 1356365293, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lif1k", "link_id": "t3_15c0ky", "parent_id": "t1_c7le9pr", "retrieved_on": 1430759969, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "That is crazy! They talked me into giving formula in a medicine cup in the hospital too (for jaundice).", "controversiality": 0, "created_utc": 1356365539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ligtl", "link_id": "t3_15c0ky", "parent_id": "t1_c7lif1k", "retrieved_on": 1430759994, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "They had me start her on formula the 2nd day, and kept making me pump and pump to make my milk come in faster.  She ended up getting mild jaundice around day 4. They actually didn't release her for 5 days just because they wanted the breast feeding \"established\" before she left and my milk didn't come in til then.I was released after 2 days, so you can guess how much fun that was.  Of course it was my first and I was a total basket case on top of that. ", "controversiality": 0, "created_utc": 1356366422, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ling5", "link_id": "t3_15c0ky", "parent_id": "t1_c7ligtl", "removal_reason": null, "retrieved_on": 1435654817, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Meg_Shark", "author_flair_css_class": null, "author_flair_text": null, "body": "I love your last sentence. It covers so much of the human condition. We so often rationalize our decisions based on no evidence whatsoever. \n\n\nI strongly favor breastfeeding, as well, but I do not very much like when studies link IQ and breastfeeding without accounting for differences between women. Studies show that when you actually do this the benefits of breastfeeding and IQ disappear. Instead, the link seems to be social advantages, rather than breast milk. This was a pretty crazy revelation for me, considering when I stopped breastfeeding (after 4 weeks of unsuccessful milk production) my MIL pretty much told me that I was handicapping my child for life.\n\nHere's the article: \n\nhttp://www.bloomberg.com/news/2012-07-02/breast-feeding-is-not-how-mothers-make-kids-smart.html \n\n", "controversiality": 0, "created_utc": 1356372763, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lk4vg", "link_id": "t3_15c0ky", "parent_id": "t1_c7la8vc", "retrieved_on": 1430760869, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Meg_Shark", "author_flair_css_class": null, "author_flair_text": null, "body": "read this article: \n\nhttp://www.bloomberg.com/news/2012-07-02/breast-feeding-is-not-how-mothers-make-kids-smart.html\n\nread this book: \n\n\"Bossypants\" by Tina Fey\n\nwhen you're done use the wisdom provided to hold your head up high while you continue being a wonderful, badass mother who made the choices that were best for her family. \n\n", "controversiality": 0, "created_utc": 1356372953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lk6lu", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430760886, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "I'm also on my phone, but I just wrote a paper about this. I can provide sources if you need them.\n\nAnyway, statistically breastfed babies are more intelligent and have a lower rate of obesity, but it is due to their parents income and education level.  More educated women are usually of a higher income, and women of a higher income are  more likely to breastfeed than low income women (weird right? Breastfeeding is free.)\n\nHigher income is also linked to higher intelligence and lower rates of obesity.", "controversiality": 0, "created_utc": 1356382812, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lmjej", "link_id": "t3_15c0ky", "parent_id": "t1_c7la8vc", "removal_reason": null, "retrieved_on": 1435654724, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "I have (and probably will in the future) used both breastmilk and formula.  I don't care how anyone chooses to feed their child, as long as they're fed, formula or breastmilk both are great and get the job done.\n\nBut to say formula is just as good as breastmilk is false. Breastmilk contains antibodies that are impossible to manufacture and put into formula. Most people know this.\n\nHope this explains your mountain of downvotes.", "controversiality": 0, "created_utc": 1356383955, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lmso6", "link_id": "t3_15c0ky", "parent_id": "t1_c7lfg4o", "retrieved_on": 1430762125, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "Formula is a second best choice than BM. I hope in the future formula continues to become closer and closer to BM so your statement will one day ring true. It was posted earlier http://doublethink.us.com/paala/wp-content/uploads/2012/11/whats-in-breastmilk-poster-canada.jpg\n\nLike I said I hope science continues to improve formula so it is just as good and not the next best thing.", "controversiality": 0, "created_utc": 1356383973, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lmst2", "link_id": "t3_15c0ky", "parent_id": "t1_c7lfg4o", "retrieved_on": 1430762127, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "oskuskaktus", "author_flair_css_class": null, "author_flair_text": null, "body": "I think people are overreacting just a little bit.", "controversiality": 0, "created_utc": 1356385045, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ln1mx", "link_id": "t3_15c0ky", "parent_id": "t1_c7lmso6", "retrieved_on": 1430762234, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "Parents tend to do that.\n\nWe are all slightly crazy.", "controversiality": 0, "created_utc": 1356385534, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ln5ji", "link_id": "t3_15c0ky", "parent_id": "t1_c7ln1mx", "retrieved_on": 1430762274, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree! haha. That's why I'm in Vegas with family for Christmas. :)", "controversiality": 0, "created_utc": 1356386872, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lnfyj", "link_id": "t3_15c0ky", "parent_id": "t1_c7ldvht", "retrieved_on": 1430762406, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inderpwetrust", "author_flair_css_class": "green", "author_flair_text": "JJ 03-09-12", "body": "I wouldn't necessarily use the word viable. Societal changes made wet nursing *undesirable* if anything. I've read of families and close friends still practicing wet nursing if the mother is struggling with breastfeeding, but the wide use of wet nurses went away when formula was made available. ", "controversiality": 0, "created_utc": 1356393087, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lor43", "link_id": "t3_15c0ky", "parent_id": "t1_c7lgoi1", "retrieved_on": 1430763027, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AmbyPamby1", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha! Mainly because they all are.\n\nThere are some people who are bitchy, but mainly everyone's just chill", "controversiality": 0, "created_utc": 1356396350, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lpdym", "link_id": "t3_15c0ky", "parent_id": "t1_c7libyh", "retrieved_on": 1430763325, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "Inconvenient. We no longer live in the same kind of societal system. The \"village to raise a child\" mentality is pretty much gone now in the Western world.", "controversiality": 0, "created_utc": 1356396382, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lpe5r", "link_id": "t3_15c0ky", "parent_id": "t1_c7lor43", "retrieved_on": 1430763327, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inderpwetrust", "author_flair_css_class": "green", "author_flair_text": "JJ 03-09-12", "body": "A good number of women who used wet nurses were women of higher societal status, and would likely have used formula had it been available at the time. I don't think it's a question of inconvenience, it's a question of modern Western cultural taboo.\n\nhttp://en.m.wikipedia.org/wiki/Wet_nurse\n\nWarning, opinion ahead:\n\nThis is how I see it happening. Western culture lost the need for wet nursing with the invention of formula. Formula companies really hit their stride when women entered the workforce en masse during WW2. Formula is heavily advertised as the best for a baby, breastfeeding and wet nursing falls by the wayside. The American middle class is created, and things like breastfeeding just don't fit in to the new Nuclear Family ideal. How can you possibly have a baby attached to your boob when you have dinner to cook and floors to vacuum all while wearing pearls and pumps! Breasts have become objectified as sexual playthings or something to be ashamed of and hidden.\n\nI'm not against formula, and I believe the companies producing it do their best to replicate the nutrition found in breast milk. However, that's proven hard to do. Along the way, general society was given the view that breastfeeding was something crunchy hippies did. The idea of wet nursing became repulsive to many.\n\nIn my view, I think wet nursing should make a comeback. If a woman is screened through a hospital and deemed healthy, I think she should be able to make herself available to a family in need. (Of course the question of should a woman be paid for this comes to mind, which is a whole other debate, one that I'm not focusing on right now.) \n\nIf my son weaned himself tomorrow (9 months) I would consider donating milk. I would consider considering wet nursing as well, if there was a family in need.\n\ntl;dr: I don't view using another *healthy* woman's breastmilk as undesirable, and think it should be just as accessible as formula as a choice.\n\n\n\n", "controversiality": 0, "created_utc": 1356401671, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lqehy", "link_id": "t3_15c0ky", "parent_id": "t1_c7lpe5r", "retrieved_on": 1430763869, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Offonjupiter", "author_flair_css_class": null, "author_flair_text": null, "body": "Lolz upvote for \"judgy mcjudgypants\"", "controversiality": 0, "created_utc": 1356402063, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lqh8x", "link_id": "t3_15c0ky", "parent_id": "t1_c7ldce8", "retrieved_on": 1430763904, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sarahkali08", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the article. I have read a few more things leading to more of a correlation rather than causation, thanks for pointing that out! ", "controversiality": 0, "created_utc": 1356405678, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lr75s", "link_id": "t3_15c0ky", "parent_id": "t1_c7lk4vg", "retrieved_on": 1430764242, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel more like I was depressed, and desperate to force my body to work like it was supposed to.  I think I was trying to prove I wasn't a complete failure.  I really would never have done it if the hormones hadn't driven me a little crazy.", "controversiality": 0, "created_utc": 1356410069, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ls3my", "link_id": "t3_15c0ky", "parent_id": "t1_c7lecnm", "retrieved_on": 1430764671, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "That's a good point. There are many cultures in this world where the woman who gave birth barely gets to interact with her newborn for all the aunts and sisters and grandmothers and great-grandmothers and so on. I truly think we have lost something when we chose to let go of this women's wisdom circle sort of thought... a lot of our support system is gone, a lot of pressure accumulated... kind of a side-track here, I know.\n\nAside even from nursing... this kind of support would be amazing. Women were not expected to \"go it alone\" before the era you mentioned.", "controversiality": 0, "created_utc": 1356440230, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lw5rt", "link_id": "t3_15c0ky", "parent_id": "t1_c7lqehy", "retrieved_on": 1430766581, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inderpwetrust", "author_flair_css_class": "green", "author_flair_text": "JJ 03-09-12", "body": "Yes. Those first few weeks when I struggled with breastfeeding , bouncing from LC to LC and hearing something different each time, crying along with my baby while my husband watched helpless: that would have been when a whole family's worth of experienced women would have been welcomed. It wasn't to be though, as my mother formula fed me and my siblings, and my sister has no children. The rest of the family women live hours away. We finally leaned on an LC outside of our insurance network, who swooped in like a very expensive breastfeeding fairy and finally gave me the help we needed.\n\nYou are very right. A lot of women have lost that family support structure due to our societal changes. The brunt of child rearing is placed on the mother and that brings us back to the OP's issue: being judged for her parenting choices. It's a nasty circle that should be broken.", "controversiality": 0, "created_utc": 1356453376, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lxufr", "link_id": "t3_15c0ky", "parent_id": "t1_c7lw5rt", "retrieved_on": 1430767461, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "you sound like you had a real shit hospital :( My daughter was born and they told me that it was normal for her to lose weight because I had an iv during labor. They wanted me to feed her some formula because of her jaundice because apparently you poop out the excess bilirubin, so I did. I tried pumping and nothing came out (I could NEVER pump, which is just how some women are). We were out in 3 days and my milk came in a few days later. Nobody there cared about having feeding established or anything, because they know that 5 days is probably the most common day for a first timer's milk to come in. Mine might have even been closer to 6 days. Colostrum is so packed with calories and fat and nutrients that it literally doesn't matter if your milk takes a week to come in. In fact, to be honest, babies can survive much longer than adults with no food (it helped their survival in the past). That is why when you see these miracle survivors pulled out of earthquake wreckage after a week, it's almost always babies. If I were you I would pick a new hospital next time even if you aren't going to breastfeed, because they sound horribly incompetent. \n\nIf I had 4 main pieces of advice for moms who want to nurse it would be this:\n\n1. It is normal for your milk not to come in for a week, the baby doesn't need it any sooner. \n\n2. Pumping just doesn't work for some women. If you can only pump an ounce at a time, it doesn't mean you can't make milk. The baby is just much better at getting it out of you.\n\n3. Breastfeeding hurts at first! For real. It gets better, but just because it hurts for the first few weeks doesn't mean baby has a bad latch. Even a perfectly latching baby will hurt while first nursing. My grandma nursed her last baby over 50 years ago and still cringed when she saw me nursing for the first few weeks. She said she remembered that pain like it was yesterday.\n\n4. If you give your baby formula, it will make you make less milk. It doesn't matter (to me anyways) how you feed your baby, but skipping a feeding will make your body think that it doesn't need to make that milk. \n\nI see a TON of women say \"I *couldn't* breastfeed\" and then they say it was because of one of the reasons I listed above (they wouldn't latch, I didn't make enough milk because nothing came out when I pumped\" or \"my milk didn't come in for a week!\" when really those are things that most women go through while breastfeeding. That is why people try and be more vocal about breastfeeding. Some women really can't breastfeed, but not a lot. Most of the time women are just made to believe that they can't. It's hard to walk the line of informing women of that fact, and making them feel bad. I would never want a mother to feel bad for using formula, but at the same time it makes me kind of feel bad that they might be telling other women that not being able to pump anything means that they can't breastfeed, and causing more women to beat themselves up over something that they really shouldn't!", "controversiality": 0, "created_utc": 1356489546, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m52iq", "link_id": "t3_15c0ky", "parent_id": "t1_c7ling5", "retrieved_on": 1430770892, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "I had a former classmate that wet nursed a friend's baby while her friend recovered from a serious surgery, but that was when she lived in California.", "controversiality": 0, "created_utc": 1356489774, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m54aq", "link_id": "t3_15c0ky", "parent_id": "t1_c7lor43", "retrieved_on": 1430770926, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieRose23", "author_flair_css_class": "purple", "author_flair_text": "Alice Rose - 8/28/11", "body": "Not only the family support, but the social support. I mean, before I had my daughter I had never seen a woman breastfeeding an infant in real life. This was a pretty interesting article about a zoo that had trouble getting a chimp to nurse because that chimp had never seen it done. http://www.becomingmamas.com/what-our-primate-cousins-can-teach-us-about-breastfeeding/", "controversiality": 0, "created_utc": 1356489936, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m55k1", "link_id": "t3_15c0ky", "parent_id": "t1_c7lxufr", "retrieved_on": 1430770947, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356497849, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m6xgc", "link_id": "t3_15c0ky", "parent_id": "t1_c7lfqkn", "retrieved_on": 1430771851, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "Shit that sucks. Nursing hormones- as bad as pregnancy ones. ", "controversiality": 0, "created_utc": 1356539564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mcqwl", "link_id": "t3_15c0ky", "parent_id": "t1_c7lfcp1", "retrieved_on": 1430774600, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "miparasito", "author_flair_css_class": null, "author_flair_text": null, "body": "Feed her. And when someone asks why you aren't breastfeeding, look at them and say -- in a voice both friendly and matter of fact -- \"Because I don't love her.\"\n\n", "controversiality": 0, "created_utc": 1356595466, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mpk25", "link_id": "t3_15c0ky", "parent_id": "t3_15c0ky", "retrieved_on": 1430780790, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}