{"submission": {"author": "LookingForResolution", "author_created_utc": 1355061006, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9ub93", "created_utc": 1356418184, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/15eu77/mothers_opinions_on_testicle_checks/", "gilded": 0, "id": "15eu77", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 124, "over_18": false, "permalink": "/r/Mommit/comments/15eu77/mothers_opinions_on_testicle_checks/", "retrieved_on": 1413262011, "score": 1, "secure_media_embed": {}, "selftext": "I am reposting this into this subreddit in hopes of potentially finding some responders; it was difficult to write, and I would really appreciate some feedback:\nThis is something that is rather difficult for me to talk about, but I am really hoping that the women of reddit will be willing to discuss this topic with me, and I figure it's anonymous so...it's really the only way I would ever feel comfortable talking about this subject. I am doubly interested in the opinions of women who are also mothers, or interested in being mothers, especially any mothers that may have gone through something similar with their young boys. Well...I don't want to get too graphic unless there is some interest shown, and people feel the details are necessary for more context. But basically, I had a very, very uncomfortable relationship with testicle checks as a young boy. I felt extremely private, I was very shy, and on top of that my testicles are extremely sensitive (but there is nothing explicitly wrong with them apparently, except they have an a slightly higher concentration of nerves than your average male). Any time a doctor would bring it up, or my mother, I would bolt out of the doctor's office and literally run a mile away, or just refuse to go to the doctor altogether. For the most part my mother was understanding, but not in a very \"kind\" way. I would be harshly punished and yelled at usually, but at least she would end up signing me out of the exams. Well, until one day she decided that it was time to be firm I guess. She actually went through the trouble of hiring someone to help her escort me to the doctor's office and keep me there. And...well, I had to have my first testicle check while being held down for it. After this, I guess my mom was satisfied that I at least had relatively normal equipment, and didn't really want to subject me to anymore of it, and it didn't come up too much, a few times she would ask if I was willing to have another one, but I was too freaked out to even consider it. But a few years later she felt enough time had gone by, I was older, etc... and decided to take a firm stance again. Both of these were some of the worst days of my life... the experiences were so horrible I have never been able to fully comprehend them, or how a mother could stand there and watch her son go through something like that. I really want to know if other mother's have had to do anything like this? Is it relatively common, or is this just an insane case of misfortune? =/ Articles/blogs like this one make me think it might be somewhat common: http://open.salon.com/content.php?cid=43950 I would really like to know about mother's perspectives on it, and whether you would have done essentially the same thing as my mother or not? Was it something essential, or not? I guess I am just searching for some perspective, opinions from the other side of the equation...it's taken a long time to even get the point of talking about it anonymously on the internet hah. (For age references, I was about 7 the first time, and about 12 the second time). I really appreciate anyone daring to offer their opinion up. It's an awkward subject, but a very real one to me. Thank you very much!", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Mother's Opinions on Testicle Checks", "url": "http://www.reddit.com/r/Mommit/comments/15eu77/mothers_opinions_on_testicle_checks/", "user_reports": []}, "comments": [{"archived": true, "author": "SluiceBox", "author_flair_css_class": null, "author_flair_text": null, "body": "How old are you now? It sounds like you are still very young since you haven't come to terms with the fact that it is a medical necessity. I'm sure they like doing it less than you like having it done. It most definitely hurt your mother more than it hurt you. What you need to come to terms with is the fact that everyone has to go through uncomfortable and awkward physical assessments for the sake of their health. I'm sure every woman out there would trade a Pap smear for a cup-cough check. \n\nTl/dr: You have some growing up to do. ", "controversiality": 0, "created_utc": 1356420497, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lu49z", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430765618, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "she-Bro", "author_flair_css_class": null, "author_flair_text": null, "body": "what she said. in fact you better get really used to it because a testicles check is nothing compared to a prostate exam if Im guessing.\n\n\njust think about it this way. everyone goes through it. you're not special", "controversiality": 0, "created_utc": 1356421974, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7luctw", "link_id": "t3_15eu77", "parent_id": "t1_c7lu49z", "retrieved_on": 1430765730, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I have no doubt that your experiences were intense emotionally.  The way you made it sound was that your private anatomy was never discussed or brought up unless it was in the type of situation where you were supposed to submit to some other person \"checking\" for problems.  \n\nRight off the bat, if you aren't raised to be comfortable with your body, and to understand that there is nothing \"bad\" about/on your body, it's easy to see why having a testicle check would feel humiliating, terrifying, and even leave you feeling violated.  \n\nIt sounds as though your mother had a hard time of sticking to her guns until things absolutely HAD to be done.  That parenting habit tends to cause real problems not only for the parent themselves, but for the child as well, as you experienced when she later refused to give in.\n\nConsistency is one of the biggest rules of parenting, and by failing to uphold it, you were unable to prepare yourself mentally for the exam you'd be required to sit through, which probably led to the trauma that you've carried with you all of these years.\n\nObviously, there's not much your mother can do about these instances now but apologize for not being able to help you with your feelings and fears associated with the testicle checks.  BUT, your negative experiences could prove to help you be a better parent if you choose to have children in your lifetime.\n\nKids may be young, but they're not stupid.  Often, sitting them down and talking with them about things like their body, upcoming doctor visits, even daily experiences can help them develop the resources to understand why something like a testicle check may be necessary.  It doesn't mean that they won't be nervous, embarrassed, or afraid, but it could help them come to terms with their discomfort by understanding their body and what will happen through their discussions with you.  \n\nYou can't lie to kids about procedures and expect them to willingly go to every doctor visit.  Just like you can't cave all but one time and then expect them to trust what you say, or respect your authority as a parent.  The unexpected turn of events often leaves children feeling betrayed and vulnerable.\n\nIf you were to ask me directly, I'd say that your mother was unintentionally responsible for the severely negative experience you had with testicle checks as a child.  And that you have that much more knowledge empowering you to improve as a parent where she fell short.", "controversiality": 0, "created_utc": 1356424339, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7luon4", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430765887, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not that I am unable to recognize it as medically important. But I don't see why it is so important that it can't be skipped until you are older.\n\nI don't see why it is something that can't just be left up to the kid when he is 18 of his own free will. Why does it have to be forced?\n\nAt least in cases of severe sensitivity, like mine, do you really think it was harder for my mother than for me?\n\nI've actually been able to somewhat move past it. Funnily enough, because of some other medical issues I have had to get a prostate exam, despite being pretty young still. The prostate exam was nothing compared to those testicle checks I had to go through, not even close. I guess what I am asking really is, was it actually important enough for my mother to hold me down for?", "controversiality": 0, "created_utc": 1356432146, "distinguished": null, "downs": 0, "edited": 1356433641, "gilded": 0, "id": "c7lvhbl", "link_id": "t3_15eu77", "parent_id": "t1_c7luctw", "retrieved_on": 1430766261, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "First, I really appreciate your taking the time to reply. I know this isn't the easiest thing to discuss. It means a lot to me.\n\nWhat makes you say medical necessity over simply \"medically important\"? I mean...is it really warranted for a mother to effectively restraint her son in such situations?\n\nI am really looking more for perspectives to understand the whole situation more than anything I guess. See my other comment about the fact that despite being young I've had to get prostate exams; but when I was older, and could get something like that done of my own free will, and fully understood all of the medical reasons (well to be fair, mine were potentially very serious) it seemed like an entirely different situation. Why can't testicle checks just be left until you are 18 and able to make your own free decision?\n\nFor reference, I'm only 19 now.", "controversiality": 0, "created_utc": 1356432182, "distinguished": null, "downs": 0, "edited": 1356433169, "gilded": 0, "id": "c7lvhez", "link_id": "t3_15eu77", "parent_id": "t1_c7lu49z", "retrieved_on": 1430766262, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "First, I really appreciate your taking the time to reply. I know this isn't the easiest thing to discuss. It means a lot to me.\n\nI was raised to pretty much believe that sex is evil, and that private parts are never to be shown to anyone/are dirty, etc...\n\nThat was definitely part of the problem. The other part was just that I am very shy, and literally, physically very sensitive...\n\nJust to be clear, I don't exactly hold a huge grudge or anything against my mom. I realize parents are as human as their kids. I am just at a point where I feel I could greatly benefit from learning perspectives from other mothers/women in general.\n\nAlthough sometimes I am surprised myself that it didn't affect my relationship with my mother more. I guess for a certain amount of time it must have though...\n\n\nThe experiences pretty much turned me off the idea of having kids. I would most likely not force my kids to have such exams, and would end up being hauled to jail I guess since everyone else is saying how forcing kids into these things is \"routine\" and necessary.", "controversiality": 0, "created_utc": 1356432541, "distinguished": null, "downs": 0, "edited": 1356433180, "gilded": 0, "id": "c7lvilg", "link_id": "t3_15eu77", "parent_id": "t1_c7luon4", "retrieved_on": 1430766278, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "Doctors don't just make things up. They need to check you as you develop and catch problems early. It's not a conspiracy to make you do something you don't want to. Your mom did the right thing. I hope you can see that and take better care of yourself as it is now your responsibility.", "controversiality": 0, "created_utc": 1356451204, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lxh4q", "link_id": "t3_15eu77", "parent_id": "t1_c7lvhez", "retrieved_on": 1430767201, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "There are no exceptions? It needed to be done despite my special case of extreme sensitivity?", "controversiality": 0, "created_utc": 1356453501, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lxv6v", "link_id": "t3_15eu77", "parent_id": "t1_c7lxh4q", "retrieved_on": 1430767468, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "prairiefantasque", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm surprised your mother signed you out of the exams, I would have never done that because it is very important for little boys to get their testicles checked regularly. Your mom just wanted to make sure you were healthy, nothing mean about that…Your sensitivity doesn't really matter, there are no exceptions, you just needed to get your testicles checked. ", "controversiality": 0, "created_utc": 1356456048, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lyc6v", "link_id": "t3_15eu77", "parent_id": "t1_c7lxv6v", "retrieved_on": 1430767679, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Really? Do mothers not feel bad about just standing there and making their little boys go through torture like that though? =/", "controversiality": 0, "created_utc": 1356456307, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lydyp", "link_id": "t3_15eu77", "parent_id": "t1_c7lyc6v", "retrieved_on": 1430767702, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "prairiefantasque", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, I don't know, but they shouldn't feel bad about it!", "controversiality": 0, "created_utc": 1356456654, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lygdf", "link_id": "t3_15eu77", "parent_id": "t1_c7lydyp", "retrieved_on": 1430767737, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Why not?", "controversiality": 0, "created_utc": 1356456935, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lyib4", "link_id": "t3_15eu77", "parent_id": "t1_c7lygdf", "retrieved_on": 1430767759, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "prairiefantasque", "author_flair_css_class": null, "author_flair_text": null, "body": "Getting your testicles checked is not the worst thing ever, just a simple exam...but very important.", "controversiality": 0, "created_utc": 1356457445, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lylu0", "link_id": "t3_15eu77", "parent_id": "t1_c7lyib4", "retrieved_on": 1430767805, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "They seem like the worst things in the world to me, since I am especially sensitive =/\n\nPretty much any other exam seems better to me...", "controversiality": 0, "created_utc": 1356458295, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lyryi", "link_id": "t3_15eu77", "parent_id": "t1_c7lylu0", "retrieved_on": 1430767886, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "As mothers we have to do a lot of really not fun things to make sure our kids are healthy. If you were my kid I probably would have talked to you about it ahead of time and let you know that it was absolutely going to be done. I also would have spoken to the dr to see if there was anything they could do to make you more comfortable. I really don't think your mother handled it well at all. It's absurd to excuse a child from an exam, but then punish him for not going. When my daughter was 18 months old she was diagnosed with advanced Lyme disease. For an entire year I had to take her to a specialist and get bloodwork done every time. The first time they did the testing was in an ER. they couldn't find a vein and I had to physically hold down my screaming toddler for 45 minutes while they poked and poked. It brings tears to my eyes to even think about it now, but she's a happy healthy 4 yr old. Luckily the specialist was much better at it then the ER was. My son just had an infection under his foreskin so I got to give him the same treatment while it was being cleaned. I hated every second of it, but we do what we need to. Testicle exams are an UN-fun fact of life for men, but your mom did you a disservice by not preparing you for it and letting you think they're optional. Now if you want to talk about the necessity of them i'd ask your doctor. Maybe he can shed some light on why they're so important\n", "controversiality": 0, "created_utc": 1356463393, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lztj0", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430768386, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow...well, the wrong impression was definitely given because I had always thought they were optional, and she just decided to do it anyway.\n\nWould you have given your son the same treatment for a testicle check if he didn't cooperate?... Or is holding down reserved for more important things?", "controversiality": 0, "created_utc": 1356464222, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7lzzkm", "link_id": "t3_15eu77", "parent_id": "t1_c7lztj0", "retrieved_on": 1430768475, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had to hold my kids down for well checks and vaccines when they were infants/toddlers, but not anymore. If my kid was really nervous about an upcoming exam I would make him an appointment to see his regular dr, talk about what to expect, and let him/her ask any questions. I would tell my kid before hand, we'll listen to what the dr says needs to be done, and If it has to be done then we'll make you as comfortable as possible, and if he still fought me on it then yes, I'd hold him down.I remember being really nervous about my first lady dr appointment, so my mom took me shopping for \"fancy\" underwear and tried to explain what would happen beforehand. I think open communication goes a really long way. If your dr and your mom had talked to you, explained why it was important, let you ask questions and done everything they could to make you more comfortable would that have been easier for you to handle?", "controversiality": 0, "created_utc": 1356466172, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m0dpw", "link_id": "t3_15eu77", "parent_id": "t1_c7lzzkm", "retrieved_on": 1430768647, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, to be honest, probably not. I had it somewhat explained to me. I basically knew what wold happen. The reason I fought/ran was because of how sensitive my testicles are, not because I just didn't want to cooperate =/ So I really am not sure there was anything that could've been done to convince me when I was young.\n\nHow would you have really explained it though?\n\nAlso, how old were you for your first \"lady\" dr appointment? I assumed those happened when girls were pretty old, almost 18?", "controversiality": 0, "created_utc": 1356469353, "distinguished": null, "downs": 0, "edited": 1356469862, "gilded": 0, "id": "c7m114t", "link_id": "t3_15eu77", "parent_id": "t1_c7m0dpw", "retrieved_on": 1430768952, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Loluka", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had to hold my daughter down for shots that were important for her health. She hated it and she cried but she got over it. I've had to hold her down for measurements too (to make sure she's growing at the appropriate rate, etc). It's never a fun thing to need to do, but it's important. I would do the same thing your mother did if it meant making sure my child was healthy.", "controversiality": 0, "created_utc": 1356472860, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m1ptp", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430769324, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you feel bad having to hold them down, or is it just a routine part of the exam?", "controversiality": 0, "created_utc": 1356473963, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m1xlu", "link_id": "t3_15eu77", "parent_id": "t1_c7m1ptp", "retrieved_on": 1430769427, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "booksarepretty", "author_flair_css_class": "brown", "author_flair_text": "Jack, 12 Months", "body": "It doesn't always happened around 18. I had my first examination \"down there\" when I was 15 due some issues. It was terrible. I didn't want to do it, but my parents and doctors needed me to do it. I hardly remember it being terrible once it was finished. \n\nThose types of examinations aren't fun for anyone but people do them all the time. \n\nMy husband had a late regrowth on his circumcision. He had to have it peeled back for quite some time at a few visits when he was around 3 and had to have it rechecked until he was well into his preteens. He hated but it was better than not checking it and having to get surgery later on. Same goes with athletic physicals when he was a teen. They cupped and felt around or else he couldn't play. ", "controversiality": 0, "created_utc": 1356474825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m23r7", "link_id": "t3_15eu77", "parent_id": "t1_c7m114t", "retrieved_on": 1430769514, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Hmm, but 15 is still twice the age of 7 =/\n\nI remember coming very close to being cornered into doing one of those sports physicals. It was one of the most awful moments ever when they told me a testicle check was part of it. But for whatever reason, my mother signed me out of it because I refused so much, and I guess they couldn't restrain me in the more public setting.\n\nBut because of that she decided to be firm again and took me to the doctor's a some time later and made me get checked. Do you think that was the right thing to do?", "controversiality": 0, "created_utc": 1356475325, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m27eb", "link_id": "t3_15eu77", "parent_id": "t1_c7m23r7", "retrieved_on": 1430769556, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "booksarepretty", "author_flair_css_class": "brown", "author_flair_text": "Jack, 12 Months", "body": "Yes, I do think it was the right thing to do. At 7, or even 15 you aren't in a position to decide what is best for you medically. At least that is my opinion. There might be a medical reason your testicles are so sensitive. To find out why, a doctor would have to examine you.   \n\nI would make my son undergo the tests necessary for his health. Most children, mine included, move on rather quickly for any ordeal and I am there the whole time. \n\nI am sure your mom did what she thought was best for you to be healthy. This procedures are fairly common and preformed for a reason. Is there a reason why this still bothers you? Have you spoken to a doctor or maybe a therapist? There could be more at the heart of the issue, maybe? ", "controversiality": 0, "created_utc": 1356478664, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m2v3s", "link_id": "t3_15eu77", "parent_id": "t1_c7m27eb", "retrieved_on": 1430769846, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Loluka", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel terrible that I need to. I always try to give her something special afterwards.", "controversiality": 0, "created_utc": 1356480025, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m34s9", "link_id": "t3_15eu77", "parent_id": "t1_c7m1xlu", "removal_reason": null, "retrieved_on": 1435654291, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know.\n\nIt somehow helps to know it wasn't an isolated case. At the same time I cannot see how it wouldn't have affected me a lot. I guess a big part of it was feeling betrayed by my mother at the time; I couldn't believe she would hold me down and let someone touch something so private, and plus it is just beyond uncomfortable because of how sensitive I am.\n\nAnd then it somehow got reinforced again because I thought it would never have to happen again, but it did.\n\nMaybe it'll bother me less in time to know that other mother's would have done the exact same thing...I've always felt I was very unusual and had to suffer just because my mother was being mean or something.\n\nIn that sense this post has been pretty helpful actually... I am pretty surprised. I still feel that same sensation like, it seems like it is so easily decided to condemn a young boy to such an awful exam...", "controversiality": 0, "created_utc": 1356480585, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m38mk", "link_id": "t3_15eu77", "parent_id": "t1_c7m2v3s", "retrieved_on": 1430770032, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess that's nice. Maybe part of my issue was that my mother was just upset that she even had to hold me down...so it was pretty much bad on top of bad. It made it seem like she didn't care at all about how awful the testicle checks were...I really have no idea how true that is, but it seemed like she didn't care at all.\n\nWhen I tried to talk to her about it she borderline laughed at me, and told me that it was just something all boys have to get done, and pretty much closed off any future discussion, which only reinforced that idea.", "controversiality": 0, "created_utc": 1356480705, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m39ho", "link_id": "t3_15eu77", "parent_id": "t1_c7m34s9", "retrieved_on": 1430770038, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "booksarepretty", "author_flair_css_class": "brown", "author_flair_text": "Jack, 12 Months", "body": "For most children it isn't a thing that continues to bother them. Your issue is something you should seriously consider discussing with a medical professional. That sensitivity isn't normal and could be related to how you view your genitals. \n\nMost parents ( not just moms) are going to do the things that medically necessary for their children to live healthy lives. Those\nchecks test for growths, cancers, and other problems. Doctors and parents are usually very sensitive to emotions of the children, and usually attempt to provide a safe and as easy as possible exam for the child. \n\nYou should discuss this issue with your mother. It might give you some closure on why she did what she did. Having a child is a huge responsibility. We are in charge of their health, safety, happiness, etc, and juggling all those things are never easy. \n\nAlso, those exams for children are often a front line of defense against many healthy problems.\n\nI hope you are able to some peace with this. ", "controversiality": 0, "created_utc": 1356481373, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m3e4s", "link_id": "t3_15eu77", "parent_id": "t1_c7m38mk", "retrieved_on": 1430770088, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "You are shockingly hung up on this.  While I understand being terrified of it as a kid, shouldn't you now accept that it's just a standard medical check?  One of my kids is phobic of shots.  Do I make him get them anyway?  Absolutely.  He cries for days ahead of time because he hates them soooo much, but a parent has to be the bad guy sometimes to ensure their kid's well-being.  If your mom had chosen to not fight you on the testicle check and something bad had happened, she would never have forgiven herself.  Maybe you can forgive her for putting your health above your comfort.  I imagine it was nearly as stressful for her as it was for you.  ", "controversiality": 0, "created_utc": 1356484222, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m3ygo", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430770377, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356491048, "distinguished": null, "downs": 0, "edited": 1356491296, "gilded": 0, "id": "c7m5e3d", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430771121, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "isnt_that_special", "author_flair_css_class": null, "author_flair_text": null, "body": "As a chick, I can guarantee our exams are way more invasive ;) Although, to your point, for most women they don't occur until 16 years or older.\n\nAs a mother, I would not have restrained my son for this type of exam, but skipping them is not an option. If my son is uncomfortable with it in the future, I will make sure he sees a counselor to get to the root of his sensitivity and work with him to get over his fear. ", "controversiality": 0, "created_utc": 1356491144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m5euj", "link_id": "t3_15eu77", "parent_id": "t1_c7lyryi", "retrieved_on": 1430771132, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sensitive to your concerns because I was sexually abused as a little girl for 2 years by my moms friends son who lived with us.  I am sharing that as to not belittle your fears.  It actually makes me wonder of someone hurt you.  Regardless o haven't forgiven my mother completely but therapy really helped. Imagine, I forgave the rapist before her!\n\n", "controversiality": 0, "created_utc": 1356493329, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7m5wbi", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430771383, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Well...if skipping was not an option, what would you do in the case of absolute refusal to cooperate?\n\nI don't know if I buy the \"more invasive\" argument. Testicles are insanely sensitive... what is comparably sensitive that has to be subjected to touch for girls?\n\nSometimes I even wish I had been a girl because of the later exams, and the lack of something extremely sensitive to deal with...=/", "controversiality": 0, "created_utc": 1356517822, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ma58b", "link_id": "t3_15eu77", "parent_id": "t1_c7m5euj", "removal_reason": null, "retrieved_on": 1435654070, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "It's just hard to accept something that was so awful as being standard...this thread represents the first time I have really had any real conception of it as such. =/", "controversiality": 0, "created_utc": 1356518103, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ma637", "link_id": "t3_15eu77", "parent_id": "t1_c7m3ygo", "retrieved_on": 1430773400, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I really don't know why more boys aren't bothered by it...I have talked to a therapist about it, but they were completely unhelpful, and pretty much linked it to the extra trauma involved because of my heightened physical sensitivity. Actually, the therapist said at some point maybe getting perspective on the whole situation would help...so I guess that is what I am trying to do here?\n\nI wasn't initially ready to admit this, even anonymously...but because you brought up the fact that you don't think you are capable of making the right medical decisions even at 15 I feel like maybe I can. I am really somewhat embarrassed by this because it sounds worse than the other exams...but my last testicle check was at 15. I was too traumatized by the earlier exams to get it done myself. So my mother signed me up for one without telling me; or made the decision to have it done. The thing that was the catalyst was getting a physical for some summer camp thing. It turned out at the doctor's that a testicle check was on the required list, but I was just not prepared to get it done really. Somehow my mom was convinced by the doctor that she should be firm and be there to make me go through with it though.\n\nMaybe there was something especially bad about not being able to do it on my own, and having my mother in the room at that age that left a particularly awful memory...\n\nShouldn't my mother have just let things slide by that age?... Or was the testicle check still not optional even then?", "controversiality": 0, "created_utc": 1356518812, "distinguished": null, "downs": 0, "edited": 1356520160, "gilded": 0, "id": "c7ma89c", "link_id": "t3_15eu77", "parent_id": "t1_c7m2v3s", "retrieved_on": 1430773421, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess that seems like a likely explanation, but unless I am repressing it 100% I don't know of any sexual abuse, other than the testicle checks themselves...=/", "controversiality": 0, "created_utc": 1356518865, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ma8em", "link_id": "t3_15eu77", "parent_id": "t1_c7m5wbi", "retrieved_on": 1430773423, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't mean to belittle it.  It seems like you would benefit from therapy for it.  Abuse is still.abuse even if it happened in a Dr.'s office", "controversiality": 0, "created_utc": 1356528405, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mb1b5", "link_id": "t3_15eu77", "parent_id": "t1_c7ma8em", "retrieved_on": 1430773802, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "It seems like everyone else world disagree with this view (see the rest of this very post's comments)...why do you think that is?", "controversiality": 0, "created_utc": 1356530291, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mb8eh", "link_id": "t3_15eu77", "parent_id": "t1_c7mb1b5", "retrieved_on": 1430773888, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "That's like saying \"why give your kid a shot\" and \"shouldn't the child be able to opt out because it hurts and is uncomfortable\". TFB. Pap smears hurt too- in fact you can bleed from them. Did your nuts bleed after they got checked? You'll get no sympathy from me. It is something you have to check for. A child is not going to go through a cost benefit analysis like an adult and rightfully so- a child's brain isn't finished developing. A child isn't going to fully understand the risks involved eith forgoing  a check up.\n Here's a [site](https://www.cornellurology.com/clinical-conditions/pediatric-urology/cryptorchidism/) that goes over what can be wrong and what needs to be done about it.", "controversiality": 0, "created_utc": 1356539105, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mcnfc", "link_id": "t3_15eu77", "parent_id": "t1_c7lyryi", "retrieved_on": 1430774548, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ravensreign3", "author_flair_css_class": null, "author_flair_text": null, "body": "Are you familiar with female anatomy? My first exam occurred when I was 8 because I had been raped. So I can say I was \"harassed\" by a doctor in an age near yours. A metal  speculum was inserted into my vagina and my tiny painful bleeding vagina was forced to open wide enough that the doctor could see in and use various tools. I was scraped with several different swabs inside of my vagina it was very painful and confusing at such a young age. Having your cervix poked with a stick is not pleasant in the slightest.  My mother cried. I did not resist the procedure (I did complain of the pain) but If i had resisted my mother would have forced me to go through with it anyway because it was critical information to know. She would have felt bad, but it was necessary.  She would have been HYSTERICAL because she was already at the breaking point due to such a high trauma situation, and she STILL would have held me down if needed because it was a necessary evil. At the time I was confused. In retrospect, i completely understand why it needed to be done, and proud that my mother was there and willing to do what was necessary, not just scrub my skin off with a nail brush like my aunt and pretend nothing was wrong. EVERY other person on here has said that the testicular exam is a necessary evil. I'm sorry you feel that your testicles are particularly sensitive (most men i know will claim theirs is more sensitive then other men's. Yours might be, i obviously do not know you, but all men have sensitive testicles.  I do not know a single man who enjoys the exam, but it is tolerated for health) I am sorry that you were traumatized by this event.  Your mother probably should not have allowed you to bypass this exam so often. The thing is, she is your mom, and genuinely tried to do her best. Being a parent means they are responsible for you and your health. If something horrid had occurred with your testicular development she would have felt horrid for not forcing you to have exams done. Regarding your previous mention of thinking you were able to make health decisions for yourself at 15. Probably not. Opinions on your health sure, but still a child, still under your mother's guidance. Still young enough to think that it was unnecessary and could be skipped on. The decision was still her's to make. It seems that you have a negative view on your own body and sexuality due to being raised that way.  THAT is an issue I would try to seek therapy for. That seems to be the root of your problem with the exams in the first place. Try not to be angry or resentful to your mother, she tried her best.  You seem to be frustrated with the lack of posts here \"supporting\" your trauma/feelings of the topic.  I'm sorry if that makes you feel invalidated at all, I'm sure that is no ones intention. The fact that you are upset by all of this is understandable. I believe the general consensus here though is that yes, the exams are necessary to ensure proper development. Also that your strong reaction to this is likely something you should continue to seek help for.  From your posts I infer that you are typically skeptical of things that your therapists have suggested. Whereas not all of them are great, they have gone to school to study how your brain works. Make sure to give genuine effort into the things they ask/recommend/say. I wasted several years of therapy by brushing it off as \"they just dont get it.\"  Once i finally tried following their suggestions, even rolling my eyes and saying it was stupid, things started to get better. Sorry this is SOOO long. I'm also sorry if it sounds like im chiding you at all, I'm not trying to, just incredibly tired and trying to be short (didnt really work).", "controversiality": 0, "created_utc": 1356539106, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mcnfq", "link_id": "t3_15eu77", "parent_id": "t1_c7ma58b", "retrieved_on": 1430774548, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess it seems like there must be sexual abuse to explain it... but so far as I know there was none. To me the sexual abuse WAS the testicle checks... being held down and forcibly having my genitals violated was pretty much the most violating thing that happened to me.\n\nI came here to see what the real opinions of other mother's are...I think it's actually been more helpful that they seem to mostly be the same as, or even meaner in some sense, than my own mother's. It is slowly changing my whole perspective on things.\n\nI really appreciate your time and willingness to be honest and direct.\n\nI wonder if it would've been better (i.e. somehow would've got more used to) the exams if I had more of them...but from a distance it seems like it would've been horrible.\n\nHow often do you think my mother should have had me get testicle checks?\n\nDo you really think it was important for her to force me to get a testicle check at 15?\n\nWould you have found it better to not sign me out of the sports physical testicle check and made me do it in public as opposed to having it done in private?\n\n\nAlso...it seems like the whole strategy of forcing somewhat backfires since now that I am old enough to make my own decisions, I am pretty much too afraid of/incapable of doing it. =/", "controversiality": 0, "created_utc": 1356543292, "distinguished": null, "downs": 0, "edited": 1356544853, "gilded": 0, "id": "c7mdlgp", "link_id": "t3_15eu77", "parent_id": "t1_c7mcnfq", "retrieved_on": 1430775056, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "But...testicles are like super sensitive eyeballs that are exposed...having them poked and prodded is painful in a hyper sensitive way that is different from the kind of pain that leads to bleeding =/\n\nDo you really think that extra-sensitivity should play no factor? You have to get checked anyway?", "controversiality": 0, "created_utc": 1356545863, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7me83i", "link_id": "t3_15eu77", "parent_id": "t1_c7mcnfc", "retrieved_on": 1430775354, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "So is the cervix! They seriously scrap cells off for a Pap smear 0.o\n\nI think I would've asked the doctor if my son expressed hyper sensitivity but it still done the check ups. They might've done an ultrasound instead had your mother asked and explained how you felt. That's something you might want to have looked at anyway", "controversiality": 0, "created_utc": 1356546278, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mebsp", "link_id": "t3_15eu77", "parent_id": "t1_c7me83i", "retrieved_on": 1430775403, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Why would you have the checkups done anyway even if your son was hyper-sensitive?\n\nAn ultrasound of them sounds pretty intense too...but if it had uncovered something I guess maybe it'd have been worth it at least =/\n\nNothing ever even came from all the torture of the testicle checks...in some ways, that is the worst part hah", "controversiality": 0, "created_utc": 1356546746, "distinguished": null, "downs": 0, "edited": 1356547319, "gilded": 0, "id": "c7mefxk", "link_id": "t3_15eu77", "parent_id": "t1_c7mebsp", "retrieved_on": 1430775456, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "Because the problems need to be corrected or they can cause infertility or an increase in cancer risk\n\nUltrasound is less invasive. They smear some jelly on you and then put the wand on. They aren't checking for a uterus or anything deep so it would be gentle unless they were searching your abdomen for testes that didnt make their way down. ", "controversiality": 0, "created_utc": 1356547165, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mejjv", "link_id": "t3_15eu77", "parent_id": "t1_c7mefxk", "retrieved_on": 1430775512, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "It still sounds weird...but oddly, it sounds more like an actual medical procedure; I probably would have been more ok with the ultrasound than a regular testicle check as a kid =/\n\nHow often would you make your son get checked?", "controversiality": 0, "created_utc": 1356547371, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7melc6", "link_id": "t3_15eu77", "parent_id": "t1_c7mejjv", "retrieved_on": 1430775537, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "My son is 15months at the moment. They've checked his testicles a few times. He is certainly not as sensitive as you- I have to regularly mess with his foreskin for stretching and he gives not one fuck. I'm actually curious as to how you took diaper changes and if you were always sensitive or associated it with something negative and don't like to be touched there now.... Otherwise changing your diaper would've been a pain in the ass. Shit gets all over the nuts an you can't just not wipe them clean", "controversiality": 0, "created_utc": 1356547625, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7menj5", "link_id": "t3_15eu77", "parent_id": "t1_c7melc6", "retrieved_on": 1430775561, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess I don't remember, but from what I've heard it was pretty challenging to change me as a kid. I preferred being naked. It's possible I hated it because of super sensitivity, but no one ever seems to have linked it to that directly =/\n\nI remember having some foreskin issues as well...nothing major, but it didn't retract until somewhat late, and it was very painful the first time it was done. =/ Fortunately it turned out to be ok...I would have hated to had to get circumcised. I don't think I could've survived that.", "controversiality": 0, "created_utc": 1356547845, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mepiv", "link_id": "t3_15eu77", "parent_id": "t1_c7menj5", "retrieved_on": 1430775581, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "This may sound like an odd question, but...for sake of argument, suppose this was happening somehow in the future, and instead of me being on here, my mother was on here asking for advice with a shy/sensitive son who was saying her testicles were way too sensitive to get checked, and he completely refused to get them checked at the doctor's; what advice do you think you would give her?", "controversiality": 0, "created_utc": 1356548312, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7metna", "link_id": "t3_15eu77", "parent_id": "t1_c7menj5", "removal_reason": null, "retrieved_on": 1435653948, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "Ask a doctor about the sensitivity and bribe you with your favorite thing ever. My mom would give me McDonalds if I was a \"big girl\" during shots. Still hate shots and needles, but goddamn McDonalds fries are my go-to comfort food. ", "controversiality": 0, "created_utc": 1356548452, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7meuv4", "link_id": "t3_15eu77", "parent_id": "t1_c7metna", "retrieved_on": 1430775659, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "A bit ironic haha\n\nI wish bribery had worked on me; it seems to work for most kids that fall into the problem end of the spectrum. Instead by not cooperating I ended up being doubly screwed and just getting yelled at for not cooperating hah\n\nIf the bribery failed would you have just told her to give up on the exams?", "controversiality": 0, "created_utc": 1356548608, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mew7g", "link_id": "t3_15eu77", "parent_id": "t1_c7meuv4", "retrieved_on": 1430775678, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "Maybe ask the doctor which ones were absolutely necessary- I think the ones right near puberty matter most but I could  be wrong. Temporary discomfort is better than cancer- best way to explain the necessity of it. ", "controversiality": 0, "created_utc": 1356548762, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mexi6", "link_id": "t3_15eu77", "parent_id": "t1_c7mew7g", "retrieved_on": 1430775694, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess that may be why my mom was even more concerned with me getting them at older ages (12-15).\n\nWould you still force your son to get the exams at that age, I mean, be in the exam room and everything?", "controversiality": 0, "created_utc": 1356549043, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mezyh", "link_id": "t3_15eu77", "parent_id": "t1_c7mexi6", "retrieved_on": 1430775730, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "If you read the link, the checks at puberty show if something is wrong. Absolutely would make my kid get it: cancer and infertility (without a choice) is worse than temporary discomfort. It sucks, but it's a necessary evil", "controversiality": 0, "created_utc": 1356551701, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mfnf2", "link_id": "t3_15eu77", "parent_id": "t1_c7mezyh", "retrieved_on": 1430776032, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess I am wondering more...would you, be in the exam room with your son at that age? If he still refused to cooperate that is?", "controversiality": 0, "created_utc": 1356552154, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mfrct", "link_id": "t3_15eu77", "parent_id": "t1_c7mfnf2", "retrieved_on": 1430776078, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wearmyownkin", "author_flair_css_class": "blue", "author_flair_text": "Baby boy born Sept 2011", "body": "Uh I can't really say. Depends on my son I guess- would it relax him more if I'm there or make it worse since I could potentially see his junk, lol. I know I started getting shy around 13 or so. Now I don't give a fuck but you know... Maybe his dad being there would be better than me as his mother. I care about different gender family seeing me naked but mom, aunt, sisters... Don't care. Son may be the same ", "controversiality": 0, "created_utc": 1356552608, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mfv9z", "link_id": "t3_15eu77", "parent_id": "t1_c7mfrct", "retrieved_on": 1430776128, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, if you were his only parent (as in my case) and he completely refused.\n\nI guess the alternative would be to simply order nurses to restrain him?\n\nMaybe that would be the better option actually.", "controversiality": 0, "created_utc": 1356552732, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mfwe1", "link_id": "t3_15eu77", "parent_id": "t1_c7mfv9z", "retrieved_on": 1430776144, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "Your fear/discomfort of the procedure is incredibly severe, obviously. It fits the medical definition of a phobia and you should see a therapist about it because you should not be so affected by this still.  ", "controversiality": 0, "created_utc": 1356553222, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mg0qa", "link_id": "t3_15eu77", "parent_id": "t1_c7ma637", "retrieved_on": 1430776199, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there an official phobia of getting your testicles checked?...\n\nAren't phobias, like, hardwired into you, so I was a time bomb waiting to explode when first faced with getting a checkup? =/", "controversiality": 0, "created_utc": 1356553436, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mg2ly", "link_id": "t3_15eu77", "parent_id": "t1_c7mg0qa", "retrieved_on": 1430776228, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know that there's an official ball-touching phobia and I'm afraid to google it ;) and, no, phobias aren't hardwired into you.  They're usually caused by something traumatic happening to you, but can also be caused by an overly-active imagination. ", "controversiality": 0, "created_utc": 1356554122, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mg8j8", "link_id": "t3_15eu77", "parent_id": "t1_c7mg2ly", "retrieved_on": 1430776322, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "\"They're usually caused by something traumatic happening to you,\"\n\nI.E. Being forcibly dragged to a doctor's office, and held down while you have your most sensitive body part poked and prodded?...\n\nWhy wouldn't that be enough to trigger a phobia exactly?", "controversiality": 0, "created_utc": 1356554254, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mg9p0", "link_id": "t3_15eu77", "parent_id": "t1_c7mg8j8", "retrieved_on": 1430776328, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "Whoa.  That was an innapropriate response.  \nYou really should see a therapist.  You do not come off as very stable in this thread.  I'm not judging...I've seen some of the smartest, kindest people I know go a little sideways and your comments sound like they're written by someone on the slide.  Please take care of yourself.  You deserve to be healthy and happy because life is seriously very short.  ", "controversiality": 0, "created_utc": 1356555013, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mgg9o", "link_id": "t3_15eu77", "parent_id": "t1_c7mg9p0", "retrieved_on": 1430776411, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't get how that is not a legitimate question?\n\nThat is literally what happened to me...\n\nWhy isn't that something that could potentially traumatize someone?", "controversiality": 0, "created_utc": 1356555186, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mghr3", "link_id": "t3_15eu77", "parent_id": "t1_c7mgg9o", "retrieved_on": 1430776426, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "You said, \"aren't phobias hard-wired?\" I said, \"no,\" you then wigged out as if I said that what happened to you was not traumatic.  It clearly was.\nThis subject is a very difficult one for you and your comments and reactions are very strange.  Maybe you're just a really awkward person, but given how worked up you are on this subject, I'm under the impression that you need to spend more time in therapy.  ", "controversiality": 0, "created_utc": 1356556327, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mgrmk", "link_id": "t3_15eu77", "parent_id": "t1_c7mghr3", "removal_reason": null, "retrieved_on": 1435653901, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I was just saying, if you are correct that phobias aren't hardwired, but caused by some traumatic event, then why couldn't a testicle check itself be a traumatic event?\n\n\nThe way you refer to therapy as a miraculous cure all for anything and everything makes me wonder if you have ever seen a therapist, or just movies with them as plot devices?", "controversiality": 0, "created_utc": 1356558135, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mh76w", "link_id": "t3_15eu77", "parent_id": "t1_c7mgrmk", "retrieved_on": 1430776759, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "*hugs*\n\nI know how you must've felt. When I was very young (maybe 3-4 years old) I had to have blood drawn for some reason and a combination of me having wiggly veins that run away from sharp pokey things, my smaller than average veins (it's a family trait) and a doctor who couldn't get a vein no matter how hard he tried ended up with me screaming my head off. Eventually, it got to the point where the doctor had my mom and a nurse hold me down while he jabbed me in the neck where the big veins were sticking out really good from all of my crying/screaming.\n\nI've been terrified of needles ever since, to the point of almost vomiting whenever I get my blood drawn.  Last year I had to be sedated for some dental work and the guy doing the IV just COULD NOT get the needle in. He tried nine times before he got a spot he was comfortable with and by the time he was done inserting it, I was crying, shaking and  trying really hard not to cuss him out (although I did call him a truck driving son of a platypus).", "controversiality": 0, "created_utc": 1356558179, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mh7jr", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430776761, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "If a boy had an undescended or late descending testicle at birth, they often do a check to make sure they're staying right where they should be. That's the explanation our pediatrician has given us, anyway, since DS had one that failed to drop on time (it showed up about 10 days after birth).", "controversiality": 0, "created_utc": 1356558299, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mh8ks", "link_id": "t3_15eu77", "parent_id": "t1_c7lztj0", "retrieved_on": 1430776773, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't say it couldn't.  That was why your indignant reaction was so bizarre.  \n\nWhen someone says you need therapy and it sounds disingenuous to you it's usually because it's being used as a euphamism for \"you don't sound sain and need some serious help\".   I just don't want to be so harsh.  You seem nice, just \"off\".  ", "controversiality": 0, "created_utc": 1356560809, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mhtxd", "link_id": "t3_15eu77", "parent_id": "t1_c7mh76w", "retrieved_on": 1430777070, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "\"I didn't say it couldn't. That was why your indignant reaction was so bizarre.\"\n\nI don't get the point of the discussion then. Somewhere along the way there was some miscommunication of some sort.\n\nI was really just trying to ask a question. Think you are reading too much into everything that is said and seeing what is not there...", "controversiality": 0, "created_utc": 1356565882, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mizzu", "link_id": "t3_15eu77", "parent_id": "t1_c7mhtxd", "retrieved_on": 1430777627, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "It would be nice if we could get off of mental health at the moment though. I'm willing to admit to needing therapy, but this whole post is part of it for me.\n\nBeing able to read messages like those from booksarepretty and  ravensreign3 is helping me gain a huge amount of perspective I never had before, and I am slowly becoming more comfortable with things, but it's not an instantaneous process.\n\nI am incredibly thankful to everyone that has been going through this with me, I hope you don't all see it as a lost cause. I really appreciate being able to gain this perspective on the whole situation!\n\nIf you have something to contribute to that, it would be great.", "controversiality": 0, "created_utc": 1356567444, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjcmt", "link_id": "t3_15eu77", "parent_id": "t1_c7mhtxd", "retrieved_on": 1430777768, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "*hugs*\n\nWell, this just seems to show that medical exams can cause trauma I guess. I feel extra sorry for you though, because getting blood drawn is EVERYWHERE =/ I can just avoid testicle checks...it's pretty much impossible to avoid having blood drawn without just refusing all medical care =(\n\nDo you see that original medical procedure as necessary? Did you always?", "controversiality": 0, "created_utc": 1356567564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjdlx", "link_id": "t3_15eu77", "parent_id": "t1_c7mh7jr", "retrieved_on": 1430777780, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I honestly can't remember what the heck they were drawing blood FOR and neither can my mom so I can't say if it was a necessary procedure or not.", "controversiality": 0, "created_utc": 1356567908, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjgeu", "link_id": "t3_15eu77", "parent_id": "t1_c7mjdlx", "retrieved_on": 1430777818, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm really glad it's helping, am happy you posted, and I'm really sorry the checks were so traumatic for you.  Best of luck, lookingforresolution! ", "controversiality": 0, "created_utc": 1356567972, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjgzc", "link_id": "t3_15eu77", "parent_id": "t1_c7mjcmt", "retrieved_on": 1430777837, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Hmm, how do you view it then? As most likely necessary, or not?\n\nI guess I am actually quite curious whether you have an opinion about (then necessity of) my exams given your experience (?)", "controversiality": 0, "created_utc": 1356568319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjjtu", "link_id": "t3_15eu77", "parent_id": "t1_c7mjgeu", "retrieved_on": 1430777878, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks =)", "controversiality": 0, "created_utc": 1356568587, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjlz8", "link_id": "t3_15eu77", "parent_id": "t1_c7mjgzc", "retrieved_on": 1430777909, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I think that in some cases, it's absolutely neccessary. It's just one of those things, that while unpleasant, every once in awhile you have to suck it up and get through it.\n\nEvery year, I have to go to the doctor and have him grope my boobs for a breast exam which I don't really care for but I figure it's just something I HAVE to do for my own good. To me, a guy having his balls handled by a medical professional is kind of the same thing. You don't like it, the doctor probably doesn't like it either but it's part of his job to check for any abnormalities, etc by fiddling with them.", "controversiality": 0, "created_utc": 1356569549, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjtti", "link_id": "t3_15eu77", "parent_id": "t1_c7mjjtu", "retrieved_on": 1430778008, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "What would the cases be where it was not absolutely necessary?\n\nDo you think that my case was one such?\n\nOr do you think my mother did the right thing by holding me down for them?", "controversiality": 0, "created_utc": 1356569847, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mjwaw", "link_id": "t3_15eu77", "parent_id": "t1_c7mjtti", "retrieved_on": 1430778052, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I was trying to suggest in a nice way to see a therapist.  It will be awesome. Not a shrink just someone to work through the issues with.  Why people disagree is because I may have suggested abuse but only because of your reaction.  \n", "controversiality": 0, "created_utc": 1356570740, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mk3mn", "link_id": "t3_15eu77", "parent_id": "t1_c7mb8eh", "retrieved_on": 1430778151, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Is abuse only present if something ends up effecting you negatively?", "controversiality": 0, "created_utc": 1356570913, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mk51e", "link_id": "t3_15eu77", "parent_id": "t1_c7mk3mn", "retrieved_on": 1430778177, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Would you be open to sharing your opinion on the necessity of testicle checks? How often they should be done, if at all? How you think refusal to cooperate with them should be handled? I am really curious about your opinions.", "controversiality": 0, "created_utc": 1356571113, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mk6p5", "link_id": "t3_15eu77", "parent_id": "t1_c7mk3mn", "retrieved_on": 1430778197, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ravensreign3", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think there is necessarily any repressed sexual abuse, at least nothing intended.  Some people DO feel very invaded during a health check. The point is to try and find the root of why a seemingly simple exam to the majority of people is so hard for you. \n\nAs to whether it would have been better on you emotionally if mother had enforced all the exams, maybe.  Many phobias/fears are helped but repeat exposure to what is so frightening, and then realizing that whereas it was uncomfortable, it was not the end of the world. \n\nAs for how often one should have testicular exams....I really don't know. It is not my area of knowledge. I am willing to bet a google search or two could answer many of your questions as to why it is necessary or how frequently is should be performed.  I do know that while you are young and developing (and lets be honest, you are likely to develop a bit more still) many people DO NOT know what is normal, and what is truly unusual enough to need medical intervention. Heck, even older adults frequently do not know that something about them is medically incorrect and assume it is \"just how they are.\"  Our society puts soo much pressure on keeping such matters private, that many will choose not to speak up.  Especially a pubescent teen (of either gender) that is trying to understand what is going on with their bodies hormonally, let alone knowing what is normal or not.  My best friend growing up never received a talk from her mother regarding her period.  When I started mine I already knew exactly what it was and how to handle it. My best friend thought she was dying, and because her private parts were not to be discussed, tried to hide it from everyone and cope with the thought that something was wrong and she might be dying, but no one could know.  She broke down crying to me saying she couldn't tell anyone but she knew she was going to die and wanted me to tell her parents that she loved them. One visit to the school therapist later, I am lending her feminine hygiene products and trying to explain more thoroughly what was ACTUALLY happening. Not being aware of your body makes things happening to your body very very scary.  \n\nI would have made you have the sports physical check. I also would have spoken to the school officials about yours needing to be performed privately.  I would have asked if you were more comfortable having it done privately at school or taken to the dr for a physical exam. But it still would have been done.  Most schools will not allow this exam to be waived. \n\nI understand that you do not want to continue this torture of testicular exams, and as an adult, you cannot be forced to.  On one hand it IS something that you should have done. Maybe having more control of the situation will help. Discussing this with a doctor without your mother present is probably going to empower you a bit. If you simply cannot have a doctor get involved yet, I honestly recommend learning more about your reproductive health (there are a million things you could reference) and trying to become more comfortable with your own \"bits and pieces.\"  Touch them yourself. Examine yourself with regularity.  People can have whatever viewpoint on sexuality and masturbation they want, but you should never be afraid/ uncomfortable to touch your own body. I don't know if you are uncomfortable, but it does seem likely with your other...experiences.  The only one who can control your health and sexual well being is you, and everyone should have a firm grasp on themselves. ", "controversiality": 0, "created_utc": 1356571971, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mkdrm", "link_id": "t3_15eu77", "parent_id": "t1_c7mdlgp", "retrieved_on": 1430778286, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry I only have a daughter.  But she is going to go the gyn when she is 16 and that is much more invasive to me than a testicle check.  I think they are routine though.  I asked my brother and husband.  I also have a friend who had testicular cancer at age 13.  A testicle check saved his life. He's now in his 30's and has three kids of his own.", "controversiality": 0, "created_utc": 1356571984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mkdvf", "link_id": "t3_15eu77", "parent_id": "t1_c7mk6p5", "retrieved_on": 1430778287, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "What do you think you might have done if you had a son?", "controversiality": 0, "created_utc": 1356574013, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mkul4", "link_id": "t3_15eu77", "parent_id": "t1_c7mkdvf", "retrieved_on": 1430778585, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "When you said you thought my mother shouldn't have let me bypass so many exams, I was just wondering how many you would have made me get if you had been in her position? Not necessarily what precisely the right amount to get is, if that makes sense.\n\n\nWell, I think I was only signed out of the sports physical on the condition that it would be done later at a doctor's office. I didn't realize that it wasn't even something my mom could waive...I mean, do you think she really had no choice but to take me to the doctor and force me to get checked?\n\nMaybe the exam at 15 was the same kind of thing? =/ I have to ask again...do you think you would've enforced a check at that age?\n\n\nI have begun to start touching myself oddly enough. I think I am actually acutely aware of my testicles because of all this...if I ever felt something relatively off, even somewhat slightly, I would probably relent and try to force myself to go get them checked despite how awful it is for me.\n\nWell...this whole discussion is making it a bit easier to get more comfortable with the idea of going. I probably need a bit of reinforcement in terms of someone telling me I have to go I guess...because I really do not want to at all. Maybe if all of the mother's here voted that I should or something I would consider it hah", "controversiality": 0, "created_utc": 1356574643, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mkzwj", "link_id": "t3_15eu77", "parent_id": "t1_c7mkdrm", "retrieved_on": 1430778641, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a four year old son who has had to be held down by the doctor or nurse before. A few times for shots, and once when he was sick so the doctor could look at his throat. When he was about 2.5 he had major issues with the doctor touching his face and had to be held down for standard throat, ears, nose check. \n\nDid I feel bad for him? Yes. Did I think that the doctor was doing something wrong or harmful or medically unnecessary? Of course not. Doctors aren't in the business of lying to patients about which procedures are medically necessary and which aren't. As a parent, if a doctor says something is necessary, you follow their advice unless it's something questionable, in which case you may seek a second opinion before proceeding. \n\nIn order to make those procedures less uncomfortable for my son in the future, I explained to him what the doctor had done and why, and always make sure to discuss upcoming doctor's visits ahead of time so he knows what to expect and why it's being done. At four, my son understands that sometimes the doctor will do things that may seem unpleasant, but it's a part of life and necessary to ensure his health. I'm a little concerned for you that you're not also able to make this connection, instead placing quite a bit of blame on your mother for doing what every responsible parent does -- following the professional opinion and recommendations of a doctor. I really think you should seek further therapy if it continues to be a problem. ", "controversiality": 0, "created_utc": 1356606848, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mqvfs", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "removal_reason": null, "retrieved_on": 1435653591, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, I said in another comment that I've petty much been able to forgive my mother.\n\nIt feels like the results of having to be held for ear/nose/throat checks is not quite as horrible as for a testicle check though =/\n\nHas your son had any issues with testicle checks? Would you apply the same procedure to resistance in that area as well? What is the threshold for resistance?\n\n\"I'm a little concerned for you that you're not also able to make this connection,\"\n\nI guess from my point of view it seemed like if anything was ever really wrong with my testicles...I would know, and would tell me mom about it. It feels like the torture was not worth the prevention, especially since nothing wrong was ever found...it felt pointless. Why could I just look after myself, at least as a special exception because I am so extra sensitive?", "controversiality": 0, "created_utc": 1356608162, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mqzrp", "link_id": "t3_15eu77", "parent_id": "t1_c7mqvfs", "removal_reason": null, "retrieved_on": 1435653582, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I think that your case was probably one that it was a necessary  evil but holding a kid down for a procedure should only be a last resort. \n\nIF I had been in her situation with you, I would've tried to explain things first and then, if you STILL didn't feel comfortable, offer to hold your shoulders or hand while the doctor did his thing to make you feel more comfortable/reassured.\n\n", "controversiality": 0, "created_utc": 1356618124, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ms2d0", "link_id": "t3_15eu77", "parent_id": "t1_c7mjwaw", "retrieved_on": 1430782041, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Necessary even though I had extreme sensitivity? Would you resort to holding both of my hands?\n\nAt least half the problem would be that I wouldn't be able to not squirm and try to pull away while the doctor touched me.\n\nIf you had been my mother, how often would you have made me get a testicle check done? Every year, like you said your breasts exams are done?", "controversiality": 0, "created_utc": 1356618699, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7ms5jq", "link_id": "t3_15eu77", "parent_id": "t1_c7ms2d0", "retrieved_on": 1430782088, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "scribblingwoman", "author_flair_css_class": null, "author_flair_text": null, "body": "...off-topic, but props to your mom. She sounds awesome. :)", "controversiality": 0, "created_utc": 1356621481, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7msnnh", "link_id": "t3_15eu77", "parent_id": "t1_c7m0dpw", "removal_reason": null, "retrieved_on": 1435653546, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I would, but that's the kind of parent I am. \n\nWith my own son, they've only done testicle checks a couple times, not yearly so I don't think that (at least till you're an adult anyway) needed every year UNLESS you're playing sports where you'd be at risk for groin shots. ", "controversiality": 0, "created_utc": 1356621728, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mspdx", "link_id": "t3_15eu77", "parent_id": "t1_c7ms5jq", "retrieved_on": 1430782352, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "He hasn't had issues with it, though so far I think that hasn't been checked since he was under 2, and kids that age are used to it because of diaper changes. I would, however, apply the same policy. I would explain thoroughly what was to happen and why and it would be done. If he was still upset afterwards, I would have him discuss his feelings about it with me, let him know that it was ok to dislike the experience and that I was sorry, and then reiterate why the doctor did it and that everyone has to go through it. \n\nI'm also trying really hard to make sure he never has any negative or shameful feelings toward any of his body parts. He knows his penis is his penis, testicles are testicles, and if he has anything to say about it, as far as he's concerned it's just another one of his body parts. So hopefully he won't ever have to feel traumatized about a medical professional touching them. \n\nI'm really sorry that your upbringing caused shameful feelings about your anatomy, and I hope one day you can move past it. I think that was the real misstep your mother made here -- the attitude that caused feelings of secrecy and shame surrounding sex and sex organs, not the carrying out of medical procedures. ", "controversiality": 0, "created_utc": 1356621804, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mspx4", "link_id": "t3_15eu77", "parent_id": "t1_c7mqzrp", "retrieved_on": 1430782351, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "You are probably on a much better path than my mom put me on, it's true. I'm glad there are some mother's like you out there =)\n\nOut of curiosity...how often do you plan on having your son have his testicles checked, if at all?", "controversiality": 0, "created_utc": 1356622191, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mssq3", "link_id": "t3_15eu77", "parent_id": "t1_c7mspx4", "retrieved_on": 1430782386, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "How old is your son, and how many testicle checks has he undergone? (Sorry if that's too much information to ask...I would just like to compare if possible).\n\nWould you still have had him get the same amount if he needed to be held/restrained by you each time? Or would you have reduced the amount instead?", "controversiality": 0, "created_utc": 1356622378, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7msu2i", "link_id": "t3_15eu77", "parent_id": "t1_c7mspdx", "retrieved_on": 1430782407, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My doctor sends a \"What To Expect During Your Next Visit\" letter ahead of each check up appointment. If it's on the letter, or he deems it necessary during a visit, it will be done. I trust my son's doctor and if I didn't, I'd find a new doctor. ", "controversiality": 0, "created_utc": 1356622640, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7msvyl", "link_id": "t3_15eu77", "parent_id": "t1_c7mssq3", "removal_reason": null, "retrieved_on": 1435653542, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "I would say that your sensitivity makes it all the more important.  What else could be abnormal?  Something serious? You don't know unless you get checked.", "controversiality": 0, "created_utc": 1356622953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7msy93", "link_id": "t3_15eu77", "parent_id": "t1_c7lxv6v", "retrieved_on": 1430782462, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Would you at least say the number of checks should be reduced? Why even have one after the first one to establish the extra sensitivity wasn't a sign of something really bad?\n\nOr do you think the number should have been increased to force me to get used to it in that case?...", "controversiality": 0, "created_utc": 1356623377, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mt1id", "link_id": "t3_15eu77", "parent_id": "t1_c7msy93", "retrieved_on": 1430782506, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "I would say that if it showed everything was normal you continue the regularly scheduled checkups. you don't increase medical checks to get someone use to them, you no what is needed. As you develop your body changes by definition- you need to continue to be checked. Maybe your doctor was rough, maybe you made it worse for yourself psychologically and/or physically by developing a fear and needing to be restrained (making it hard for the doctor to be gentle). \n\nI listen to doctors, the have tested and proven science behind them and what they do. if your doctor says you need a test, you need it.\n\nYou really seem to be dwelling on this, you should go talk to someone about this. This is not normal.", "controversiality": 0, "created_utc": 1356624570, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mtb00", "link_id": "t3_15eu77", "parent_id": "t1_c7mt1id", "retrieved_on": 1430782629, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "booksarepretty", "author_flair_css_class": "brown", "author_flair_text": "Jack, 12 Months", "body": "I really can't answer any more of your questions. I wish I could, but my opinion on this as a mother and as another human being, just isn't what I think you want to hear. I asked my husband about the exams when he was a child, and what little he remembers he doesn't believe they hurt at all. Perhaps, talking to other men would be better for you. \n\nAgain, I hope you are able to find peace with this and the decisions your mom made. ", "controversiality": 0, "created_utc": 1356630164, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7muqw6", "link_id": "t3_15eu77", "parent_id": "t1_c7ma89c", "retrieved_on": 1430783310, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I really wish you would reconsider.\n\nMaybe I've appeared too antagonistic in some sense?\n\nMulling over your posts for the past few days has been the most helpful out of anyone's!\n\nI really wish you would reconsider =(\n\nSorry if I somehow offended you, I really appreciate your time answering my questions, maybe they are a bit tough to hear at first, but I am pretty sure I need to hear them. It's hard to just change overnight though.\n\nI will really count it as a major blow if you decide to completely bow out; but either way, thank you very much for taking the time to respond to me, it really means a lot to me!\n\nSometimes the most important things to hear are the ones we may have started off not wanting to hear after all.", "controversiality": 0, "created_utc": 1356630426, "distinguished": null, "downs": 0, "edited": 1356631194, "gilded": 0, "id": "c7mutj1", "link_id": "t3_15eu77", "parent_id": "t1_c7muqw6", "retrieved_on": 1430783338, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "booksarepretty", "author_flair_css_class": "brown", "author_flair_text": "Jack, 12 Months", "body": "I am not mad about it. It is just that obviously I can't help you with the closure you need. \n\nI have to hold my 1 year old down for every diaper change and doctors visit because if I didn't, he would stand up and walk/crawl away, and we would never get anything done. He cries but he gets over it immediately after it is done. My kid isn't special. A lot of parents have to do this. I don't enjoy holding him down but it is a ton better than him my getting any vaccines or checks or running around in a smelly diaper.\n\nI had to have a ton of blood routinely drawn for a disease I had when I was kid. I was 8 and got told that I would cry and fight every time but it had to be done. I still hate having blood drawn, but being held down for it didn't traumatize me. And now I do it because I wan t to continue to be healthy. Am I mad at my grandparents for holding me down when I was little? No. I was a kid. I didn't understand. It hurt and that was all I knew at the time. Would I require less blood work for my son because of it? Nope. He will cry and scream, but those test they run will tell me he is healthy. Will I tear up when he cries out and generally feel bad about it? Yes. I love my son and hate to see him hurting, but it is over quickly and the tears will stop before we even leave the office doors. \n\nI am sorry, but I just don't have the information you need. Maybe try r/daddit. The men there probably have better perspective on male related problems. \n", "controversiality": 0, "created_utc": 1356631556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mv52z", "link_id": "t3_15eu77", "parent_id": "t1_c7mutj1", "retrieved_on": 1430783498, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I am not sure what makes you think that you have not helped with the closure you think I need...\n\nTo my mind you've helped more than anyone else that has responded (not to belittle everyone else's great contributions though!).\n\nI mean...this is pretty much all new to me...it takes time to adjust. But really I feel like I was hoping to encounter someone like you, so it's worked out pretty well in my mind.\n\nReally the last post you said you were unable to reply to contained my final few questions...questions about an exam I was not even going to bring up until your other posts changed my mind and made me feel I could ask anything of you. I guess maybe I just went too far...I feel somewhat bad about it now =/\n\nI should've kept that one a secret I guess...fuck...=/", "controversiality": 0, "created_utc": 1356632081, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mvaks", "link_id": "t3_15eu77", "parent_id": "t1_c7mv52z", "retrieved_on": 1430783567, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356636027, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mwez6", "link_id": "t3_15eu77", "parent_id": "t1_c7lvhbl", "retrieved_on": 1430784091, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356637431, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mwtia", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430784287, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll probably be convinced if/when some mother's answer my questions about the exam I had when I was older.\n\nIt's the final frontier it seems...one that is being ignored thus far.", "controversiality": 0, "created_utc": 1356637510, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mwuch", "link_id": "t3_15eu77", "parent_id": "t1_c7mwez6", "retrieved_on": 1430784299, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356637690, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mww7q", "link_id": "t3_15eu77", "parent_id": "t1_c7mwuch", "retrieved_on": 1430784326, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, basically...does the same answer apply? Was that a necessary, routine checkup? Or was it really something messed up, off the radar, completely embarrassing...something that should not have happened, etc...?\n\nIt feels like...I was too old to have the standard rule articulated about younger exams apply... even though otherwise I would not have gotten a testicle check done. Having my mother have to see me go through a checkup at that age just has an extra bite of embarrassment to it...I am even afraid of posting about it anonymously. Even with everything else all of the mother's have said, I haven't been directly convinced of its necessity...", "controversiality": 0, "created_utc": 1356638183, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mx1bp", "link_id": "t3_15eu77", "parent_id": "t1_c7mww7q", "retrieved_on": 1430784395, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356638802, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mx7t9", "link_id": "t3_15eu77", "parent_id": "t1_c7mx1bp", "retrieved_on": 1430784486, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I hate to be nit-picky...I sort of admitted later to there being a third exam at 15. That was the one I had in mind with the last comment.\n\nWould your comment apply equally to that? Or be revised in some way?", "controversiality": 0, "created_utc": 1356639039, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxaa3", "link_id": "t3_15eu77", "parent_id": "t1_c7mx7t9", "retrieved_on": 1430784501, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356639339, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxdgj", "link_id": "t3_15eu77", "parent_id": "t1_c7mxaa3", "retrieved_on": 1430784551, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Could I ask you personally, do you think it would have been better for my mother to have made me get checked every year? Is that what you would have done if I happened to be your son?", "controversiality": 0, "created_utc": 1356639357, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxdnw", "link_id": "t3_15eu77", "parent_id": "t1_c7mx7t9", "retrieved_on": 1430784556, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356639592, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxg69", "link_id": "t3_15eu77", "parent_id": "t1_c7mxdnw", "retrieved_on": 1430784588, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow...I...have to admit, I didn't expect it. I...have always felt like there was just no way that could  have been called a normal checkup that had to be done. I always felt like there was something super wrong about it in particular because of the age...\n\nI'm going to have to let it set in...it's a whole new world of thought to me to hear this somehow.\n\nAll I can say is...thank you.", "controversiality": 0, "created_utc": 1356639831, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxipv", "link_id": "t3_15eu77", "parent_id": "t1_c7mxdgj", "retrieved_on": 1430784620, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356640225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxmze", "link_id": "t3_15eu77", "parent_id": "t1_c7mxipv", "retrieved_on": 1430784678, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "He's 8 and I think he's maybe undergone three or four by this point.\n\nIF he had reacted the way you say you've reacted and I had to have him held down, I wouldn't have done it. I would've said screw this, let's just get on with the exam and don't worry about it for now. But then again, that's just the kind of parent I am...he has Asperger's and so the world in general (not just physical exams) is uncomfortable for him. Part of my job is to make it LESS uncomfortable, if I possibly can.", "controversiality": 0, "created_utc": 1356640300, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxnql", "link_id": "t3_15eu77", "parent_id": "t1_c7msu2i", "removal_reason": null, "retrieved_on": 1435653414, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "The only thing is...I don't see how counseling could've affected my sensitivity?\n\nWas that a non-factor?", "controversiality": 0, "created_utc": 1356640396, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxos6", "link_id": "t3_15eu77", "parent_id": "t1_c7mxg69", "retrieved_on": 1430784698, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know how relevant this is at this point, but... I also have been diagnosed with Asperger's interestingly enough.\n\nYou sound like a cool parent. I am glad your son wasn't as sensitive as me, but it sounds like he would've had a cool mom either way.", "controversiality": 0, "created_utc": 1356640548, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxqco", "link_id": "t3_15eu77", "parent_id": "t1_c7mxnql", "retrieved_on": 1430784715, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356640776, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mxssx", "link_id": "t3_15eu77", "parent_id": "t1_c7mxos6", "retrieved_on": 1430784770, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "Thanks..I do my best. \n\n\nI think part of the reason why I'm such a good parent to my special needs son is because I had early and frequent exposure to people who weren't \"normal\" per se. My favorite uncle was in a wheelchair and he mentored kids who were also in chairs for one reason or another who we got to hang out with. My mom was also the kind of person who accepted everybody, no matter what so they were always around us from the time I was very little. In fact, one of the first guys I ever dated was a young man with spina bifida whom my uncle introduced me to. He was one of the sweetest, most amazing people I've ever had the fortune to know. :-)", "controversiality": 0, "created_utc": 1356643812, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7myoeq", "link_id": "t3_15eu77", "parent_id": "t1_c7mxqco", "retrieved_on": 1430785169, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Who was this directed at?", "controversiality": 0, "created_utc": 1356645161, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7mz1x4", "link_id": "t3_15eu77", "parent_id": "t1_c7msnnh", "retrieved_on": 1430785346, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Would it be possible to still need to be restrained even with such classes?\n\nWhere would one even find such classes for children anyway?\n\nI wonder if my mother even knew about such things.", "controversiality": 0, "created_utc": 1356651029, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n0lms", "link_id": "t3_15eu77", "parent_id": "t1_c7mxssx", "retrieved_on": 1430786138, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly, I would ask my husband to help.  Or maybe my brother if dad doesnt work.  ", "controversiality": 0, "created_utc": 1356651989, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n0ulu", "link_id": "t3_15eu77", "parent_id": "t1_c7mkul4", "retrieved_on": 1430786253, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know. ", "controversiality": 0, "created_utc": 1356652012, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n0uuo", "link_id": "t3_15eu77", "parent_id": "t1_c7mk51e", "retrieved_on": 1430786257, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1356652150, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n0w5k", "link_id": "t3_15eu77", "parent_id": "t1_c7n0lms", "retrieved_on": 1430786275, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "But getting a testicle check involves restraint..violation. It's not just straight pain like breaking an arm. One would think it has at least more potential to cause lingering issues than breaking an arm.\n\nLike I mentioned previously; I was able to be totally unaffected by shots even though they were terrible. I can only think that at the time, although I hated them, I could see their obvious effect, and it was just pain.\n\nI am a bit surprised that therapy isn't made more readily available to young boys I guess =/", "controversiality": 0, "created_utc": 1356656576, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n1zxh", "link_id": "t3_15eu77", "parent_id": "t1_c7n0w5k", "retrieved_on": 1430786796, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "\"that depends on you. maybe maybe not. sometimes therapy doesn't get rid of all of one's fears.\"\n\nI am sorry to keep asking questions, but...would you still have made me get checked every year, or think I should have been, if all of the fear wasn't removed, I mean, if restraint was still necessary even though I had to proper mental ability to fight it?\n\nI ask because, well, it's so sensitive that I literally have sort of spasms from being touched, and it's basically impossible to stay still even if I wanted to =/ idk how I would ever have overcome that exactly, maybe the spasms had to do with mental fear though? They seem like physical things though...they happen outside of testicle checks.", "controversiality": 0, "created_utc": 1356657736, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n2a82", "link_id": "t3_15eu77", "parent_id": "t1_c7n0w5k", "retrieved_on": 1430786936, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "Anytime someone gives you an answer from a mom's perspective- what you asked for- the answer is almost totally100% yes,they would do the same for their son; you ask if it matters that you are extra sensitive. It doesn't. \n\nYou need to talk to a professional and stop harassing people that have more than answered your question.\n\nWhether your mom and doctor were right or wrong does not matter at this point. You need to talk to someone that can help you get through this. You will not find that on reddit or any other website. Go see a doctor, see them soon. Get on with your life.", "controversiality": 0, "created_utc": 1356668874, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n4zxa", "link_id": "t3_15eu77", "parent_id": "t3_15eu77", "retrieved_on": 1430788223, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ravensreign3", "author_flair_css_class": null, "author_flair_text": null, "body": "I would have made you have EVERY single one that the doctor/school asked for. It probably would have helped to desensitize you. As long as you were under 18 and living in my house I would have forced you to have the procedure. Period. No exception. Its a normal part of regular health exams. I don't care for any of the excuses you could potentially come up with, if you were my child and under 18 you would have had all the exams that were requested. period. \n\nI am glad that you are starting to explore yourself, you should know your own body. Every human has a beautiful body and they should be comfortable touching any aspect of themselves. There are no \"bad\" parts. I am also proud that you are of sound mind to realize that if something did come off as unusual that you should indeed see the doctor for it. \n\nas for a vote, that seems ridiculous honestly.  This needs to be your decision, not someone else's anymore. Your mother is no longer responsible for you (well, legally you don't have to listen to her, obviously a mother is a mother for life, and will always feel responsible for her children) no one else is responsible for you, your health is now only your responsibility, and its up to you to take care of your body.\n", "controversiality": 0, "created_utc": 1356668892, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n503a", "link_id": "t3_15eu77", "parent_id": "t1_c7mkzwj", "retrieved_on": 1430788225, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I just want to be clear on all opinions; it isn't easy to accept.\n\nI made this comment to this other mother about her son, I never would have been able to make such a comment before making this post, I think it has helped:\n\nhttp://www.reddit.com/r/Mommit/comments/15j99n/first_testicle_check_need_advice/c7n25ck\n\nI am not sure why you are so upset with me exactly? =/", "controversiality": 0, "created_utc": 1356669889, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n593f", "link_id": "t3_15eu77", "parent_id": "t1_c7n4zxa", "retrieved_on": 1430788336, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you really think that it would have worked to desensitize me?\n\nWould you have been present in the exam rooms even at later ages?\n\n\n\nI guess I was sort of joking about the vote because you said I SHOULD get it done...but yeah, ultimately it'll have to be up to me. Which will be a whole new challenge...but I feel better about making the call myself. Some part of me still wishes I could've been the one to make the call the first time I guess.", "controversiality": 0, "created_utc": 1356676897, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7n6vfa", "link_id": "t3_15eu77", "parent_id": "t1_c7n503a", "retrieved_on": 1430789104, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "people have said that they are done answering you and you still continue to pry as if it will help you... almost all threads in this post have concluded that you need help dealing with this from a professional... go get it.", "controversiality": 0, "created_utc": 1356703522, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7naa7w", "link_id": "t3_15eu77", "parent_id": "t1_c7n593f", "retrieved_on": 1430790779, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "Seems like you are imagining things.\n\nPeople are free to answer or not as they please. I have no magical powers to force them to do anything.", "controversiality": 0, "created_utc": 1356732638, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7nhou8", "link_id": "t3_15eu77", "parent_id": "t1_c7naa7w", "retrieved_on": 1430794332, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "Reply from booksarepretty:\n\n&gt;I really can't answer any more of your questions. I wish I could, but my opinion on this as a mother and as another human being, just isn't what I think you want to hear. I asked my husband about the exams when he was a child, and what little he remembers he doesn't believe they hurt at all. Perhaps, talking to other men would be better for you.\nAgain, I hope you are able to find peace with this and the decisions your mom made.\n\nand your response:\n\n&gt;I really wish you would reconsider.\nMaybe I've appeared too antagonistic in some sense?\n\n\nyou know other people see these right?\n\nI'm obviously not the only one to think this.", "controversiality": 0, "created_utc": 1356744445, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7nkjli", "link_id": "t3_15eu77", "parent_id": "t1_c7nhou8", "retrieved_on": 1430795684, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "So...one example?\n\nWhere I responded mainly because I thought I had offended her?...\n\nI have since PM'ed her. Pretty sure we both agree it was a momentary problem that was worked out pretty well.\n\nAre you just annoyed that I haven't asked you more questions? It seems like you want some attention..", "controversiality": 0, "created_utc": 1356745698, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7nktts", "link_id": "t3_15eu77", "parent_id": "t1_c7nkjli", "retrieved_on": 1430795810, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "olivine1010", "author_flair_css_class": "green", "author_flair_text": "Owen Leo's Mommy!", "body": "[Says the guy posting non stop about the testicle exams.](http://i.imgur.com/7DzPH.gif)", "controversiality": 0, "created_utc": 1356754556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7nmw5c", "link_id": "t3_15eu77", "parent_id": "t1_c7nktts", "retrieved_on": 1430796850, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LookingForResolution", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd say we both have issues to work through.\n\nDifference is, I can admit it.\n\n", "controversiality": 0, "created_utc": 1356759946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7no5ek", "link_id": "t3_15eu77", "parent_id": "t1_c7nmw5c", "retrieved_on": 1430797480, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}