{"submission": {"author": "perfectsunset", "author_created_utc": 1358628418, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_aaeyn", "created_utc": 1358630819, "domain": "self.Mommit", "edited": 1358707354, "full_link": "https://www.reddit.com/r/Mommit/comments/16w7zq/please_help_rmommit_my_6monthold_has_up_to_24/", "gilded": 0, "id": "16w7zq", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 84, "over_18": false, "permalink": "/r/Mommit/comments/16w7zq/please_help_rmommit_my_6monthold_has_up_to_24/", "retrieved_on": 1413182823, "score": 46, "secure_media_embed": {}, "selftext": "I desperately need your help, r/Mommit . . . I'm sobbing as I write this. I apologize in advance for the length (I want to give you all the details) and lack of fluency (I'm so sleep deprived I can no longer think straight.) \n\nMy baby girl is just shy of 6 months old. She has never been a  \"good\" sleeper. At 6-8 weeks she had a few 4 hour stretches (in a swing), but since then the longest stretch she has slept is 2-1/2 hours (rare). \n\nOn a nightly basis, she wakes up crying anywhere from 8 to 24 (yes 24) times, with the average being 12-16 times. She almost always requires nursing to go back to sleep for 2-10 minutes. Lately, around 2 a.m., she wakes up and is UP (not crying, just awake) for 1-1/2 to 3 hours!\n\nShe will only sleep in her travel system. I have had no luck getting her to sleep longer than a few minutes in her crib. I tried cosleeping for the first few months, but it was no better, and my husband never got any sleep. She and I have moved to the nursery with me on a cot next to her travel system.\n\nI read No Cry Sleep Solution and implemented many of the strategies but she just wakes up too many times to put a sleep plan in place. I would literally have to be up all night long. I really, really don't want to let her CIO. I've tried the attended CIO for a few hours and I just couldn't take it. She has a bedtime routine and a \"lovey.\" She goes down around the same time every night (7-7:30) and wakes herself up around the same time every morning (6-7, sometimes 7:30 if she's up for that 3-hour stretch). I put her down for naps as soon as she's tired. She had a problem taking longer than 30 minute naps, but I've been sitting in on  part of the naps and rocking her stroller through the transitions, so she's beginning to nap longer but with no improvement in the night wakings. I have read and read and read and have never found a description of a baby waking this frequently, which makes me feel even more alone and upset. \n\nWe tried having dad respond to her crying, but he didn't handle it well and he has to work early. We have NO ONE else to help; neither of us has family involved in our lives or friends in a position to help, and she cries when a stranger comes near her. \n\nShe is EBF and only just now is beginning to accept a bottle, but will only eat an ounce or so over a couple hours and then demands to be nursed. I'm beginning to really hate nursing and am considering switching to breastmilk in a bottle to see if that will help. I'm considering starting rice cereal before bed (as various people have been pushing for months but her doctor said not to do). \n\nShe has no symptoms of reflux. She doesn't seem to have a belly ache. I don't consume gluten or dairy. She is happy during the day (except for the tiredness, of course.) \n\nI feel like I'm going to go insane. I'm so tired. I miss my husband. I miss my bed. I want to enjoy my baby (and my other children). There seems to be no end in sight. I don't know what to do, but I can't keep doing this. I sometimes feel resentful and angry towards my beautiful baby (though I know it is obviously not her fault.) Between night sleeping and naps, my whole life is consumed by these sleep issues. \n\nHow do I get her to sleep outside the stroller? How do I get her to sleep longer? How can I get my life back without making her suffer?\n\n**TL;DR -- My 6-month-old wakes up 8-24 times a night including a long stretch, will only sleep in her travel system, and I am losing my mind (and straining my marriage). :(**\n\n*Edit: Bold TL;DR\n\n**Edit: Thank you sooo much for all the ideas and responses; you are all so thoughtful! I am overwhelmed by all the support. I think that I needed to hear that this isn't a \"normal\" consequence of breastfeeding and attentive parenting, and I really appreciate all the strategies you have given me to try. I will keep you updated!**", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Please help, r/Mommit! My 6-month-old has up to 24 night awakenings and will only sleep in her stroller, and I am desperate for solutions and sleep!", "url": "http://www.reddit.com/r/Mommit/comments/16w7zq/please_help_rmommit_my_6monthold_has_up_to_24/", "user_reports": []}, "comments": [{"archived": true, "author": "TyleetSohn", "author_flair_css_class": "purple", "author_flair_text": "Mommit User Flair", "body": "I don't have any advice, but you have my deepest sympathies... Stay strong. It will get better.", "controversiality": 0, "created_utc": 1358633518, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zxuel", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431015747, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks :) Sometimes the only thing that gets me through the night is thinking about my colicky baby who is now an 8 y.o. and how fast the time has gone since then (although not so fast during!) ", "controversiality": 0, "created_utc": 1358633907, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zxxzn", "link_id": "t3_16w7zq", "parent_id": "t1_c7zxuel", "retrieved_on": 1431015793, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you taken her to the doctor? This doesn't seem normal. Does she eat solid food yet? Will she take a pacifier? ", "controversiality": 0, "created_utc": 1358634063, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zxziu", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431015814, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarafionna", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh Momma, I'm so sorry. I can't imagine. I don't have any advice, but I'm rooting for you. It's so hard when you have no one else to help. Maybe... Co-sleep onion in a bed in her nursery? Have you tried that? ", "controversiality": 0, "created_utc": 1358634325, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zy219", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431015854, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Need_a_nap", "author_flair_css_class": null, "author_flair_text": null, "body": "This was me. My son would wake up every 20 mins until I would just go into bed and bring him in. When I went to bed he would wake only once. I just thought he slept better when I was there. Until one night he rolled over into his belly and slept 4 hours straight. I realizes he slept better with me because he nursed and always ended up on his side then his belly. He is now 8 months old and we always put him down on his belly and does a good 3 hour stretch until i go to bed. I know this goes against what we are told but it works. I would never do it unless I knew he could roll over himself anyways. We also have a video monitor and I am always watching him. ", "controversiality": 0, "created_utc": 1358635317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zybhn", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431015982, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "OwlsNest", "author_flair_css_class": null, "author_flair_text": null, "body": "I understand your frustration. My little one is almost 6 months, and will only sleep in his carseat or his swing. And he has to have a bottle when he sleeps. I gave in tot he bad habits out of desperation for sleep, and now we are working on breaking them. First I've started breaking him of the bottle, Letting him eat to his hearts content while rocking him, ad wrapped up in his blankets. Once he gets to a point where he doesnt need the bottle to sooth himself to sleep, then we will work on him falling asleep int e crib instead of the swing. Starting with rocking him to almost sleep, with his bottle, and then laying him down in his crib with his night light shining on the ceiling. He will watch it until he falls asleep. It's worked once or twice. But the big thing is that he has to be swaddled. He will flail his arms to stay awake. So when we swaddle him, he stays asleep.\n\nHope these tips help.", "controversiality": 0, "created_utc": 1358635317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zybhz", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431015983, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "OwlsNest", "author_flair_css_class": null, "author_flair_text": null, "body": "Also, I have been told no to the foods for a while, but finally followed my gut. We started oatmeal with fruit puree in it at about 4 months, and we do that in mid-morning, and my little man goes down for a 1-2 hours nap in the early afternoon. It could be that she is getting the basic nourishment she needs from your breast milk, but that she is still hungry after. You could try adding just an oz or so of oatmeal to her diet.", "controversiality": 0, "created_utc": 1358635658, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zyery", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhz", "retrieved_on": 1431016012, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "R3ru", "author_flair_css_class": null, "author_flair_text": null, "body": "I would suggest taking her to a doctor. My middle child slept like that... terribly. She ended up having silent reflux and it was painful for her to sleep or lay down. That is why she never slept or slept for long periods of time. It was super hard to diagnose her because she slowly gained weight and never spit up or had any typical symptoms of reflux. So triple check it is not some medical issue and give yourself lots of praise. Dealing with lack of sleep for that long of a period is nothing short of a miracle.", "controversiality": 0, "created_utc": 1358635717, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zyfc2", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431016017, "score": 44, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I was going to suggest that-- a twin mattress on the floor of the nursery for a while.  And, holy shit, this sounds awful.  I am so sorry.", "controversiality": 0, "created_utc": 1358636398, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zym08", "link_id": "t3_16w7zq", "parent_id": "t1_c7zy219", "retrieved_on": 1431016111, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AeroMom", "author_flair_css_class": null, "author_flair_text": null, "body": "This was exactly our first son. Slept horribly until we put him down on his stomach and then Ta Da!", "controversiality": 0, "created_utc": 1358638987, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zzb47", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431016457, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter was like that and, even at 18 months, is still a terrible sleeper. At her worst, though, it turned out she had a teeny tiny yeast rash in her folds, which was spotted by the doctor at her six month checkup. A week of cream, and she would sleep sometimes up to 5 hours all together!\n\nI also second the lady who said \"tummy sleeping.\" Big help.", "controversiality": 0, "created_utc": 1358639787, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zzirp", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431016558, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "myfairkatie", "author_flair_css_class": "green", "author_flair_text": "boy 15 mo", "body": "Same with mine, tummy sleeper all the way from the beginning.  ", "controversiality": 0, "created_utc": 1358639869, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zzjhf", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431016572, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "myfairkatie", "author_flair_css_class": "green", "author_flair_text": "boy 15 mo", "body": "My 6 month old is breast fed, but eats single grain oatmeal or rice cereal, plus random fruits or veggies.  It definitely lets him sleep better at night, I think he stays full longer.  I have read that breast milk digests faster than formula and food, so maybe your little one is just hungry.  \n\nAlso, I have to say my little guy never slept well on his back.  My MIL put him on his tummy for a nap, and it was like lightbulbs went off!  He slept so much better, and is hard to argue with that.\n\nI sincerely hope you find something that works for you!  Stay strong momma!", "controversiality": 0, "created_utc": 1358640069, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zzlbt", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431016597, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "So your not doing any solids at all? Both my kids started solids between 4-6 months . My Dr told me to give our son more solids because he was a poor sleeper. I don't know why your Dr. wouldn't want you to try at all, but it's certainly not going to hurt. Dr's really don't know everything, and if you ask ten different doctors why your kids not sleeping you'll get ten different answers. I had a Dr tell me my kids were ready to forward face at 8 months because they were over 20lbs, and a different Dr harassed me at every visit about my 2 yr old not being potty trained before he was 3. Follow your gut mama! I'd try some cereal before bed if it were me.", "controversiality": 0, "created_utc": 1358640355, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c7zznzt", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431016632, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "That sounds like adoctor needs to investigate. I have read that kids can get something like restless leg syndrome which is hard to diagnose, but makes them ready uncomfortable if they stop moving to sleep. might be worth asking your doctor, especially if you or hubby have it.\n\nThis doesn't sound normal hang in there and get help if you can.", "controversiality": 0, "created_utc": 1358641743, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8000st", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431016829, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, poor mom! I would talk more to the doctor about this because it sounds a little out of the realm of normal.   I don't have much advice just wanted to say hang in there. And whoever said twin mattress on the floor... that sounds like a good idea to me. Good luck and hope you get some rest!", "controversiality": 0, "created_utc": 1358643049, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c800cxt", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431016997, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "And while I'm thinking about it, I have a friend whose daughter has a disorder (forget which one) that has always had sleep issues like this.  Is there any chance something like that is at play?", "controversiality": 0, "created_utc": 1358643200, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c800ebp", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431017018, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "I would give this a try. Get an Angelcare (breathing) monitor if you are concerned about SIDS.", "controversiality": 0, "created_utc": 1358643755, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c800ji3", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431017089, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "This is not normal. (Just for comparison, with TWINS who were both lousy sleepers, I was up 15x a night. CIO solved this problem). Have you consulted a pediatric sleep specialist? I would ask your pedi for a referral if you live anywhere near a city. The fact that your baby will only sleep in a stroller makes me think there may be a silent reflux issue (among other things).", "controversiality": 0, "created_utc": 1358643918, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c800l0s", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431017103, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thatmollygirl", "author_flair_css_class": "brown", "author_flair_text": "18-mo girl", "body": "I would think that she may not be getting enough to eat and might be hungry to start. Breastfeeding is great, but if you are stressed and tired you might not be producing enough and you can always try supplementing and pumping to keep up supply and see if that is a factor. \nOnce you figure out feeding, I know you said you don't want to CIO, but I think at this point, it might be an option. My daughter always had to cry before falling asleep and sometimes babies cry IN their sleep and aren't really awake. \nBecause she's not getting solid sleep, she's also probably extremely over-tired and fatigued, so fortunately, solving one problem might snowball and fix other things. ", "controversiality": 0, "created_utc": 1358647112, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c801ezp", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431017438, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh goodness yes! I had forgotten how much belly sleeping helped us with our first! Instant longer and better sleeping with her!", "controversiality": 0, "created_utc": 1358647990, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c801n5p", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431017537, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Wesa", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a 6 month old tummy sleeper too.  Been that way since 2 weeks.", "controversiality": 0, "created_utc": 1358648314, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c801q8o", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431017573, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Can she roll over? I know every child is different, but my girl could roll over one way at almost 4 months, and she would just roll onto her tummy and that was that. She never sleeps on her back. Also, my doctor said I could give her solids at 4 months if she was ready. Maybe it's time for you to test the water with solid foods like rice cereal (you mix it with your breastmilk!).", "controversiality": 0, "created_utc": 1358648494, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c801rwl", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431017606, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh man, I'm so sorry to hear! It's so hard when a little one is supposed to be loved and yet they cause so much stress! I agree with others saying you need to start out with solids. That certainly helped with being fuller for longer. Also tummy sleeping will help big time! I had forgotten until reading other comments, and truly, I was amazed at how much better she slept with naps and night time. \n\nHopefully that will help, though I know someone who'd daughter slept horribly and had a sleep coach since this age or 9 months. They are looking into taking out dairy and gluten, but since you don't eat them I don't see how that might help you. Is there anything else that you eat that might bother your daughter? I found I couldn't eat any onions with both of my kids. My heart goes out to you, and I'm so sorry you have to go through this. Its really hard with bad sleepers, I hope things get sorted out, and quickly!", "controversiality": 0, "created_utc": 1358649090, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c801xmz", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431017671, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter had reflux too and preferred to sleep in her car seat until she was 5 or 6 months. Does yours sleep in the car well? My daughter preferred to be moving when she slept so she'd usually fall asleep in her swing or stroller and have to be moved later. Funny because my son gets motion sickness and screamed like a banshee in his car seat and hated the stroller and swing.", "controversiality": 0, "created_utc": 1358649347, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c801zyx", "link_id": "t3_16w7zq", "parent_id": "t1_c7zyfc2", "retrieved_on": 1431017704, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mknight44", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh boy do I feel your pain.  I have a now 17 month old that was the worst sleeper ever and awoke 10-20 times a night up until about 9 months of age.  It's agony and incredibly stressful.  \n\nMy advice would be to first try and figure out exactly why is she waking up so often.  You can often tell by the way she cries out.  Does it seem like pain/colic/reflux (hard to sometimes tell and may be good to get full checkup with this in mind), hunger, separation anxiety from you?  If it's a reflux or colic issue, this can be remedied but you may still have major problems due to the habit she has of waking so often.  This was my problem.  Our little guy started out with nasty colic for the 1st 3 months, but when that eased, he was still waking a thousand times due to habit and just wanting to hang out with mommy like before.\n\nIf it's a hunger cry, you may want to introduce some solids during the day.  Six months is usually fine to do this.  Just some simple purees and such.  Even a few bites a day may make a difference in how full she feels at night. \n\nIf the waking problem is like mine and you have a beautiful, precious, but stubborn little baby that doesn't sleep well, this may be a tough road.  I read every book, tried EVERY technique for weeks and weeks, was firmly against crying it out or anything like that, but it got to the point where my husband and I were losing our minds.  The sleep deprivation becomes mental and physical torture.  I wasn't functioning well and we both were becoming zombie parents.  Not good.  It was the hardest decision, but I did eventually do a modified cry it out at 9 months.  After a week of hell it worked.  \n\nI'm not saying this is the way for you or anyone else, it's just my experience with a difficult sleeper. Hang in there!!  I promise you will sleep again and soon.  This was all less than a year ago and it now feels like decades away!  They grow so fast that this will feel like a blink of the eye someday. ", "controversiality": 0, "created_utc": 1358650952, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c802eso", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431017895, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sburd", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi Mommy!\n\nFirst off, hang in there. You are stressed and exhausted, and when that happens tears are inevitable and its really hard to think straight and come up with a plan. Take a deep breath, you will get this figured out! This is my two cents, but I'm not expert. These are just thoughts coming from me, both as a mom and as a medical student who has worked 36 hour shifts and knows what real sleep deprivation feels like.\n\n1-Take the babe to the doc, make sure there is nothing going on (like reflux etc.) This way, if she is crying and waking up, you know there is nothing SERIOUSLY wrong that is causing pain/suffering. You won't feel guilty when she cries, because you know there is nothing that needs to be \"fixed.\" You won't lie in bed worrying yourself to death, and instead you can tell yourself \"my baby is fine, she is just learning to fall asleep and that is hard.\"\n\n2-If there is nothing medically wrong with your baby, then crying is NOT suffering. If they are healthy, have eaten, and have a dry diaper, there is NOTHING WRONG with crying. This is their only method of communication. I struggled with this BIG TIME (most moms do) when we started sleep training w my son (we started when he was around 3-3.5 mo old). I was tired and exhausted, and when he would cry going to bed I would break down in tears every time because I felt like I was failing my poor baby. My husband was the strong one, and would help me through it. One night I just couldn't do it any more, so we turned the baby monitor off and turned the TV on. He cried for 40 minutes and then went to sleep. After 1-2 weeks of his bedtime routine, he stopped crying and now goes straight to sleep every night. (bath, lotion and change, nurse, short book, cuddle and listen to one song on pandora, bedtime) If he doesn't fall right to sleep, he talks to the toys hanging from his crib until he is ready to sleep. \n\nSomething that worked for me during those first few really hard nights was setting a timer for 20 minutes. He would start crying and I would start the timer. I would listen to music, watch TV, take a shower, do laundry, anything but listen to him crying, then if he was still crying after 20 minutes I would go pick him up and hold him, rock him, cuddle etc and calm him down----then put him back in bed and let him try to fall asleep on his own again. Some nights it took a few times, but eventually he would fall asleep. It wasn't perfect, but it helped me not to feel like I wasn't allowed to comfort my crying baby while still teaching him to self soothe and learn to fall asleep on his own.\n\n3- In terms of the night awakenings, I would think NOT sleeping in the same room with her will make a huge difference. My doctor actually suggested this to me when I was exhausted and stressed! I had trouble with this too but my husband finally drew the line and basically said to me- \"You need to sleep, I need you in my bed, and he is full and nothing is hurting him, he will figure it out\" This is true, you need sleep. Babies are super loud sleepers and often wake at night (even for a few minutes) but then go back to sleep. Chances are you are noticing her waking up a million times because you are sleeping right next to her. Second, she probably hasn't learned to self soothe, so when she wakes up she can't fall back asleep. She is 6 months, and should be able to go AT LEAST 5-6 hours until NEEDING to eat. After she goes down, go to bed with your husband, set an alarm and go to her after 3-4 hours. If she wakes up and cries, she will learn to self soothe and go back to sleep instead of expecting you to help her. IT IS NOT HURTING HER.  I would get up with my son 5-10 times when he was sleeping in our room, when we moved him, I only got up 2 times because I wouldn't respond until he was clearly awake and hungry (ie loud)...not just awake and wanting me to hold him.\n\nThese are just my thoughts, but of course this is your baby and you need to do what is right for you family and I'm not an expert. I thought CIO and sleeping in separate rooms was the worst idea ever until I go to the end of my rope, then I made the leap because I had nothing left to try. I'm so happy I did and I wish someone had told me to do it sooner. YOU CAN MAKE IT THROUGH THIS! You are just too tired right now to feel like you can.\n\nOnce you get some sleep, this won't feel as formidable. I also got the book baby 411, which was the best 10$ I ever spent.\n\nTLDR: If there is nothing medically wrong and she is tired, fed, and dry, you might just have to let her cry it out, but DO NOT listen to it for an hour because you will go crazy. Don't sleep in the same room, set and alarm and go to her after 4 hours when you know she should be hungry, otherwise you will wake up with every twitch she makes--regardless of whether she needs your or not.", "controversiality": 0, "created_utc": 1358652289, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c802qwv", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018072, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lovely1108", "author_flair_css_class": "green", "author_flair_text": "Feb 08 &amp; Nov 11", "body": "I agree here. My son didn't sleep through the night until he happened to end up on his tummy one night. Never looked back. And his pedi didn't seem all that concerned either. Especially since he could lift his head on his own. ", "controversiality": 0, "created_utc": 1358653220, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c802zfk", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "removal_reason": null, "retrieved_on": 1435641372, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MSschifino", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter started off a good sleeper and then at 6 months she started to wake up during the night. I know that if I get a lot of exercise during the day I sleep like a rock. I moved my daughter's body around doing lay down-sit up- stand up things with her. We also did a LOT of jumping where I'd be like her personal johnny jumper. After doing this for about an hour in the evening a while before bed, she'd be tuckered out..\n\nI'm not sure if this is going to help, but good luck. And just remember that it may not be soon, but some day it will be better. ", "controversiality": 0, "created_utc": 1358654286, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80398s", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018303, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Becca_smashley", "author_flair_css_class": null, "author_flair_text": null, "body": "Bingo! I don't have a pediatrician but a general practitioner who has been my family doctor my entire life and he is much more \"relaxed\". He is a very follow your gut kind of guy. ", "controversiality": 0, "created_utc": 1358654890, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c803eq1", "link_id": "t3_16w7zq", "parent_id": "t1_c7zznzt", "retrieved_on": 1431018375, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PitifulCaterpillar", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you tried [The Happiest Baby on the Block](http://www.youtube.com/watch?v=DvaaYXz6IuU) or [Secrets of a Baby Whisperer](http://www.amazon.com/Secrets-Baby-Whisperer-Connect-Communicate/dp/0345479092/ref=sr_1_1?ie=UTF8&amp;qid=1358655564&amp;sr=8-1&amp;keywords=secrets+of+the+baby+whisperer)?\n\nBoth have worked extremely well for us. Good luck and remember, your baby loves you!!!", "controversiality": 0, "created_utc": 1358655645, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c803lkh", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018455, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SandShack", "author_flair_css_class": null, "author_flair_text": null, "body": "My son was like this until 8 months when he was diagnosed with silent reflux and medicating that helped immensely.  But he didn't actually start getting better with sleep until he was diagnosed with sensory processing disorder and under the care of an occupational therapist.  \n\nThis may not be the case for your daughter but if your gut is that there is something wrong, follow it!  I know it's hard to think coherently when you're functioning on so little sleep but that is Not normal sleep behavior.  There may be something bothering her.  If your pediatrician is out of answers then I would make it a priority to start talking to specialists.  \n\nPM me if you ever need to chat.  There are few people in the world who can understand that level of sleep deprivation.  It can be very isolating.", "controversiality": 0, "created_utc": 1358655970, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c803of0", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018491, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "magnumthepi", "author_flair_css_class": "blue", "author_flair_text": "Boy 3Y", "body": "It definitely sounds like you need some respite. I know its not a solution, but it sounds to me like you could really use a night off. There's definitely an end in sight, this won't last forever. ", "controversiality": 0, "created_utc": 1358656067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c803pa6", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018503, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I don't really get this whole ask your pediatrician before you do anything way of life. I grew up in a small town with about 4 GP's . We saw the Dr if we were sick, needed shots, or a physical. That's about it. When I hear one of my mommy friends say \"our pediatrician didn't allow that\" it makes me cringe. We've moved 5 times in 6 years, so I've gone through my fair share of Dr's. They all have lots of opinions and ideas, but at the end of the day it's your kid. My own mom tried to get me to start cereal at 2 weeks old! Lol- I didn't listen to her, but it never even occurred to me check with the Dr before I did it at 4 months .", "controversiality": 0, "created_utc": 1358656167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c803q5i", "link_id": "t3_16w7zq", "parent_id": "t1_c803eq1", "retrieved_on": 1431018514, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so, so sorry!  You must be so tired.  My heart goes out to you.\n\nMy baby sleeps really well when I put him down full and swaddled with a pacifier (he's 4 months).  Swaddled REALLY tight.  I swear by this.  We also use a sound machine (a free app that I downloaded on my iPhone) to help him sleep better.  It keeps him from waking with sudden noises. He usually goes down around 11pm and sleeps until 6:30am.\n\nGood luck and please update! ", "controversiality": 0, "created_utc": 1358656698, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c803uri", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018576, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dinosaur_train", "author_flair_css_class": null, "author_flair_text": null, "body": "Take her to the doctor immediately. If the doctor says nothing is wrong, go to another doctor.", "controversiality": 0, "created_utc": 1358657602, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8042ff", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431018685, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SockCreature", "author_flair_css_class": null, "author_flair_text": null, "body": "Also, you might be able to get some professional advice from a place like this:\nhttp://www.sleephaven.ca/", "controversiality": 0, "created_utc": 1358660921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c804ulh", "link_id": "t3_16w7zq", "parent_id": "t1_c800l0s", "retrieved_on": 1431019046, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LilBeansMom", "author_flair_css_class": null, "author_flair_text": null, "body": "You have gotten some really good advice here. In addition to that I strongly recommend that you work on you getting some sleep, even if you haven't solved baby's problems. That means your husband needs to step up. Sleep deprivation is a form of torture, and it's clear from your post that you are suffering!\n\nSo, two points on this. First, your husband *will* figure out how to handle the baby better if given the opportunity and if he puts some effort into it. Will it be the way you would do it? Likely not, and that's ok!!! Daddits generally do things a little differently from the mommits. Babies somehow survive. Second, what works for us is to take shifts. I am \"on\" until 2 am, and then Bean's dad takes over, only waking me if nursing is required. This allows me to get a few hours of solid sleep before I have to go to work, enabling me to function. Since your husband has to work early, maybe he could take the 7-1 shift, and you could take the 1-7 shift. \n\nLook, I get that you want to let your husband sleep as much as possible, and that's thoughtful of you. My husband needs more sleep than i do to function, and I want him to have it (notice who has the long shift at my house). But it's just not smart to try to deal with such a difficult situation completely on your own. Don't be that mommy that puts everyone first so much that you're completely used up. You won't be helping anyone, in the long run. ", "controversiality": 0, "created_utc": 1358664141, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c805jlu", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431019488, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beccainblue", "author_flair_css_class": null, "author_flair_text": null, "body": "Rice Cereal!\n\n\nEdit: I had a big long answer and then reread your post. Rice Cereal works. She is Hungry! Does she watch you when you eat? Does she look like she could dig in if you let her? 90%  of all books I have read, doctors I have seen, and people I have talked to say that 6 months is when you start introducing solid food. Can you sleep when you are hungry? I can't.\n\n\nEdit: I saw the Karma loss coming when I edited the first time around.", "controversiality": 0, "created_utc": 1358664872, "distinguished": null, "downs": 0, "edited": 1358692327, "gilded": 0, "id": "c805oqq", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431019549, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "All of this. It took me until my son was 10 months old and finally got a referral to a pediatric GI for my son to get diagnosed officially with silent reflux. He started medication a little over a month ago and OH MY GOSH... He is a different baby. He cried all the time, he woke up at night so much... And now he is calm and happy and sleeps well. I am really sad that it took so much for me to get him help, but OP, please go to the doctor. If your doctor says she's fine, take her somewhere else. The only symptom my son had was he would arch his back while nursing. Well, that and the crying all the time. Good luck OP, keep us updated!", "controversiality": 0, "created_utc": 1358665886, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c805vey", "link_id": "t3_16w7zq", "parent_id": "t1_c7zyfc2", "retrieved_on": 1431019653, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PaperDoll98765", "author_flair_css_class": null, "author_flair_text": null, "body": "My heart goes out to you. My son went through a colicky phase and it was terrible. He would cry most of the day. I forget how long this phase was, but it was long enough to take a toll on my sleep and emotions. \nGet a second opinion. Even if it is nothing at least you have peace of mind. If it is something then you can take steps to make it better. I wish I got a second opinion, it would have kept me from worrying as much.", "controversiality": 0, "created_utc": 1358669355, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c806gq2", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431019916, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "singloud", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there a sleep clinic nearby? Might be worth a try along with the suggestion to be checked for medical problems and introducing solids. Best of luck &lt;3", "controversiality": 0, "created_utc": 1358681780, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c807xwz", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431020678, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Need_a_nap", "author_flair_css_class": null, "author_flair_text": null, "body": "Please don't assume because she is breastfeeding that the baby must be waking hungry. The baby has been a poor sleeper since the beginning. She has been gaining weight and growing and by 6 months the mother's supply is well established. ", "controversiality": 0, "created_utc": 1358682460, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8080ad", "link_id": "t3_16w7zq", "parent_id": "t1_c801ezp", "retrieved_on": 1431020706, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "Man I thought I had it rough. I feel for you mama\n\nMy son is now 8 months old and wakes anywhere from 5-12 times a night between 7p-7a. He too sometimes wakes up at 5a and is just awake. Our reason of why he wakes is he needs to eat. I KNOW he needs to eat because he refuses to eat much during the day. For example: today he woke up at 7a and didn't until 3pm. Then again at 5p and again at 7 when I put him down. We've been up 6 times so far tonight so he could eat. \nHe's breastfed and always has been. When I introduced baby cereal it did nothing. I fed him at dinner time right before bed and it made no difference what so ever. The only thing that did happen was I had a lil boy who screamed bloody murder every time I tried to feed him purées. We started at 4 months and I gave up at around 5 months. Then reintroduced solids at 6 months but instead tried baby led weaning. This let him control the food and he no longer cries unless god forbid I make the mistake of trying to feed him something myself. When we started the baby led weaning and he actually ate food, it cut the night time waking a from about 12 down to 8 (although we still occasionally have a bad night). However, the solid food doesn't make up for the fact that he doesn't nurse much during the day and seeing as how he needs to eat... \nThe only thing that helps is co sleeping. He usually only naps for 30-40 mins if I'm lucky.  My son is also just a terrible night sleeper and occasionally has night terrors which started around 4 months (really young for them but I had them as a kid too). Because of this it's just so much easier to co sleep a nurse laying down. I stopped fighting trying to get him into a crib. I gave up trying to let him CIO, he cries so hard he stops breathing for seconds at a time and sweats profusely. Cosleeping and nursing at night is the only way we get the most amount of sleep. Maybe get a bed in the nursery you can both share instead of the cot and crib. I found the more fuss that had to be made (picking up from crib, going to sit to nurse) just made problems worse. \nI would say your best bet would be to check out a sleep clinic or someone who specializes in infant/children's sleep problems. I would too but I know the sources of my problem: he's just hungry. \nI don't have much advice, but just know you're not alone. There are days I snap because I short on sleep and I'm begging my husband to take the baby while I nap for 20 mins. :/ it's rough. \nGood luck to you *hugs* hang in there mama. ", "controversiality": 0, "created_utc": 1358688771, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c808oac", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "removal_reason": null, "retrieved_on": 1435641192, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "libelluler", "author_flair_css_class": null, "author_flair_text": null, "body": "Came here to say this. Silent reflux was our issue too!  It was horrible and I know how you feel. Once she got on medication it was amazing the change. ", "controversiality": 0, "created_utc": 1358690853, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c808yho", "link_id": "t3_16w7zq", "parent_id": "t1_c7zyfc2", "removal_reason": null, "retrieved_on": 1435641174, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vikingqueene", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter was like this at 6-7 months old. She only slept in the stroller, and we had to rock her with one foot to boot! If your pedia finds nothing wrong, then it is pretty much a phase (much like my daughter's was). She didn't wake up quite as often, but she did wake up a few times. I agree that maybe it is time to introduce some solids in her diet, I'm not a big grain person for my children but try some of the lighter veggies/fruits and don't give her ones that are common allergens (berries, etc).\n\nI hate to be the bearer of bad news, but this is something your babe needs to grow out of, short of any medical issues and her hunger increasing. \n\nMy daughter is now nine years old, so there is definitely a light at the end of the tunnel. Nine year olds come with a whole slew of other \"problems\".  ;)\n\nI wish you the best of luck, and you can message me if you have any questions!", "controversiality": 0, "created_utc": 1358691167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80909d", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431021263, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "How do they diagnose silent reflux? I have read about it and wondered if it was a possibility but she doesn't seem to have the symptoms listed, except the lack of sleep and hiccups a couple times a day.", "controversiality": 0, "created_utc": 1358694587, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809l94", "link_id": "t3_16w7zq", "parent_id": "t1_c7zyfc2", "retrieved_on": 1431021532, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "I have taken her to 2 doctors so far. The first just said, \"She has her days and nights mixed up!\" and told me to give her formula before bed (but I'm still working on getting her to take a bottle at all.) The 2nd doc was ridiculous; he told me to stop demand feeding her, to only feed her every 4 hours during the day and only give her a bottle of water at night. My instincts said no. I may have to go to an out of town doc, it sounds like. She was 4 months before she would take a pacifier, and after about 3 weeks she was done with it. ", "controversiality": 0, "created_utc": 1358694873, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809n6w", "link_id": "t3_16w7zq", "parent_id": "t1_c7zxziu", "retrieved_on": 1431021555, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "How do you go about tummy sleeping? Do you wait until they're asleep before you put them down? She's used to being swaddled, so I'm not sure how I should go about trying this. Thank you for the idea; I hadn't really considered this with all the scary SIDS stuff they throw at us from the moment we're pregnant!", "controversiality": 0, "created_utc": 1358695125, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809oy6", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431021588, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "I tried a tablespoon of rice cereal before bed last night. She was definitely ready for it; ate it right up. She seemed to sleep a little better for the first few hours (woke up 3 times in 4 hours) but after that it was back to the usual. I'll keep trying, though!", "controversiality": 0, "created_utc": 1358695317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809qaq", "link_id": "t3_16w7zq", "parent_id": "t1_c7zznzt", "retrieved_on": 1431021615, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! We don't have an extra mattress, but I might have to see if I can get one. I'd really like to sleep with my husband at some point, though, lol but sleep in general would be great!", "controversiality": 0, "created_utc": 1358695602, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809seu", "link_id": "t3_16w7zq", "parent_id": "t1_c7zy219", "retrieved_on": 1431021641, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! It helps just knowing people care and can sympathize/empathize. :-)", "controversiality": 0, "created_utc": 1358695627, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809slh", "link_id": "t3_16w7zq", "parent_id": "t1_c7zym08", "retrieved_on": 1431021642, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much! I do feel like something is not right, whatever it may be. I don't feel like over-attentive parenting (so-called) has caused this, as some people (doctors) have suggested. Thank you so much for caring and for your offer to chat! It really means a lot, and yes, it is sooo isolating! ", "controversiality": 0, "created_utc": 1358696157, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c809wjg", "link_id": "t3_16w7zq", "parent_id": "t1_c803of0", "retrieved_on": 1431021680, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarafionna", "author_flair_css_class": null, "author_flair_text": null, "body": "You could try an aerobed-- not as much of a $$ commitment! Best prices on Amazon. I hear you on the sleep... We finally got my daughter to sleep out of our bed, but I'm still up 1-3x / night with her, so exhausted all the time. So is my husband! However we do get to snuggle. ", "controversiality": 0, "created_utc": 1358697131, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80a46x", "link_id": "t3_16w7zq", "parent_id": "t1_c809seu", "retrieved_on": 1431021736, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Need_a_nap", "author_flair_css_class": null, "author_flair_text": null, "body": "I nurse him to sleep and then as I am walking over to the crib I roll him over and place him in his crib going in head first. I found if I placed his bottom half in first he would wake up(maybe a falling sensation?) I then just keep my hand on his back for a minute in case he wakes up. Hope that helps! ", "controversiality": 0, "created_utc": 1358699985, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80atdc", "link_id": "t3_16w7zq", "parent_id": "t1_c809oy6", "retrieved_on": 1431021966, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "I do hear the \"not getting enough to eat\" assessment a lot. I'm not sure how to gauge that. She eats until she doesn't want to eat anymore. She doubled her weight by 5 months. When she wakes at night, she doesn't take full feedings, no matter how much I try to get her to eat more to sustain her longer. I am hoping that by switching to giving her breastmilk from a bottle that I will have a better idea how much she is consuming and when.", "controversiality": 0, "created_utc": 1358702811, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80blii", "link_id": "t3_16w7zq", "parent_id": "t1_c801ezp", "removal_reason": null, "retrieved_on": 1435641001, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "I know exactly what you mean. When your baby will only fall asleep one way, it is hard NOT to go with it, even if you know it might cause problems down the road (they have to get sleep somehow, after all, so their development isn't affected). It definitely helps her to be swaddled. When she isn't swaddled it is much worse. Thanks for the tips. ", "controversiality": 0, "created_utc": 1358703002, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80bnjq", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhz", "retrieved_on": 1431022362, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Interesting you should mention that; I have wondered if this is even a possibility. When I put her in her crib to sleep, she picks her legs up and slams them down repeatedly, and it is almost as if the leg movements are waking her up. I have wondered if sleeping in the stroller keeps her legs more supported and still and that's why she sleeps better.", "controversiality": 0, "created_utc": 1358703136, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80bp0k", "link_id": "t3_16w7zq", "parent_id": "t1_c8000st", "retrieved_on": 1431022389, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "She can roll front to back but not yet back to front. It seems as if the tummy sleeping is a popular recommendation, so I guess I need to figure out how to implement that. ", "controversiality": 0, "created_utc": 1358703301, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80bqs2", "link_id": "t3_16w7zq", "parent_id": "t1_c801rwl", "retrieved_on": 1431022418, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for the time taken to respond. Did you feel as if your baby had any emotional after-effects from the CIO? That is what I am most worried about. I keep feeling like there must be some emotional consequences of my baby crying for me and being lonely and scared and me not responding to her and comforting her. ", "controversiality": 0, "created_utc": 1358703482, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80bspq", "link_id": "t3_16w7zq", "parent_id": "t1_c802qwv", "retrieved_on": 1431022441, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "It is certainly possible, though the doctors I have talked to have said she is a normal, healthy baby outside of the sleep issues. ", "controversiality": 0, "created_utc": 1358703533, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80bt91", "link_id": "t3_16w7zq", "parent_id": "t1_c800ebp", "retrieved_on": 1431022445, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "I have wondered if maybe there is a dietary culprit, but as I have already eliminated the big ones, I'm not really sure where to start. I suppose I could try cutting out soy or eggs, but since she has the problems every day and I don't  eat the same things every day, I'm not sure if it would help (could be worth a try, though). It seems like she would have symptoms during the day, though, too, if that were the case. ", "controversiality": 0, "created_utc": 1358703652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80buim", "link_id": "t3_16w7zq", "parent_id": "t1_c801xmz", "retrieved_on": 1431022459, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "It is a relief just hearing that someone else in the world has been through this! Thank you for your tips and ideas. When you say \"modified\" CIO, what do you mean? How did you go about it? ", "controversiality": 0, "created_utc": 1358703793, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80bw0w", "link_id": "t3_16w7zq", "parent_id": "t1_c802eso", "retrieved_on": 1431022481, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "The challenge will be finding someone who will listen before they check off the standard: baby is just feeding for comfort, mother us over reacting, etc. and other mids information about breastfed children. Sick at it. If you know something is wrong just keep at it till they listen.", "controversiality": 0, "created_utc": 1358704788, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80c6qh", "link_id": "t3_16w7zq", "parent_id": "t1_c809n6w", "retrieved_on": 1431022642, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "I fear that I have made my husband sound bad in my OP. He does help me when I ask for it, but it is hard for me to ask him for help when I can calm her down MUCH more quickly than he can, so dealing with the awakenings is much harder on him. He does take over for a couple hours on weekend mornings when he doesn't have to work. I (luckily) quit my job after my maternity leave, so it seems logical that I would be the one to handle things. I should heed your advice not to be a martyr, however. I do wait too long and stretch myself too far before asking for help. ", "controversiality": 0, "created_utc": 1358704963, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80c8le", "link_id": "t3_16w7zq", "parent_id": "t1_c805jlu", "retrieved_on": 1431022657, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "She does, indeed, watch us eat and even try to get food off our plates. I did start the rice cereal last night, 1 tablespoon before bed, and she gobbled it up. No help with the sleep issue yet, but it was only the first feeding, after all. How much should I be giving her? A tablespoon once a day? Twice a day? Two tablespoons?", "controversiality": 0, "created_utc": 1358705118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80ca8c", "link_id": "t3_16w7zq", "parent_id": "t1_c805oqq", "retrieved_on": 1431022674, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Do they do sleep studies on babies?", "controversiality": 0, "created_utc": 1358705152, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80calk", "link_id": "t3_16w7zq", "parent_id": "t1_c807xwz", "retrieved_on": 1431022688, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "The ones in major medical centers certainly do.", "controversiality": 0, "created_utc": 1358705954, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80cjcs", "link_id": "t3_16w7zq", "parent_id": "t1_c80calk", "retrieved_on": 1431022784, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "I think it is discribed by adults as tingling, crawling, aching, etc. by adults. And from what I remember it happens when ppl are tired (night) if they stop moving and start resting. Wish I could remember where I read the article. I'l post if I do.", "controversiality": 0, "created_utc": 1358705955, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80cjdb", "link_id": "t3_16w7zq", "parent_id": "t1_c80bp0k", "retrieved_on": 1431022784, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "perfectsunset", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for your thoughts and your post! I obviously feel for you, too! If you need someone to talk to, PM me anytime! As for the baby-led weaning, I didn't even know that was an option! Doctors and magazines and such make us so terrified of food allergies, and follow the single-grain-cereal-first-then-another-then-single-foods-one-at-a-time mantra. How did you start this? What foods did you begin with? Or did you just give him what you were eating? At every meal or just dinner? \n\n*Edit: And *hugs* to you, too!", "controversiality": 0, "created_utc": 1358706406, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80co6g", "link_id": "t3_16w7zq", "parent_id": "t1_c808oac", "retrieved_on": 1431022846, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My oldest son wouldn't sleep in anything but his car seat or his bouncer for about the first six months. And then it was only for about 20 minutes per 24 hours. \n\nNot to scare you at all, and I don't think it should, but in our experience the lack of sleep and constant wakefulness was the first sign of the autism that was to come. You might also want to push the doctor for an MRI and extensive blood testing to rule out physical causes. If it isn't illness, injury or developmental disability, then it is a phase and she will grow out of it. \n\nDo you go to her every time she wakes up, or do you give her the chance to soothe herself and try to go back to sleep on her own? In our case, my son's father literally would not let me out of bed until he had been crying at least three minutes, because my instinct was to go to him the minute he awakened. We worked him up to about 5 hours a night (where we still are currently) by simply not going to him unless it was obvious that he would be up for a little while. Not really letting him cry it out because after the first three minutes I would go to him and help him out, but many times he would put himself back to sleep after just a minute or two. \nDon't start the rice until the pediatrician says to. It likely will only make things worse, especially if her stomach rejects it, however, 6 months old might be old enough to start some first solid foods, but not through the bottle. ", "controversiality": 0, "created_utc": 1358706538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80cpmi", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431022860, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "R3ru", "author_flair_css_class": null, "author_flair_text": null, "body": "Bad mom of the century-- I did not even know until she was close to 2 years old. I thought she had asthma or some lung issues with her chronic bronchitis and then a terrible case of pneumonia. The asthma/allergy doctor looked down her throat and saw all the reflux damage. :( Within 3 weeks of reflux medication she started sleeping through the night and having less tantrums. All that time she cried and cried and never slept she was in pain. :( I just thought she was fussy baby. She is almost 6 years old and I STILL feel guilty. ", "controversiality": 0, "created_utc": 1358707731, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80d2pw", "link_id": "t3_16w7zq", "parent_id": "t1_c809l94", "retrieved_on": 1431023107, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "When i started again at 6 months it happened by chance. I was eating a wedge of cantaloupe and he reached for it and sucked on it. He gummed it to death. Naturally I was a but hesitant because it was a huge wedge but he managed it quite well. So I bought the book Baby Led Weaning by Rapley. Very informative. We stuck with cantaloupe since it obviously worked for him and then just gave him fruits and veggies (some raw some cooked) from the approved list. The first few we're roasted sweet potato sticks, steamed green beans, ripe pears, banana and cucumber (which is also great for soothing upset gums). We started with about one to two choices at a time and worked up to more. He typically has 4-5 options at a given time and its cute cuz you can see he has favorites (broccoli, cucumber and pears) as he recognizes and reaches for those first. \nIt's a messy process at first so we started with just dinner time with a bath right after. We started breakfast at about 7.5 months. He usually WILL NOT nurse at all in the morning so he chows down at breakfast. I leave him in his pjs and then change him. Much easier that way. \nAbout two weeks ago I started to offer egg YOLKS. I know this can be a high allergen but no one in our family is allergic so I felt comfortable introducing it. No whites as they don't offer much nutrition wise and they are supposedly what most people are actually allergic too. Anyways, I have seen a recent improvement with his morning nap. He's gone from 30 mins to an hr and the past three days he has taken a THREE HOUR NAP! I was stunned. But it's only been three days so I don't know if its from the egg or a growth spurt. I hope it's a permanent change. Obviously you'd have to evaluate if its appropriate for your lil one to introduce it this early. \nWe've gotten remarks from some who are a little wigged out that we give him while pieces of food but he's never choked once. He's gagged less than he did with the purées. It's what has worked best for us. \nOh and we haven't touched any grains since the baby cereal. Just fruits and eggs for breakfast then veggies and beans for dinner.\n\nI hope you find a sleep solution soon. It's so hard. Definitely the hardest part of having a baby IMO. ", "controversiality": 0, "created_utc": 1358708078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80d6g5", "link_id": "t3_16w7zq", "parent_id": "t1_c80co6g", "retrieved_on": 1431023157, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LilBeansMom", "author_flair_css_class": null, "author_flair_text": null, "body": "Yay, I'm glad to hear that! You never know. The weekend thing is huge--my husband does that too. They go to the coffee shop and I sleep in! Think about the shifts. I'm sure that even though you're not working outside the home, you have responsibilities during the day and need to be able to function. \n\nI wish you all good things in solving this problem. I know how hard it has been on me since Bean started waking up every hour (now we're getting back to every two, most of the time). I would certainly have already lost my mind in your case!", "controversiality": 0, "created_utc": 1358709340, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80dk5z", "link_id": "t3_16w7zq", "parent_id": "t1_c80c8le", "retrieved_on": 1431023340, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "That's perfect for you then. If she can roll from tummy to back, she can sleep on her tummy just fine. I really hope things get better for you soon mama. If I lived anywhere near you I would offer to baby sit so you could get some rest!! And I mean that seriously, you don't live in California do you?", "controversiality": 0, "created_utc": 1358710477, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80dw4s", "link_id": "t3_16w7zq", "parent_id": "t1_c80bqs2", "retrieved_on": 1431023488, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "Yeah, we let our daughter sleep on her stomach most of the time because she would cry in any other position. We just lied to her doctor about the fact that we were doing it. ", "controversiality": 0, "created_utc": 1358711482, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80e739", "link_id": "t3_16w7zq", "parent_id": "t1_c7zybhn", "retrieved_on": 1431023628, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beccainblue", "author_flair_css_class": null, "author_flair_text": null, "body": "This chart is helpful http://media.gerber.com/nirf/cm2/upload/78C0C49B-AD91-4175-8C92-08A28CB5AEFD/Gerber_cereal_guide.pdf", "controversiality": 0, "created_utc": 1358721094, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80h7cw", "link_id": "t3_16w7zq", "parent_id": "t1_c80ca8c", "retrieved_on": 1431025046, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sburd", "author_flair_css_class": null, "author_flair_text": null, "body": "He is a super happy baby, and even happier now that he gets good sleep. Even on the nights where he would cry, he would wake up smiling at me when I came in to get him in the morning. Think of how awful you feel being sleep deprived, and your baby is up all those hours too and is probably pretty exhausted as well. I promise that when they cry it feels way worse for you than it does for them. I thought the same thing you did and my husband made two good points to me, the first being: he is in his own bed in his own house with a nightlight, music, and his toys, and he knows that, he is not lonely or scared---he is bored and tired and needs to settle himself. Every kid in the history of the world tries to stay up past their bedtime. Second, you have no memories from being a 6 month old. Does anyone remember being born? Your baby will still love and trust you, especially since you respond to her every need ALL DAY LONG, she has no reason to think any differently.\n\nI still had trouble when he would go into the hysterical crying, because it just sounded so awful and I felt like he would never settle himself down once he got to that point and I didn't want him to think I abandoned him. Thats why I still let myself go pick him up and calm him down, then put him back to bed and give him another shot at it. In my head it felt like I was reassuring him that I had not abandoned him and would still respond, but he finally learned to settle himself after a week or so. \n\n ", "controversiality": 0, "created_utc": 1358727591, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80jacl", "link_id": "t3_16w7zq", "parent_id": "t1_c80bspq", "retrieved_on": 1431026050, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sburd", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi again!\nMy son hasn't been gaining as much weight and my doctor actually suggested we start solid foods (and he is only 5 months). She told me there is actually some evidence out there that introducing some wheat around 5-6 months decreases the risk of gluten intolerance (celiac disease). I don't have an article to back this up though. There is no right way to start first foods. You should avoid peanuts/peanut butter (and nuts/nut butters) because of the risk of an allergic reaction. Don't give her honey because of the risk of botulism. After that, just try some pureed/mashed stuff and stick with less than 3 new foods per week (and not all on the same day!) so if she has a reaction (rash or diarrhea or something) you know which food it was from. Grab a box of the gerber wheat baby cereal from the store and mix it with breast milk. (My doc suggested wheat instead of rice so that he doesn't get constipated) I also grabbed bananas (sweet) and avocados (high in good fat and calories that will keep a baby full). You can also try full fat yogurt but my son didn't like it. You can always get jarred baby food too! I just tried these other things so that if there were leftovers I could eat them and they wouldn't go to waste. My doc also suggested feeding him after a BF session and not when he is super hungry, otherwise it won't go well! Good luck!!!", "controversiality": 0, "created_utc": 1358729773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80jyeo", "link_id": "t3_16w7zq", "parent_id": "t1_c80co6g", "retrieved_on": 1431026363, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "singloud", "author_flair_css_class": null, "author_flair_text": null, "body": "They teach you to teach your baby to sleep. If there is something abnormal going on they'll know it. My friend did it years ago and swaddled her baby until he was 1! Most people will say their baby hates it and they do but they give up the struggle and do sleep.", "controversiality": 0, "created_utc": 1358757261, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c80rcs0", "link_id": "t3_16w7zq", "parent_id": "t1_c80cjcs", "retrieved_on": 1431029909, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "OwlsNest", "author_flair_css_class": null, "author_flair_text": null, "body": "I hope they help! And the best of luck! You might also try elevating her slightly, if it is reflux of any sort, this will help keep it down a bit. My little man had reflux his for few weeks home, and letting him sleep upright helped.", "controversiality": 0, "created_utc": 1358813910, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c814z54", "link_id": "t3_16w7zq", "parent_id": "t1_c80bnjq", "retrieved_on": 1431036546, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "oh-bubbles", "author_flair_css_class": "lightcoral", "author_flair_text": "14 Feb 10 &amp; 3 Jun 12", "body": "Hey are you on babycenters june 2012 board... I swear this exact post was there the other daay.", "controversiality": 0, "created_utc": 1358815231, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c815dv5", "link_id": "t3_16w7zq", "parent_id": "t3_16w7zq", "retrieved_on": 1431036756, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mknight44", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess I'd say modified cry it out was just getting him almost asleep in my arms then gently putting him down.  In a perfect world they will go right off to sleep, but if not, we would time the crying and go in to pat on back and gently reassure every 5 minutes.  After a few times we would extend this to every 10, then 15, then 20 minutes.  This is done, of course, knowing for sure he's dry, comfortable and not hungry.   It took a full tortuous week, but he eventually slept through the whole night. \n \n", "controversiality": 0, "created_utc": 1358818167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c816apl", "link_id": "t3_16w7zq", "parent_id": "t1_c80bw0w", "retrieved_on": 1431037149, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thatmollygirl", "author_flair_css_class": "brown", "author_flair_text": "18-mo girl", "body": "No doubt. I breastfeed my babies, I was just suggesting that supply might be low and to try pumping/formula for a couple feedings to see if it might help. \nHardcore breastfeeders always assume everyone is attacking them. Definitely not saying that, just trying to suggest a solution.", "controversiality": 0, "created_utc": 1358828981, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c819x7l", "link_id": "t3_16w7zq", "parent_id": "t1_c8080ad", "retrieved_on": 1431038935, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}