{"submission": {"author": "23sunflowers", "author_flair_css_class": "lightcoral", "author_flair_text": "Caili's Mom (2yo)", "created_utc": 1359646046, "domain": "self.Mommit", "edited": 1359742830, "full_link": "https://www.reddit.com/r/Mommit/comments/17mrs3/husband_slept_on_couch_last_night_by_choice/", "gilded": 0, "id": "17mrs3", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/17mrs3/husband_slept_on_couch_last_night_by_choice/", "retrieved_on": 1413142515, "score": 37, "secure_media_embed": {}, "selftext": "It's been storming here. Our toddler got up when we went to bed and asked if she could sleep in momma's room. I said sure. Her dad disagreed and tried to rush her back to her bed. I tried explaining that as parents, our kid is going to want to sleep close to us sometimes. That she might be scared. We could let her fall asleep with us and lay her down back in her own room if he had a big problem with it. Or that I could go cuddle with her in her room until she goes to sleep, and sneak out. Either way, I wasn't going to shut her into her room crying (she's normally a really good sleeper!) and possibly scared. He said, 'whatever' and went downstairs to sleep on the couch and I went to cuddle with my daughter in her room until she fell asleep. I fell asleep for a bit too. Our huge bed was completely empty for a good part of the night. And that seems wrong.\n\nWhat's happened? How can someone not want to comfort their kid, or allow the mom to? I can see how, this could be a problem if she asked everynight but she hasn't ever, even once, before this. Did I do something wrong? I mean, I did what I felt right doing. Idk.\n\nUpdate2: A few things first: Thanks for all the helpful replies! Really appreciated right now. Not sure where everyone's getting that he's sleep deprived. We were just going to bed, it wasn't in the middle of the night. There was no fatigue or sleep deprivation to dismiss everything on. It was maybe 11pm. If you think there may be something I left out--ask me about it! Unless I record conversations, I'm sorry but I can't share them word-for-word. *I* was sleepy and cranky (new diet) and still managed to list options and be tirelessly diplomatic. Regarding whether or not he was upset because I was neglecting him, I'd like to say that's most definitely not the case. Overall, I felt like I suddenly had two kids and woke up wondering what happened to my husband.\nI posted this so that I can get outside opinions on a snapshot of how we behave. Ofcourse, other things have happened that are of more consequence than this and continue to do so. I know that, someday, I may have a big decision to make that I'm not looking forward to.\nI talked to him about all this and it seems he was trying to make a stand against this becoming routine (she and I had taken a nap together in mommy's room a few days before) and he felt that she would've been 'fine' and that I should've let him put her back to bed. He went downstairs so that he could be 'out of the way'. And then we managed to start another argument when he said that he was already upset at me because I've started a new diet that 'limits' the rest of the family (buying my own foodstuffs with my own pay- there's been no toll on him or our daughter save for there's a hell of alot more bread in the house.)\nThings aren't peachy-keen now by any measure, but life goes on.\nNow, I'm wondering if I saw a cuddling opportunity and just wouldn't let go of it. :3 Idk. I guess, If my daughter needs me, is crying, and screaming for me like she was, I'm going to be there one way or another. He can choose to cuddle with us, or not. There's nothing I can do about that.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Husband slept on couch last night ...by choice.", "url": "http://www.reddit.com/r/Mommit/comments/17mrs3/husband_slept_on_couch_last_night_by_choice/", "user_reports": []}, "comments": [{"archived": true, "author": "fluffystalin", "author_flair_css_class": "red", "author_flair_text": "Mom to an almost two year old.", "body": "I have noticed that my husband and I get testy with one another since we had our son.  Sometimes you do not see eye to eye on certain things.  He was probably just very tired and frustrated.  I think you were doing the right thing too.  Sleep can be a very touchy subject when people don't get enough of it.  ", "controversiality": 0, "created_utc": 1359647615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86x7hu", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431140682, "score": 26, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Caseygrl98", "author_flair_css_class": null, "author_flair_text": null, "body": "Our twins are 10 and still want to sleep with me when they aren't feeling well or have a bad dream.  My husband ALWAYS tries to get them to go back to bed while my first instinct is to put them in bed with me.  I usually win and my husband ends up on the couch for the night. He is a light sleeper and can't stand the constant moving and getting kicked.  It's just one of many different opinions we have and it's ok. ", "controversiality": 0, "created_utc": 1359647912, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86xamc", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431140720, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359648128, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86xcwm", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431140747, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SneezeFart", "author_flair_css_class": null, "author_flair_text": null, "body": "I just popped into this subreddit while spamming the random button.\nI'm a guy, and one of the things I miss most are the years where the three of us shared a queen sized bed.\n\nI was nervous that I'd roll over on my daughter when she was an infant but some strategic pillow placement helped.\n\nShe never had a crib, she was three before she even had her own bed.\n\nThat being said, we've been divorced for a decade.\nI guess I just want to make sure you're communicating and guarding your relationship.\n\nThings can spiral so quickly over nothing. (We were fine financially and nobody cheated or even called names)\n\nI obviously don't know your husband, but I can't imagine any guy worth his salt would willingly neglect his kid. He must be tired and under pressure at work. \n\nI'm not saying you should cut him slack, but maybe have a date night.\nLet him know how you feel (Don't hate me but let him know in 100 words or fewer) / exit stage left.\n\n", "controversiality": 0, "created_utc": 1359649052, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86xn1r", "link_id": "t3_17mrs3", "parent_id": "t1_c86x7hu", "retrieved_on": 1431140890, "score": 40, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Serendipitee", "author_flair_css_class": null, "author_flair_text": null, "body": "I let all 3 of my kids sleep in bed with me/us when they were babies and kicked them out into their own rooms at various ages (around 3ish) and that's just how I did things.\n\nMy ex seemed ok with this for our first born, but when the 2nd one came along he spent several months sleeping in the guest room. Said he was afraid to roll over onto her or something but respected that I was very pro-co-sleeping and didn't try and tell me to do anything differently, just moved himself elsewhere while he was uncomfortable without making a big fuss. Since we were never exactly cuddly at night anyway, this wasn't really a big deal for us and he eventually came back to bed when she'd gotten a little bigger and less squishy.\n\nI have learned over the years though that different men have very different feelings about kids in the bed - their own or otherwise. Some men love the family bed, and others are just not comfortable with it - sometimes with children of certain ages, or sometimes never. \n\nYour husband may fall into the latter category and was probably tired and grumpy and just didn't want to deal with it. You should probably discuss your feelings during the day when he's awake and rested and in good spirits and come to a mutual agreement for future instances of kid-invasion. \n\nPersonally, I firmly believe in comforting kids when they're sick or afraid and think you did the right thing. You just need to work out how to do what you feel is right without your husband feeling creeped out or uncomfortable or whatever it was for him. The option of you cuddling in the kids' room till they fall asleep seems very un-intrusive, and if he can't deal with that, I don't know what to tell you.\n\nGood luck!", "controversiality": 0, "created_utc": 1359651288, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86ycdv", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431141206, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ktprince", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't underestimate the power of fatigue to make a man cranky. Talk to him about it when he is awake and feeling good. \n\nAnd yes, you did the right thing. You are a good mama.", "controversiality": 0, "created_utc": 1359652001, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86ykhb", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431141321, "score": 47, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "This is going to sound bizarre, but I kind of wish mine wanted to snuggle with me.  She's so independent.  We tried co-sleeping and she wanted nothing of it (queen size bed probably wasn't big enough).  She likes her space and my husband and I do as well.  Even when she's sick she doesn't like to be in bed with us, but would rather sit in our laps or sleep on our shoulder (still pretty little at 1 1/2 I guess), but never any desire to come into bed with me or him.  \n\nI agree with everyone else, that maybe he was just really tired and wanted some restful sleep.. maybe he missed the part where you said you'd go comfort her in her own room.  You were right.. in fact my hubby did all the comforting last night when our little one was sick and whiny so I could rest for work today.. ", "controversiality": 0, "created_utc": 1359652167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86ymaz", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431141351, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "Sounds like my husband. ", "controversiality": 0, "created_utc": 1359652921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86yuzh", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431141449, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "that was my first thought - it sounds like (a)dad can't sleep when kiddo's in bed with them, and (b)he tends to end up losing arguments to his wife and it has been a long time since he's actually gotten his way about anything - she says \"as parents\" but every decision defaults to her way and has to be haggled towards his way (if at all). to him, it doesn't matter what the reasons are for the kid sleeping in her own room vs. the parents' room, his preference is dismissed as an option outright (\"if it's such a big problem for you, ~~you can have your way~~ we can go halfsies\"). and when he gives up and punishes himself, his wife gets her way entirely. her kid's happiness has trumped her husband's happiness.\n\n&gt; It's just one of many different opinions we have and it's ok. \n\ni would agree, except for this part:\n\n&gt; I usually win\n\nit feels okay to have \"different opinions\" to you because you usually win. your husband is probably grumbling about how pointless it is to disagree with you because he so seldom gets his way.", "controversiality": 0, "created_utc": 1359654199, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86z9xe", "link_id": "t3_17mrs3", "parent_id": "t1_c86xamc", "retrieved_on": 1431141644, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rollinonDDs", "author_flair_css_class": null, "author_flair_text": null, "body": "I let my 19 month old sleep in bed with me all the time. My husband just gets up and goes to sleep on the couch. He's a light sleeper and my daughter moves a lot. We don't even discuss it anymore. It's his choice to sleep on the couch. Don't over think it he may of just been crabby from waking up. ", "controversiality": 0, "created_utc": 1359655050, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86zka5", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431141780, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "missjlynne", "author_flair_css_class": "blue", "author_flair_text": "Malachi 9/26/12", "body": "We coslept with my little guy for a while, simply because he wouldn't sleep any other way and I was tired of being up all night. My husband was definitely more anxious to get him back in the crib than I was. He considers our bed a place of intimacy for us and I think having Malachi in bed with us symbolized an interruption to that intimacy. Luckily he was also pretty understanding about the fact that both the baby and I needed sleep and cosleeping was the only way it would happen. ", "controversiality": 0, "created_utc": 1359655650, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c86zrek", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431141873, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Caseygrl98", "author_flair_css_class": null, "author_flair_text": null, "body": "You're right, I should have phrased that differently.  There is no winning or losing when it comes to this, or any, argument and I don't look at it that way.  I should have said our child usually ends up in bed with me. Thank you for bringing that to my attention.", "controversiality": 0, "created_utc": 1359656766, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8704te", "link_id": "t3_17mrs3", "parent_id": "t1_c86z9xe", "retrieved_on": 1431142049, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My significant other has problems getting more than 5 hours of sleep a night.  He'll just randomly wake up after 4 or 5 hours and won't be able to go back to bed, no matter how early he laid down.  He doesn't have problems getting to sleep, oddly enough.  He's been like this for 4 years and has gotten increasingly testy and asshole-ish.  I try to cut him some slack, but it's getting to both of us badly.  He also hates his job and is under a lot of stress at work (I'm a SAHM), so I know that adds fuel to the fire.  He refuses to see a doctor because he doesn't think that sleeping pills are safe and he's afraid of getting addicted.\n\nHow do I draw the line between cutting too much slack and letting his moodiness affect everyone else in the family's good mood vs. not saying enough and growing resentful of him being touchy?  :/", "controversiality": 0, "created_utc": 1359657096, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8708t6", "link_id": "t3_17mrs3", "parent_id": "t1_c86xn1r", "retrieved_on": 1431142101, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "You need to find a middle ground... Both of your reactions weren't ideal. What would have happened if you both cuddled your child for a few minutes to calm her, had a talk about being safe and then taken her back to her bed? You both would have gotten what you wanted. Instead you both took a hard stance and ended up alone. Yes, your husband could have been more understanding of your wishes, but you also could have been more understanding of his.\n\nUnderlying all of this are fundamental opinions that all couples grapple with. We all have these arguments. Ideally you should have these potential road bumps discussed before the event occurs. Maybe you did talk about it, but either way expectations were not met. You now need to go back and discuss the issue. Try not to attack with \"you\" statements, use \"I felt like you wanted me to just abandon \"Sara\" while she was upset\". He'll respond more openly. Potential solutions could be: comforting and calming, then the child goes back to her own bed; have daddy deal with her without you intervening - maybe he reads a book to her; or set a very firm limit on the number of times she's allowed to sleep with you... One of these should make him feel more comfortable without leaving you feeling like you've abandoned your little one.", "controversiality": 0, "created_utc": 1359658825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c870u2e", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431142379, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "Undermining him is not good for their relationship. We also don't know how cranky she was... It would have been nice if they could have come to an agreement instead of them both drawing a line in the sand. They're both at fault... He's not the big, bad wolf out to torture his crying daughter.", "controversiality": 0, "created_utc": 1359659407, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87113b", "link_id": "t3_17mrs3", "parent_id": "t1_c86ykhb", "retrieved_on": 1431142473, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "adarkstone", "author_flair_css_class": null, "author_flair_text": null, "body": "Find a good marriage therapist, and talk about these concerns.  My husband and I both struggle with depression, and it can be really hard on our marriage, on our kid, and absolutely on our sleep schedule, which in turn effects our marriage and our kid.  It's a bad cycle.  Your husband might benefit more from talking to a therapist or psychiatrist than to a doctor - early-morning wakings are a big depression red flag.", "controversiality": 0, "created_utc": 1359659456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8711ol", "link_id": "t3_17mrs3", "parent_id": "t1_c8708t6", "retrieved_on": 1431142479, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SneezeFart", "author_flair_css_class": null, "author_flair_text": null, "body": "\n\nIn my early 20s I was a concrete mason pouring slabs of concrete in the desert. It was brutal work moving heavy mud under the blazing sun but my days as a SAHD were much-much harder.\n\nI always knew that I could quit and get another desk job if the heat became an issue. As a SAHD/M you can't quit your kids and even worse there's no clocking out.\n\nMy wife (at the time) was making really-really-really good money and most everything was going into savings. Still, she felt that staying at home was not real work and that I should also get a job and place our then one year old daughter in day care all day.\n\nOur marriage ended over perception.  \n\nI'm on my third relationship since my divorce in 2001 so take any advice from me with a grain of salt. The key to all of it is to bring back the spark. The key to the spark is to be the person you were when you first started dating, the one he fell for. \n\nNone of the above means you should be a doormat. \nI was a doormat to my ex when she was paying all the bills and it just made her hate me that much more. You need a back bone, the trick will be to balance everyone's needs.\n\nI once stood my ground on not putting our daughter in childcare thinking this wouldn't be fair to her but in the aftermath she may have paid a much higher price.\n\nI feel like I've barged in here so I'll be quiet now but I wish you all the luck in the world. (Pssst... Tell him I told him to see the &amp;^%$ doctor)\n\n  /really wish I had a different user name right now...\n", "controversiality": 0, "created_utc": 1359659716, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8714to", "link_id": "t3_17mrs3", "parent_id": "t1_c8708t6", "retrieved_on": 1431142520, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm pretty sure that he's suffering from chronic depression.  We've had a few rough spots lately wherein he promises to go to couples counseling with me but always backs out.  He also has it in his head that all doctors are \"quacks\" (even the MDs - whut?) and refuses to go see anyone.  \n\nI'm surprised that you two were able to pick up on what is really going on instead of what I'd said.  I guess it's a bigger problem than I thought if two people can 'see through me' so easily.\n\nThanks for the input!  I'll try again to convince him, but I know he'll shoot it down in flames.  :/", "controversiality": 0, "created_utc": 1359660290, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c871by8", "link_id": "t3_17mrs3", "parent_id": "t1_c8711ol", "retrieved_on": 1431142613, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "adarkstone", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband also hates doctors.  I just made the therapist appointment myself, and calmly, lovingly told him that it was really important to me that he come with me.  In my case, it helped to tell him just how important it was - that I felt our marriage was in trouble, and I wanted us to learn some tools to fix it.  That I love him, and want all of us to be happy.  He's been on an antidepressant for a couple months now, and it has made a world of difference.  Don't give up!\n\nEdit: The therapist appointment helped ease him into the psychiatrist appointment.  We did end up seeing both.", "controversiality": 0, "created_utc": 1359661412, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c871ppw", "link_id": "t3_17mrs3", "parent_id": "t1_c871by8", "retrieved_on": 1431142793, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "even if you don't call it \"winning,\" the effect is the same - he wants the baby in her own bed, but she ends up in your bed.", "controversiality": 0, "created_utc": 1359662701, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8725kf", "link_id": "t3_17mrs3", "parent_id": "t1_c8704te", "retrieved_on": 1431143002, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mostly_me", "author_flair_css_class": null, "author_flair_text": null, "body": "Can he sleep in 2 or more \"naps\"? Maybe if he can somehow add another nap and get 7 or 8 hours of sleep that way, things will improve?\n\nMaybe nap from 9 till 11, and sleep from 3 till 7? Or whatever your schedules allow for?", "controversiality": 0, "created_utc": 1359663094, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c872ai8", "link_id": "t3_17mrs3", "parent_id": "t1_c8708t6", "retrieved_on": 1431143068, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "From the way she tells it, it was he who undermined her. She was willing to compromise, he wasn't. I'm not saying he's a big bad wolf, but I don't see what she did wrong.", "controversiality": 0, "created_utc": 1359670123, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c874stv", "link_id": "t3_17mrs3", "parent_id": "t1_c87113b", "retrieved_on": 1431144350, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ValarDohaeris", "author_flair_css_class": "brown", "author_flair_text": "Dashiell's mom, 8/14/2012", "body": "Ask him to consider having a sleep study done.\n\nMy fiance falls asleep SUPER fast but never really got rested. He actually had extremely bad sleep apnea, and had surgery to remove his tonsils and other unpleasant stuff. He doesn't snore anymore, and he doesn't stop breathing in the middle of the night anymore. He's getting better quality sleep. It's so worth looking into. ", "controversiality": 0, "created_utc": 1359670369, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c874vv8", "link_id": "t3_17mrs3", "parent_id": "t1_c8708t6", "retrieved_on": 1431144390, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "maybe he wanted to have sex and was being cranky ?", "controversiality": 0, "created_utc": 1359671065, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8754e4", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431144501, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "my husband is such a bear if he's tired", "controversiality": 0, "created_utc": 1359671080, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8754kx", "link_id": "t3_17mrs3", "parent_id": "t1_c86ykhb", "retrieved_on": 1431144504, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Brandonite", "author_flair_css_class": "green", "author_flair_text": "DJ 29/09/2012", "body": "I haven't read all the responses so sorry if this is a repeat. I'm wondering if its how you said it. Explaining to him all the different options. I know I say things inthe wrong manner (with good intentions) but it ends up just making my husband mad/annoyed. ", "controversiality": 0, "created_utc": 1359671914, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c875evg", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431144638, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "Undermining? What is this 1950's? Jesus. Her daughter was scared and needed comfort. If he has such a big ego that he gets pissed that his wife- the mother of his child- wants to comfort their child then the guy has bigger issues. Just sayin.", "controversiality": 0, "created_utc": 1359674011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8765bx", "link_id": "t3_17mrs3", "parent_id": "t1_c87113b", "retrieved_on": 1431144984, "score": 17, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think he saw it that way... I've had this argument. No where does she say that he told her to shut the child in it's room. She just says that's not what she was going to do. I'm guessing that from this guy's reaction he is feeling belittled and left out. Why be somewhere he isn't wanted? Not saying that's how she feels, but a strong suspicion this is how he feels. Leaving a situation is a pretty strong indicator the person has reached the end of his or her rope and has nothing left to say. ", "controversiality": 1, "created_utc": 1359674275, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8768im", "link_id": "t3_17mrs3", "parent_id": "t1_c874stv", "removal_reason": null, "retrieved_on": 1435635627, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "You did the right thing. Your child comes first. If your husband wants to act like a 2 year old and throw a little tantrum, then fine, sleep on the couch. That is his issue, not yours. \n\nYou should sit down and discuss the situation with him and ask why he feels the way he does. Don't back down from what feels right to you. If your husband was \"cranky\" because he was tired or wanted sex and the little one was in the way, then you need to remind him that you are a mother first and a wife second. \n\n", "controversiality": 0, "created_utc": 1359674328, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87694p", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431145037, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "Why is it ok for either of them to undermine each other? That is my point... She portrays her side as she is innocent and he is the big meanie. I highly doubt that was the case... He has feelings too and I'm guessing she is neglecting them. People don't sleep on the couch just cause.\n\nEdit: and I'm aso guessing that it's their daughter. Not just hers.", "controversiality": 0, "created_utc": 1359675455, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c876mp0", "link_id": "t3_17mrs3", "parent_id": "t1_c8765bx", "retrieved_on": 1431145217, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xxcatalopexx", "author_flair_css_class": "blue", "author_flair_text": "6YR Boy", "body": "Well the husband has a right to sleep and I think the two of you need to get together when you are both awake and aware and discuss what to do in situations like these.  Make it clear and stick to it, that way you both agreed on it and nobody can point fingers at anyone.  This is just a failure of communication and yes I agree with the other comments about the guy being sleep deprived and grouchy.  It happens to most men.  You people who are getting on the husband need to step back and see what he was doing wasn't wrong and neither was she.  I don't think it's going to ever work out when having arguments at whatever hour of the night.   And I highly doubt he's a bad father, I think establishing boundaries as far as where your child can sleep at night is important.  ", "controversiality": 0, "created_utc": 1359677007, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8775eh", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431145461, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "Sure he has feelings. We all have feelings. The daughter had feelings of being scared and needed comforting. In this situation the only thing that matters is the child. If the husband has an issue with her wanting the child to feel love and comfort, then he has major issues. \n\nA mother's main goal is to focus on her children. She is a mother first, then a wife. The husband should already know this and stop being selfish. ", "controversiality": 0, "created_utc": 1359677521, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c877bcf", "link_id": "t3_17mrs3", "parent_id": "t1_c876mp0", "retrieved_on": 1431145541, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow.... you're really compassionate. Maybe the mom should stop being quite so selfish. I see the other side of this coin. My other half had a wife who would do this. She abused him. Mentally and physically. Often when he just to be a part of the situation he wasn't allowed to be. Now, I'm not saying the OP is abusing her husband, but his reaction doesn't mean he is being a big meanie. She (the OP) is a mother and a wife equally - otherwise there is no marriage. He is a father and a husband, but he gets ignored? Come on.\n\nEdit: if this were a husband complaining of this, I think the 2x response would be vastly different. My whole point is that there is way more to this story than the OP is letting on. I hate some of the women on 2x for their inability to treat men as equal and important as the women in the relationship. This the man must always come below the needs of the woman and child? What?? You're a family.... If it were a male perspective it would be fairly misogynistic... How does misandry sound?", "controversiality": 0, "created_utc": 1359679746, "distinguished": null, "downs": 0, "edited": 1359732439, "gilded": 0, "id": "c8781ot", "link_id": "t3_17mrs3", "parent_id": "t1_c877bcf", "retrieved_on": 1431145882, "score": -11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a very compassionate person and I usually get into trouble because of it! Oops! \n\nI'm not trying to say his feelings aren't valid, because I am sure to him they are. And your right in order for a marriage to work you have to play the parts equally. But when it comes to this certain situation being a parent is more important then being a spouse. He should have under stood his daughters needs should have been met first. \n\nMy husband and I have a mutual agreement that the kids are ALWAYS first. If one the kids need comfort because they are scared then they get the attention first, it doesn't matter if we are in the middle of sexy times or not. It is our job as their parents to make them feel safe. \n\n", "controversiality": 0, "created_utc": 1359682476, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c878xva", "link_id": "t3_17mrs3", "parent_id": "t1_c8781ot", "retrieved_on": 1431146302, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ejsmommy", "author_flair_css_class": "maroon", "author_flair_text": "GingerBaby", "body": "They should be parents *together* and partners *together* at the same level. You can be a mom and a wife at the same time. Marriage is a partnership, where both partners work together. The idea that a child is so much more important than a marriage baffles me. Children (people) are resilient and built to withstand much more than a marriage. It would be more beneficial to the child to have two parents who love them and each other and all work together. No one person in a family is more important than another. Yes, you must take more steps to provide safety and health to a child, but no, that doesn't mean they're more important. It just means they're more physically needy.", "controversiality": 0, "created_utc": 1359685438, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c879w0g", "link_id": "t3_17mrs3", "parent_id": "t1_c87694p", "retrieved_on": 1431146752, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359685627, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c879y7f", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431146778, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "your right. They should be parents and partners TOGETHER. But he made the choice for her to parent alone. \n\nAll situations are different, and in the scheme of things, yes not one person should be more important than another. But when you break it down to something simple like My child is scared and needs their parents to comfort them vs. my husband wanting me to himself.... I think the child trumps the father. Just my honest opinion. I even checked in with my husband on this and he said that this is just stupid and the father sounds like an ass. \n\n", "controversiality": 0, "created_utc": 1359686557, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87a8tl", "link_id": "t3_17mrs3", "parent_id": "t1_c879w0g", "retrieved_on": 1431146925, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ejsmommy", "author_flair_css_class": "maroon", "author_flair_text": "GingerBaby", "body": "If the husband did just want her all to himself, then yes, that's poor parenting on his part. We weren't really given any clues that said that's what was going on though. The whole situation sounds more like the husband has been going through neglect himself and is just fed up with it. We are missing information. Men don't say \"whatever\" and sleep on the couch for no reason. Certainly not because his wife went to comfort an upset baby. Either OP is not telling us how the situation REALLY went down, or the dad is in fact a serious douche.", "controversiality": 0, "created_utc": 1359687845, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87and5", "link_id": "t3_17mrs3", "parent_id": "t1_c87a8tl", "removal_reason": null, "retrieved_on": 1435635524, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "themilkmaiden", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you're projecting your SO's past issues onto this woman. You're being very negative and jumping to conclusions. It doesn't seem much like she was attacking her husband. She seemed like she was more wondering if she did something wrong and asking for advice. If she was a soul-sucking she-beast the post would have been quite different IMO.", "controversiality": 0, "created_utc": 1359688571, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87ave3", "link_id": "t3_17mrs3", "parent_id": "t1_c8781ot", "retrieved_on": 1431147282, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "Well we said this was the first time the child has done this, so I'm banking on that the guy is just a douche", "controversiality": 0, "created_utc": 1359691210, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87bo44", "link_id": "t3_17mrs3", "parent_id": "t1_c87and5", "retrieved_on": 1431147723, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ejsmommy", "author_flair_css_class": "maroon", "author_flair_text": "GingerBaby", "body": "If so, it's a shame. It seems like if he's a douche, he would be douchey in other areas of their lives as well, therefore she would know he was a douche and wouldn't be here asking what could possibly be going on. Sigh. I'm not trying to argue with you, just really confused about the state of marriage and communication these days. If this incident was something totally out of the ordinary and uncharacteristic of him, maybe the answer is therapy. I don't know. I wish she had outlined the entire conversation. I know in the past I have phrased things in the wrong way towards my husband, been selfish and stubborn, causing him to act that way. And I've even tried to rationalize it to myself so I didn't have to admit that I had done anything wrong. That's not good for a marriage.", "controversiality": 0, "created_utc": 1359692695, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87c3ed", "link_id": "t3_17mrs3", "parent_id": "t1_c87bo44", "retrieved_on": 1431147920, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "Very true! I see this more as a discussion then an argument. It's good to really talk about these things with other people!\n\nAnd I agree. More info is needed. There can be several conclusions from the information she gave, and several more from what she hasn't. I guess in the end all we can do is just try and point the person in the right direction while discussing how we would have handled the certain situation! \n\nBeing a parent is hard, being married and a parent is even harder. ", "controversiality": 0, "created_utc": 1359694426, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87cl99", "link_id": "t3_17mrs3", "parent_id": "t1_c87c3ed", "retrieved_on": 1431148156, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ejsmommy", "author_flair_css_class": "maroon", "author_flair_text": "GingerBaby", "body": "Well on the one hand it's nice to have the extra two hands and the extra support a partner provides (I say that having been a single parent for 3 years), and on the other hand it's ANOTHER person whose needs have to be taken into consideration. It helps if you are married to someone you're compatible with. I hate to see people whose relationships are crumbling because of differences of opinion or just obvious differences in personality. I guess you either get lucky or you don't. But I also think that marriage isn't what it's supposed to be. People get married just because they have a kid, and that's not a good enough reason. Or they get married because they're in lust, not love. I feel like love has gone from meaning \"mutual respect and consideration\" to \"warm fuzzy feelings that I only get when you do/act exactly how I want you to\". People don't really think about the whole Till Death Do You Part.. or they think about it too late. Gotta be careful who you exchange vows with!", "controversiality": 0, "created_utc": 1359695126, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87csfb", "link_id": "t3_17mrs3", "parent_id": "t1_c87cl99", "retrieved_on": 1431148409, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "casual__t", "author_flair_css_class": "green", "author_flair_text": "Boy-2007/Girl-2008/Girl-2010", "body": "You didn't do anything wrong. I have 3 kids and had to buy a king size bed because of how often I wake up with at least one of them in the bed, sometimes all 3. My husband tried when our oldest child was a baby to put a stop to it and I ignored him. Maybe not the most diplomatic way to do it, but 6 years later and he enjoys the snuggle time with the kids.", "controversiality": 0, "created_utc": 1359697718, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87dgm9", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431148738, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xixoxixa", "author_flair_css_class": "blue", "author_flair_text": "Demon (6) Demoness (9)", "body": "As a husband who has been working night shift for the last 6 months, the fatigue comment is so dang true.\n\nAs much as I hate it, I can't help just being an asshole sometimes because I've only slept 2 hours in 3 days.", "controversiality": 0, "created_utc": 1359697905, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87di8k", "link_id": "t3_17mrs3", "parent_id": "t1_c86ykhb", "retrieved_on": 1431148763, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "Yes, have a good breakfast and ask with no \"you\"s or \"I\"s. It is the #1 most effective way to avoid putting people on the defensive in my experience. ", "controversiality": 0, "created_utc": 1359700040, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87e09j", "link_id": "t3_17mrs3", "parent_id": "t1_c86ykhb", "retrieved_on": 1431148992, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "1dzMonkeys", "author_flair_css_class": null, "author_flair_text": null, "body": "He wanted a good night sleep. My husband is kind of deaf to that kind of thing. And completely open to other vulnerabilities my sons have that don't show up on my radar at all. I think it is just a guy thing. If he shows his love for her in other ways, then let it go. You each have your own ways of loving your child. ", "controversiality": 0, "created_utc": 1359701255, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87e9lz", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431149111, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "something_stoopid", "author_flair_css_class": null, "author_flair_text": null, "body": "Or maybe it's the middle of the night, he's half asleep and just sees himself getting a better sleep on the couch.", "controversiality": 0, "created_utc": 1359722098, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87gvzt", "link_id": "t3_17mrs3", "parent_id": "t1_c8768im", "retrieved_on": 1431150341, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "something_stoopid", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe it was the middle of the night, he was half asleep and maybe figured he'd have a better chance of getting a whole nights sleep on the couch?", "controversiality": 0, "created_utc": 1359722244, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87gwm9", "link_id": "t3_17mrs3", "parent_id": "t1_c8768im", "retrieved_on": 1431150348, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "23sunflowers", "author_flair_css_class": "lightcoral", "author_flair_text": "Caili's Mom (2yo)", "body": "Yeah, I said all those options. Even asked why he was going to sleep on the couch if the bed was open when I came to get my pillow and he was still getting his stuff together to go downstairs. ", "controversiality": 0, "created_utc": 1359729359, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87i4rz", "link_id": "t3_17mrs3", "parent_id": "t1_c875evg", "retrieved_on": 1431150926, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "23sunflowers", "author_flair_css_class": "lightcoral", "author_flair_text": "Caili's Mom (2yo)", "body": "OP here, got any questions? Ask.", "controversiality": 0, "created_utc": 1359730042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87iaie", "link_id": "t3_17mrs3", "parent_id": "t1_c87and5", "retrieved_on": 1431151002, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whoisearth", "author_flair_css_class": "blue", "author_flair_text": "Father of 3, 4 and under!", "body": "Men are from Mars.  Women are from Venus.\n\nI think biologically we have different responses to parenting and discipline that we find hard to understand in eachother.\n\nMy wife and I have loggerheads on this all the time.  My role is, crying or not, to let them know that 'life ain't fair' and that there are rules and those rules are hard and fast.  My wife (women being the more empathetic of the sexes) does not see it as cut and dry as this.\n\nWhat has happened in your case is that you just had a huge disagreement in parenting and rules and you need to discuss this.  I can't tell you the amount of times I have willfully listened to my son whine and cry only to have my wife then give him what he wants because \"I couldn't listen to it anymore, it was only 1 more cookie!\".  That's not the point.  The point is that you set rules, both parents need to be on the same page surrounding them.  Men, being \"cold heartless bastards\" are far better equipped to ignoring the sounds of crying toddlers.\n\nThe excuses I've heard from my wife when trying to exact discipline - \n\n\"He's only 2 years old\"\n\n\"It's only 1 more\"\n\n\"He won't remember tomorrow\"\n\n\"He's had a rough day\"\n\n\"He's not feeling well\"\n\netc. etc.\n\nI'm not getting on you, I'm just trying to explain what is probably gone through his head.  He can correct me if I'm wrong.", "controversiality": 0, "created_utc": 1359730723, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87igdh", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431151078, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "That could really be the case... The OP is unclear on a lot of the details... From her distress in the post it sounds like it was an icy exchange... Even if he was going just so he could get a good night's sleep, neither partner left it on good terms. ", "controversiality": 0, "created_utc": 1359731678, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87iozo", "link_id": "t3_17mrs3", "parent_id": "t1_c87gwm9", "retrieved_on": 1431151192, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "No, I'm giving a devil's advocate look into the situation... And yes I may be projecting my own experiences, but don't we all when we respond to posts?\n\nMy other half was really hurt when his ex would pull power plays like this... Her response? \"Our daughter's needs are more important.\" It ended their marriage cause he was a second class citizen in the reationship. Every time he tried to negotiate she would simply say no. These little \"cold wars\" can seem really innocent when they happen, but over time they can become the straw that breaks the relationship up. \n\nIt worked out in my case, I get an amazing partner that she deemed not worth it... But it kills both of us for how it's turning out for his daughter. ", "controversiality": 0, "created_utc": 1359732492, "distinguished": null, "downs": 0, "edited": 1359733167, "gilded": 0, "id": "c87iwra", "link_id": "t3_17mrs3", "parent_id": "t1_c87ave3", "retrieved_on": 1431151293, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "You're missing the point in that they could have together helped the child without either of them taking a stand... But hers was first, he just responded by drawing his own.", "controversiality": 0, "created_utc": 1359732717, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87iz1f", "link_id": "t3_17mrs3", "parent_id": "t1_c878xva", "retrieved_on": 1431151335, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "23sunflowers", "author_flair_css_class": "lightcoral", "author_flair_text": "Caili's Mom (2yo)", "body": "Yay! A Dad on mommit! =D", "controversiality": 0, "created_utc": 1359738950, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87kxi5", "link_id": "t3_17mrs3", "parent_id": "t1_c87igdh", "retrieved_on": 1431152330, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whoisearth", "author_flair_css_class": "blue", "author_flair_text": "Father of 3, 4 and under!", "body": "I would like to think there would be a lot of us, and vice versa.\n\nKnow your enemy to put it in context (not that women are the enemy) but more the line of thinking I'm getting at.", "controversiality": 0, "created_utc": 1359740907, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87llam", "link_id": "t3_17mrs3", "parent_id": "t1_c87kxi5", "retrieved_on": 1431152639, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ejsmommy", "author_flair_css_class": "maroon", "author_flair_text": "GingerBaby", "body": "Has your husband ever showed such signs of douchiness in the past? ", "controversiality": 0, "created_utc": 1359752820, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87q2l2", "link_id": "t3_17mrs3", "parent_id": "t1_c87iaie", "retrieved_on": 1431154753, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "YouNoKnowMe", "author_flair_css_class": null, "author_flair_text": null, "body": "We just bought a new bed for this very situation. Our 2 year old son sleeps with us often. We got him a twin bed around Christmas and sometimes I sleep in his room with him. Our bed was on its last days and while mattress shopping for a full size I talked my husband into the king simply by saying, \"You think it's crowded now? We're about to have another bed hog this summer.\" He didn't even argue the slightest. We have our king and we all have room and love it. ", "controversiality": 0, "created_utc": 1359760559, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87so08", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431156038, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "23sunflowers", "author_flair_css_class": "lightcoral", "author_flair_text": "Caili's Mom (2yo)", "body": "Yes. Actually, way worse than this. Not sure if I want to share all of that. It was to where our LO was scared of him (no physical abuse) and I had become resentful and negative in reply to a few years of it and that's just not me. So, I had left him for a bit, eventually came back &amp; he apologized and we worked through it but now I'm worried he's coming back around to the way he used to be. Posted to see if maybe I am being unreasonably bitchy and somehow bringing this all about instead?\n*it comes and goes throughout the day, like sometimes his 'don't be a douche' filter is on the fritz.", "controversiality": 0, "created_utc": 1359769693, "distinguished": null, "downs": 0, "edited": 1359769876, "gilded": 0, "id": "c87v8be", "link_id": "t3_17mrs3", "parent_id": "t1_c87q2l2", "retrieved_on": 1431157246, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "23sunflowers", "author_flair_css_class": "lightcoral", "author_flair_text": "Caili's Mom (2yo)", "body": "Totally not  bizarre sounding! It can be a pain when the fallout's like this, but I love that my daughter will call if she needs me. It wasn't like her to be up that late.", "controversiality": 0, "created_utc": 1359770436, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c87vf8k", "link_id": "t3_17mrs3", "parent_id": "t1_c86ymaz", "retrieved_on": 1431157336, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ejsmommy", "author_flair_css_class": "maroon", "author_flair_text": "GingerBaby", "body": "That really sucks. It could go either way. Perhaps the old resentfulness in you rears its head without you noticing (such as you not really seeing objectively how you responded to what seemed like a lack of giving a shit in this situation), or it could be that he's just falling back into old habits. Whatever it is, I hope you guys are able to talk about it and get it all out in the open.", "controversiality": 0, "created_utc": 1359827563, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8857xq", "link_id": "t3_17mrs3", "parent_id": "t1_c87v8be", "retrieved_on": 1431162029, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Honestly he probably just feels neglected. \n\nI'm so guilty of choosing mommy baby snuggles over daddy baby or mommy daddy snuggles.\n\nIt's a problems, he probably just didn't want to share you I doubt it's that he didn't care if his kid was scared. He probably just wants HIS wife back and is a little tired of you always being the mom first. There's nothing wrong with what you are doing or for him to want that but just try to remember especially of this is your first kid, husbands get sick of sharing their wives with the kid(s) all the time. It does not mean they don't live their kids more than air.\n\nMy husband gets upset when I want me time and baby time so much and don't do husband wife time. ", "controversiality": 0, "created_utc": 1359958880, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c890aol", "link_id": "t3_17mrs3", "parent_id": "t3_17mrs3", "retrieved_on": 1431177868, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}