{"submission": {"author": "talk2thebreast", "author_created_utc": 1344347821, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_8l84i", "created_utc": 1359863093, "domain": "self.Mommit", "edited": 1359920052, "full_link": "https://www.reddit.com/r/Mommit/comments/17sfwe/had_a_bad_scare_today_still_shaking/", "gilded": 0, "id": "17sfwe", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 87, "over_18": false, "permalink": "/r/Mommit/comments/17sfwe/had_a_bad_scare_today_still_shaking/", "retrieved_on": 1413134126, "score": 57, "secure_media_embed": {}, "selftext": "I was visiting friends with my 6mo old today.  After changing her diaper upstairs, I went to go down the stairs holding the railing in one hand, baby in the other.  You can guess what happened next.  I at least didn't fall fwd, rode my tail bone all the way down the staircase, but the baby's head did smack on the wall, god I'm still shaking with shame every time I think of it.  My friends were great.  Took us to the ER, baby was fine didn't even get a bump on her head just a little redness (she took a nap while I was waiting for x-rays doc says shes fine) , I just bruised my tail bone.\nI know accidents with little ones are par for the course, but usually they are their own bumps and bruises, not caused by Mommy's clumsiness.  Anyone else out there that can share a moment of being a new parent and having a situation like this?  I guess I'm just looking for some validation that I'm not a complete fuck up as a new mom.  Thanks for letting me rant.\nNext day edit:  Thanks everyone for sharing your stories!  After a decent nights sleep and lots of hugs for my baby girl today, I feel like I'm part of an exclusive group now instead of a fuck up :-)  ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Had a bad scare today, still shaking", "url": "http://www.reddit.com/r/Mommit/comments/17sfwe/had_a_bad_scare_today_still_shaking/", "user_reports": []}, "comments": [{"archived": true, "author": "atemporalsquid", "author_flair_css_class": null, "author_flair_text": null, "body": "There is no shame in that, you weren't doing anything risky or stupid. If it makes you feel better my mom stumbled going up the stairs with my 3 week old. I bonked him on the head on the door frame two days ago. My husband has two scars on his face from accidents with his mom. ;)", "controversiality": 0, "created_utc": 1359864018, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ejgb", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431166479, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugg yes, my daughter is almots 8 months old. And stupid me Was sitting on the couch with her, my phone rang so i answered it ( it was next to me on the other side) She rolled off the couch and hit her head. She was fine no bump, nothing ten min later no crying at all. Phew never agian, ill learn that lesson once", "controversiality": 0, "created_utc": 1359866835, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88f9vd", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431166890, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "milleniajc", "author_flair_css_class": "maroon", "author_flair_text": "boy junior &amp; baby girl", "body": "Mine was 8 or 9 months, getting his diaper changed up on the changing table. I lean over to toss his dirty diaper in the bin and he rolls right off the top. I always left one hand on him before ( and since ) but that one time I didn't. I think he was more scared of me snatching him up off the floor so quickly than actually being hurt. He was fine after a quick crying spell. Felt guilty for weeks! ", "controversiality": 0, "created_utc": 1359867293, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88fe1v", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431166944, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "timeforstars", "author_flair_css_class": null, "author_flair_text": null, "body": "5 weeks old. Put her in her car seat (without buckling her in because it was just going on the stroller. Picked up the car seat with the handle not locked into place, as I was carrying her out of the kitchen, her weight tipped the seat forward until I heard her face-plant on the tile floor. \n\nShe was fine though, cried for all of a minute and then was the usual 5 week old baby. She's 6 months now and in these past 6 months I have dropped my phone on her head a few times and accidentally bopped her head on various places. Every time I hold my breath for a second and wait for the cry but it doesn't usually happen. \n\nBabies are pretty tough, don't feel bad. I can understand the scare of it but you're not guilty of anything!", "controversiality": 0, "created_utc": 1359867725, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88fi0g", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431166999, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fallenstar831", "author_flair_css_class": null, "author_flair_text": null, "body": "When my oldest (now 13, and only mildly braindamaged - in a teenager kinda way) had several good ones.  He was about 6 months old and we dozed off on the couch with him on my chest, I woke up to him rolling off my chest ontothe floor.  He woke up shocked, looking at me mad as hell that I didn't catch him.  When he was about 2 I went pee for 30 seconds - in that time he manages to jump on an electric toy 4 wheeler and drive it down a full flight of stairs.  I didn't even realise that it was in the room.  He was more upset his toy broke, and not hurt at all.  Also bumped his head on a door frame, etc. Etc.  He's lived to tell, and actually finds the stories hilarious. :) no worries momma, we've all been there!", "controversiality": 0, "created_utc": 1359869031, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ftzt", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167159, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359872551, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88go34", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167547, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "krb180", "author_flair_css_class": null, "author_flair_text": null, "body": "TIL I am not the first mom to hit her baby's head on a door frame.", "controversiality": 0, "created_utc": 1359872622, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88gon9", "link_id": "t3_17sfwe", "parent_id": "t1_c88ftzt", "retrieved_on": 1431167555, "score": 32, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tif23", "author_flair_css_class": null, "author_flair_text": null, "body": "When my son was about four months old, I left him in the middle of our bed for all of 30 seconds so I could let the stupid dog out. I heard him chatting away \"da da da da dit dit dit\" then WHOMP. He scooted himself right off the bed and onto the floor. I wanted to throw myself off the roof and we both cried. He was fine, thank god for carpeted floors, and I learned that just because he couldn't roll over, it didn't mean he couldn't go places.", "controversiality": 0, "created_utc": 1359872770, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88gput", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167576, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shaynami", "author_flair_css_class": null, "author_flair_text": null, "body": "An expression someone told me got me through these last 2 years- 'Children: hard to raise. Harder to kill'", "controversiality": 0, "created_utc": 1359873413, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88guyq", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167638, "score": 84, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meeks17", "author_flair_css_class": null, "author_flair_text": null, "body": "Omg- the only thing that keeps running through my head is that I live in the furnished lower level of my SO's miggers house- and not only is there this giant stair case- but it's all tile down here. I'm either going to wrap baby girl in bubble wrap or I'm never going to let her go....\nThank you for sharing these stories/ I know shut happens- but that's fucking awesome that all your little ones turned out ok!!!", "controversiality": 0, "created_utc": 1359873686, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88gx2a", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167664, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meeks17", "author_flair_css_class": null, "author_flair_text": null, "body": "Damn phone- SO's mothers house... Excuse typos please", "controversiality": 0, "created_utc": 1359873755, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88gxla", "link_id": "t3_17sfwe", "parent_id": "t1_c88gx2a", "retrieved_on": 1431167673, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clasi", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter was around a year, and I was holding her in my lap and sitting on the couch. I leaned over to do something (I forget now) and I tipped her without meaning to and she smacked her face on the coffee table. Her nose started bleeding, she was screaming like she was dying, and I felt SOOO bad. I called her Dr. in a panic, terrified that I broke her nose or something. They talked me down, asked all her symptoms, and basically told me to chill. If she didn't pass out, wasn't gushing blood, and if she had quit crying before me, she was fine ^ ^", "controversiality": 0, "created_utc": 1359874042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88gzqj", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167700, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MSschifino", "author_flair_css_class": null, "author_flair_text": null, "body": "It's important to forgive yourself. Don;t worry about what could've happened, you're both going to be just fine. Everyone has a little accident once in a while. ", "controversiality": 0, "created_utc": 1359876489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hgtt", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167923, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Libertarian1986", "author_flair_css_class": "green", "author_flair_text": "1yr old girl, twin 5 year old boys, 10 month old boy", "body": "When I was in the hospital after having my daughter they had me on some major pain meds because I had C section complications (go figure) well I refused to let her sleep in the baby bed and wanted her in the bed with me. The nurses gave me the same lecture that she would fall out and I was thinking that this is my fourth child. I think I can handle it. \n\nWe all know where this is going right? She rolled right out of my arms because of the meds, I dozed off. I felt like the worst mother in the world. She screamed bloody murder and I calmed her down and gave her the boob. The fall was maybe a foot. I still feel shitty about it. \n\nBut she is a year old now and is fine. Good enough to tumble down the stairs. *sigh* my kids are going to kill me from fright one day. ", "controversiality": 0, "created_utc": 1359876675, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hi0y", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167939, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MSschifino", "author_flair_css_class": null, "author_flair_text": null, "body": "Every time your daughter is in her car seat, no matter the distance, she needs to be buckled in. ", "controversiality": 0, "created_utc": 1359876719, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hibq", "link_id": "t3_17sfwe", "parent_id": "t1_c88fi0g", "retrieved_on": 1431167943, "score": -8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "siriuslynotamuggle", "author_flair_css_class": "green", "author_flair_text": "Adahliah's Mommy", "body": "The first one that came to mind is once when she was probably like a month or two old I was really really tired and had been up all night with Adahliah and she was taking a nap and I was trying to sneak her into her crib without her waking up and wanting me to hold her and I turned the corner and bumped my elbow and her head on the wall when I did. I knew I had not hit it that hard (she didn't even wake up) because my elbow had hit too, but I bawled and bawled about it because I just thought I couldn't even carry my baby right. Also once when she was tiny I was clipping her nails and she jerked and I clipped some of her skin and she was screaming... that time I felt awful too. When she started rolling, I lied her on the couch for a second and turned around, still right next to the couch seriously turned for a second and she rolled herself right off and her head hit the floor and it freaked me out so badly. I called the doctor and they were really nice and walked me through making sure she seemed alright. There are always accidents. I still feel bad when something happens to her that I think I could have prevented, but accidents are always going to happen. I'm sorry that happened to you I can imagine how scared you must have been, I certainly would have been.", "controversiality": 0, "created_utc": 1359877307, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hlyr", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "removal_reason": null, "retrieved_on": 1435634379, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "adalab", "author_flair_css_class": null, "author_flair_text": null, "body": "I just stumbled upon this subreddit pressing the random button and this was top post.  My children have had their fair share of tumbles, falls and bumps and I am sad to say many of them have been directly or indirectly due to my immense clumsiness.  None of them have ever so much as broken a bone or needed a stitch.  It happens to a lot of us, please don't hold it against yourself!  At least you didn't leave baby in the carseat unbuckled in the back seat of the car only to notice when you took a corner.  Nope, honey, that was me!   edit: missed a word", "controversiality": 0, "created_utc": 1359877347, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hm73", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431167998, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "siriuslynotamuggle", "author_flair_css_class": "green", "author_flair_text": "Adahliah's Mommy", "body": "me too!", "controversiality": 0, "created_utc": 1359877408, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hmkf", "link_id": "t3_17sfwe", "parent_id": "t1_c88gon9", "removal_reason": null, "retrieved_on": 1435634377, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "adalab", "author_flair_css_class": null, "author_flair_text": null, "body": "Nope, I skulled every one of my three kids thinking I had door frame clearance!!", "controversiality": 0, "created_utc": 1359877449, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hmu1", "link_id": "t3_17sfwe", "parent_id": "t1_c88gon9", "retrieved_on": 1431168013, "score": 30, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Saravi", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an extremely similar accident with my son when he was 10 months old.  It was New Year's Eve and I was heading to a family party.  As a single mom in university, I didn't get out much, so I dressed up all nice, right down to a pair of heels.  I lived in a rented room on the second floor of a a home built in the 1920s:  Steep, narrow stair case, and no railing.\n\nI was holding my son on my right hip while I locked my door (I'm left handed), so he was towards the stairs.  I was in a rush to catch a bus and my ankle twisted as I turned, and I just knew we were going down.  I somehow managed to twist almost a full 180 degrees as I fell.  My son basically rode my hip the whole way down.  I was bruised all to heck on my left side for it with some seriously strained abdominal and leg muscles (from twisting in mid air...  *How* did I do that??), but he was 100% unscathed - didn't even cry - and that was all I cared about.\n\nI was a total mess after.  I went back to my apartment, skipped the party and just cried on and off for the rest of the night, hugging him as much as he'd let me.  I had a few episodes of not-quite panic attacks after the fact, just thinking about what could have happened, but they were brief and it passed.\n\nI felt like such a fuck up that I didn't tell anyone, but in a way, it was a good thing that this happened.  I didn't rush around with my son in my arms *ever* again.  It was a wake up call, I guess:  Slow down, be careful.  I'm not saying that you need that or even that I needed that, and I didn't wrap my kid in foam padding or anything, but it made me a little more aware of how easily accidents can happen.  I like to think that I was a \"better mom\" in the end for it.", "controversiality": 0, "created_utc": 1359877928, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hpjh", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431168042, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "interplanetjanet", "author_flair_css_class": null, "author_flair_text": null, "body": "When my daughter was about the same age, we had a similar accident. I was carrying her and stepped on a toy and ended up unintentionally doing the splits and slamming into the wall. I'm still not sure if it was my shoulder or her head that put the hole in the wall, but she did have a goose egg and a bruise from it. I didn't take her to the ER, though, just kept an eye on her. She's just fine!", "controversiality": 0, "created_utc": 1359878211, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hr37", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431168071, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Polandra", "author_flair_css_class": null, "author_flair_text": null, "body": "I was taking my daughter (then 1.5 yrs old) to the local Children's museum last January. I was walking across the parking lot carrying her and slipped on ice. We both fell and as I tried to keep her protected I bashed my knees but she still hit her head on the blacktop. I hobbled back to the car both of us crying and me freaking out. She threw up which freaked me out more so I drove us to her pediatrician's office. She was fine within minutes as I was still shaking. All of us were fine in the end I got the worst of it with bruised and bloodied knees. But it scared the crap out of me. You are not alone and certainly not a  bad mom! You got yourself and you child medical care and evaluation - bad moms wouldn't think or care to do so! *hugs* it's ok. ", "controversiality": 0, "created_utc": 1359878385, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hs4r", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431168077, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Darbzor", "author_flair_css_class": "black", "author_flair_text": "DS 08/08", "body": "When my DS was tiny, but big enough to pull himself up, we were at a local coffee shop with like six friends. DS had gone over to the window and pulled himself. I walked over to get him....I can't remember if he needed to nurse, or it was time to go? But when I picked him up I kind of tossed him in the air a little....right into a tiny light that was hanging down. The cover of the light fell and shattered everywhere. DS started screaming and I about passed out because I thought I'd sliced my kids head open. Turns out he was totally fine (had a super tiny little scratch). He started crying because of the noise and me tensing up. I sat and nursed him and cried for like 20 mins thinking what could have happened. Called the doc, she didn't think we needed to come in (we didn't). Had to fill out an accident report for the coffee shop. Later their PR ppl contacted me and sent me a $20 gift card lol We still go to this coffee shop just about every week :)\nEdit: luckily the coffee shop was empty except for me and my friends!\n", "controversiality": 0, "created_utc": 1359878807, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88huii", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431168103, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "keepswimming9112", "author_flair_css_class": null, "author_flair_text": null, "body": "The finger mail clipping thing happened to me just today with my four month old! That kid cannot sit still and he jerked it away and all a sudden I saw blood coming up on his thumb. I honestly couldn't believe that just happened. He wasn't crying or anything, despite what looked to be a little chunk of skin missing. I've felt so bad about it all day! \n\n\nI'll walk with him in one arm and he'll hold onto that arms finger for balance. Well he's gotten a little to excited and just wiggles and thrusts his body back and hits his head on doors or doorframes. It's crazy, it's like he knows \"okay, we're going through a door frame, time to do the crazy dance.\" ", "controversiality": 0, "created_utc": 1359879813, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88hzqt", "link_id": "t3_17sfwe", "parent_id": "t1_c88hlyr", "retrieved_on": 1431168175, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Infernored2937", "author_flair_css_class": "purple", "author_flair_text": "Ivy - 10/26/2012", "body": "I live in an old house with a steep staircase and I'm nervous every single time.  Scary!", "controversiality": 0, "created_utc": 1359880642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88i3wz", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431168230, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "My husband smacked our daughter's head on doorframes several times within the first month -- once was *really* hard and she didn't even wake up. We were standing there looking at each other going, \"she's still *breathing*....What should we do?\" He rubbed his knuckles on her sternum like he'd seen on ER and confirmed with our medical-student friend; she cried twice and went back to sleep. Uh...I guess she's okay?\n\nWell, she's 2 1/2 now so apparently she was.\n\nNot a physical injury but still made me feel like shit: she was about 3 weeks old and actually awake for a change, so I started making faces at her to make her smile. Might've been 2 months, actually. Really young baby, anyway. The third one I made, she reacted to with an expression of absolute eye-popping terror. I will never ever EVER forget the fear on my baby's face. I felt like a shit human being and the world's worst mother.\n\nWe didn't have stairs in our house, hadn't regularly used stairs in years, so when we visited my mom for Christmas when our daughter was 3 months old, I was out of practice. I slipped on the stairs at 5:30 am and slid down the last three or so steps. Broke both my pinky toes. She was fine.\n\nI can't think of them right now but I know there are others. Oh, there was the time I realized my then 10-month-old was holding her fingers straight out while she closed a drawer in the kitchen. Hmm, I wonder how she learned that? and I didn't even notice she was (must have been) pinching her fingers in the drawer sometimes.", "controversiality": 0, "created_utc": 1359887004, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88iukq", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431168575, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fallenstar831", "author_flair_css_class": null, "author_flair_text": null, "body": "Upvote for coining the term \"skulled\"", "controversiality": 0, "created_utc": 1359895275, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jlsm", "link_id": "t3_17sfwe", "parent_id": "t1_c88hmu1", "retrieved_on": 1431168931, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "katyshel", "author_flair_css_class": "purple", "author_flair_text": "3 girls", "body": "I swear baby-toddler heads have an extra layer of foam padding hidden somewhere. She won't remember a thing and you've been initiated into the \"I can relax now that the new car got it's first dent\" club. At two months our cat scratched one of our twins. I freaked out for a day imagining all of the horrible diseases she was going to get and debating getting rid of the cat. Calmed down after a day and just a week ago I told the same twin (almost 2 now!) to get up and shake it off after she fell on the sidewalk and scratched her knee. She did and went on her merry way. You're a good mother and I'm glad your baby is alright! ", "controversiality": 0, "created_utc": 1359896944, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jrss", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "removal_reason": null, "retrieved_on": 1435634350, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "myfairkatie", "author_flair_css_class": "green", "author_flair_text": "boy 15 mo", "body": "I clipped my son's finger while doing his nails, and saw blood.  Had a mini panic, and to this day, 5 months later, I still make my husband clip his nails.  :)", "controversiality": 0, "created_utc": 1359897518, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jtza", "link_id": "t3_17sfwe", "parent_id": "t1_c88hzqt", "retrieved_on": 1431169043, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cassiope", "author_flair_css_class": null, "author_flair_text": null, "body": "I let my younger toddler crawl off the bed and land on the top of her skull. Twice. In the space of a few weeks. \n\nMy husband just told me I dropped my older kid when she was a baby and hit her head on the crib. I don't remember it, but apparently it was quite a goose egg. \n\nWhen I was a teenager, I was carrying my toddler brother and walking down stairs to the garage and I missed the last step. The whole way as I fell I just kept thinking: \"ohgodpleasedon'tlethimhitthefloorpleasedon'tlethimgethurtaaaaahhhh!\"  I sprained my ankle. I did manage to keep him from hitting the floor, but boy howdy it scared the daylights out of him. \n\nOther than the typical family craziness, they all seem fine. \n\nYou kept your balance (feel back rather than forward), you didn't drop her. You rock. ", "controversiality": 0, "created_utc": 1359897579, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ju85", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169045, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Last week my ten month old managed to get the baby gate open. It is in the kitchen at the back door protecting the back stairs down to the basement. I was in the kitchen, but had my back to the stairs and was making cookies. I didn't notice when the gate opened. I have no idea what made me turn around. She was sitting at the very top of the stairs at the edge behind the gate. I almost threw up.", "controversiality": 0, "created_utc": 1359897665, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jujr", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169047, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sixtwelve09", "author_flair_css_class": null, "author_flair_text": null, "body": "When my daughter (now 3) was 9 months old, my husband was carrying her down the stairs at my MIL's. She somehow ended up doing a back flip out of his arms and landed directly on the top of her head on a wooden platform in between stair cases. Needless to say we lost our shit and went into panic mode, but by the time we got to the hospital she was smiling and being her silly self. She was fine but my husband felt like shit over it for a long time. \n", "controversiality": 0, "created_utc": 1359898044, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jvzd", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169066, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I fell done the stairs with my 3 month old. He hit the floor so fast, he bounced.  He cried because he was surprised, but went back to cooing again in less than a minute.  I was in pain, he clearly was not and I couldn't find any sign of a bump or bruise or red spot on him!  I called the doc and he said he sounds fine and yes, babies bounce when you drop them because they're made of rubber and pretty hard to break, ha.  I called my mom, a paramedic, and she said he sounds fine, looks fine, is acting fine, and she's not worried about him.  And, logically, I knew they were right, but he mother fucking BOUNCED.  ", "controversiality": 0, "created_utc": 1359898651, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jyb8", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169094, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359899039, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88jzwb", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169116, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Shadylane85", "author_flair_css_class": "maroon", "author_flair_text": "Mom to 3 boys", "body": "Holy crap, I can't even imagine... I have three boys, so we are nooo strangers to head injuries, but that gave me chills to think about.", "controversiality": 0, "created_utc": 1359900667, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88k76s", "link_id": "t3_17sfwe", "parent_id": "t1_c88fi0g", "retrieved_on": 1431169211, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dayna113", "author_flair_css_class": "green", "author_flair_text": "3 year old Godzilla", "body": "This almost EXACT scenario happened to me on my first day home from having a c-section. The only thing was I only slid like 2 stairs... my then 5 day old got his head bumped on the wall. I was damn near inconsolable for an hour about what a horrible mom I must be.\n\n He'll be three in April, and I promise he's just fine.", "controversiality": 0, "created_utc": 1359900805, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88k7vb", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169224, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MaeBeWeird", "author_flair_css_class": "purple", "author_flair_text": "10y, 7y, 2y, &amp; &lt;1y", "body": "When I was almost a year old, my brother put a tricycle on the front porch. I rode it down the cement stairs.\n\nHad a lovely scab on my chin in my first birthday pics but thats it.\n\nWhen my husband was like 4 years old he was running up bleachers and tripped. Smacked mouth first on the edge of one.\n\nKept all his teeth but bit his lip pretty hard. \n\nMy baby sister I dropped on her head as a 7 or 8 month old. On tile. (I was 10 years old)\n\nShes 20 now and her flaws are caused by her being the baby and treated as such for too long. Nothing from me dropping her.\n\nAll four of my children have fallen at some point or other. The only trips to the ER have been for my 7 year old and only once was it something worse than bruising (broke her collar bone)", "controversiality": 0, "created_utc": 1359900983, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88k8pz", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169231, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FranklyDEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "This just happened to me today. My husband has been teasing me about holding the baby all the time. I usually wait for him to get home to take a shower so that he can watch the baby but today, no today I said, \"no one is going to steal my baby. He wont smother himself in an empty crib, he loves his crib mobile, I am going for it. By golly I am going to take a shower!\" So I put him is his crib with the mobile on and took a shower. It was a good one too. Shave my pits and everything! I get out and I hear him screaming. I run down the hall in to his room and see that he has rolled over (new trick of his) and slid diagonally in to the corner of the crib on his tummy. One leg is sticking out between the slats that face out, and one arm is sticking out between the side slats. My heart nearly stopped I swear. I am so investing in one of [these](http://www.amazon.com/BreathableBaby-Breathable-Mesh-Crib-Liner/dp/B0013ABUQO/ref=sr_1_16?s=baby-products&amp;ie=UTF8&amp;qid=1359904424&amp;sr=1-16&amp;keywords=crib+bumper)today.", "controversiality": 0, "created_utc": 1359904556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ktum", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169510, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I did the same thing with my oldest when she was about eighteen months. I fell from the top of the stairs and slid all the way down on my tailbone. When I came to a stop at the bottom of the stairs I started to freak out a little trying to check if she was alright. She started laughing at me. Meanwhile I'm laying on the floor with a broken tailbone. \n\ntl;dr: it happens to all of us. ", "controversiality": 0, "created_utc": 1359905650, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l1kl", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169609, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "All three of my kids fell off my bed before they were 6 months old. All ok.", "controversiality": 0, "created_utc": 1359905935, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l3qo", "link_id": "t3_17sfwe", "parent_id": "t1_c88gput", "retrieved_on": 1431169640, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BehBehBehBehBeh", "author_flair_css_class": "purple", "author_flair_text": "5 year old son, 2 year old daughter", "body": "You are no where near a fuck up as a Mom!  The fact that you are traumatized by your fall shows that even more.  When my first born was 6 weeks, I tripped on the step going from our kitchen to family room.  We went down!!  Somehow I managed to land still holding him, like some kind of football move!!  I was crying so much!!!  I could not believe I almost dropped my little baby!!  I felt awful!  I'm glad you and you're lil one are OK!  Sorry to hear you have a bruised tail bone - OUCH!  You're a great Mom, keep up the good work!!!   :-)", "controversiality": 0, "created_utc": 1359906035, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l4h4", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169647, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Crimson_Serenity", "author_flair_css_class": "green", "author_flair_text": "Derek 05-28-12", "body": "When my son was first born, I fell down the stairs because I went from very pregnant to suddenly not pregnant. No harm came to him because I curled around him protectively, sliding down on my tailbone and back like you did. I was shaken up badly and bruised, but these things just happen.", "controversiality": 0, "created_utc": 1359906170, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l5hi", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169660, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "billygoatgrufff", "author_flair_css_class": null, "author_flair_text": null, "body": "My kids haven't started school yet and we've already experienced broken bones and stitches. My kids inherited my clumsiness. ", "controversiality": 0, "created_utc": 1359906308, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l6im", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169674, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "my daughter managed to throw herself off our ottoman and gave herself a bloody nose. it was one of those \"i only turned my back for a second!\" situations, and i honestly thought since she could sit up but not crawl that she would just stay put. she's had minor bumps before that i didn't worry about but when i saw the blood i was convinced i had broken her nose or given her a concussion or worse. some frantic googling calmed me down, though.", "controversiality": 0, "created_utc": 1359906416, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l7cd", "link_id": "t3_17sfwe", "parent_id": "t1_c88gzqj", "retrieved_on": 1431169687, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duelingsith", "author_flair_css_class": null, "author_flair_text": null, "body": "Considering the typo,  it could've been worse... :-P", "controversiality": 0, "created_utc": 1359906731, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88l9sd", "link_id": "t3_17sfwe", "parent_id": "t1_c88gxla", "retrieved_on": 1431169716, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "trixiebix", "author_flair_css_class": "purple", "author_flair_text": "Girl 5, boy 1", "body": "I fell with my baby, he was maybe 6 months, maybe less... I forget. But fell the same way, down 3 steps and baby hit his face on the step. Thought all was good then his nose started bleeding and he was crying. I felt so horrible!!! Took him to doc, and he was ok. \n", "controversiality": 0, "created_utc": 1359907953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ljf2", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169849, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359908102, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88lkmj", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431169859, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zifna", "author_flair_css_class": null, "author_flair_text": null, "body": "Hmm... Do you think that will help? I see it's one of the breathable ones, but I have heard of kids getting their heads (or, less alarmingly but still irritatingly, their limbs) trapped behind these.", "controversiality": 0, "created_utc": 1359909222, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88luln", "link_id": "t3_17sfwe", "parent_id": "t1_c88ktum", "retrieved_on": 1431169989, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359909985, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88m1o8", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170082, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "techno_for_answers", "author_flair_css_class": null, "author_flair_text": null, "body": "Numerous times my daughter has bumped her head, a few times I felt like it was entirely my fault, and other times it was my fault but still an accident. One time in particular we were in a hotel room and hanging on the bed. I put a tie in my hair and as I held my arms up it blocked my view and she lurched forward and hit herself quite well on the thin carpeted floor that had concrete underneath. I was guilty and mostly worried - concussion, trauma, we're at Disneyland and she's in misery! Nope. Totally fine, no issues. \n\nMy absolute worst parenting moment was on a drive home about a year ago. We live on the coast and between my hometown and apartment there is a beautiful place to pull over and view the ocean. She was asleep so I stepped one foot out of the car and took a photo of the moon on the water. I closed the door and stood next to the car, snapping pics. I got back in and realized that I hadn't put my car in PARK. Luckily the car didn't move at all and in hindsight I tell myself I would have realized it was initially when I had one foot in/out, but the picture of my car moving forward, over the small curb, on to railroad tracks, and then in to the water is a deeply hidden reminder of irresponsibility. I still beat myself up when I think about it, though I simultaneously remember that it has taught me to be more thorough. \n\nMy point is that stuff happens, stuff that people will blame you for or understand, stuff that you'll blame yourself for. Babies are durable and I'm certain yours is ok. \n\ntl;dr: You are not a fuck up and your babes is ok. :) Heal up!\n", "controversiality": 0, "created_utc": 1359910513, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88m6t5", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170149, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "techno_for_answers", "author_flair_css_class": null, "author_flair_text": null, "body": "You conveyed what I tried to do in my story of \"oops.\" Completely agree that the guilt turns in to a lesson learned! ", "controversiality": 0, "created_utc": 1359910700, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88m8oz", "link_id": "t3_17sfwe", "parent_id": "t1_c88hpjh", "retrieved_on": 1431170174, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FranklyDEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "I was hoping that if I placed it below the mattress a little bit it would prevent him from getting his limbs out of the crib. You don't think it will help? Why are they always trying to kill themselves!?", "controversiality": 0, "created_utc": 1359912397, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88mq05", "link_id": "t3_17sfwe", "parent_id": "t1_c88luln", "retrieved_on": 1431170466, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "love_my_lilly", "author_flair_css_class": null, "author_flair_text": null, "body": "That happened to my brother!  It was back in 1988, and my parents were goin boating, I was walking behind my mom And saw the whole thing. The handle came loose, and the car set flipped over And he fell face first on the cement sidewalk. He was sleeping, didn't cry or anything. My mom thought he was dead. Brought him to the hospitl, they slapped his bum, he woke up and was fine. Just a little road rash. He laughs about it to this day that he was dropped on his head.  ", "controversiality": 0, "created_utc": 1359912432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88mqd9", "link_id": "t3_17sfwe", "parent_id": "t1_c88fi0g", "retrieved_on": 1431170473, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "patchgrrl", "author_flair_css_class": null, "author_flair_text": null, "body": "This is so true!  After my sister in law cut my lo's finger along with his nail and my husband let him slump and bump his head on the wall, I feel so much more relaxed!  It probably doesn't help that my mom constantly finds horror stories to share.", "controversiality": 0, "created_utc": 1359912446, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88mqid", "link_id": "t3_17sfwe", "parent_id": "t1_c88jrss", "retrieved_on": 1431170474, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zifna", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;You don't think it will help?\n\nNo idea, I've never used them. I've just heard a lot of advice against them. =(", "controversiality": 0, "created_utc": 1359912652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88msnf", "link_id": "t3_17sfwe", "parent_id": "t1_c88mq05", "retrieved_on": 1431170501, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dinosaurjones", "author_flair_css_class": null, "author_flair_text": null, "body": "When I first brought my son home from the hospital, the first time I gave him a bath by myself I set him down wrapped in a towel on a pillow on the floor. I turned around to grab a washcloth or something and when I came back around I stepped right on his little newborn foot. I felt so bad, accidently hurting him so early in his life. He's almost 3 now and his foot is just fine. ", "controversiality": 0, "created_utc": 1359912721, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88mtep", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170511, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smapple", "author_flair_css_class": "lightcoral", "author_flair_text": "1 Girl 12/27/12", "body": "I was feeding my little one and realized her head was tilted forward a bit too much and she stopped eating. I adjusted my arm so that she was in a better spot and the bottle with it. This shot a bunch of milk down her throat and she spit the bottle/milk out while chocking. I recovered her and she's just fine, but you're not alone in the clumsiness. we'll learn :)", "controversiality": 0, "created_utc": 1359912887, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88mva1", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170535, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "patchgrrl", "author_flair_css_class": null, "author_flair_text": null, "body": "My friend's eight month old was in the hospital for RSV and the crib malfunctioned.  She face planted on the hard ass hospital floor.  Perfectly fine (mamma, not so much).", "controversiality": 0, "created_utc": 1359913225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88myzq", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170585, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jsosmart", "author_flair_css_class": "lightcoral", "author_flair_text": "09/14/2011 Girl", "body": "me and my husband were standing in front of the couch where she was sitting and she still managed to do a front flip onto the floor with both of us right there! she landed on her back, i think she was more shocked than anything and so were we. i cried and she didn't.", "controversiality": 0, "created_utc": 1359913896, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88n6c1", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170682, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359914114, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88n8r8", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170717, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ForLoveOfHumanKind", "author_flair_css_class": null, "author_flair_text": null, "body": "When my oldest was only a few months old I went flying face first off a flight of stairs (still don't know how exactly I went air born) I somehow managed to wrap myself around her and land on my elbows and knees, she was unhurt and I ended up with some pretty nasty fractures. She is now 22 (tomorrow) and of course does not remember a thing about it. But she does remember her dad tossing her up in the air to play and bashing her head on the ceiling that he forgot did a dip in between rooms, and her uncle doing the same but into a ceiling fan! - men lol", "controversiality": 0, "created_utc": 1359914115, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88n8ru", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170717, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "Geez, last year I hit my daughter's head on the door frame *in the pediatrician's office* while we were there for her checkup.  You should have seen the looks I got from the nurses.", "controversiality": 0, "created_utc": 1359914384, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88nbsk", "link_id": "t3_17sfwe", "parent_id": "t1_c88gon9", "retrieved_on": 1431170759, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "oh_the_humidity", "author_flair_css_class": null, "author_flair_text": null, "body": "When my daughter was about 1 1/2, during the winter, we visited our local river to feed some ducks. I parked her, strapped into her stroller, at the top of a concrete slipway. I didn't put the brakes on (STUPID!!!) I turned and walked about five steps to a nearby trashcan to throw out a bread bag, and turned back to see the stroller heading down the slipway.\n\nI ran to catch it but I just didn't make it. The stroller entered the water--of a deep river on a cold day in the middle of winter, mind--and flipped forward after hitting some debris at the bottom of the slipway. At this point she was completely submerged in the water, strapped to the stroller. I jumped in, thinking, \"oh my god she must be dead.\" I pulled the stroller back upright and there she was, soaked and screaming (at that point I was so happy to hear that scream!) I unhooked her and wrapped her in my coat, as passerbys rescued my diaper bag and the stroller. We luckily lived just across the road where she got a warm bath immediately.\n\nI was a fool for not putting the brakes on the stroller; water and children are serious business. I guess I didn't think the incline was so bad but it was definitely too fast for me. I am just thankful that she was strapped in the stroller (half the time she usually isn't), or she would have been flung into the debris and I may not have been able to recover her quickly.", "controversiality": 0, "created_utc": 1359915894, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88nsp2", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431170978, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Oh god! That's so scary, but I'm so glad you two are fine! Yeah, I posted last week about my almost 6 month old [falling off the bed](http://www.reddit.com/r/Mommit/comments/17g7qn/my_baby_fell_off_the_bed_last_night/)! I was shaking all night and it was not nearly as horrifying as falling down the stairs! I know that feel! You shouldn't feel ashamed, it could have happened to any of us!", "controversiality": 0, "created_utc": 1359917397, "distinguished": null, "downs": 0, "edited": 1359917952, "gilded": 0, "id": "c88o9i1", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431171193, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Also, I want to share a story when *I* was a baby to make you feel better. I was *under a year old*, and I was in a walker in the kitchen of our old house while my mom was in there on the phone. The back door to the kitchen had a flimsy screen door, and a couple concrete steps into the driveway. Whelp, while my mom wasn't looking, I scooted myself in the walker into the flimsy door, it flung open, and I toppled (IN the walker!) down the concrete steps and landed head first WITH THE WALKER ON TOP OF ME. I was fine, but man, that could have ended badly. I always joke that I was dropped on my head as a baby and that's why I'm so weird. Haha.", "controversiality": 0, "created_utc": 1359917895, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88of1x", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431171267, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Timey_Wimey", "author_flair_css_class": null, "author_flair_text": null, "body": "In my area last week a father forgot to drop his one-year-old off at daycare. Kid stayed in the car for *8 hours* until the dad left work and saw him in the car. Despite the freezing weather, somehow the kid was totally fine, thank god. Terrifying, but you could totally see how it could happen. ", "controversiality": 0, "created_utc": 1359917919, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ofbv", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431171270, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Haha, it's always like, \"WHOOPS\". Mine never cries, she just gives me a look like, \"YOU'RE STUPID\".", "controversiality": 0, "created_utc": 1359918168, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88oi5b", "link_id": "t3_17sfwe", "parent_id": "t1_c88gon9", "retrieved_on": 1431171307, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "I feel better about myself.", "controversiality": 0, "created_utc": 1359918219, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88oiq0", "link_id": "t3_17sfwe", "parent_id": "t1_c88l3qo", "retrieved_on": 1431171314, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Hahaha, miggers. Sounds like a bad word, but it isn't.", "controversiality": 0, "created_utc": 1359918327, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ojx6", "link_id": "t3_17sfwe", "parent_id": "t1_c88gxla", "retrieved_on": 1431171330, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "I clipped my girl's finger too once. I was like, \"Why are you screaming?! Oh. Shit. Honey, where's the Neosporin?!\" \"Why?\" \"JUST GET IT.\" :P Having children is funny sometimes.", "controversiality": 0, "created_utc": 1359918663, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88onom", "link_id": "t3_17sfwe", "parent_id": "t1_c88hlyr", "retrieved_on": 1431171379, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "Oh man, I know that feeling. Just sitting there thinking of *all the things that could have happened*. But, they didn't. But no one can tell *you* that when that shit happens right?! Haha.", "controversiality": 0, "created_utc": 1359918859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88opw7", "link_id": "t3_17sfwe", "parent_id": "t1_c88hpjh", "retrieved_on": 1431171408, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "talk2thebreast", "author_flair_css_class": null, "author_flair_text": null, "body": "Welcome to Mommit subreddit!  I've been lurking here for 6 mos and I really love the 'no judgement' feel of the posts. Thanks for your kind words, feeling better mentally and physically today.  Smiling happy baby doesn't even have a bump from the fall, I can't even sit for 5 minutes without my tailbone hurting, go figure.", "controversiality": 0, "created_utc": 1359920456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88p7ld", "link_id": "t3_17sfwe", "parent_id": "t1_c88hm73", "retrieved_on": 1431171641, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1359921206, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88pfqo", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431171746, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "It's okay, it happens. Little once bounce - they don't seem to get as hurt as we do. Once, my son came running into the kitchen just as I was walking out of it...he bounced off my leg and literally flew backwards onto the floor, flat on his back. He was fine. I felt like a horrible person though! Another time, my baby girl climbed all the way to the top of the stairs - this was before we had a safety gate at the bottom, and before I even knew she *could* climb stairs, as she'd never done so before - and then fell all the way back down. I heard her falling and got to the stairs in time to watch her land, face down, at the bottom. She screamed and cried, I almost did too...but again, she was fine. She didn't even have any bruises, just a red patch on her forehead. She seemed to be more afraid than in pain. Still, I felt truly awful about it, and we bought and installed a baby gate the very next afternoon. All this to say - accidents happen to pretty much all of us, and while they make us feel like crappy parents it doesn't mean that we really are.", "controversiality": 0, "created_utc": 1359922525, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88pu3r", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431171934, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "adalab", "author_flair_css_class": null, "author_flair_text": null, "body": "Take as much care if baby's mom as you take care of baby!!!  Don't lose yourself!", "controversiality": 0, "created_utc": 1359923235, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88q1wb", "link_id": "t3_17sfwe", "parent_id": "t1_c88p7ld", "retrieved_on": 1431172036, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "timeforstars", "author_flair_css_class": null, "author_flair_text": null, "body": "We weren't in the car, it was to carry her from the kitchen to the stroller at the front door. ", "controversiality": 0, "created_utc": 1359924269, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88qd6s", "link_id": "t3_17sfwe", "parent_id": "t1_c88hibq", "retrieved_on": 1431172184, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "italiancornbread", "author_flair_css_class": null, "author_flair_text": null, "body": "My LO fell down the stairs once. She was about 8-9 mos old. I turned my back for 3 seconds and she somehow managed to take out the baby gate and crawl down the stairs.\n\nShe ended up barrel rolling down and landing in the crawling position. She didn't hit her head once though, thank god. I cried more than she did. I wouldn't let her leave my sight for a long time after that. \n\nShe was fine.", "controversiality": 0, "created_utc": 1359926311, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88qzkn", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431172476, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "katyshel", "author_flair_css_class": "purple", "author_flair_text": "3 girls", "body": "Horror stories about babies are the worst - especially if someone is telling them to new parents. At this point I just smile and move on from the conversation but when our girls were first born they wound haunt me. ", "controversiality": 0, "created_utc": 1359928063, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88ri1s", "link_id": "t3_17sfwe", "parent_id": "t1_c88mqid", "retrieved_on": 1431172720, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "For me it was the shower railing. Oh the shame.", "controversiality": 0, "created_utc": 1359933461, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88t0ao", "link_id": "t3_17sfwe", "parent_id": "t1_c88gon9", "retrieved_on": 1431174370, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tif23", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel like it's a rite of passage. You have to have that \"OMG I BROKE THE BABY\" moment so that you can put all future parental fuck ups into perspective.", "controversiality": 0, "created_utc": 1359935603, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88tko6", "link_id": "t3_17sfwe", "parent_id": "t1_c88l3qo", "retrieved_on": 1431174700, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "patchgrrl", "author_flair_css_class": null, "author_flair_text": null, "body": "I know that haunted feeling for sure. ", "controversiality": 0, "created_utc": 1359943499, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88vupo", "link_id": "t3_17sfwe", "parent_id": "t1_c88ri1s", "retrieved_on": 1431175773, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "atemporalsquid", "author_flair_css_class": null, "author_flair_text": null, "body": "It is insane that you have been downvoted. You are absolutely correct. If the car seat is getting moved or if you have to turn your back on it baby needs to be strapped in or you need to pick up the baby.", "controversiality": 0, "created_utc": 1359947806, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88x3yl", "link_id": "t3_17sfwe", "parent_id": "t1_c88hibq", "retrieved_on": 1431176366, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "atemporalsquid", "author_flair_css_class": null, "author_flair_text": null, "body": "Tailbone injuries suck so bad, hope you feel better soon. It might help to get a donut pillow to sit on.", "controversiality": 0, "created_utc": 1359947893, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88x4uz", "link_id": "t3_17sfwe", "parent_id": "t1_c88p7ld", "retrieved_on": 1431176376, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MSschifino", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I also thought that it was pretty crazy that so many people disagreed with me. This post was about keeping our babies safe. It wasn't about putting down anyone. I have personally seen (not my daughter) a baby injured because they were in a car seat without being buckled in. They weren't in a car, but on the couch.  ", "controversiality": 0, "created_utc": 1359949824, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c88xofg", "link_id": "t3_17sfwe", "parent_id": "t1_c88x3yl", "retrieved_on": 1431176635, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smarty_skirts", "author_flair_css_class": "green", "author_flair_text": "Twin Boys born 4/2012", "body": "I was giving my 5 month old (or so) a bath in his little tub. He was in a seated position and I leaned him over my arm so I could clean his back... and didn't realize his face was in the water... Until I leaned him back and he had soap suds all over his laughing face... SHAKING for days over that one.", "controversiality": 0, "created_utc": 1359997770, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c896olr", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431180946, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sweetright", "author_flair_css_class": "lightcoral", "author_flair_text": "Madison 11.3.2012", "body": "I probably would have found a new doctor our of embarassment lol.", "controversiality": 0, "created_utc": 1360005794, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8999fc", "link_id": "t3_17sfwe", "parent_id": "t1_c88nbsk", "retrieved_on": 1431182224, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "talk2thebreast", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you, I'll try and keep that in mind.", "controversiality": 0, "created_utc": 1360022611, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c89f0cq", "link_id": "t3_17sfwe", "parent_id": "t1_c88q1wb", "retrieved_on": 1431189097, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "talk2thebreast", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, well reading all of the great replys below, I'm starting to wonder if they are part bouncy-ball, lol.  Thanks everyone, don't mean to laugh at you and your little one's expense, but it's helped me going thru the posts to get over the guilt of it.  My tailbone feels much better today, sure I'll be fine in a wks time.  ", "controversiality": 0, "created_utc": 1360022984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c89f4e7", "link_id": "t3_17sfwe", "parent_id": "t1_c88guyq", "retrieved_on": 1431189235, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LilBeansMom", "author_flair_css_class": null, "author_flair_text": null, "body": "Our daycare does ours because I refuse to us clippers and sometimes don't use the emery board often enough. They're very nice about understanding how it freaks me out. ", "controversiality": 0, "created_utc": 1360100965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c89ymlg", "link_id": "t3_17sfwe", "parent_id": "t1_c88jtza", "retrieved_on": 1431202307, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I tripped up the curb going into the grocery store... both when I was 29 weeks pregnant and when I was holding my son when he was about 5 months old. Both times I badly bruised my elbows and knees to decrease the impact of the fall.\n\nYou went to the hospital? Then you're doing great!", "controversiality": 0, "created_utc": 1360182346, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8aj15c", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431212044, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "The *entire* time I was pregant I said to myself, \"I will never raise my baby above my head or toss him in the air.\"  Fast forward: he's seven months, we're having a good time dancing to some music and...I lifted him up into the air and RIGHT into the ceiling fan.  It felt like the blades completely hit my arm and just barely grazed his head after the motor jammed, but he screamed and I was **terrified**.  My blood ran cold and I went into some sort of super-calm-but-actually-freaking-the-fuck-out-in-my-head mode.  Dialed 911.  \n\nThe ambulance and paramedics showed up and I was wide-eyed and ashamed and terrified I'd permanently damaged my darling baby, and started to cry once I saw them.  Turns out he was fine, just scared.  The paramedics said I was so pale they thought I'd faint, so they stuck around until I got some colour back.\n\nStill not sure if I'll ever tell him (he's three and a year ahead in his learning/speech, so maybe it was a 'good' knock...errr...).  My worst and most shameful parent memory to date.", "controversiality": 0, "created_utc": 1360260345, "distinguished": null, "downs": 0, "edited": 1360994231, "gilded": 0, "id": "c8b2mex", "link_id": "t3_17sfwe", "parent_id": "t1_c88n8ru", "retrieved_on": 1431221422, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jctims1519", "author_flair_css_class": "green", "author_flair_text": "2 Boys  &amp; Cooking Baby #3", "body": "YUP! Nearly identical thing happened to me.. I was walking down the stairs with my baby in tow and I slipped on a stair and fell backwards onto my back and my sons head banged a wooden edge on the railing, no blood but a nice indentation.. we went to urgent care and all was fine just watched for signs of a concussion. I was terrified though!!", "controversiality": 0, "created_utc": 1360291144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8bcwjo", "link_id": "t3_17sfwe", "parent_id": "t3_17sfwe", "retrieved_on": 1431226371, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}