{"submission": {"author": "barbedwire_blowjob", "author_created_utc": 1352524676, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9k6ni", "created_utc": 1363627371, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1aj8tk/i_cant_get_the_housework_done_advice/", "gilded": 0, "id": "1aj8tk", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 137, "over_18": false, "permalink": "/r/Mommit/comments/1aj8tk/i_cant_get_the_housework_done_advice/", "retrieved_on": 1412968905, "score": 30, "secure_media_embed": {}, "selftext": "My husband comes home bitching about the house being a wreck (piles of clean laundry, dishes piled in the sink, etc.). Honestly the mess makes me feel really shitty too and the kids don't need to live in it either. \n\nI try to pick up and clean while my two year old is at school, but I still have a six month old at home. Between giving him naps, playing with him, nursing him, and carrying him around (sometimes I wear him but he'll only have that for about ten minutes) I only get about thirty minutes of housework done a day. \n\nI feel pathetic for only having one child home most of the daytime and not being able to finish what people with four kids can accomplish in a day. \n\nI've tried chore apps but that didn't last. My husband helps a lot but everything is still so far behind. After the the kids go to sleep I can't get much done because louder chores will wake them up. Surely there is a way to get it all done, or at least a reasonable amount? ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I can't get the housework done. Advice? ", "url": "http://www.reddit.com/r/Mommit/comments/1aj8tk/i_cant_get_the_housework_done_advice/", "user_reports": []}, "comments": [{"archived": true, "author": "mammasnell", "author_flair_css_class": null, "author_flair_text": null, "body": "I understand where yiur coming from im in the same boat i dont know how people do it. I have a three year old and nine month old bolth home full time it is near impossible for me to get anything done during the day between the two I usually wait till they go to bed I clean the kitchen do dishes then chill out in  bed watch Netflix while folding laundry I call it working while relaxing lol", "controversiality": 0, "created_utc": 1363627747, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xw9qu", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431624676, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't clean the kitchen while they're sleeping because it wakes them up, and while I watch my nighttime TV is when I fit my exercise in then finally take a break! Damn, I guess I'll have to start taking breaks like you- multitasking.  ", "controversiality": 0, "created_utc": 1363628017, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xwd1h", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xw9qu", "removal_reason": null, "retrieved_on": 1431624692, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "andilynscott", "author_flair_css_class": "green", "author_flair_text": "Mom to 2 with 1 in the Oven", "body": "I know it's not much help now but I am blogging about my journey to become more organized over at thedistractedhousewife.com.  I have developed some housekeeping routines for myself and finished an entire month of decluttering 20 items a day. I am hoping that one day I will be able to help distracted and disorganized mothers and people like me by showing them my journey to organization. ", "controversiality": 0, "created_utc": 1363629129, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xwqwy", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1435565443, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you tried white noise machines for the kids?  After they go to sleep it will mask the noise of other stuff going on in the house.  It might be worthwhile?\n\nAs for everything else - I feel your pain. I only have one, but between work and taking care of him (and all the night wakings... I am so zonked!) the house definitely suffers.  When I was home on maternity leave, it wasn't any better because I felt like I couldn't put him down for more than two minutes at any given time.  \n\nOne thing I've tried to do that at least saves my sanity is make a rule about the One or Two things that must be done every day.  For me, the big thing is the empty sink.  I'm not perfect but I try and have about an 80% success rate of having the sink empty before bed every night.  And I do some odds and ends upstairs while preparing kiddo's bath while dad has a little after-work bonding time.  \n\nAnd not going to lie, the occasional \"mental health\" day where kid goes to daycare REALLY helps.  It's amazing how much you can get done, and how quickly, with no baby underfoot.  Do you have a friend or relative who could give you a few hours once a week or so just to catch up on laundry, etc?\n\n", "controversiality": 0, "created_utc": 1363630088, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xx2wx", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xwd1h", "removal_reason": null, "retrieved_on": 1431625003, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dinosaur_train", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel you. My three year old wrecks the house. I have to clean it 3 times a day and often that's not enough. \n\n1. Can you afford a maid? It's worth it if you can, if not, that's understandable. \n\n2. Organization. 30 minutes to clean is ok if you have an organization structure that backs it. If you have a super organizer in the family, have them come over and help work out a system. If you don't, it's worth hiring a professional organizer for a one time visit. An organizer can and will put in place a system that will work for your limited cleaning time. Once you find the right system you'll be in a better place all around. It's like dieting, atkins may work or fail, but if it fails that's no reason not to try calorie counting, ya dig? The app failed, but that doesn't mean there isn't a workable system, just keep trying to find it.", "controversiality": 0, "created_utc": 1363630630, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xx9ri", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625109, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "amandanob", "author_flair_css_class": null, "author_flair_text": null, "body": "I know you said you've tried chore apps, but I have one for you to try. I am so easily distracted,I have ADD but I'm not medicated for it as an adult. I have never been able to keep my house clean, never. My room was a mess as a child because I couldn't figure out where to even start. I downloaded Motivated Moms. It has a few tasks that are daily tasks, and adds a couple of things a day like clean out the bottom shelf of the refrigerator. It breaks it down into a few easy to accomplish tasks, and throughout the course of a few days you realize your house is clean! It reminds you of things that normal people do that I never think of, like wipe down the cabinets, or even dust. I love it, hope it helps!", "controversiality": 0, "created_utc": 1363630740, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxb73", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625120, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ValarDohaeris", "author_flair_css_class": "brown", "author_flair_text": "Dashiell's mom, 8/14/2012", "body": "In our house, I'm the working mom and my husband is the SAHD. He's in the reserves, so he only works one weekend a month. We have lists of tasks to divide up the labor. Yes, I work, but I also stayed at home for a few months and I know how impossible it can feel to get anything done with a needy baby. So we both clean.\n\nNaptime is key cleaning time. You can't sit down for a breather - as soon as baby is down for nap, you need to buzz around and get as much done as quickly as possible. Load the dishwasher. Set the clean laundry where you're going to sort it. Flip the laundry. Pick up the baby's toys. Clean the high chair. I'm sure there's something you can do in the kitchen to be quieter about whatever business you need to do in there.\n\nOther times, designate cleaning days. Weekend or weekday, one day a week where you and your husband BOTH work to get as much cleaned as possible.\n\nEveryday, make effective trips. If you need to go into the kitchen, take clutter from the coffee table with you. Throw away trash. If you go to the bathroom and see something on the counter or in the shower that you can fix, fix it on the spot. \n\nIf your baby only allows for 10 minutes in a carrier, make that 10 minutes of vacuuming. Maximize your time, and get the most out of your current routine so it doesn't overwhelm you. ", "controversiality": 0, "created_utc": 1363630945, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxdoa", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625160, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Baby only naps if I lay with him so that's out. \nWe've had a schedule in place several times but my husband doesn't see the importance. He just does what he wants when he wants. \n\nBut yes, I do try to get little things done on the spot. Like, don't set down whatever is in your hands unless you're setting it down where it goes. That reduces a lot of mess. That's another thing the husband won't get on board with, though. He leaves shit everywhere and refuses to shoot clean, saying we'll do the whole house later. ", "controversiality": 1, "created_utc": 1363631538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxl9d", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxdoa", "removal_reason": null, "retrieved_on": 1431625240, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "That should say \"spot clean\", not \"shoot clean\". Mobile isn't letting me edit. ", "controversiality": 0, "created_utc": 1363631643, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxmls", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxl9d", "removal_reason": null, "retrieved_on": 1431625267, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brenders", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know why you are being down voted. Any system that works is a system that works. ", "controversiality": 0, "created_utc": 1363631648, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxmnq", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xwqwy", "removal_reason": null, "retrieved_on": 1431625272, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Punkergirl14", "author_flair_css_class": null, "author_flair_text": null, "body": "I am in exactly the same boat.  Being a SAHM is hardcore!  I struggled on for the first 2 years or so, but I just couldn't get my shit together, I'm just not that type of person.  Now we have a cleaner come in for 2 hours a week and it has changed my life!  I get to go out with my boy and spend quality time with him instead of telling him I'm too busy ironing/washing up/doing laundry to play with him.  \n\nI still have to keep on top of things, especially the laundry, but it has made such a difference.  I feel less guilty because I'm able to play with my son, cook dinner, run errands, etc and know that if I don't manage to clean the toilets or sweep the floors it will at least be done once a week.  \n\nI was embarrassed to begin with but my husband said that if we can afford it and it makes everyone's life easier then we should do it while we can. BUT, if a cleaner really isn't an option, get a chalkboard/whiteboard and put it up somewhere you will see it every day and write a list of chores on there.  Each time you do something cross it off (don't wipe it away, so you can keep track of how much you've done).  I did this before the cleaner and it was really motivating when I could see that I'd actually done some things that day, even if it was only a few little bits. ", "controversiality": 0, "created_utc": 1363631781, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxof9", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625292, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "samazon27", "author_flair_css_class": null, "author_flair_text": null, "body": "When I need to clean the kitchen I'll put my son in his space saver high chair, turn on music, give him toys, and sometimes give him little Gerber cereal puffs (he's 8 months) and it usually keeps him pretty entertained so I can do dishes, clean counters, sweep the floor, etc.  I watch another 8 month old Tues-Friday and while my son is really patient, the little girl gets bored much faster.  I just try and distract her with toys, etc, and I can usually get through everything without a meltdown.  Maybe doing something like that will help you tackle the kitchen during the day.  Good luck, mama!  It's hard work so don't feel bad.  You're already doing the most important job out there, raising your children, so keep that in mind and try not to stress too much!", "controversiality": 0, "created_utc": 1363631875, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxpmz", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625307, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brenders", "author_flair_css_class": null, "author_flair_text": null, "body": "Simple solution - he can help out instead of bitching. My husband works all day but when he comes home he helps with dishes (my least favourite chore) or entertains the kids while I get stuff done. My house does not sparkle, but We are ok with that (until they are both in school at least!)", "controversiality": 0, "created_utc": 1363631891, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxpue", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625312, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I actually just deleted a similar app. It broke things down in to daily, weekly, every two weeks, and once a month. It helped me think of things that you're saying like cleaning the blinds. I have the problem too of looking at a mess and not even knowing where to start. \n\nThis is going to sound silly, but here's the thing- I deleted it because when I completed certain tasks that I had only set for Sundays, it was setting them for a month from that day- not another Sunday. Plus if I missed a task it turned red, so I was ending up crossing off stuff I didn't do just so it wasn't red. I told you it was stupid. Ugh. I guess I could rearrange the way it was laid out. I think I should download it again and stop being so picky and obsessive over stupid things. ", "controversiality": 0, "created_utc": 1363632091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxsff", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxb73", "removal_reason": null, "retrieved_on": 1431625353, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "We could afford a maid once a.week, but mom guilt. I feel like I would be a shitty mom/housewife for staying home all day and still hiring help. Is that silly? ", "controversiality": 0, "created_utc": 1363632212, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxu1j", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xx9ri", "removal_reason": null, "retrieved_on": 1431625380, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whoisearth", "author_flair_css_class": "blue", "author_flair_text": "Father of 3, 4 and under!", "body": "Learn to live with the mess?\n\nMy wife is home with twins (5 months) and we have an almost 3 year old.  We get jack shit done at home anymore aside from the essentials.\n\nWe have a cleaning lady once a month to bring us back to a baseline of clean.", "controversiality": 0, "created_utc": 1363632281, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxuxb", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625388, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you're right about setting s couple of everyday things again like I used to. Looking back, I was pretty good for a while about making sure the two or three important things got finished most days. Thanks! \n\nI'm just not ready to leave the baby yet. Maybe in a few months when I'm comfortable leaving him for an hour or two that will help. I have a friend who will take him out and play for a little while. ", "controversiality": 0, "created_utc": 1363632403, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxwkj", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xx2wx", "removal_reason": null, "retrieved_on": 1431625407, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dinosaur_train", "author_flair_css_class": null, "author_flair_text": null, "body": "I wouldn't call you silly. There is just something about being a mom that makes you feel like you have to do it all, I understand. \n\nBut, practicality has to trump emotion on some things. Practically speaking, if you can get the help in, then it's worth a try at least once.", "controversiality": 0, "created_utc": 1363632451, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxx5p", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxu1j", "removal_reason": null, "retrieved_on": 1431625417, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sbzitz", "author_flair_css_class": null, "author_flair_text": null, "body": "No. Hire a maid, enjoy it. You mentioned wearing the baby, what are you wearing him/her in? A wrap? An Ergo?", "controversiality": 0, "created_utc": 1363632474, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxxgn", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxu1j", "removal_reason": null, "retrieved_on": 1431625430, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Dude, I've tried. I don't need sparkly but I get overwhelmed by stupid stuff. Lol. My two year old has sensory processing disorder and the visual stimuli of clutter sends her into fits. Maybe I'll work mostly on her areas and lower my standards for everything else. ", "controversiality": 0, "created_utc": 1363632660, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xxzub", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxuxb", "removal_reason": null, "retrieved_on": 1431625459, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "stendra", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there anyone you can invite over? \n\nI have an 8 month old and he is the same. He needs my attention constantly. I put him down and he doesn't cry, but as soon as he sees me walking away, he goes ape shit! \n\nSo what i usually do is have him dropped off at my moms for a bit while i get everything done, or if not just have his aunt come over and she usually watches him while i do the necessary.\n\nMaybe you can call and ask someone to help? You'll feel a lot better.(:\n", "controversiality": 0, "created_utc": 1363632683, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy061", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625462, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "He'll do that for about ten minutes. But hey, ten minutes three times a day should give me a little while at least. ", "controversiality": 0, "created_utc": 1363632715, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy0l7", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxpmz", "removal_reason": null, "retrieved_on": 1431625466, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I think this is a great answer. I'm always struggling to find a place between the guilt- feel guilty about being too busy to play, or feel guilty about hiring help. Thank you. ", "controversiality": 0, "created_utc": 1363632978, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy3zv", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxof9", "removal_reason": null, "retrieved_on": 1431625505, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Actually yeah, that would work. Thanks for the support! ", "controversiality": 0, "created_utc": 1363633042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy4sy", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xy061", "removal_reason": null, "retrieved_on": 1431625513, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Mei tei (sp?). He just learned to crawl so he wants to get down! ", "controversiality": 0, "created_utc": 1363633158, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy6at", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxxgn", "removal_reason": null, "retrieved_on": 1431625525, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "amandanob", "author_flair_css_class": null, "author_flair_text": null, "body": "This one doesn't turn red when you miss things, that would just annoy me. It gives you a new list every day. If you miss something it will just give it to you another day. You can also add your own tasks, and set when and how often you want to do them. I don't know if it will help you, but I wanted to share because it has done me a world of good!", "controversiality": 0, "created_utc": 1363633329, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy8jw", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625542, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "amandanob", "author_flair_css_class": null, "author_flair_text": null, "body": "You can also hide tasks that don't apply to your household.", "controversiality": 0, "created_utc": 1363633432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xy9x7", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxsff", "removal_reason": null, "retrieved_on": 1431625553, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ValarDohaeris", "author_flair_css_class": "brown", "author_flair_text": "Dashiell's mom, 8/14/2012", "body": "Sounds like it's time for some sleep training for baby and sticking to schedules for you &amp; your husband. If you and your husband can't communicate about this, that's a serious problem you need to address, maybe through counseling. He's upset that housework isn't getting done, while not contributing the way that you want. You need to define your roles and work together. \n\nThe way things are clearly isn't working, so some things need to change. ", "controversiality": 1, "created_utc": 1363633534, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xyb7u", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxl9d", "removal_reason": null, "retrieved_on": 1431625568, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dementedpixie", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with the sleep training. I work part time and have a six month old, and I'm still able to do housework with her, both when she's awake and asleep.  \n\nOP, have you tried just putting baby in a playpen with some toys while you work?  My girl is at the point where she wants to be in the same room with me while she's awake, but doesn't need to be held 24/7.  Laundry gets folded in the living room while she hangs out with toys in the pen or on the floor.  Kitchen chores, she gets put in her walker so she can scoot around the room.  I put one of the kitchen mats under the wheels and stop her at the bathroom door while I'm cleaning there, so she can see me.  \n\nBasically, let him occupy himself a bit in a safe area while you get things done.", "controversiality": 1, "created_utc": 1363634984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xyu2q", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xyb7u", "removal_reason": null, "retrieved_on": 1431625827, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sbzitz", "author_flair_css_class": null, "author_flair_text": null, "body": "Mei Tei is a good carrier, have you tried back carrying him so he can see? Maybe you can sway with him on your back while you do dishes?", "controversiality": 0, "created_utc": 1363635295, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xyy8k", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xy6at", "removal_reason": null, "retrieved_on": 1431625880, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1363635372, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xyz9n", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431625891, "score": 34, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mammasnell", "author_flair_css_class": null, "author_flair_text": null, "body": "My kids sleep through anything but that's probably becouse I always vacuumed and did dishes while they slept lol", "controversiality": 0, "created_utc": 1363635430, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xz000", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xwd1h", "removal_reason": null, "retrieved_on": 1431625904, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kindalaureny", "author_flair_css_class": null, "author_flair_text": null, "body": "It could also help to have a friend come over to watch the baby while you do some things. For me, it gets me moving when I have someone else in the house with me, instead of being alone with the baby all day and having to make an effort to start getting things done.\n\nHaving a deadline also helps. But I doubt you'd want to clean like a madwoman before Pesach like I am, trying to get everything clean before the weekend.", "controversiality": 0, "created_utc": 1363635430, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xz008", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxwkj", "removal_reason": null, "retrieved_on": 1431625904, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Or even if you had someone come over to play with the baby for a few hours - you'd be right there but have your hands free. I know a few people who did this with local young babysitters - gave the babysitter a little experience, helped mom, but wasn't leaving them totally on their own with an infant either.  Might be worth a few bucks :)", "controversiality": 0, "created_utc": 1363636131, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xz90p", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxwkj", "removal_reason": null, "retrieved_on": 1431626011, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "drunken_trophy_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "I've got a friend who manages to get it all done. She has three kids, works full time, and always has a spotless house. She doesn't sleep and she's always on the verge of some kind of breakdown. She makes terrible company!   \n\nDon't worry about it too much; your own health is more important than the housework. Do what you can, and don't beat yourself up for what you can't get to.", "controversiality": 0, "created_utc": 1363636163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xz9gn", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431626017, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Cayterri", "author_flair_css_class": "lightcoral", "author_flair_text": "4yo girl, 20 mo boy", "body": "I like \"shoot clean\" better, anyway. I just can't imagine anyone refusing to do it. :)", "controversiality": 0, "created_utc": 1363636166, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xz9if", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxmls", "removal_reason": null, "retrieved_on": 1431626017, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh man, I hear you! It sucks so bad, you feel bad because you \"should\" be able to do it because you're \"home all day\". I struggle with this a lot. It will get better as the youngest gets older. I have a 4yo and an almost 2 yo. There's always a mess somewhere! Look up the Fly Lady. She has 15 minute tasks every day, and you'll be surprised how that little amount every day gets things done. It's helped me a lot! ", "controversiality": 0, "created_utc": 1363636473, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8xzdil", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431626152, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I guess I'm really lucky to have a husband who helps out.  We both work from home, he works full time and I work part time, so cleaning and childcare is largely my responsibility.  But, we have certain assigned jobs, like he does bathrooms and dishes, I cook, shop, vacuum and dust, and do laundry.  Childcare takes a ridiculous amount of time.  I calculated the other day that I spend at least 3 hours a day cooking, eating, and feeding my son.  It was easier when he was containable, but now he's 2, and you kind of have to do whatever you can whenever he's within sight of something you can do! I feel like it gets worse (going from babies to toddlers) before it gets better.", "controversiality": 0, "created_utc": 1363638391, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y03eh", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxpue", "removal_reason": null, "retrieved_on": 1431626511, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the app tip.  I've been trying to figure out a way to remind myself what needs to be done.  For instance, the house hasn't been fully vacuumed in several months (to be fair, it used to be my husband's duty; we just switched) and I'm hoping I can do a through vacuum of each story once every two weeks, so at least the whole house gets vacuumed once a month.  An app might hold me to that.", "controversiality": 0, "created_utc": 1363638550, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y05ks", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxb73", "removal_reason": null, "retrieved_on": 1431626552, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "This is exactly what I was going to suggest. Contact your local Girl Scouts or Red Cross--they usually have babysitting courses and I'm sure those girls would love getting a little practical experience under your supervision. Also, you'll score a few babysitters for when you're ready to step out a bit, and you'll already know which ones you and your kids like. ", "controversiality": 0, "created_utc": 1363638713, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y07so", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xz90p", "removal_reason": null, "retrieved_on": 1431626584, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "[FLY Lady](www.flylady.net) is your friend!  Seriously, 15 minutes at a time and you can get SO much done.  Whenever I sent my timer I usually finish whatever it was I needed to do, plus a little extra.  Then I get to sit for 15 min and relax.  Follow her stuff, you'll get into a routine.  Routine will be good for you and for the wee one!", "controversiality": 0, "created_utc": 1363639413, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y0h8m", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431626707, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "Bins! I got these really cute storage bins that double as stools. There's 5, so it's easy just to open em all up and start chucking crap in there. Then i go around the House with a big garbage bag and get all the miscellaneous crap. Then dishes get gathered up and put in the sink. Then it's swiffer time.we have a dog and hardwood floors so they have to be vacuumed every day and usually mopped. The swiffer sweeper vac is great for dog hair. I keep baskets in all the rooms too and just throw the things that belong in other rooms in them until i have time to deal with it. I try to get one room really cleaned every day and the rest just get straightened. It's a horribly frustrating never ending cycle! I have two preschoolers and a 2 month old, plus dog and cat, and i hate animal hair, so the floors are always my priority, but just figure out what has to absolutely be done, and go from there. You need to get those kids used to noise when they sleep! My mom used to do all the  housework after we were in bed. Whenever we had friend sleepover they thought she was crazy, vacuuming at 3am, but we slept right through it. My two month old sleeps through my cleaning now, but if I'm doing something extra loud i flip on a fan next to him. Sleep training isn't a bad idea at his age either.i don't think id get anything done if i napped with the baby.good luck!\n\n\n", "controversiality": 0, "created_utc": 1363639886, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y0no0", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431626813, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loves_dogs", "author_flair_css_class": null, "author_flair_text": null, "body": "First of all, I'll say that it sounds to me like you are prioritizing properly. It sounds super cliche, but you won't remember 20 years from now that you didn't put your laundry away, but you will remember the first time your baby crawls, or claps or laughs. \nThat said, I was getting overwhelmed with thinking the entire house needed to be done. And I was therefor inefficient in my cleaning. I started using the attached pic as a guideline and I don't know if my house is cleaner, but I feel better about it. \nIt allows me to feel accomplished when I've got my day finished, rather than looking around and thinking 'I should'. \nGood luck Mama. Don't be too hard in yourself. My moms house was super clean when we were growing up, but I don't remember a single occasion where she just say on the floor and played with me. \nhttp://i.imgur.com/KwRcfx1.jpg", "controversiality": 0, "created_utc": 1363640878, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y10yw", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431626988, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whydoyoudothat", "author_flair_css_class": "lightcoral", "author_flair_text": "We've got a 2-year-old on our hands!", "body": "Does your littlest one enjoy bouncy seats? When my daughter was around that age, she loved to be put in her bouncy seat and pushed around our home, room by room, to bounce while I (quickly) cleaned.  If I were dusting with a rag, I'd hand my daughter a rag of her own to play with/chew on/drool on.\n\nDo the basic things over the day while your baby is awake and leave things such as organizing and purging for at night time.  If there's clutter, get rid of it.  Your home will automatically feel cleaner and more organized without knick-knacks, paperwork and unused items laying around.", "controversiality": 0, "created_utc": 1363640899, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1191", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431626990, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "do you have an understanding and capable friend that will either a: look after the 6 month old for a few hours or b: help you clean house? my daughters 6 now and my house is still a wreck, but hubby works shifts and im disabled. he regularly takes her out for the day and i get time to catch up a bit, but basically, we live with it!\ni do have a routine though. once shes dropped off at school, i come home and load and run the dishwasher and washing machine. tbh if you can do this every morning and another load in the afternoon, you will be fine. the 6 month old must nap occasionally. dont try and do everything at once...figure out if the babies asleep for 2 hours, thats a load in each washer, straighten up the lounge. next nap, have a cup of tea and a snack, then maybe sort some laundry. learning time management is important. ask hubby to take baby and 2 year old out somewhere so you can do the house when hes got a day off.", "controversiality": 0, "created_utc": 1363640991, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y12he", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxzub", "removal_reason": null, "retrieved_on": 1431627012, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "On top of the squeegee for the shower, I like the post shower spray.  I really don't like cleaning the bathtub, and that spray keeps it under control!  I prefer the \"The Method\" spray, and I get it at Target.\n\nAlso, I think writing down everything you are doing is super helpful.  People thing when you are a SAHM you don't do anything all day but eat bonbons and watch soap operas.  I think that only happens when your kids are in grade school ;)", "controversiality": 0, "created_utc": 1363641242, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y15rs", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xyz9n", "removal_reason": null, "retrieved_on": 1431627060, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dieflamingoes", "author_flair_css_class": "green", "author_flair_text": "3 year old son", "body": "I saw below that your daughter has SPD, so does my son (My son is also autistic, so it might be a bit different). My son is three now, and a lot of what helped me might also help you. Here's a numbered list!\n\n1. Designate 'no kid' zones. Mine is my bedroom, and two closets. These rooms are cluttered to the nines. I have big blue totes full of random stuff. Throughout the week (I work) instead of cleaning the odds and ends that don't have concrete homes, I throw them into the out of bounds bins. My son doesn't have to see them, and it only takes me 10 - 15 minutes to clean what would have normally taken me 30. I also store boxes of clean (to be folded) and dirty (to be washed) laundry in my bedroom -so that my son doesn't have to see them.\n\n2. Make cleaning a family activity. I go room to room with my son, each room has a box for toys in it (or at least, the rooms that aren't out of bounds). He picks up his toys with me. In his room, he has a hamper for laundry - so he picks up his own laundry. I keep the garbage can in the kitchen a low-smell zone. We have a compost bucket outside our back door for food related garbage. Any diapers or things with strong smells go directly into the outside garbage can. This makes it easy for my son to operate the garbage can, without smell-related sensory issues. When I clean, he cleans. If I say \"That goes in the garbage\" - he puts it in the garbage. We clean together. It gets done twice as fast. Yes, once or twice I've had to deal with bowls and spoons being thrown out - even once, a pair of my socks. Just check your garbage often (once a day, for me) right before you take it out. My son scrapes his dishes into the garbage, and than puts them in a bin that I have on a low shelf - for his dirty dishes.\n\n3. Designate a single day. I work monday - thursday, so I only have probably about 30 minutes on those days to do my cleaning. Things pile up. Dishes, especially. I designate one day a week (friday, for me) to catch-up cleaning. I make it a fun day. We listen to music, clean to the beat of the music. I pre-rinse dishes, and than pile the rest (no knives or anything super-breakable) into the bathtub with bubbles - and my son helps me clean the dishes. Yes, in the bathtub. My son loves bubbles and water - so it was a good bonding activity that multi-tasked all my chores. My son also likes to water the garden, I just have to fill up the watering can and hand it to him. He waters, while I pull up weeds. My son can't handle the sound of a vacume(sp?) cleaner - so I sweep everything, even carpets. Once a month or so (while he's at church, usually) I vacume the whole house.\n\n4. Designate a Sensory Area. My son has a tipi in his room, I filled it full of soft things. When he's feeling overwhelmed - he goes to the tipi and de-stresses. This is a great option for more than just dealing with a messy house. We don't do time-outs, because my son doesn't understand punishment the way a neurotypical child might. Instead, when he's done something wrong (pinching, biting, tantrums) he goes to his tipi. Once he's in there, I sit outside the tipi and talk to him about what he did, and why it wasn't okay. It's worked miracles for us, and I highly recommend it.\n\n5. If your daughter is anything like my son - as long as she can't see the clutter, it's fine. I have shelves with doors that I got from Ikea ( sort of like this - http://www.ikea.com/ca/en/catalog/products/S19837820/ ) and after  buying one, I got my dad to help me build four others. I put child-locks on all the doors - and I store everything in them. A lot of cleaning is really just organization. Having a place for everything, and making sure everything is in it's place. To help my son learn words, and to remember where things go - I have all those doors labelled. I bought some fancy stickers and sharpie, and I labelled everything. I found that the more organizational tools I had (specifically, ones with doors or drawers to get things out of the way and out of sight) the cleaner my house stayed and the happier my family was. Keep in mind, a lot of the stuff from Ikea is easy (and cheaper) to build yourself - if you know someone with a few tools and know-how. \n\n6. Talk to your husband. My SO was doing the same thing, complaining about the house. I started to resent him a little, feeling like I did most of the hard work in our lives. I almost left him, it got so bad. Now, he wasn't being purposely mean or trying to hurt me - he just didn't realize what kind of stress I was under, and how much I did throughout a day. Finally, I sat him down and talked to him about it. In retrospect, it seems silly that I didn't talk to him about it sooner, and I allowed that resentment to grow over something as simple as chores. At the end of the day, chores had nothing to do with it. I was tired. I was stressed out. Having a child with a disability, working and maintaining a household was killing me. I was trying to be superwoman, and not quite making it. I started to hate my SO for it, and that's not fair to anyone. Re-assess your personal situation. You have a baby, a toddler with a disability, and a house to maintain. It is not a fault of yours, that some things fall by the wayside. Make your husband understand how much you do. Use words, be kind and understanding - but be firm. If he still doesn't seem to understand, do what I did and switch places for the day. It was hard to get my SO to agree, but I told him that it was important for our relationship, for him to understand the pressure I was under. The only way he was going to understand, was living it. After that day - he didn't complain nearly as much. \n\nLast, I have become an organizational tool guru. If you have any questions or inquiries about organizational stuff - for the purposes of making your cleaning job easier - just let me know. ", "controversiality": 0, "created_utc": 1363641530, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y19hd", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431627103, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kimberlyann0507", "author_flair_css_class": "purple", "author_flair_text": "Mommy to 3 girls 8, 5 and 1 with one on the way", "body": "I have an eight year old, a four year old,a one year old and another due in June. I feel your pain. Sometimes you just have to put the baby down and do it. In the beginning they may cry or fuss but you just have to be strong and get through it. You will both be much better for it. Same thing with nap time, if this kid doesn't learn to nap without you nothing will get done. I have been lucky as all my girls were good nappers but it took work to get there. I don't have the heart to let them cry it out but sometimes you just have to. \n\nOnce you get started you will find it easier to keep going. The little one can be in the room with you in a playpen with some toys so they learn to post independently, which is very important developmentally anyway, and you get time to clean up. \n\nIt gets better, trust me.  ", "controversiality": 0, "created_utc": 1363641835, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1dh0", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431627148, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AnyelevNokova", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;Childcare takes a ridiculous amount of time.\n\nI don't think my partner understands this. Every now and then he'll comment on something messy, or needing to clean the house. But come on, dude. We've got a one month old. It takes me 20~45 minutes to feed the baby per feed, and he's showing no signs of letting up his self-assigned schedule of 10~12 feeds *per day*. Then there's diaper changes and clothing changes. He has a touch of colic, so add in the requisite \"mommy must sit with me on her lap or else I'm going to scream like I'm about to die\" 2~4 hours per day. And, in the past week, you can add in entertaining the baby/play. All in all, I think it comes out to about 1:1 child care:free time. So I spend a solid 12 hours a day caring for the baby, and 5~8 hours sleeping (broken up into 1~2.5 hour chunks, of course.) That leaves me with anything from 4 to 7 hours of free time *total*, per day. \n\nNow, if he'd like to actually step in and take over child care himself, I'd be more than happy to do whatever chore he's feeling too lazy to do. But if he's not willing to take the baby, then I'm sorry, but unless it's of vital importance, I'm not getting to it right away. *Tough freaking luck.*", "controversiality": 0, "created_utc": 1363642048, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1ga5", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y03eh", "removal_reason": null, "retrieved_on": 1431627179, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "neutralcolor", "author_flair_css_class": null, "author_flair_text": null, "body": "Then do it!  Hire someone!  I did when my kids were little!  You didn't choose to stay home because you wanted to clean house, right?  That's the least important thing you do all day.  Let someone else clean while you do the things you chose to stay home for.  It will benefit the whole family. Best money I ever spent.", "controversiality": 0, "created_utc": 1363642149, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1hny", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxu1j", "removal_reason": null, "retrieved_on": 1431627192, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I said in another comment that baby will only nap if I'm in bed with him. But I can still take in a lot of what you said. Thanks. ", "controversiality": 0, "created_utc": 1363642192, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1i7y", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y12he", "removal_reason": null, "retrieved_on": 1431627201, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AnyelevNokova", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I have an 8 month old and he is the same. He needs my attention constantly. I put him down and he doesn't cry, but as soon as he sees me walking away, he goes ape shit!\n\nOh no. My one month old has started doing this already. He just hit five weeks and the past few days have been marked by severe mommy clinginess. Here I was hoping it would let up with age :(", "controversiality": 0, "created_utc": 1363642276, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1jee", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xy061", "removal_reason": null, "retrieved_on": 1431627217, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I never thought of that. Thanks. ", "controversiality": 0, "created_utc": 1363642293, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1jm2", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y07so", "removal_reason": null, "retrieved_on": 1431627219, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Sleep \"training\" is absolutely not something I will consider. The baby plays independently for a few minutes and that's all I'd ask of a six month old. If the baby wants to be held, I hold him. We never deny emotional needs in our household. ", "controversiality": 0, "created_utc": 1363642439, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1ljv", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xyu2q", "removal_reason": null, "retrieved_on": 1431627245, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "It might take a few times to get the back carry down but I'll try! ", "controversiality": 0, "created_utc": 1363642609, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1ntc", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xyy8k", "removal_reason": null, "retrieved_on": 1431627267, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "The last line is so true. Thanks. ", "controversiality": 0, "created_utc": 1363642833, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1qs9", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y10yw", "removal_reason": null, "retrieved_on": 1431627313, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "We HAVE been working on throwing things out. Guess I'll throw out some more! ", "controversiality": 0, "created_utc": 1363642882, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1rfr", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1191", "removal_reason": null, "retrieved_on": 1431627327, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "This response means so much to me and is so helpful. Thank you! ", "controversiality": 0, "created_utc": 1363642910, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1rtl", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y19hd", "removal_reason": null, "retrieved_on": 1431627332, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I'm sure it gets better because you're kid learns not to depend on you emotionally. I would rather live with a bit of clutter than put the house before my child. ", "controversiality": 0, "created_utc": 1363642984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1ss2", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1dh0", "removal_reason": null, "retrieved_on": 1431627347, "score": -8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kimberlyann0507", "author_flair_css_class": "purple", "author_flair_text": "Mommy to 3 girls 8, 5 and 1 with one on the way", "body": "Putting the child down for a half an hour to play does not teach them not to depend on you emotionally , it allows them time to play alone. I have three wonderful kids who I love dearly. I was not coming down on you, I was trying to explain to you what I did and how it worked for me. \n\nI also babysit three other kids in the mornings before school and one all day long three days a week. I understand being overwhelmed and was trying to give you the benefit of my experiences over the past eight years. ", "controversiality": 0, "created_utc": 1363643433, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y1ys6", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1ss2", "removal_reason": null, "retrieved_on": 1431627411, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "It worked for me. And the girls were so much more patient about feeding the baby. Then again, they weren't sleep-deprived and living on cheese sandwiches.", "controversiality": 0, "created_utc": 1363644080, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y27ab", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1jm2", "removal_reason": null, "retrieved_on": 1431627519, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dieflamingoes", "author_flair_css_class": "green", "author_flair_text": "3 year old son", "body": "No problem, glad I could help. It took me far longer than I'd like to admit - to figure all that stuff out for myself. Once, I even went to my sons occupational therapist and asked her if she could give me cleaning tips. She thought I was nuts. Sort of a \"what does this have to do, with your sons development\" type face. It was embarrassing - but I literally had no clue how to cope with everything. So - I am glad my haphazard list helped. I hope things get easier for you! \n\nPS; multitasking is my go-to. I watch netflix while I do my dishes by setting my laptop on the counter beside the sink. I work out (crunches, sit-ups and squats - mostly) while I clean. Every time you bend down to pick something up, is an opportunity to do a squat! I also dance with my son, while cleaning. He thinks it's hilarious, and he dances along with me. I have a dance move for each cleaning related activity. You should see the booty shake I have to accompany washing windows! :)", "controversiality": 0, "created_utc": 1363644494, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y2cqk", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1rtl", "removal_reason": null, "retrieved_on": 1431627549, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sbzitz", "author_flair_css_class": null, "author_flair_text": null, "body": "Try it. A Tula may be a way to go too. If you can afford it. Its a soft structured carrier much like your mei tei but with buckles and is a bit faster up and down.", "controversiality": 0, "created_utc": 1363644933, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y2ic9", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1ntc", "removal_reason": null, "retrieved_on": 1431627623, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loves_dogs", "author_flair_css_class": null, "author_flair_text": null, "body": "I forgot to mention as well, that I drag baby furniture all around the house. For instance, today I parked the high chair outside the bathroom door and supplied my daughter with some kitchen utensils to slam together as I cleaned the tub and sang wheels on the bus approx 200 times. :). ", "controversiality": 0, "created_utc": 1363645332, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y2nbm", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1qs9", "removal_reason": null, "retrieved_on": 1431627690, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "You're going to need to get him to nap without you. Do you guys cosleep? My daughter and I coslept until she was almost ten months old, and I couldn't get her to sleep anywhere but on me or next to me in bed/couch. We finally broke down and let her CIO, first with naps, then at night. She sleeps in her crib now, and cries for maybe five minutes before she falls asleep? You, obviously, don't need to do the CIO method, it's not for everyone, but I urge you to look into some sleep training methods before this really gets out of hand. My ex's mom coslept, and didn't get her daughter out of her bed until she was 11..", "controversiality": 0, "created_utc": 1363645848, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y2tsu", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1i7y", "removal_reason": null, "retrieved_on": 1431627773, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "two girls, 2yo &amp; 1yo ", "body": "I work 40 hours a week and pretty much never get to clean anything anymore. Especially since daylight saving time ruined my daughter's schedule. I have a huge pile of clean laundry that has never been put away simply because I never get alone time upstairs to put it away. So I just kind of dig through it for stuff. \n\nI used to clean during her naps, but now I just nap during her naps because I'm pregnant again. It isn't even that things are that dirty, it's just so cluttered I'm losing my mind. ", "controversiality": 0, "created_utc": 1363647012, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y38gc", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431627964, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1363648085, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y3lwy", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y15rs", "removal_reason": null, "retrieved_on": 1431628142, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BoulderCat", "author_flair_css_class": null, "author_flair_text": null, "body": "I've somewhat adopted a routine of working on different room/tasks/chores each day. So instead of cleaning the whole house on one day, I break it up over the week. For instance, I'll clean the bathrooms one day then I'll vacuum &amp; mop the next day. Same with laundry. I'll do mine one day then my daughters the next.  The kitchen and dishes get done every day after dinner because I just have to or I'll go nuts from the clutter.\n\nI agree with other posters though. Perhaps expectations need to be lowered a bit. As long as your house isn't a safety or health issue, it's fine. There's always some degree of messiness with kids around.", "controversiality": 0, "created_utc": 1363648307, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y3ool", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431628177, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "I think it's an amazing idea!  My ex thought I just sat around all day and did nothing.  I was going to school full time studying Computer Engineering!", "controversiality": 0, "created_utc": 1363649122, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y3yw8", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y3lwy", "removal_reason": null, "retrieved_on": 1431628319, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MojoBlue", "author_flair_css_class": null, "author_flair_text": null, "body": "My son will only nap when I'm with him too and I just view it as my much needed break time and just relax and take a little time for me. It's only one time a day and helps me feel less overwhelmed the rest of the day. No need to CIO, there's nothing wrong. Those are my thoughts. ", "controversiality": 0, "created_utc": 1363650140, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4bbu", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1i7y", "removal_reason": null, "retrieved_on": 1431628486, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "The children will transition from my bed when they're ready. My two year old still needs to sleep with us most of the time. What's wrong with an eleven year old sleeping with parents? We respect and value our children's emotional needs and if they feel safest and most comfortable sleeping with us for a few more years I would not deny them that. To make a child scream until they lose hope of having their needs met is barbaric. ", "controversiality": 0, "created_utc": 1363650147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4bfh", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y2tsu", "removal_reason": null, "retrieved_on": 1431628487, "score": -8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I talked to my husband and he understood. I told him I just can't keep it together though I've been trying hard for the last few years. He said it would be less pressure on everyone if we had outside help. Thanks for making me not feel lazy! ", "controversiality": 0, "created_utc": 1363650317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4dky", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1hny", "removal_reason": null, "retrieved_on": 1431628514, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dementedpixie", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm trying to figure out a good way to respond to the insinuation that I'm a shitty mom who isn't attentive to my child's emotions, but everything I think of is less than polite, so I'm just going to echo kimberlyann0507's statements: putting down a child lets them explore on their own and learn by themselves.  Like kimberlyann0507, I wasn't coming down on you, either, just letting you know how I worked things.  Kids have different personalities, and what works for one person doesn't always work for another.\n\nHowever, YOU were the one asking for advice, and to insult the parenting of the people who try to give you the advice you were asking for is beyond rude.  How hard would it have been for you to simply say \"Sleep training doesn't really fit with my parenting style, and my child is a bit more high needs, but thank you for your advice\"?", "controversiality": 0, "created_utc": 1363650412, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4esw", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1ljv", "removal_reason": null, "retrieved_on": 1431628530, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. Judgmental much? I don't \"Make my child scream until she looses hope of having her needs met\" and that was pretty goddamn rude. She knows her needs are met, and (bonus!) she can now put herself to sleep. You wanted to know how to get your house clean during the day? Let your kid sleep in it's own bed. You asked for advice, I gave it to you. You don't have to be rude just because you don't like the advice I gave you. I never said \"Let your kid cry it out.\". In fact, I explicitly said that it wasn't for everyone, and that if it wasn't for you, there were a lot of other sleep training methods. ", "controversiality": 0, "created_utc": 1363650536, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4gdt", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4bfh", "removal_reason": null, "retrieved_on": 1431628547, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "When you say the baby may cry and it will be hard on me is where I have the problem. If it's hard on me to hear him cry, imagine how hard it is on him to actually be the one crying. I think of how my children feel in situations and how difficult it is for a baby to deal with emotional stress, not how uncomfortable something is for me. ", "controversiality": 0, "created_utc": 1363650617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4hfg", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1ys6", "removal_reason": null, "retrieved_on": 1431628556, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah, the dance cleaning workout. ", "controversiality": 0, "created_utc": 1363650783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4jk0", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y2cqk", "removal_reason": null, "retrieved_on": 1431628582, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I've never seen one. I'll look it up. Thanks again. ", "controversiality": 0, "created_utc": 1363650802, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4jsy", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y2ic9", "removal_reason": null, "retrieved_on": 1431628584, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Cying it out isn't for anyone. ", "controversiality": 0, "created_utc": 1363650891, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4kx8", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4gdt", "removal_reason": null, "retrieved_on": 1431628599, "score": -10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "milkysecret", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a maid clean and organize the house once per week--wash floors, scrub baths, etc, (Thursdays so we have the house super clean fri, sat, sun). She even organizes the baby's toys! It's so nice. I stay home and we just have one baby. I felt guilty at first but now I see it as something that helps me stay happy and sane. Clean house just feels good. It's only $160 per month. ", "controversiality": 0, "created_utc": 1363650914, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4l6r", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxu1j", "removal_reason": null, "retrieved_on": 1431628603, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I understand.what you're saying, and sorry to come off like that. It's just that it's not just my high needs children- I hate to set any child ignored. Sleep training is like putting a dog in a crate. I try to make sure I meet the physical AND emotional needs of my children. Having a child crying alone isn't meeting emotional needs. ", "controversiality": 0, "created_utc": 1363651053, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4mxf", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4esw", "removal_reason": null, "retrieved_on": 1431628628, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BubblegumAndEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "I had sympathy until this comment.\n\nYou reached out to the community to get suggestions on what could help you with your day, then bash someone for doing something different than you would?\n\nIn addition, it's already hard enough for moms being judged for every single thing they're doing- this should be a place to escape the judgements (for the most part) and to get support- and you just laid it on like your husband does to you.  Did it at least make you feel better, being that nasty to someone else?", "controversiality": 0, "created_utc": 1363651154, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4o73", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4bfh", "removal_reason": null, "retrieved_on": 1431628645, "score": 17, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh really? I had no idea! /s \n\nI *said* that twice. I'm not pressuring you to cry it out. I'm saying if you want to get housework done around the house during the day, then I would utilize your child's nap times. There are at least half a dozen other sleep training methods besides cry it out. If you like co-sleeping, you could even just have him/her sleep in their own crib for naps, and co-sleep at night.\n\nMaybe next time, you should read carefully, not jump down someones throat and basically accuse them of not meeting their child's needs, and actually listen to the advice, because (newsflash) I was in your situation once. We chose CIO, you can choose something different, but my advice stands: If you want more time during the day to pick up the house, have your child sleep in their own crib. ", "controversiality": 0, "created_utc": 1363651342, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4qiy", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4kx8", "removal_reason": null, "retrieved_on": 1431628679, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I've been rude to a few people in this thread because I've been defending the idea of nurturing children for so long that I've lost patience with it. I didn't ask anyone for advice on how to force my child to sleep- I wanted ideas for cleaning around my child's rhythm. I guess I just value that when your baby wants to be close to you, it's not a \"want\" than can be put off- it's a \"need\". \n\nI love snuggling with my babies. And hey, I get a nap most days. Who wouldn't want that? [: ", "controversiality": 1, "created_utc": 1363651399, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4r7b", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4bbu", "removal_reason": null, "retrieved_on": 1431628685, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't own a crib because I don't believe in caging babies. But thank you for taking the time to respond, even though we didn't see things eye-to-eye. ", "controversiality": 0, "created_utc": 1363651527, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4spq", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4qiy", "removal_reason": null, "retrieved_on": 1435565125, "score": -18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kimberlyann0507", "author_flair_css_class": "purple", "author_flair_text": "Mommy to 3 girls 8, 5 and 1 with one on the way", "body": "I do understand, like I said I have been through this three times. I had a terrible time with it too, every time. What I would do is set a time limit, five minutes the first time. Then six, seven, ten and so on until we both grew accustomed to it. When the time is up you pick them up and give all the snuggles and love and kisses you can. Eventually they can nap and play on their own and you have time to do the things you need to do. \n\nIt's not about putting the house before the children, it is about living in a way that everyone in your house can be comfortable with. I can promise you my house is never spotless but all of us feel better if it isn't a mess either. ", "controversiality": 0, "created_utc": 1363651702, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4uxt", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4hfg", "removal_reason": null, "retrieved_on": 1431628734, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "Caging...seriously? What other \"normal\" things do you not believe in? (Not trying to be a bitch, I'm actually interested in your parenting ideas)", "controversiality": 0, "created_utc": 1363651761, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4vnv", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4spq", "removal_reason": null, "retrieved_on": 1431628739, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sbzitz", "author_flair_css_class": null, "author_flair_text": null, "body": "http://www.tulababycarriers.com/ it may be hard to google lol", "controversiality": 0, "created_utc": 1363651784, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4vxx", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4jsy", "removal_reason": null, "retrieved_on": 1431628743, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't ask for advice about my baby. I guess I should have stated in the OP that I sleep with my children and don't want to change their degree of care in order to meet cleaning goals. I've just heard this same advice so many times that I'm always defending it. Two years ago I was patient and kind in explaining these things to people but I'm exhausted by it now. No one here knew that. Sorry.", "controversiality": 1, "created_utc": 1363651800, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4w4t", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4o73", "removal_reason": null, "retrieved_on": 1431628746, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "That's what my husband just agreed to and I'm feeling less guilty already! Thanks. ", "controversiality": 0, "created_utc": 1363651842, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4wou", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4l6r", "removal_reason": null, "retrieved_on": 1431628755, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dementedpixie", "author_flair_css_class": null, "author_flair_text": null, "body": "Your apology looses sincerity when you go on to defend the original rudeness and continue to insinuate that myself and several other posters aren't meeting our children's emotional needs.  You have made your feelings on any kind of sleep training, or independent play very clear.  I hope your house cleaning situation gets resolved. Good luck in the future.", "controversiality": 0, "created_utc": 1363651921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y4xoy", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4mxf", "removal_reason": null, "retrieved_on": 1431628781, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for explaining. I've seen so many people just leave their baby in a crib to cry for hours until it finally gives up and fall asleep. Your method is better and I've seen it a million times, it's just still not something I'd put my children though. I just can't see some one not rocking/patting/nursing their child to sleep. Crying sucks, even for adults- it makes you feel like crap emotionally and physically. I don't want babies feeling like crap, especially before bed. /: ", "controversiality": 0, "created_utc": 1363652539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y55hd", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4uxt", "removal_reason": null, "retrieved_on": 1431628888, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Those look like Ergos. Were they called Ergo before, or do they just look similar? They are quite expensive but maybe I can find one on ebay or something. ", "controversiality": 0, "created_utc": 1363652660, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y571o", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4vxx", "removal_reason": null, "retrieved_on": 1431628907, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sbzitz", "author_flair_css_class": null, "author_flair_text": null, "body": "They are ergo like but different. Imo. I have the toddler size so I can wear both my kids.", "controversiality": 0, "created_utc": 1363652921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y5aai", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y571o", "removal_reason": null, "retrieved_on": 1431628934, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MojoBlue", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess I was being too vague. I was actually agreeing with you. I've co slept with my son since he was born and he's two now. I relish our peaceful little nap times. So no judgment here. I wouldn't trade my cuddle times for anything, even a sparkly clean house. The way I see it, years from now I'm not gonna care about if the house was super clean when my kid is so little, what I will cherish is the nice moments we have every day, that's what's really important to me. Sorry if I offended. ", "controversiality": 0, "created_utc": 1363652975, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y5ayz", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4r7b", "removal_reason": null, "retrieved_on": 1431628940, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "purplepeach", "author_flair_css_class": "purple", "author_flair_text": "Lilith's mom: 4/18/12", "body": "I think you apologized to the wrong person. ", "controversiality": 0, "created_utc": 1363653271, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y5epd", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4w4t", "removal_reason": null, "retrieved_on": 1431628997, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "There's always the No Cry Sleep Solution! \n\nIf you like being close to baby while sleeping, then do you do any babywearing? It's a pain in the butt for me but sometimes it's all I can do to get things done. \n\nSorry you're getting so heavily downvoted. You do seem a little rude in your responses to people, but they're getting really worked up over the way YOU choose to parent. And their suggestions have little to do with your original question.\n\nMy advice is babywearing (my son stays asleep pretty much no matter how much noise I make while I'm wearing him), or just taking one weekend day to do all the cleaning with your husband. Those two things are what I do and it's been working well. We completely clean on Sunday so that it's not such a big chore to pick up after ourselves.\n\nGood luck!!!", "controversiality": 0, "created_utc": 1363654738, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y5xn2", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1ljv", "removal_reason": null, "retrieved_on": 1431629242, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jysalia", "author_flair_css_class": null, "author_flair_text": null, "body": "I found a young lady at my church (after asking around among other moms for recommendations), and she comes over for three hours once a week.  She will watch the kids while I clean, or pick up stuff while I nurse the baby.  It helps a lot.  \n\nAnother suggestion: When I finally got on top of my game, I put the toys in containers that get put away in a room where the kids are not allowed to go.  They can have a certain number of containers out at any given time, and if they want some of the toys that are put away, they have to clean up and trade in one of the other boxes.  By controlling the number of toys allowed out at any given time, I control the size of the mess they can make by dumping them all out everywhere.  Since I'm not spending all my time tripping over toys and scrambling to keep them put away, I have more time and energy to do things like the dishes.", "controversiality": 0, "created_utc": 1363654950, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y60f3", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1jm2", "removal_reason": null, "retrieved_on": 1431629272, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "Nobody's against her methods of parenting. She's getting down-voted for implying that anyone else who parents differently is denying their children's emotional needs. ", "controversiality": 0, "created_utc": 1363655181, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y63dk", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y5xn2", "removal_reason": null, "retrieved_on": 1431629317, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel like he might be a bit young for the no-cry method. Maybe I'll look into it when he's a bit older. \n\nI try wearing him but the damn kid is a squiggly one! Ten minutes on me and he's struggling to get down. But maybe if I keep trying while he's tired he'll get used to sleeping on me. ", "controversiality": 0, "created_utc": 1363657003, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y6qoo", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y5xn2", "removal_reason": null, "retrieved_on": 1431629618, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah, I know what you meant. I'm just typing on the run right now. Sorry. Thanks for the support. ", "controversiality": 1, "created_utc": 1363657074, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y6rlj", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y5ayz", "removal_reason": null, "retrieved_on": 1431629636, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Great ideas. Thank you. ", "controversiality": 0, "created_utc": 1363657123, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y6s8j", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y60f3", "removal_reason": null, "retrieved_on": 1431629640, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "You know what has helped us recently?  Getting rid of the clutter- the mess seems to build up more easily with clutter (it blends right in!), but then it's also more overwhelming. \n\nIt took us a good week to really make a plan and deal with everything. It was exhausting, but afterwards the rooms felt more airy and organised.  You wouldn't believe how much *garbage* (old food, unusable appliances or kitchenwares) we found in our cupboards. It's kind of embarrassing, but the truth is, it was barely noticeable before we really overhauled the whole works of it. \n\nI made sure my 3yo did her part and donated a few things she no longer used. It helped her feel involved with the process so it wasn't as uproarious to her as it could have been.\n\nBeyond that, I think we've just learned to accept living with a certain amount of mess while the baby is still so young and we have an active preschooler. It's crazy around here, but I've found ways to make it work. I'm always trying to find good ways to involve or distract the older one while I'm busy, and that's half the challenge.  Honestly, I sometimes have to put the baby in the playpen for a minute and just power through a small task to feel like I *did* something noticeable in a day. Too often the mess glazes over any cleaning I've done and it's just a shitty feeling. I think the layout of the house can have a big impact on this. I find ours kind of sucks, yours might too, so it's hard for everyone to be safe and happy and productive all at the same time.\n\nAll this to say you're not alone, but I think you will find ways to improve your situation. And of course, baby will grow up and become more independent. \n\nGood luck! \n\n", "controversiality": 0, "created_utc": 1363658757, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y7dhn", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431630001, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "We've been working on getting rid of clutter. I've thrown out/donated a few bags already but I bet I could find more somewhere. It definitely feels like a weight has been lifted every time a bag leaves our house! \n\nThanks for the reply. ", "controversiality": 0, "created_utc": 1363658906, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y7fgv", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y7dhn", "removal_reason": null, "retrieved_on": 1435565052, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I sympathise with your cosleeping napper. It's hard.", "controversiality": 0, "created_utc": 1363659319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y7kym", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y7fgv", "removal_reason": null, "retrieved_on": 1431630127, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nurshable", "author_flair_css_class": null, "author_flair_text": null, "body": "I babywear. Only way to get anything done with three kids, only one of whom is in school. That, and I speed clean, use my feet to move things around, have laundry hampers made of cloth that I can just roll down the stairs, etc. ", "controversiality": 0, "created_utc": 1363659611, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y7otj", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431630170, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "stendra", "author_flair_css_class": null, "author_flair_text": null, "body": "he probably feels lonely, what I do is let someone else distract him while I do stuff. Sometimes I can't put him in the play pen because then he starts crying right away, anybody else can put him down but me, idk why. Im still hoping this goes away when he gets older lol ", "controversiality": 0, "created_utc": 1363661005, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y87fc", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1jee", "removal_reason": null, "retrieved_on": 1431630427, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "stendra", "author_flair_css_class": null, "author_flair_text": null, "body": "let me know how it goes(:", "controversiality": 0, "created_utc": 1363661022, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y87mw", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xy4sy", "removal_reason": null, "retrieved_on": 1431630423, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "andilynscott", "author_flair_css_class": "green", "author_flair_text": "Mom to 2 with 1 in the Oven", "body": "Thank you! My blog is something I am kind of shy about still so it was hard to post that.", "controversiality": 0, "created_utc": 1363662362, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y8plk", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxmnq", "removal_reason": null, "retrieved_on": 1435564985, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "What are you planning on doing when you're children start throwing tantrums? Screaming and throwing themselves to the ground when they don't get their way/exactly what they want?", "controversiality": 0, "created_utc": 1363662523, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y8rp0", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4mxf", "removal_reason": null, "retrieved_on": 1431630713, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "No advice here, just commiseration. I remember that age, and we had a similar arrangement to you- cosleeping Velcro napper who was just starting to warm up to a back-carry. And we don't even have an older sib to juggle. But in those days pretty much nothing got done until my husband came home and we did a baby handoff so I could clean and cook. I know they say when some babies start sitting up is when they enjoy more independant time. That wasn't really true for us though. It took another year before I could leave the room for extended periods. Well, good luck. ", "controversiality": 0, "created_utc": 1363662994, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8y8xri", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431630797, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clasi", "author_flair_css_class": null, "author_flair_text": null, "body": "I still struggle with this every single day. I have a 2 1/2 year old and a 1 year old at home. Its pretty much impossible.\nI found having set chores for the hubby helps \"you put the dishes and the clean, folded laundry away for me\" Also, about once a month I would try and see if you can get a baby sitter for the little one. Even if they come to your place and hang out with him. Then take that time to do everything. Really clean, organize, de-clutter. That's the only thing that really works for me.", "controversiality": 0, "created_utc": 1363668970, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yatmv", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431631679, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MojoBlue", "author_flair_css_class": null, "author_flair_text": null, "body": "When my son was an infant he never wanted to be in a carrier either *until* I got a Moby wrap and started facing him out. Then he loved it! He was just getting bored facing me and wanted to see the world I guess. It really helped! ", "controversiality": 0, "created_utc": 1363670888, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8ybb7a", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y6qoo", "removal_reason": null, "retrieved_on": 1431631907, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I just wanna chime in as an SPD mom, it is often like parenting two kids at a time!  It is not easy, sometimes it's enough to make it through the day!\n\nThat being said, I really recommend FlyLady (someone else left you a link), and getting organized and de-cluttered.  Give your daughter something sensory to do (in summer I'd give my son little buckets of water and his cars and have him \"wash\" them, it'd keep him busy for a while) and take like 30 minutes to get some basics done.  Garbage in the garbage can, dishes in the dishwasher, sweep the floor, de-clutter the living room.  It's amazing what a difference that can make. Save the deep cleaning for when you have time to yourself and a day off (I KNOW it's the last thing you wanna do lol).  Also, pat yourself on the back.  We went 5 years without a diagnosis, idunno how we made it through, I always felt like such a failure as a parent trying to compare him to other \"normal\" kids.  You're not alone girl, PM me if you ever need a fellow mom to rant to.  :)", "controversiality": 0, "created_utc": 1363672468, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yboaj", "link_id": "t3_1aj8tk", "parent_id": "t1_c8xxzub", "removal_reason": null, "retrieved_on": 1431632093, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BuffyPilotKnob", "author_flair_css_class": null, "author_flair_text": null, "body": "This thing's pretty awesome, I put my baby in it while I'm folding laundry. It's better than just a bumbo seat because that activity tray makes all the difference.  http://www.amazon.com/Summer-Infant-Stage-Super-Seat/dp/B001NJC5QY/ref=sr_1_1?s=baby-products&amp;ie=UTF8&amp;qid=1363673537&amp;sr=1-1&amp;keywords=baby+chair\n\nWhen I cook, I put my baby in her high chair and I do a \"cooking show\" for her, where I get all over enthusiastic and animated and dance around while I'm cooking, to entertain her.  I do the same for when I'm doing dishes or unloading the dishwasher, and I show each dish to her and tell her the name (\"fork\", \"plate\", \"bowl\", etc.) and for some reason she finds this very interesting.\n\nI wear my baby when I vacuum. \n\nI use Safeway.com to have groceries delivered. It only costs about $3 for delivery.\n\nI don't know if you live in a house or not, but I live in an apartment. To do laundry, I wear baby to the laundry room while carrying my basket.  When I need to transfer the laundry to the dryer, and when I need to pick it up, I bring the baby with me in her stroller.\n\nA jumperoo is great for short bursts of getting stuff done. Usually no more than 20 minutes at a time, and you can drag them to wherever you're going to be doing your chore. You can still engage with them while you're working.\n\nI don't do bathrooms or mop or anything where I'm using chemicals unless baby is napping.  Since that is not an option for you, you should split those chores with your husband, especially since they don't have to be done every day. Once a week or even every 2 weeks should be sufficient.  \n\nI also give myself a small daily goal, instead of overwhelming myself with everything that needs to be done.  One day I will just focus on the laundry.  Another day, I will clean 1 bathroom.  Etc.", "controversiality": 0, "created_utc": 1363674491, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yc2xk", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431632301, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bribeekins", "author_flair_css_class": null, "author_flair_text": null, "body": "Best advice? Just let it go. Concentrate on spending time on your kids, on yourself, and on your husband, and do housework when you feel refreshed. Also talk to your husband about his comments, because he needs to understand that raising children is no easy feat. ", "controversiality": 0, "created_utc": 1363675082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yc6yw", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431632352, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a special needs 2.5 year old. Don't even try to school me on that front. Lol. ", "controversiality": 0, "created_utc": 1363701914, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg3fe", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y8rp0", "removal_reason": null, "retrieved_on": 1431634169, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "It is! But even when it's frustrating it makes me slow down and give him and I some close time together. ", "controversiality": 0, "created_utc": 1363701980, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg40m", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y7kym", "removal_reason": null, "retrieved_on": 1431634177, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for understanding. \nI was a complete mess when my older child was home all day too. She's the same way as the baby, just the way you described. At 2.5 I finally worked up the courage to start taking her to a learning center a few hours a day. We were all unsure of it at first but now she loves it. ", "controversiality": 0, "created_utc": 1363702167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg5r1", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y8xri", "removal_reason": null, "retrieved_on": 1431634198, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not trying to \"school you\" on anything. Believe it or not, people  can be interested in  how you  plan on handling things when you have an unconventional parenting style without trying to criticize you. ", "controversiality": 0, "created_utc": 1363702347, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg7gt", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yg3fe", "removal_reason": null, "retrieved_on": 1431634222, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "That's how I look at it too. Especially with my attention divided, it's nice to have some forced quiet time.", "controversiality": 0, "created_utc": 1363702370, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg7og", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yg40m", "removal_reason": null, "retrieved_on": 1431634224, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Those are actually the two chores I have my husband too. Lol. Except I just took over the laundry because it was piling up and he was getting upset about it. \n\nI tried hiring a friend for an hour or two in Fridays to play with the baby while I clean up, but I always ended up talking to her the whole time or saying, \"Omg I have one hour- where do I start?\" It might be easier if I get a younger person to who needs the experience to play with him like some people here suggested. ", "controversiality": 0, "created_utc": 1363702464, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg8m7", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yatmv", "removal_reason": null, "retrieved_on": 1431634238, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "So many typos but mobile hardly ever lets me edit. Sorry. ", "controversiality": 0, "created_utc": 1363702510, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg91z", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yg8m7", "removal_reason": null, "retrieved_on": 1431634243, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll take that into consideration. Thanks. ", "controversiality": 0, "created_utc": 1363702535, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yg9a8", "link_id": "t3_1aj8tk", "parent_id": "t1_c8ybb7a", "removal_reason": null, "retrieved_on": 1431634246, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much. We're still searching for a real diagnosis but that's what we have for now. \n\nHer latest thing is paint. I can give her a plate of paint and she'll dip different things in it to paint with, like toy fish, leaves, strings. She'll do that for an hour! So if yours will put up with thick/sticky stuff, I'd recommend it. ", "controversiality": 0, "created_utc": 1363702730, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8ygb4t", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yboaj", "removal_reason": null, "retrieved_on": 1431634271, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vitaminmary", "author_flair_css_class": null, "author_flair_text": null, "body": "You have a 2 year old, so you know it will get better in time.  Don't feel pathetic, I'm in the same position as you.  I have a 2.5 year old and a 5 month old.  My husband comes home to dishes in the sink, laundry left in the dryer, and a very messy house.  He knows how hard it can be so he is very encouraging when he sees what I have gotten done and he always pitches in.  He has become the diaper washer (since we do cloth).  \n\nHe may not have a lot of time to pitch in, but he is always encouraging.  That makes all the difference.  Our house may not be the cleanest, our laundry rarely gets put away, and showers don't happen in a timely manner.  But that's life.  It's not perfect.  But we play and have fun, and I at least keep the house from becoming disgusting.  Do what you can when you can.  ", "controversiality": 0, "created_utc": 1363702743, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8ygb9l", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431634273, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ValarDohaeris", "author_flair_css_class": "brown", "author_flair_text": "Dashiell's mom, 8/14/2012", "body": "Crate training dogs is actually very humane. Most creatures like having a little bit of space that they can call their own. That's why we like having rooms of our own and quiet places we retreat to when we need to recharge. \n\nSleep training extends far, far beyond \"cry it out\". If you have a bias against it, it's from your own preconceived notions and prejudices. If you think I just left my son alone in his room one night and called it \"sleep training\" you're out of your god damn mind. We introduced him to his crib, put him there when he was good and sleepy with a nice heating pad to stay toasty like he was cuddled on me. And you know what he did? He took his paci, turned over and passed out. \n\nYou asked for advice, but for most of the suggestions in the thread you made excuses why it won't work for you because you seem to be unwilling to actually try anything different. Things don't magically get better, you have to keep trying to see what works. You could *try* putting your 6-month-old down for a nap once he's on the verge of falling asleep, or asleep, instead of anchoring yourself to him indefinitely and then complaining that you aren't getting anything done during his naptimes. Of course you have no free time.", "controversiality": 0, "created_utc": 1363703461, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8ygi9x", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y4mxf", "removal_reason": null, "retrieved_on": 1431634364, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Twenty minutes is waaayy past how long my baby will tolerate being put down. Lol. I clean everything with vinegar/essential oils/botanicals so that it's okay if the baby gets into it. Maybe you'd like to check out something like that. \n\nI think small goals are where it's at, plus my husband agreed to hiring help every two or three weeks! I'm focusing on laundry and our smallest bathroom today. Thanks. ", "controversiality": 0, "created_utc": 1363705643, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yh4yk", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yc2xk", "removal_reason": null, "retrieved_on": 1431634661, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I cloth diapered my first and gave up a few months in with my second. Having two kids in cloth is hard. God job! ", "controversiality": 0, "created_utc": 1363705770, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yh6c4", "link_id": "t3_1aj8tk", "parent_id": "t1_c8ygb9l", "removal_reason": null, "retrieved_on": 1431634678, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "The way you worded it sounded combative. \n\nFor tantrums I try to see what's making the child upset. If a child is screaming and acting out, there's a reason- maybe they feel ignored, they're over tired, or there's something else that they just don't have the ability to express yet. When a child is tantrumimg they're not giving you a hard time- they're having a hard time. \n\nMy toddler daughter doesn't throw fits over wanting certain toys at the store, being first in line, etc. If she hits the baby it's because he's crowding her, not because she's being mean. We have time in to talk about why hitting is hurtful and what she could have done differently, like move to a different spot or given him a different toy. We also talk about what we as parents could have done differently, such as given the baby his own spot/toy when the toddler is wanting alone time. \n\nSometimes kids are assholes, but like adults, it's because they've been triggered, but they have the additional burden of limited self control and communication skills. Usually if we just get on their level and listen the behavior will be resolved without resorting to spanking or isolating the child. If a kid already feels like he's not being heard, time out is going to make it harder on them. That's not to say, though, that I haven't separated my daughter from others for a few minutes until she could wind down physically. ", "controversiality": 0, "created_utc": 1363706559, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yhewh", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yg7gt", "removal_reason": null, "retrieved_on": 1431634792, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "Interesting. I like that. ", "controversiality": 0, "created_utc": 1363707008, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yhjzg", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yhewh", "removal_reason": null, "retrieved_on": 1431634857, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. It can be very frustrating some times and doesn't always work, especially with a special needs child. But then I remember how frustrating it was to be a kid. My mom was always dragging me boring places, wouldn't listen when I wanted to tell my side of the story (\"I don't care who started it. Cut it out.\"), sent me to my boring room when I was just acting out out of boredom... Being a kid sucks sometimes. Life shouldn't suck. ", "controversiality": 0, "created_utc": 1363707888, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yhu1m", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yhjzg", "removal_reason": null, "retrieved_on": 1431634989, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "then it might be time to teach baby new sleep habits. ", "controversiality": 0, "created_utc": 1363709010, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yi794", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y1i7y", "removal_reason": null, "retrieved_on": 1431635167, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "We're fine with listening to our children's natural sleep system. They'll outgrow it in a few years. I was more looking for way to work around their system, not work their system around mine. ", "controversiality": 0, "created_utc": 1363709256, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yia2u", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yi794", "removal_reason": null, "retrieved_on": 1431635199, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cosmovixen", "author_flair_css_class": null, "author_flair_text": null, "body": "I've read through your blog, and I think it's awesome. Good work, and go you! For sticking with your goals. You've inspired me to tackle my clutter, help get down a routine and find what works for me :)", "controversiality": 0, "created_utc": 1363713417, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yjovc", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y8plk", "removal_reason": null, "retrieved_on": 1431635864, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thats_not_funnier", "author_flair_css_class": null, "author_flair_text": null, "body": "I understand the issue of getting overwhelmed with the sheer amount of work that needs to be done. It helps me to break it into small chunks and to prioritize the things that actually bother me. And the key is letting go of perfectionism. No one has a spotless house all the time. So stop comparing yourself to this non-existent ideal. Figure out what good enough means, and try to get there. If your husband is willing to work with you on this ask him what his top priorities are as far as household cleanliness. Also, is he on board with the idea that your primary responsibility is raising the kids while he is at work?\n\nHere is a wall o' text on practical things that have helped me get better about household stuff.\n\nWhen I stick with it, I find Flylady's 15 minutes method very helpful. Set a timer for 15 minutes and do as much as you can in that time. You will be amazed at when you can get done in 15 minute chunks. Knock it down to 10 minutes, or 5 minutes if that's all you can do right now.\n\nThings I can complete in a 5 minute or less chunk:\n-empty dish washer\n-load dish washer\n-empty household trash cans (we have 5 small cans around the apartment, and one large on in the kitchen)\n-put a load in the washer\n-move wash load to dryer\n-fold and/or hang a load of laundry\n-wipe down the bathroom counter and sink\n-wipe down the toilet\n-wipe down the kitchen counters\n-wipe down the kitchen cabinets\n-sweep the kitchen floor\n-sweep the bathroom floor\n-vacuum one room in the house\n-spot clean spills on the kitchen or bathroom floor\n\nKeep in mind that most of these things do not have to be done every single day to keep a home in decently clean condition.\n\nAre you taking advantage of cleaning as you go? If you wipe down the counters after making breakfast, lunch, and dinner. Or rinse the dishes right after you're done eating you'll get more things accomplished than having an I'll do it all later attitude. (I suffer from this often. Life is so much better when I suck it up and just do the quick cleanup tasks.) \n\nTry reducing you work load in as many ways possible. Are you putting away toys when the play period with them is over? Are you teaching your 2 year old to do this with you? Are you washing clothes that are actually still clean? Would you benefit from getting through one entire laundry cycle per load before starting a new one? (wash, dry, fold, and put away) I find a single load of laundry a lot less intimidating to fold and put away than 5 loads in a giant pile. Are you folding everything, or taking advantage of the speed of hanging things straight out of the dryer?\n\nLook at some of the household control journals out there on the interwebs, and see if having specifics like that to reference would be helpful for your personality style.", "controversiality": 0, "created_utc": 1363716056, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8ykmaa", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1431636301, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "The fifteen minute method sounds like a good idea. Lots of good stuff here. Thanks. ", "controversiality": 0, "created_utc": 1363718208, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8yldou", "link_id": "t3_1aj8tk", "parent_id": "t1_c8ykmaa", "removal_reason": null, "retrieved_on": 1431636660, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "andilynscott", "author_flair_css_class": "green", "author_flair_text": "Mom to 2 with 1 in the Oven", "body": "Thank you so much! I have been somewhat absent due to the move but I am trying to post more despite my mile long to do list.", "controversiality": 0, "created_utc": 1363784738, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8z2mz4", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yjovc", "removal_reason": null, "retrieved_on": 1431645006, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mockingjay", "author_flair_css_class": "green", "author_flair_text": "Kiddo, 6years", "body": "I always feel better after a good cry.", "controversiality": 0, "created_utc": 1363786555, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8z316m", "link_id": "t3_1aj8tk", "parent_id": "t1_c8y55hd", "removal_reason": null, "retrieved_on": 1431645182, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "well good luck with that", "controversiality": 0, "created_utc": 1363792031, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8z4j8q", "link_id": "t3_1aj8tk", "parent_id": "t1_c8yia2u", "removal_reason": null, "retrieved_on": 1431645997, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1363800342, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c8z7fhn", "link_id": "t3_1aj8tk", "parent_id": "t3_1aj8tk", "removal_reason": null, "retrieved_on": 1435564464, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}