{"submission": {"author": "macadamia_nut", "author_created_utc": 1364142672, "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "author_fullname": "t2_b257p", "created_utc": 1364143471, "domain": "self.Mommit", "edited": 1364176261, "full_link": "https://www.reddit.com/r/Mommit/comments/1ax3t3/i_feel_like_all_i_do_is_yell/", "gilded": 0, "id": "1ax3t3", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 60, "over_18": false, "permalink": "/r/Mommit/comments/1ax3t3/i_feel_like_all_i_do_is_yell/", "retrieved_on": 1412948733, "score": 31, "secure_media_embed": {}, "selftext": "Hi eveyone, long time lurker here, finally signed up to participate!!\n\nSo I have a 3 year old boy, and I feel like all I do is yell at him! Then I get frustrated and even the little things get to me way more than they should. Time to get dressed? its a battle, time to put your shoes on? its a battle, Time to eat? its a battle, literally everything is a battle. Some days I feel like I can't do it anymore! I try giving him notice like \"I know you're watching nemo right now, when it's over we have to get in the bath\" and he said \"okay\" but when it comes time it's a huge battle of him yelling \"NO\" then crying, etc. In the morning before work I give him a 15 minute warning \"We need to get our shoes and coats on in 15 minutes\" and he says \"okay\" then when it's time it's a huge battle. Then I end up getting frustrated and yelling. I feel like all I do is yell! I feel like we're not even enjoying our time together bc it's constant fighting and I want to enjoy our time together. Does anyone have any suggestions?\n\nA littel extra info that might help, his father isn't in the picture so I can't get out for a while and leave him home. I live with my parents right now (that's hopefully changing in the next 6 months) and they \"help\" but it's only if I want to go out after he is in bed. I've tried getting away and having my mom watch him for a few hours but when I get back all I get is crap from her about how bad he was, etc. So I don't know what else do to at this point. ANY help is appreciated!!! \n\nEdit: I've gotten so much good advice here! Thank so all so much for your kind words and for not making me feel like a failure! I was really nervous to post this because I didn't want people to be rude and make me feel worse than I already did, but you ladies gave me so many good ideas! I also have a lot of reading to do now!!! ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I feel like all I do is yell!", "url": "http://www.reddit.com/r/Mommit/comments/1ax3t3/i_feel_like_all_i_do_is_yell/", "user_reports": []}, "comments": [{"archived": true, "author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have a lot of help, but You have my sympathy!   It sounds like he's going through one of those phases where he's testing boundaries. Stand firm, it sounds like you're doing everything right.\n\nI have teenage stepsons, and when we get to where we feel like we're constantly locking horns and can't stand to look at each other any more, we declare a \"family day\".  We try to find an afternoon activity that we all enjoy and let the boys pitch ideas, too.  At first, it seemed counterintuitive, but it really helps reset our attitudes towards each other when we spend an afternoon enjoying each other's company.\n\nMaybe you could try something like that with your 3 year old?  It sounds like YOU could benefit from an enjoyable afternoon with him.  Maybe you could think of something that he's be excited to get ready for?  Maybe something with a definite end or closing?\n\nHang in there!  You're going to make it.", "controversiality": 0, "created_utc": 1364144578, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jk9a", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431687752, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "Hmmm... I hope you get some good advice here - I do not have any super ideas. But I will tell you one critical step is to STOP YELLING. Yelling, as you have already learned from experience, is not effective - all you're doing is teaching your child that you can't control yourself. Eventually this will lead to contempt. One possibility is to start rewarding *good* behavior - every time he does something right, he gets something you know he wants (e.g., sticker). Another is to think up a consequences for bad behavior (e.g., take a toy away) - and do whatever that is calmly and without emotion. \n\nYou might try reading some books on discipline - I liked 1-2-3 Magic and Harvey Karp's book (can't remember the name, but it's about toddlers). ", "controversiality": 0, "created_utc": 1364144653, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jl2z", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431687760, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you, I'll try and think of something we can do that we both enjoy. Like go to the zoo, the park, etc. maybe we could try and do a reward system where if he is good all week we get to go do that. ", "controversiality": 0, "created_utc": 1364145141, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jq69", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jk9a", "removal_reason": null, "retrieved_on": 1431687828, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you, I'll check that book out! I really hate yelling and I know it's not the way to deal with it but it's SO HARD sometimes! I think I've just been at my wits end and that everything has been getting to me more than it should. I'm going to try really hard to stay calm. Thank you for the advice :)", "controversiality": 0, "created_utc": 1364145234, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jr67", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jl2z", "removal_reason": null, "retrieved_on": 1431687850, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thatsboxy", "author_flair_css_class": null, "author_flair_text": null, "body": "Does he have choices over certain things? For example do you let him choose between taking a bath now or reading a bedtime story? Or do you let him pick between food items at breakfast? \"Honey do you want cereal or eggs?\"\n\nIf you let him have some kind of control over his day and schedule maybe it will make other times easier. sometimes, of course, he doesn't get a choice. But if the order of something can be changed let him change it. \n\nPJs before or after you pick up your toys.\n\nCookies or ice cream.\n\nShoes first or hair.\n\nStuff like that.", "controversiality": 0, "created_utc": 1364145434, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jt9y", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431687869, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I'll try to do that more often. He gets choices with food (eggs or pancakes, milk or juice, etc) but I haven't really thought about giving him the choice about the other things, I'll try that out and hopefully it'll help! At this point I'm happy to try anything!! Thanks for your input!", "controversiality": 0, "created_utc": 1364145690, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jvyl", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jt9y", "removal_reason": null, "retrieved_on": 1431687909, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thatsboxy", "author_flair_css_class": null, "author_flair_text": null, "body": "Also let him pick clothes. Does it really matter if his clothes match? As long as he is warm enough let him have the freedom. And if he doesn't want to brush his hair...who really cares. I guess it comes down to picking what you want to argue over. Plus it gives him room to be him.", "controversiality": 0, "created_utc": 1364145965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91jysa", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jvyl", "removal_reason": null, "retrieved_on": 1431687941, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Serasha", "author_flair_css_class": "red", "author_flair_text": "Norah, 4; Sam, 6 months", "body": "When I tell my three year old that it is time to do something, \"no\" is never an acceptable response. There are no second chances, if she says \"no\", its a time out immediately. After the time out, I ask if she's ready to do what I said. 10 times out of 10, she's ready. Try it! ", "controversiality": 0, "created_utc": 1364146089, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k03b", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431687957, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "Another book recommendation would be *Raising Your Spirited Child* by Mary Sheedy Kurcinka. In spite of the title, I think it's very helpful for all parents, not just those with \"spirited\" children, as the main thrust of the book is looking at your temperament and your child's temperament and presenting strategies for dealing with mismatches.", "controversiality": 0, "created_utc": 1364146231, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k1lt", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jr67", "removal_reason": null, "retrieved_on": 1431687981, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "You're right, because if I argue about everything I'll be arguing all day (like now haha) I'm going to try and give him as many choices as possible now! Thank you so much ", "controversiality": 0, "created_utc": 1364146465, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k417", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jysa", "removal_reason": null, "retrieved_on": 1431688018, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "seals", "author_flair_css_class": null, "author_flair_text": null, "body": "That's a good idea. I  would just really caution you from just saying \"good\". Because what that means to you and what that means to him is vastly different. So maybe make some very concrete goals, like each time you put your shoes on when I ask you to, you get a sticker. And then when his chart is full you guys go on the outing. That way he doesn't just lose out a bunch of good behaviour when he has one blip. They have [rewards charts](http://www.kiddycharts.com/assets/helen-neale-kiddycharts-reward-charts-mummys-not-shouting-at-children-reward-chart.jpg) that make it very tangible for him.\n\nAlso, for a 3 year old, a week is a long time, so make sure you're giving him positive feedback for his positive behaviour, too. Even if it's just you had to only ask him three times instead of the usual four. \n\nAnd finally, when you give him the 15 minute countdown, do you come back and remind him when there's 10 and 5 and 1 minutes left? If not, that may help as well. \n\nGood luck!", "controversiality": 0, "created_utc": 1364146480, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k467", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jq69", "removal_reason": null, "retrieved_on": 1431688014, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Omg I hate the \"no\" so much! I might start doing this if giving him more choices doesn't help! ", "controversiality": 0, "created_utc": 1364146539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k4rb", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k03b", "removal_reason": null, "retrieved_on": 1431688021, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Great! Thanks again! I don't want to be \"mean\" or yelling all of the time, no one enjoys it!", "controversiality": 0, "created_utc": 1364146597, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k5d5", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k1lt", "removal_reason": null, "retrieved_on": 1431688029, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DingoesAteMyBaby", "author_flair_css_class": null, "author_flair_text": null, "body": "One thing I do when my daughter is being insane is, instead of yelling, I whisper. It lets me have a little outlet while dealing with her. And it also makes me laugh a little when I really just want to cry. Whispering, \"We need to put these pants on or we're not going anywhere!\" just seems funny in the moment.", "controversiality": 0, "created_utc": 1364146696, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k6du", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431688042, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Okay, that's I great idea. I can even have separate lines for \"putting on shoes\" \"getting in the bath\" etc, and when he does them without arguing he gets a sticker. Plus having the visual reminder will probably help him too!", "controversiality": 0, "created_utc": 1364147019, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91k9pd", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k467", "removal_reason": null, "retrieved_on": 1431688083, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Haha I can just imagine! You gotta do what keeps you sane at the moment! I bet it's better than yelling :/", "controversiality": 0, "created_utc": 1364147077, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91kaae", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k6du", "removal_reason": null, "retrieved_on": 1431688090, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "seals", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh yeah, I like the idea of giving each line a different goal (as long as there are only 2 or 3 goals). Another idea is to focus on a different target each week. So for the first week if he takes a bath without yelling or arguing, he gets a sticker. Once he masters that, then you add a different goal.\n\nBut remember, the first time he doesn't get a sticker, he will raise a fuss. And you have to stay firm. Don't try to reason with him when he's upset (he won't listen anyways) just stay calm, consistent, and firm. Once he's calmed down, then you can discuss what he did that meant he didn't earn the sticker, and what he can do next time to earn it. This gives him some closure and helps him think about how his behaviours have consequences.", "controversiality": 0, "created_utc": 1364147273, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91kccc", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k9pd", "removal_reason": null, "retrieved_on": 1431688117, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I love this idea so much! This is what we did with potty training, he got a sticker each time he went and it worked really well and he got so excited about putting a sticker up!", "controversiality": 0, "created_utc": 1364147674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91kgh5", "link_id": "t3_1ax3t3", "parent_id": "t1_c91kccc", "removal_reason": null, "retrieved_on": 1431688170, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeeholic15", "author_flair_css_class": null, "author_flair_text": null, "body": "Aside from giving him choices (which is almost always my first go-to answer for this age) make everything you can into a game. \n\nTime to put toys away? Have a race! Put the blocks into two piles and see who can put their pile away first. \n\nTime to eat dinner? See who can make up the best story about their food. (\"Mr and Mrs Broccoli were walking to the store when all of a sudden then were trapped in a gravy tar pit! Then, King Chicken Nugget came along and pulled them out just to feed them to the giant dragon -which is your son-! Suddenly, the dragon decided he loves the taste of the gravy tar pit and eats it all up...but first he decided to dip the king and eat him too!!\" okay. my story telling kind of sucks. You get the idea).\n\nAlso, let him help with things. \n\nBath time? Let him add the bubbles (I suggest you pour them into the cap and then let him pour the cap-full into the tub). If he can get into the bath without a fit, let him add one more cap-full as a reward. \n\nTime for coat and shoes? Ask him to help you zip it up (get it started if he can't do that quite yet). If you make it seem like you need his help for things, he'll be more willing to do them....hopefully. \n\nAlso, try talking to him about how he feels about constantly fighting with you. \"Wouldn't you rather be friends with mommy? I don't like fighting, I have a lot more fun with you when we're both happy. Let's try not fighting so much.\" Then when fights do come up, stop what you're doing and say \"This sounds like an ugly fight is starting. How about instead of fighting we compromise. You need to get your shoes on but if you want, you can wear this other pair instead.\"\n\nHopefully some of that will help. Good luck :)", "controversiality": 0, "created_utc": 1364147708, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91kgts", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431688176, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "saucity", "author_flair_css_class": null, "author_flair_text": null, "body": "Mama, 3 is a TOUGH age. Don't beat yourself up. They'll make you yell sometimes. \n\nHere's my advice: \n-STAY calm. Negative energy is contagious. Approach him with positivity from the second his eyes open. Tickle him and joke if you have to - being happy and relaxed yourself makes a huge difference. Be present in the moment.\n\n-Consistency and predictability. Try allowing an extra 15-30 min to your morning, and make a consistent routine. I know it sounds lame, but you can even ring a bell or flick the lights as a signal. (I teach preschool and I have a 4-year old. My son, and all my kids, LOVE that damn bell, and it works!) Then he'll know, every time, lights off means we're getting ready. Also, try to make it fun, make it a game! That way, he just got himself dressed and ready, and he had such a good time he didn't even realize it. \n\n-Don't give in, and don't negotiate. What you say GOES, and that's it! Stick to your guns, you're the mama, you'll have awful days but it's better for you both in the end. \n\nAs an aside, I feel ya. I could go on a long tangent about 'helpful' parents and even more 'helpful' fathers. Take care of yourself, be patient with yourself, so you can take care of your little man. (((hugs to you)))\n", "controversiality": 0, "created_utc": 1364149066, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91kvni", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431688441, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ofinethen", "author_flair_css_class": null, "author_flair_text": null, "body": "http://www.janetlansbury.com/2013/02/i-think-i-know-why-youre-yelling/\n\nThis is a great article that I found here on reddit somewhere.  Another resource with a TON of advice on short-tempered Mommas, like us:\n\nhttp://positiveparentingconnection.net/chill-out-corner-a-positivetool-for-learning-emotional-self-regulation/\n\nI def. recommend browsing the second link, there are so many helpful tips.  ", "controversiality": 0, "created_utc": 1364149972, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91l5eo", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431688564, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "YodaRoo", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok so I haven't read this yet but my neighbor says it has worked wonders with their 4 year old, Peaceful Parent Happy Kids by Dr Laura Markham.  My five year old, I feel like I yell all day.  I feel like I repeat myself all the time.  I have tried the 1-2-3 Magic and Parenting with Love and Logic but have yet to find what works for us.  I have noticed that he behaves best when he is getting one on one attention, of course I have a 3 year old so that is hard to manage.  Best of Luck.", "controversiality": 0, "created_utc": 1364155786, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91mts9", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431689355, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PollyAmory", "author_flair_css_class": null, "author_flair_text": null, "body": "Regularly point out (specifically) what he's doing right. It will boost his confidence, ease his frustration (the constant arguing frustrates little ones too) and he'll still be getting the attention he's seeking. Start with small things (WOW, you put on your shoes so fast! Nice job!) and as his behaviors get better start making him work a little harder for it (WOW, you got dressed by yourself, put on your shoes and you're totally ready to go and I didn't even have to ask!).\n\nAnd lots of hugs and kisses :) ", "controversiality": 0, "created_utc": 1364156271, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91myov", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431689419, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wakawhat", "author_flair_css_class": null, "author_flair_text": null, "body": "Seconding that theme of book, I just finished Taming the Spirited Child, and it gave me some great advice. I am about to start Raising to see if it has any differing advice.  \n\nStart today by doing a couple things that have helped me tremendously: \n\n1, treat your child with respect! This means no yelling of course, and asking nicely for the things you want, as you would expect if him.  \n\n2, offer options to avoid power struggles. Ex: would you like to wear this or this? Would you like to stop playing now or in 5 minutes?  \n\n3, use a timer. This gives him some idea of how long he has/is allowed to do an activity. \n\n4, use When/Then and Either/Or.  Ex: When you've put on your clothes then you may have breakfast. (Make sure this is not a bribe, but something that would occur anyway).   Either you get dressed or we're going to be late and you won't have time for breakfast. (Or other logical consequences).\n\nI've been doing this for about a week and have already noticed a difference! Good luck.", "controversiality": 0, "created_utc": 1364156740, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91n3he", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k5d5", "removal_reason": null, "retrieved_on": 1431689481, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "The idea is that you work on your relationship first, then the behavior. Having someone yell at you 24/7 is stressful. Just think how he must feel.", "controversiality": 0, "created_utc": 1364157312, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91n9hq", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jq69", "removal_reason": null, "retrieved_on": 1435562861, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I agree, and I've never claimed to be perfect. That's why I was asking for advice so I can improve the quality of life for both of us. ", "controversiality": 0, "created_utc": 1364159163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91ntig", "link_id": "t3_1ax3t3", "parent_id": "t1_c91n9hq", "removal_reason": null, "retrieved_on": 1431689822, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Afromthehills", "author_flair_css_class": null, "author_flair_text": null, "body": "Try the book \"Scream Free Parenting\" by Hal Edward Runkel. There's also a website: http://www.screamfree.com/site/PageServer. I used the strategies in this book as a high school teacher and plan to use them with my son (now 8 months) as he grows up.", "controversiality": 0, "created_utc": 1364160121, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91o43i", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431689960, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Estecia", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a suggestion. It will take a lot of patience to stop this behavior (on both you and him). Stop yelling, and talk. Say, he doesn't want to have a bath. Sit there and discuss it. Stay absolutely calm, and reasonable and just discuss why he doesn't want to have a bath. Talk to him, heck talk his ear off about the bath. How fun bubbles are, fun toys to bring, temperature of the bath, anything! He will become interested in the bath, and go on his own without a fight.\n\n Sticker rewards are good, but hugs and love may work better. Sounds like a slightly dysfunctional relationship you have, but you can turn it around.\n\nEdit : Get down on his level, don't stand above him and talk. Sit on the floor beside him. Also be absolutely consistent! It's a respect problem. Respect him, and he will respect you. ", "controversiality": 0, "created_utc": 1364161747, "distinguished": null, "downs": 0, "edited": 1364162039, "gilded": 0, "id": "c91oll9", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431690191, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CunningAllusionment", "author_flair_css_class": "purple", "author_flair_text": "2 year old toddler", "body": "[This](http://www.handinhandparenting.org/) site has immensely useful content.", "controversiality": 0, "created_utc": 1364164731, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91pi0i", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431690614, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "miseleigh", "author_flair_css_class": null, "author_flair_text": null, "body": "This sounds a lot like Positive Discipline. You might like that one too.", "controversiality": 0, "created_utc": 1364166981, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91q6wf", "link_id": "t3_1ax3t3", "parent_id": "t1_c91n3he", "removal_reason": null, "retrieved_on": 1431690940, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yaen", "author_flair_css_class": null, "author_flair_text": null, "body": "Kids have no concept of time when they're enjoying themselves. Buy a cheap battery operated timer--the cheap digital kind (maybe make sure the back stays closed with glue or tape). Don't give fifteen minutes warning, that may be too much. Try five, and let him set the timer for five minutes by pressing the button five times. Then set it where he can see it.  He can even hold it. Make sure it's the kind that beeps every time you add a minute though so he can't add more time without you noticing.\n\n\n\nAlso, I'd skip the punishments and stick with verbal praise, with lots of positive attention for stretches of good behavior. Maybe a mother son lunch at his favorite spot or something. I wouldn't make getting them dependent on anything though--just a random \"caught you being kind/responsible\" thing.", "controversiality": 0, "created_utc": 1364167888, "distinguished": null, "downs": 0, "edited": 1364168119, "gilded": 0, "id": "c91qh6d", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431691077, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "Try giving him warnings in smaller increments. We start at 10 minutes, then 5 minutes, then 2 minutes, then it's time. They don't have the concept of time at that age, so you have to break it down even smaller. Better yet, set a timer. When the timer goes off, it's time. \n\nIt's hard, and it's a battle I deal with everyday. It does get easier, just hang on mama!\n\n", "controversiality": 0, "created_utc": 1364168277, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91qlkv", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431691132, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wakawhat", "author_flair_css_class": null, "author_flair_text": null, "body": "Ooh I'll have to look for that one.", "controversiality": 0, "created_utc": 1364169525, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91qzic", "link_id": "t3_1ax3t3", "parent_id": "t1_c91q6wf", "removal_reason": null, "retrieved_on": 1431691318, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zoe_girl", "author_flair_css_class": "lightcoral", "author_flair_text": "3 yr old girl", "body": "Totally saving this thread for future reference for myself.  This sounds like life with my two year old sometimes (except we're not quite to the point where she capable of having a discussion about stuff--gah, it makes me so crazy sometimes).  I have no good advice for you because I could use some myself.  It's hard sometimes, huh?  Internet hugs all around.", "controversiality": 0, "created_utc": 1364170736, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91rcu1", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431691493, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": ":) Best of luck!", "controversiality": 0, "created_utc": 1364173927, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91sdnr", "link_id": "t3_1ax3t3", "parent_id": "t1_c91jr67", "removal_reason": null, "retrieved_on": 1431692042, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I'm really excited to read this book now! It sounds like it's going to help a lot. Thank you so much! ", "controversiality": 0, "created_utc": 1364174928, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91spn0", "link_id": "t3_1ax3t3", "parent_id": "t1_c91n3he", "removal_reason": null, "retrieved_on": 1431692197, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you :)", "controversiality": 0, "created_utc": 1364174938, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91spre", "link_id": "t3_1ax3t3", "parent_id": "t1_c91sdnr", "removal_reason": null, "retrieved_on": 1431692197, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "OMG the story about food just made my night! I'm going to try and make something up like that (on a side note, have you ever thought about what we would sound like to an outsider with no kids? haha they must think we're insane when we do stuff like that! LOL) And I did try the talking with him earlier, I *calmly* took his ball away today because I asked him repeatedly to no throw his ball in the house and he kept doing it, so after a couple minutes of him crying I told him I wanted to talk to him. I said \"I don't like when I have to take your toys away, do you like it?\" he said \"*sniff sniff* no\" I said \"I would much rather let you play with your toys, but you have some rules about them, one is no throwing the ball in the house, do you understand what what means?\" he said \"yes\" I said \"okay, well I'd like to give you the ball back, but remember, no throwing it in the house\" he said \"okay\" and I told him \"I don't like it when we fight, I'd rather us have fun all the time, wouldn't you?\" and he said \"yes\" and I gave him his ball back, he didn't throw it in the house again! So hopefully trying to have small talks with him like that will help. Thank you! ", "controversiality": 0, "created_utc": 1364175225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91st2d", "link_id": "t3_1ax3t3", "parent_id": "t1_c91kgts", "removal_reason": null, "retrieved_on": 1431692241, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you! Sometimes I feel like I am going to go insane! I might invest in a bell because it sounds like it works... anything to make our lives easier is great in my opinion! ", "controversiality": 0, "created_utc": 1364175376, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91suve", "link_id": "t3_1ax3t3", "parent_id": "t1_c91kvni", "removal_reason": null, "retrieved_on": 1431692271, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I like this a lot, I'm going to try and start pointing out the good things he does because it really ISN'T all bad... it just seems like the bad stuff is overshadowing the good right now, and I want something to change so we're both happier :)", "controversiality": 0, "created_utc": 1364175478, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91sw38", "link_id": "t3_1ax3t3", "parent_id": "t1_c91myov", "removal_reason": null, "retrieved_on": 1431692293, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I like the idea of a timer, someone else said to get a bell and ding it when it's time to do something but a timer might work the same and give him more notice. I might even put velcro on it and put a piece of velcro on the wall so we can set it, then put it on the wall. You guys have really given me so many good ideas I really appreciate it!!", "controversiality": 0, "created_utc": 1364175604, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91sxlw", "link_id": "t3_1ax3t3", "parent_id": "t1_c91qh6d", "removal_reason": null, "retrieved_on": 1435562779, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you for the kind words, someone else mentioned the timer thing and I am going to try it out, I really think it will help out a lot with some of the battles! Of course we'll still have some but even if I can eliminate one a day I'm happy (and so is he!) ", "controversiality": 0, "created_utc": 1364175688, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91syl8", "link_id": "t3_1ax3t3", "parent_id": "t1_c91qlkv", "removal_reason": null, "retrieved_on": 1431692337, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mommypooh", "author_flair_css_class": null, "author_flair_text": null, "body": "My biggest advice would be a 15 min warning is far to much.  I give my kids a 5 min warning and then count it down such as okay in 5 min we need to get dressed, Okay 4 more min, Okay 3 more min and we have to get dressed, okay 2 more min, 1 more min and we have to get dressed.  Count down the last 10 seconds and then give them a choice of either two outfits, or a choice of you helping him get dressed or him doing it hisself.  \n\nThis age is alot about choices and I have been known to make one choice something good and the other something they won't want.  Now I did have one child that caught on and was a smart ass and would chose the bad choice.  It will take time.  I will admit I have been a yeller and I have learned not to yell as much.  it is still hard to not do when I get frustrated.  \n\nSet limits and enforce them.  It will get worse before it gets better when you start setting limits but it will make the years easier if you start and stick to it.  I set up a stool in the hall for time out. and there were days in the begining that all I did was take my child back to the stool and I would keep at it til my child sat for the time they needed, then I would bring them out to a chair with me and ask them if they knew why I put them on timeout if they did not know or could not explain it I gave them the words and we talked and then hugged and moved on.  There are still days that I have kids in timeout but then we go weeks without needing it.  \n\nIt is very important especially as a single parent that you set boundaries now.  It will make your life easier as he gets older.  ", "controversiality": 0, "created_utc": 1364175726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91sz2e", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431692337, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I thought 2's were hard but 3's have been MUCH harder for us! He knows he can test his boundaries and he really does! However, my cousin has a 3 year old daughter that's about a month older and she hasn't had any issues like this... maybe you'll luck out! LOL either way there's so many good suggestions on this thread I'm so happy I decided to post it. I was really worried at first and didn't want people to think I was a horrible person, but not everyone is born a super-mom, right? Some, like myself, need to learn the good behaviors! ", "controversiality": 0, "created_utc": 1364175841, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91t0h8", "link_id": "t3_1ax3t3", "parent_id": "t1_c91rcu1", "removal_reason": null, "retrieved_on": 1431692355, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "I'll check that out too! I have lots to read now and I really thank everyone for giving their input! ", "controversiality": 0, "created_utc": 1364175871, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91t0vo", "link_id": "t3_1ax3t3", "parent_id": "t1_c91pi0i", "removal_reason": null, "retrieved_on": 1431692357, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you, it was really hard to admit that I wasn't doing it how I should and I'm really happy I did because I got some amazing ideas for you ladies! I actually tried this tonight at bath time, I said \"okay it's time for a bath\" of course he said \"NO!\" so I just walked into the bathroom and started filling up the tub, and loud enough so he could hear I started saying \"Oh wow, the water is so nice and warm, it feels great! Oh here come the bubbles!\" sure enough he ran right in and started stripping down! It's going to take some times to get into a groove but I think it's very doable. I think a large part of this was just my overall frustration with life right now, but that's not his fault so I need to make sure I'm not taking it out on him. ", "controversiality": 0, "created_utc": 1364176034, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91t2uk", "link_id": "t3_1ax3t3", "parent_id": "t1_c91oll9", "removal_reason": null, "retrieved_on": 1431692380, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you, it's going to be a lot of trial and error, what works for yours might not work for mine. I'm going to start out with a few tips I've gotten here and then change it up if those aren't working. Thanks for your input and good luck with your little ones, too! ", "controversiality": 0, "created_utc": 1364176121, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91t3t4", "link_id": "t3_1ax3t3", "parent_id": "t1_c91mts9", "removal_reason": null, "retrieved_on": 1431692399, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wakawhat", "author_flair_css_class": null, "author_flair_text": null, "body": "You're welcome! I hope it helps!", "controversiality": 0, "created_utc": 1364176412, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91t7il", "link_id": "t3_1ax3t3", "parent_id": "t1_c91spn0", "removal_reason": null, "retrieved_on": 1431692433, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "macadamia_nut", "author_flair_css_class": "green", "author_flair_text": "3 year old boy", "body": "Thank you, as most people have been suggesting I'm going to do a smaller warning like 5 minutes, and try really hard not to yell! I hate it, he hates it, it makes the situation worse... but sometimes it's so hard! But I'm going to really make an effort to try and not yell from now on! ", "controversiality": 0, "created_utc": 1364176424, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91t7oa", "link_id": "t3_1ax3t3", "parent_id": "t1_c91sz2e", "removal_reason": null, "retrieved_on": 1431692441, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Estecia", "author_flair_css_class": null, "author_flair_text": null, "body": "That's fantastic, I'm so happy for you! Take everyday one step at a time and don't be hard on yourself. The fact that you seeked help, makes you an amazing mommy! I'm so glad you came here for advice. I definitely think you need your \"me\" time. I give you great praise for raising your son virtually on your own. Your family needs to step up and help you have your own time. Even an hour or so to go shopping alone, do your nails whatever! You deserve a break too, to be a fresh, energized happy mommy! Makes all the difference in the world for you, and your son.\n\nEdit: typo. On my phone, sorry.\n\nOh and praise, positive reinforcement goes a long way! Clap, cheer whatever. ", "controversiality": 0, "created_utc": 1364179647, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91ua44", "link_id": "t3_1ax3t3", "parent_id": "t1_c91t2uk", "removal_reason": null, "retrieved_on": 1431692935, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "GorramGlob", "author_flair_css_class": null, "author_flair_text": null, "body": "But you wouldn't want to teach him that he can never say no to an adult or an authority figure...", "controversiality": 0, "created_utc": 1364180092, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91ufai", "link_id": "t3_1ax3t3", "parent_id": "t1_c91k4rb", "removal_reason": null, "retrieved_on": 1431693007, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PollyAmory", "author_flair_css_class": null, "author_flair_text": null, "body": "When I was a nanny I had to constantly remind myself to point out the GOOD behaviors and focus less on the BAD behaviors because it's important to pay attention to the kind of behavior you want to see more of.", "controversiality": 0, "created_utc": 1364181834, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91uzdm", "link_id": "t3_1ax3t3", "parent_id": "t1_c91sw38", "removal_reason": null, "retrieved_on": 1431693267, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeeholic15", "author_flair_css_class": null, "author_flair_text": null, "body": "Yay!! I'm glad it worked out and I hope it continues to do so! (Hearing that worked actually made my night as well as set my mind at ease. To be completely honest, that doesn't work with my niece who is 4...however she has MAJOR disciplinary issues so I don't think anything I can do as the aunt who visits occasionally is going to help her much...but now I'm excited to use that method with my daughter who is only 18 months). \n\nHaha I'm glad you liked my story. Yes, a few people have actually commented on my crazy-mommy-ness. They're good friends though, so I don't mind. They'll know someday... :P", "controversiality": 0, "created_utc": 1364184143, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91vp7u", "link_id": "t3_1ax3t3", "parent_id": "t1_c91st2d", "removal_reason": null, "retrieved_on": 1431693628, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CunningAllusionment", "author_flair_css_class": "purple", "author_flair_text": "2 year old toddler", "body": "My wife and I listen to their talks while cleaning etc, they aren't free but they're more than worth it. ", "controversiality": 0, "created_utc": 1364187126, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91wjbz", "link_id": "t3_1ax3t3", "parent_id": "t1_c91t0vo", "removal_reason": null, "retrieved_on": 1431693999, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lindsaychild", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree that 15mins is too long but its a good starting point. You could give a 15mins warning, then 10mins warning, then a 5mins warning. A constant reminder helps as small children often forget of they are ingrossed in something. Also give him a minute to do something before asking again. You wouldn't jump to command so why should he!  ", "controversiality": 0, "created_utc": 1364193016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91xvos", "link_id": "t3_1ax3t3", "parent_id": "t1_c91qh6d", "removal_reason": null, "retrieved_on": 1431694637, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "Don't get frustrated -- do something about it: effect the consequences. He'll figure it out. Examples:\n\nOne thing that worked with my now 2.5-year-old for cleaning is that I'd hand her something and ask her to put it in the specific place (\"Would you please put this in the bin?\" and then thank her when she did it) with each item until I could stop asking and she'd keep going, then I'd periodically thank her and give her a bigger thank-you and a hug at the end. If she didn't, I did it, but she had to stick around. Building bad habits? Not necessarily: if you do it without comment and without giving attention, a kid's natural desire to be involved kicks in and they want to do it too. Works for the laundry too. Now she cleans up all her toys, even those with many pieces, with minimal reminders, and she loads the washers and dryers with me.\n\nThe wonderful thing about getting a kid to eat is that you don't have to do anything. You put food in front of him and take it away when it's time to be done, and he'll figure out that if he doesn't eat, he'll be hungry. In the morning I let my daughter watch TV while I take a shower, and I put her oatmeal in front of her but she's distracted by the TV and doesn't eat much. I do give her a couple of reminders to eat, but only because she does want to eat it and I know it's just distraction. But when it's time to go, I pick up the bowl and put it in the sink, and that's the end of it. If she whines or cries, I explain that I had told her it was time to eat and that I was going to take the bowl in a little bit, and now it's time to go so I had to take the bowl because bowls go in the sink when we're done eating. Then I say it's time to go and put our shoes on, directing her to the next activity.\n\nShoes: Fortunately, my daughter hates going out without her shoes on, so I've only had to carry her to the car about three times in the last month. When I get tired of asking (I'm trying to pare it down to once but I still do it 2-3 times before I remember to shut the fuck up and enforce the consequences so I can stop asking so much), I pick up my things and tell her we're leaving now and she'll have to wait to put her shoes on till we get in the car. Then I pick her up and carry her to the car. Now she usually gets her shoes on when it's time.\n\nOh! another thing about getting ready: when she needs a sweatshirt or coat, I lay it open on the floor in front of her with the collar facing her, and she puts her hands in the sleeves and flips it over her head. She loves to do that, so it makes getting ready easier.\n\nI cannot control my daughter's behavior. I can, however, control my own, and because I'm bigger and stronger, I can enforce consequences when the natural ones are either not quick enough, not strong enough, or too harmful. Toys that don't get picked up get put away where I won't have to put them away again for a while. No shoes? You don't get to walk to the car. No eating? Okay. I don't have to do anything to enforce the consequences of that one.\n\nAll that said, I do think it's important that they feel like they've been heard, so if she's upset I'll agree that it must be upsetting to not be able to walk to the car, but if we don't put our shoes on then we can't walk to the car (in an \"oh darn\" or \"that's the rules\" tone of voice). I say I know she'll put her shoes on next time so that she can walk to the car. And I repeat that until I get bored and find something else to talk about or until she realizes that that's all I'm going to say on the subject and I'm not changing what I'm doing.", "controversiality": 0, "created_utc": 1364198068, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91yo2g", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431695009, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SluiceBox", "author_flair_css_class": null, "author_flair_text": null, "body": "Really great advice!", "controversiality": 0, "created_utc": 1364198663, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c91yqth", "link_id": "t3_1ax3t3", "parent_id": "t1_c91kgts", "removal_reason": null, "retrieved_on": 1431695045, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mommypooh", "author_flair_css_class": null, "author_flair_text": null, "body": "I can totally understand how hard it is not to yell.  The best thing I found for helping me not to yell was even if I started and was mad at myself for yelling I HAD to forgive myself and say I was sorry to my children.  It has helped me to not yell so much, cause I hate to say I was wrong.  Just remember this is a learning process for everyone and just cause you yell one minute does not mean the next you can't turn around and change it.  Don't be too hard on yourself and remember you are learning just as he is learning.  If you ever need to vent message me I am usually around.  ", "controversiality": 0, "created_utc": 1364217255, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c920yfg", "link_id": "t3_1ax3t3", "parent_id": "t1_c91t7oa", "removal_reason": null, "retrieved_on": 1431696146, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeeholic15", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you :)", "controversiality": 0, "created_utc": 1364220340, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c921mdw", "link_id": "t3_1ax3t3", "parent_id": "t1_c91yqth", "removal_reason": null, "retrieved_on": 1431696458, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "orchd84", "author_flair_css_class": null, "author_flair_text": null, "body": "Love and Logic worked wonders for us. We took a class on it offered at a local counseling center, and I also read the book. I was skeptical of some parts of it, but I have to say that it made a HUGE difference! No more fights, power struggles, or tantrums. It is all about giving kids choices and letting them have control within limits (but YOU are really in control because you give the options). I highly recommend it!", "controversiality": 0, "created_utc": 1364226203, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c92393a", "link_id": "t3_1ax3t3", "parent_id": "t3_1ax3t3", "removal_reason": null, "retrieved_on": 1431697394, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}