{"submission": {"author": "Lifeisworthit", "author_created_utc": 1356106488, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9yo84", "created_utc": 1364584391, "domain": "self.Mommit", "edited": 1364925505, "full_link": "https://www.reddit.com/r/Mommit/comments/1b9bk6/please_help_me_with_my_15_month_olds_sleep/", "gilded": 0, "id": "1b9bk6", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 68, "over_18": false, "permalink": "/r/Mommit/comments/1b9bk6/please_help_me_with_my_15_month_olds_sleep/", "retrieved_on": 1412932127, "score": 20, "secure_media_embed": {}, "selftext": "Please help me out.\n\nI have a 15 month old boy, and breastfeeding is going fine. My problem is with **disciplining him, and getting time for myself.**\n\nHe does not like solids much, as he knows that he will get breast milk any time. But not having solids makes him hungry and cranky, and I cannot afford to have him at the breast all the time. I don’t wear him, as I have a bad back. \n\nHe is very clingy, and he wakes up the moment I do, and needs to be carried around after that. Our mornings are a rush, so it is hard to get things done while carrying a big baby around. I pee, poo and brush while holding him and nursing him and that makes him slightly better while saving me time. But I need to cook and pack food too, and I can’t hold him when I do.\n\nHe goes to a daycare from 9 to 6, which is good for my sanity. But the moment I pick him up at 6 PM, he cries for boob, so I nurse him in the car. I suspect that fills him up, so he doesn’t want to eat dinner at all, gets angry and throws food around, till I give up n nurse him. But he nurses for ages, and sometimes he doesn’t fall asleep, so the half hour or one and a half hours I spent awake in bed doing nothing were a waste. \n\nI realized that I can’t have even a little bit of chocolate, or his sleep is affected. Coffee seems okay, the effects do not last as long as for chocolate. I need to throw out the granola bars that I bought without knowing they had chocolate – it is too tempting to have it if it is in sight.\n\nSometimes I make him sleep and change my shirt, and put my old shirt near him. This way I can go finish my task without him waking up. I go in and periodically swap my shirt so that he can still smell me near him.\nMy questions:\n\n\n2.\t**How do I make mealtime easier?** He eats well at the daycare.  Yesterday I drove back home from daycare without nursing him in the car, and he cried murder for a few minutes, and was fine. And we distracted him by taking him to the park afterward, so he was hungry enough at dinner time. I doubt we can take him to the park every day, especially with the crazy weather in my place.\n\n1.\t**How do I make nap times easier?** How can we get him to sleep if I am not around to nurse him? My family is pressuring me to stop breastfeeding since my life now revolves around nursing him, and also since by not sleep training him, I am inconveniencing the rest of my family who have to step in and help. He sleeps at the daycare, because the lady is kind enough to make him sleep on her shoulder, and she’s experienced enough to make it work. In the last two weeks she could transition him from her shoulder to her bed near her, but not to his nap mat. My family has not been able to do it.\n\n3.\tHe is basically clingy because my parents left a fortnight back, and he went nuts at home cause he was always surrounded by people and now there was only me. So he is still clingy and cries when I leave him at the daycare, and cries at home if I am doing something else. **How do Imake him feel more secure?**\n\n4.\tUnrelated to breastfeeding: The daycare provider mixes honey and lemons in his water, to make him drink more water. It is as sweet as lemonade. Should I ask her to dilute it further? I**’m concerned about him having sweets**, but thought honey is good since it is natural, but I’d like it to be in moderation too.\n\n\n\n\n----\n\nUpdate: since he came down with a fever on Friday evening, I've been nursing him kinda non stop and giving him lots of attention. He still is cranky in the morning (and through the night, thats a new problem but hopefully is temporary), but otherwise he's fine, and loving the attention. He even was comfortable to leave my side and go play in the daycare, when I left him. Usually he clings to my side and cries when I leave. I think the loads of attention did go him good for once. I'm going to incorporate all your suggestions in the future. Thanks!\n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Please help me with my 15 month old's sleep troubles, eating, and clinginess. Am at my wits end.", "url": "http://www.reddit.com/r/Mommit/comments/1b9bk6/please_help_me_with_my_15_month_olds_sleep/", "user_reports": []}, "comments": [{"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I've crossposted this from r/breastfeeding.", "controversiality": 0, "created_utc": 1364584410, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94s71t", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431737648, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Boys need there moms emotionally and physically a lot. Yours does sound extreme though. May I ask are you cosleeping? Being separated during daycare hours is emotional difficult for young kids. Boys even more so. As a society we pretend otherwise. Cosleeping during the night can reassure him and build his confidence in you presence. Being in contact during the night might make your days easier on you both because he will feel more secure.", "controversiality": 1, "created_utc": 1364585790, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94snc1", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431737435, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "time to set some rules, and stick to them. get him off milk onto foods. if hes hungry, he will eat. get him somewhere you can put him to sit where he can see you while you do stuff, and do the stuff you need. if he cries, talk to him, reassure him you are there but dont pick him up. i know it seems harsh but its whats got to be done, or you will never get your life back. break the bad habits now. you dont have to take him to the park every day. play at home, go to the store, do something but dont feed him. give him a bottle of water or weak juice if needs be but dont breast feed. I hate to sound horrible but you have to set rules and stick to them. hes safe, you are nearby but you dont have to be holding him. he wont starve, he wont die from exposure. you will have to put him down before he gets so big he hurts to lift. be strong. smile, laugh, sing and carry on. he will get used to it.", "controversiality": 1, "created_utc": 1364587393, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94t6jk", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431737184, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ChronoTriggerHappy", "author_flair_css_class": null, "author_flair_text": null, "body": "I totally agree with everything you said, but my daughter didn't start sleeping through the night until she slept in her own crib AND was weaned off the breast (18 months). I found even though she was with dad while I was at work she was very clingy to nurse and woke up very suddenly if I rolled over in bed and wouldn't go back to sleep until she nursed. So she was only getting 8 hours of sleep at night and maybe 1 or 2 hours of nap (if she would go). This made her very clingy and didn't want to eat much either in the morning. I eventually had to let her cry it out in her crib, but she only cried for 10 minutes the first time. And by day 4 no crying at all. Once she learned to self soothe, she stopped asking for the breast and she weaned herself. Her mood improved and she became a bit more independent (but not distant by any means). She now sleeps 10 or 11 hours a night with no wake ups and naps for 2 or 3 hours (some days she doesn't nap but I think it's due to teething). All babies are different. Cosleeping is awesome and I wouldn't have done it any other way, but by the time she was 16 months old it stopped working for us. Breast feeding is always a tough one too, it's such an amazing thing and some babies don't want to let go. I guess I don't have any actual advice, just sharing my experience. I didn't have any friends who breastfed anywhere near as long as me so I had little advice. 'Throw them in the crib and they'll fall asleep' was the only one and it actually worked, but I know that I got lucky. And I was super lucky she weaned herself. I think she asked for it once (momma, a bub?) and I was like 'no baby, big girls don't bub, want a cup of milk?' And that was the end of it. ", "controversiality": 0, "created_utc": 1364587810, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94tbf7", "link_id": "t3_1b9bk6", "parent_id": "t1_c94snc1", "removal_reason": null, "retrieved_on": 1431737120, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snowellechan77", "author_flair_css_class": null, "author_flair_text": null, "body": "Breastfeeding and being held should never be called bad habits. It is nurturing your child.", "controversiality": 1, "created_utc": 1364589652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94txk8", "link_id": "t3_1b9bk6", "parent_id": "t1_c94t6jk", "removal_reason": null, "retrieved_on": 1431736913, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "unplural", "author_flair_css_class": null, "author_flair_text": null, "body": "they should after the child exits the \"needs-only\" stage and demands it so often that it is affecting the quality of life for the mother. ", "controversiality": 0, "created_utc": 1364590041, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94u28j", "link_id": "t3_1b9bk6", "parent_id": "t1_c94txk8", "removal_reason": null, "retrieved_on": 1431736899, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snowellechan77", "author_flair_css_class": null, "author_flair_text": null, "body": "But milk ideally should make up a good chunk of his calories still and it still carries all the benefits it did for infants. It sounds like she is only feeding him three times a day, which isn't a lot. For the OP, can you get up a bit earlier in the morning? Have a nice snuggles and milk time before starting your day. Then stick baby in the high chair with a solids breakfast while you cook and pack lunches. Don't worry if he won't eat much. For dinner, he might be too tired to eat solid food. Can you offer a snack in the car on the way home and only nurse when you get home? Will someone else take over bedtime after he nurses but doesn't go down? Maybe dad  can rock and snuggle a bit while he drifts off.", "controversiality": 0, "created_utc": 1364590785, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94ub2b", "link_id": "t3_1b9bk6", "parent_id": "t1_c94u28j", "removal_reason": null, "retrieved_on": 1431736652, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "super_bee", "author_flair_css_class": null, "author_flair_text": null, "body": "My doctor says not to give honey under the age of 2 due to risk of botulism.", "controversiality": 0, "created_utc": 1364591471, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94uj08", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431736548, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "He's at daycare from 9 am to 6 pm?", "controversiality": 0, "created_utc": 1364591982, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94uota", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431736473, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "holding a child every second of the day is not good for them. they need to be put down to learn to explore, to examine thir surroundings, to learn the limitations of social interractions. by holding that child every second you are teaching them to be clingy. to breast feed them when you know its insufficient for their needs because they are cranky and unsatisfied, and temporary filling them so they dont get the sustenance from eating solids, then yes i would call it a bad habit. the child is no longer a baby, it needs to learn to explore, socialise and eat for the sake of its development.", "controversiality": 1, "created_utc": 1364592311, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94usht", "link_id": "t3_1b9bk6", "parent_id": "t1_c94txk8", "removal_reason": null, "retrieved_on": 1431736424, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "This.", "controversiality": 0, "created_utc": 1364592330, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94uspn", "link_id": "t3_1b9bk6", "parent_id": "t1_c94txk8", "removal_reason": null, "retrieved_on": 1431736421, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "But this kid is, if I read the post right, in day care from 9 am to 6 pm.  He's trying to get a whole day's worth of mommy time out of a couple of hours in the morning and before bedtime.  I bet his demands would actually decrease substantially if she were to pull him from daycare or reduce his time there to half days (assuming she is able to do that, of course).", "controversiality": 0, "created_utc": 1364592760, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94uxiw", "link_id": "t3_1b9bk6", "parent_id": "t1_c94u28j", "removal_reason": null, "retrieved_on": 1431736358, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "technokitty", "author_flair_css_class": null, "author_flair_text": null, "body": "Omg, you sound exactly like me! My 15 month old is almost exactly the same. \n\nEatings been super difficult, but I've found out some things that worked for me. I chew up whatever I'm eating till its kinda puréed, then spit. It onto my finger and hell eat that. I've also taken bananas, frozen strawberries and milk, mixed them in a blender and let him practice drinking that from a straw. I've been putting ice cold water into a sippy cup for him and have him drink that any time he's thirsty. It's gotten to the point where he only nurses when he naps or is cranky. I also give him boiled carrot strips which he seems to like. Give him food he can experiment with, like boiled broccoli, carrots, or other soft but firm foods. Let him learn food is fun, and he'll enjoy eating. Remember that kids this age are picky eaters, so don't get stressed if he doesn't eat a lot everyday. besides, he's still getting nourishment from breastfeeding so it's not the end of the world if he doesn't eat more than a bite of solids a day. You can also make freeze pops of the fruit smoothie thing I mentioned earlier for him to suck on if his teeth hurt too bad from teething. You can even pump breast milk and make the Popsicles out of that. Walmart is selling the freeze pop makers for like $3 right now. My son loves them.\n\nI still haven't figured the nap thing. I basically set up a laptop next to my bed and surf the web while he naps on me. I've changed his sleeping schedule from Awake 2hrs &gt; Nap &gt; Awake 3hrs &gt; Nap &gt; Awake 4hrs &gt; Bed to Awake 2hrs &gt; Nap &gt; Awake 3hrs &gt; Nursing Session &gt; Awake 4hrs &gt; Bed which has helped cut back on how long I'm stuck in bed, but on days where his teeth are killing him I go back to the old nap schedule. \n\nMy sons super clingy now too. It's just the age they're at. Not much you can do but get through it. Remember that he nurses for comfort too, and sometimes uses it as reassurance that you're there for him and that everything is okay. It'll go away eventually, and when it's gone you'll miss it, but for now just power through. If I have to do dishes, or make dinner, I put him in his high chair, give him a spatula, and sing to him. Sometimes it doesn't work and he still cries. Just calmly explain that you're doing something that has to be done and hell have to wait. Babies/toddlers cry. It sucks, but just give him a big hug whenever you can, but be firm about him having to wait. \n\nI would tell her you're uncomfortable with how sweet it is, and ask she just give him plain water. \n\nAbove all, don't let people pressure you into quitting breastfeeding if you don't want to. It's great for you and him, and it'll help you both a lot in the long run.\n\nI have to go but feel free to pm me if you need anymore help.", "controversiality": 0, "created_utc": 1364595179, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94vnsj", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431736014, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you pump and start giving him bottles?", "controversiality": 1, "created_utc": 1364596468, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94w1es", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431735836, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "allididwasdie", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly what I was thinking. I work part time and my daughter is clingy and nurses constantly on the four days a week I am gone for 6 or 7 hours to make up for lost time, and she is almost 2", "controversiality": 0, "created_utc": 1364596726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94w42v", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uxiw", "removal_reason": null, "retrieved_on": 1431735801, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alpacathecamel", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously, they barely need solids at this point. My son still had days when he refused all solids at 17 months. He weighed 34 pounds at that point. Breast milk can easily still be the majority of calories at this child's age if the mom is willing.", "controversiality": 1, "created_utc": 1364597225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94w9bx", "link_id": "t3_1b9bk6", "parent_id": "t1_c94usht", "removal_reason": null, "retrieved_on": 1431735732, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thaen", "author_flair_css_class": null, "author_flair_text": null, "body": "If he eats well at day care but not at home, you can be absolutely certain that he is manipulating you. As dawnichu says, set rules, stick by them. He will hate it, it will suck, but it will get better.\n\nNaps are hard for kids no matter what, but cry-it-out is the final word in sleepy time for kids in terms of rule-setting. Baby/toddler/child sleep Sucks for everyone.\n\nHe will feel more secure as he gets older and learns to be more secure. There's no getting around this -- he has to learn to be on his own. Start at home by leaving him to play on his own. Keep taking him to daycare -- kids being clingy and whiney when they are dropped off for daycare is normal.\n\nHoney is not recommended for kids under 2 by the American Association of Pediatricians. Give him water when he's thirsty, milk when he's hungry. He's old enough to take whole cow's milk instead of breast milk when he needs food or a bottle, so if you want to partly replace the boob with the bottle that would be one way, so long as he's also getting a multivitamin (iron).\n\nWeaning is hard. Sleep is hard. Kids are hard. But at his age, he's no longer a baby, he's a little boy. Treat him like one: Treat him with respect. Respect his ability to learn and to cope on his own.", "controversiality": 1, "created_utc": 1364599385, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94wvo6", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431735440, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gammaover", "author_flair_css_class": null, "author_flair_text": null, "body": "Could he be teething? My daughter is exhibiting most of this signs right now. She's cutting her first molars as we speak. I kept wondering why she was acting so nutty, until I felt inside and found a sharp bit popping through. ", "controversiality": 0, "created_utc": 1364601498, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94xh9d", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431735157, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thelmick", "author_flair_css_class": "green", "author_flair_text": "Wesley &amp; Charlie's Mom", "body": "My doctor said it was ok after 1 year. I've also seen 1 year on a lot of [websites](http://www.babycenter.com/408_when-can-my-baby-eat-honey_1368490.bc).", "controversiality": 0, "created_utc": 1364602278, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94xpbq", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uj08", "removal_reason": null, "retrieved_on": 1431735051, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "milk_mama", "author_flair_css_class": "green", "author_flair_text": "15 months and counting", "body": "Mine only says not to give honey under one.", "controversiality": 0, "created_utc": 1364602437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94xqvy", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uj08", "removal_reason": null, "retrieved_on": 1431735031, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't mention weaning. I suggested cosleeping for additional feelings of security for the child. Every child is different and it sounds thine ops child needs a little more cuddly lovey time than many. Sleep time makes that easy leaving days open for shorter cuddles and less need to cling. I wouldn't have traded my cosleeping and nursing years for extra sleep. These have been the sweetest moments of my life.  Sorry you didn't have the support you needed. ", "controversiality": 0, "created_utc": 1364602815, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94xupu", "link_id": "t3_1b9bk6", "parent_id": "t1_c94tbf7", "removal_reason": null, "retrieved_on": 1431734982, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thelmick", "author_flair_css_class": "green", "author_flair_text": "Wesley &amp; Charlie's Mom", "body": "I would suggest a more solid routine. Children need structure so they can predict what is going to happen. Only allow nursing at specific times of day for specific durations. Offer food at specific times of day for specific times. \n\nDon't worry about him not getting enough food, he will eat when he is hungry. If he isn't interested in what you are offering, he doesn't get anything else. They need to learn that. Throwing food around is pretty normal at 15 months old. Just stay consistent in telling him that it isn't nice to throw food. If he continues after a few warning, take it away.\n\nAgain, for naps you need a schedule. Put him in his crib at the same time everyday. Allow him to sleep as long as he wants, but keep the routine the same. If he doesn't sleep, leave him in there for a specific duration just for quiet time. Since there isn't really a routine set right now, he may cry. There are various ways to handle it. I used the cry it out method, but some people can't handle it.\n\nYou may want to see if he can get attached to a stuffed animal or special blanket. Have it with him always. It might not work at this age, usually you introduce something like this earlier. This will help with security.\n\nAdding honey to water is no different then offering natural juice. I'm not sure why they are *making* him drink water. When he is thirsty he will drink. The added sugar isn't good for him.\n\nChildren are very good about regulating things like eating, drinking and sleeping, but they need routine. A break in that routine will cause a meltdown. That's why children do so well in structured daycare, they do the same things, the same way, at the same times each day.\n\n", "controversiality": 0, "created_utc": 1364603296, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94xzny", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431734916, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "Attributing clinginess to time in daycare makes no sense - many kids go through a clingy stage at this age regardless of how much they are separated from their parents. Mine were super clingy at this age (wouldn't let me put them down for an instant!) even though I was home ALL day.", "controversiality": 1, "created_utc": 1364604624, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94yd5j", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uxiw", "removal_reason": null, "retrieved_on": 1431734740, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1364610530, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c94zzsq", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431733902, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "3893liebt3512", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you got downvotes here because you said \n\n&gt;if the mom is willing.\n\nThere are lots of other reasons why children at the age of 17 months can't use breast milk as their main form of sustenance besides an unwilling parent. That was kind of an insensitive comment to make. \n\nEdit: Can I also get a source for \"They barely need solids at this point\"? I really find that hard to believe, and would like to read the study on it, since I couldn't find anything when I googled. ", "controversiality": 0, "created_utc": 1364615454, "distinguished": null, "downs": 0, "edited": 1364615810, "gilded": 0, "id": "c951c7t", "link_id": "t3_1b9bk6", "parent_id": "t1_c94w9bx", "removal_reason": null, "retrieved_on": 1431733267, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "My 2.5 year old was (is still, sometimes) a lot like this. She has a developmental disorder. Do you have any concerns of that nature for your son? My daughter didn't start eating solids around that age because of sensory problems, plus, hey, she just loves milk. It's the most nutritional food anyway. \n\nYou said your parents just left. Sounds like he just needs some time to settle in to the changes. I suggest making him a big schedule with Velcro pictures or something so he knows what is coming up next. This has helped my daughter feel more secure by knowing what to expect and what's expected of her. This might also help since he's too little to say much but can see the pictures. \n\nIf you've been breastfeeding this long you obviously understand the importance of it. Don't try to wean now, especially when he's telling you how badly he needs it right now. I had a very difficult time getting my daughter to cut back on nursing and only did so because the new baby takes up most of the time at the breast. Put nursing times down on your schedule so he can see what times are for nursing and what times are for other things. \n\nIs dad in the picture? Having my daughter slowly grow a stronger attachment to her father helped take some of the pressure off of me, but it was slow going. \n\nI've been there. I'm still there often. Just remind yourself when it gets hard that he doesn't just want you, he NEEDS you. He's just in a tough spot right now and it will pass. ", "controversiality": 0, "created_utc": 1364615996, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c951his", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431733198, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Nursing is still very important and beneficial at this age, nutritionally and emotionally. And the \"if he's hungry enough he'll eat\" thing isn't always true. It wasn't for my family. \n\nCutting off breast feeding when her child is obviously struggling is pretty much the wise thing she could do right now. Cutting back, yes, cutting off, no. ", "controversiality": 0, "created_utc": 1364616228, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c951jq8", "link_id": "t3_1b9bk6", "parent_id": "t1_c94t6jk", "removal_reason": null, "retrieved_on": 1431733169, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Insufficient? My daughter thrived on nothing but breast milk long after a year old, and until they're two years old breastmilk should be a large part of their daily calories. My 2.5 year old still goes sine days where she barely eats anything and mostly nurses.  ", "controversiality": 0, "created_utc": 1364616414, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c951lj4", "link_id": "t3_1b9bk6", "parent_id": "t1_c94usht", "removal_reason": null, "retrieved_on": 1431733145, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "I would trade hours of sleep every night to give my child snuggles and milk throughout the night. Sounds like this boy misses mommy and just needs some time to snuggle and adjust to life changes. ", "controversiality": 0, "created_utc": 1364616530, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c951mlz", "link_id": "t3_1b9bk6", "parent_id": "t1_c94xupu", "removal_reason": null, "retrieved_on": 1431733131, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "The spit thing sounds gross but my daughter wouldn't easy purees and was very late getting teeth so I did it too. It encouraged her to eat what the family was eating. ", "controversiality": 0, "created_utc": 1364616615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c951ngg", "link_id": "t3_1b9bk6", "parent_id": "t1_c94vnsj", "removal_reason": null, "retrieved_on": 1431733120, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "technokitty", "author_flair_css_class": null, "author_flair_text": null, "body": "It also dilutes the taste of what you're eating so it's not so harsh on your babies taste buds.", "controversiality": 0, "created_utc": 1364619432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c952dj9", "link_id": "t3_1b9bk6", "parent_id": "t1_c951ngg", "removal_reason": null, "retrieved_on": 1431732778, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Junieunieaa", "author_flair_css_class": null, "author_flair_text": null, "body": "Just so you know the bacteria in your mouth is very different than that of a small child's and by putting anything in your mouth then into the child's you can cause tooth decay which can be serious enough to cause infection, or as some people call it \"bottle rot\", and may require your child to get fake teeth. Might I suggest a food processor, baby bullet, or blender. You are not a bird. ", "controversiality": 0, "created_utc": 1364623877, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c953d3k", "link_id": "t3_1b9bk6", "parent_id": "t1_c94vnsj", "removal_reason": null, "retrieved_on": 1431732314, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "technokitty", "author_flair_css_class": null, "author_flair_text": null, "body": "Source and studies to back that up?\n\n\"According to research led by Gretel Pelto, an anthropologist at Cornell University, pre-mastication was the solution to feeding infants during this interim period for most of human history, and remains the method used in many cultures today. Rather than being unhygienic, Pelto and many other scientists think the feeding method carries on the immune-system-building process that begins with breastfeeding. By exposing infants to traces of disease pathogens present in a mother's saliva, it gears up their production of antibodies, teaching their immune systems how to deal with those same pathogens later.\"\n\nTL;DR: \"The act exposes infants to their mothers' saliva, giving them an immune system boost that they can't get from the sterile, pulverized baby food bought in stores.\"\n\n[Source](http://www.livescience.com/19435-pre-chew-baby-food.html)\n\nI could quote more science blogs, but that was the first that came up.", "controversiality": 0, "created_utc": 1364626788, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c953vzt", "link_id": "t3_1b9bk6", "parent_id": "t1_c953d3k", "removal_reason": null, "retrieved_on": 1431732066, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "1.  He should not be having sugared drinks (*honey counts as sugar*).  At this age, he should only have milk or water (these are Australian recommendations).  Not fruit juice, not watered down juice, nothing sweetened.  \n\n2.  Whole fruit is of course fine.  If he likes the sweetness of fruit, he'll work to eat it as solid foods.\n\n3.  My daughter was also very very clingy to that age, she also went to daycare, but it was from about that age (or a month or so earlier) she started to get MUCH easier.  Trust me that there is light ahead.  I have no idea why she would have been insecure - it started around 7-8 months when I was on maternity leave, well before daycare.  She was breastfed on demand (still is) and I carried her everywhere (which has wrecked my back!)\n\n*Some children are just more needy.  Most grow out of it.*\n\n4.  Nap times I still struggle with.  She goes down fine at daycare, at home she only naps in the car pretty much.", "controversiality": 0, "created_utc": 1364627786, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9541o2", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431731992, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Junieunieaa", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know how to create a snazzy link from my phone but here is one source:\n\nhttp://www.mouthhealthy.org/az-topics/b/baby-bottle-tooth-decay.aspx\n\nI am, however, not interested in a debate, I know of a few children that have had to have all teeth replaced because of this, and it was painful and expensive. Just trying to help. You are a loving parent, like myself, and are welcome to parent as you deem fit. :) I wish you and your child all the best. I feel as though science and technology has progressed to our benefit in this case (food processors) and many woman continue to breastfeed into the childhood years. I also do not see a reference to the oral health of people practicing this method of feeding, but again do as you deem fit. ", "controversiality": 0, "created_utc": 1364640355, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c955ec5", "link_id": "t3_1b9bk6", "parent_id": "t1_c953vzt", "removal_reason": null, "retrieved_on": 1431731355, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ChronoTriggerHappy", "author_flair_css_class": null, "author_flair_text": null, "body": "I totally agree that they were the sweetest time! I probably wouldn't have stopped if it weren't for her sleeping habits. I couldn't have cared less if I got 4 hours of sleep but the fact that at 16 months she was only getting 8 hours of sleep worried me. I'm not sure if it was hubby waking her or me or because our bed was old but she did not like to sleep in there. She is also in the 97th percentile for height so it may have been that she actually felt too big to sleep with us, she's taller then some three year olds. The weaning came naturally and I actually got post partum depression from it! I think sleep is the hardest thing about babies. Breast feeding is hard sometimes too but I have never stressed so much in my life trying to get that lady to sleep! ", "controversiality": 0, "created_utc": 1364643087, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c955n3a", "link_id": "t3_1b9bk6", "parent_id": "t1_c94xupu", "removal_reason": null, "retrieved_on": 1431731242, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Cellysta", "author_flair_css_class": null, "author_flair_text": null, "body": "7-8 months and still on maternity leave? Damn, I need to move to Australia!", "controversiality": 0, "created_utc": 1364657810, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9582ob", "link_id": "t3_1b9bk6", "parent_id": "t1_c9541o2", "removal_reason": null, "retrieved_on": 1431730023, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Brownslegend", "author_flair_css_class": null, "author_flair_text": null, "body": "You may think you're damaging him by letting him cry a little bit when you need to get your things done in the morning, or that he'll starve if you don't breast feed him. Its probably going to be more damaging if you give in to his every want. At 15 months you need to set some boundaries. He will try to tow the line but he will at least learn where the line is. If you let him he will learn that screaming bloody murder gets him what he wants. Start making the rules now, otherwise you have a rough couple of years ahead of you. ", "controversiality": 0, "created_utc": 1364658614, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9589s8", "link_id": "t3_1b9bk6", "parent_id": "t3_1b9bk6", "removal_reason": null, "retrieved_on": 1431729930, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "allididwasdie", "author_flair_css_class": null, "author_flair_text": null, "body": "Babies should be fed almost entirely milk for 12 months, how on earth can they adjust to almost entirely solids within three months?", "controversiality": 0, "created_utc": 1364659020, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c958ddq", "link_id": "t3_1b9bk6", "parent_id": "t1_c951c7t", "removal_reason": null, "retrieved_on": 1431729882, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "allididwasdie", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine said 18 months, just to throw that in there", "controversiality": 0, "created_utc": 1364659099, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c958e50", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uj08", "removal_reason": null, "retrieved_on": 1431729872, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": " No kidding!", "controversiality": 0, "created_utc": 1364661204, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c958xk8", "link_id": "t3_1b9bk6", "parent_id": "t1_c958ddq", "removal_reason": null, "retrieved_on": 1431729619, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like you did the right thing.  Adequate sleep is really essential, and it's been a struggle in our family too (these days, it's the grownups).", "controversiality": 0, "created_utc": 1364661389, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c958zd6", "link_id": "t3_1b9bk6", "parent_id": "t1_c955n3a", "removal_reason": null, "retrieved_on": 1431729595, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alpacathecamel", "author_flair_css_class": null, "author_flair_text": null, "body": "It does sound insensitive.  I really meant it more like, if the mother wants to.  It is time consuming, and I don't blame moms who don't want to continue to nurse on demand with older kids.  \n\nMy \"barely needs solids at this point\" is really my own experience with my oldest child. I talked to our pediatrician, my midwife, several La Leche League leaders, and several message boards.  Not a research study, I know, but I was just doing it for myself.  I offered my son all kinds of food all the time, but he just wasn't interested and of course, by 17 months I was getting anxious about it.  Everyone I talked to seemed to agree that since he was off the charts for height and weight, developing normally, and healthy that there was nothing to worry about.  \n\nMy second son is now 14 months and he is also off the charts for height and weight.  He eats more solids than my first at this age, but he is still certainly getting the majority of his calories from breastmilk.  So that info is just my experience plus the viewpoint of everyone I consulted about it, some professional, some not.", "controversiality": 0, "created_utc": 1364700468, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c95jkqg", "link_id": "t3_1b9bk6", "parent_id": "t1_c951c7t", "removal_reason": null, "retrieved_on": 1431724534, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed. :)", "controversiality": 0, "created_utc": 1364755902, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c95u9vw", "link_id": "t3_1b9bk6", "parent_id": "t1_c951mlz", "removal_reason": null, "retrieved_on": 1431719347, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "On some days, playing at home just isn't enough. But I'll try my best.\n\nI'm going to go against popular advice and nurse him for a few minutes in the morning before or during my chores, hopefully it would set the right mood for the rest of his day, and I can start being strict after that.", "controversiality": 0, "created_utc": 1364925632, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c972wwg", "link_id": "t3_1b9bk6", "parent_id": "t1_c94t6jk", "removal_reason": null, "retrieved_on": 1431698015, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm job hunting at the moment, but can't even make a phone call when Master Clingy is nearby. I need to send him to the daycare.\n\nHe does nurse through out the night, and that should make up for missing me through the day... but he doesn't think so.", "controversiality": 0, "created_utc": 1364925698, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c972xr6", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uxiw", "removal_reason": null, "retrieved_on": 1431698004, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't count how many times I feed him, but it might be more than eight. Yeah, I should set an alarm, get up half an hour earlier, drink lots of water and nurse him. He hates being in the chair when we're not nearby, I don't know how to make it work.\n\nMaybe i'll move the highchair around, in such a way that he can see me working. Thing is, he takes a long time to rouse from sleep, and wants to spend that time on our shoulders. The grandparents spoiled him. He would hate being in the high chair in the morning. Should make it work somehow.", "controversiality": 0, "created_utc": 1364926002, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9731tl", "link_id": "t3_1b9bk6", "parent_id": "t1_c94ub2b", "removal_reason": null, "retrieved_on": 1431697951, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks, I'm looking for a stuffed toy to become his lovey.\n\nHe went from loving water to not drink water. At. All. \n\nHe was dehydrated yesterday and i had to give him Pedialyte. I hope it is just a phase, my neice went through something similar.", "controversiality": 0, "created_utc": 1364926295, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9735pa", "link_id": "t3_1b9bk6", "parent_id": "t1_c94xzny", "removal_reason": null, "retrieved_on": 1431697900, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine says after 1 year is fine, just limit it to a teaspoon.", "controversiality": 0, "created_utc": 1364926316, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c97360g", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uj08", "removal_reason": null, "retrieved_on": 1431697896, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have the source right now, but I've read too, about cavities being contagious, especially if the baby is 7 - 24 months old. I'm also thinking that, since dental health is not what it was in prehistoric times, with more malocclusions and cavities in adults (possibly due to lesser breastfeeding), maybe present day humans are more at risk for cavities, and carry different oral flora than our prehistoric counterparts.", "controversiality": 0, "created_utc": 1364926530, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9738ut", "link_id": "t3_1b9bk6", "parent_id": "t1_c953vzt", "removal_reason": null, "retrieved_on": 1431697787, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine always preferred warm water in his sippy cup, like breastmilk. \n\nI could try cold water to see if he likes it.\n\nYesterday he loved to have cooked green beans, uncut so it was easier to grasp for him. He is fickle and changes his preferences very soon, so that I'm mostly caught unawares and there's nothing else in the house that he'd like. Or he likes what I cook but only in a tiny quantity. \n\nReminds me, I need to be consistent applying his gum-omile oil, and maybe he'd eat better.\n\nThanks for all the help, will PM if I want more!", "controversiality": 0, "created_utc": 1364926818, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973cpg", "link_id": "t3_1b9bk6", "parent_id": "t1_c94vnsj", "removal_reason": null, "retrieved_on": 1431697736, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "We co-sleep and nurse on demand. He is still missing his grandparents.", "controversiality": 0, "created_utc": 1364926910, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973dyz", "link_id": "t3_1b9bk6", "parent_id": "t1_c94snc1", "removal_reason": null, "retrieved_on": 1431697720, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel the same way, but I need to be rested and well to take care of him, plus attend to my other duties as well. \n\nThankfully, his recent bout of the stomach bug made us closer as we practically did nothing but nurse, cuddle and play. Someone mentioned on my post in /r/breastfeeding that I could let him play by himself, then periodically go cuddle or play with him every ten minutes so that he doesn't feel alone. I think I'll do that. It seemed to work yesterday.", "controversiality": 0, "created_utc": 1364927094, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973ggk", "link_id": "t3_1b9bk6", "parent_id": "t1_c951mlz", "removal_reason": null, "retrieved_on": 1431697688, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "He's teething on and off, sometimes he has symptoms for months before a tooth erupts, for eg his first tooth. I should just apply his teething oil regularly regardless of teething.", "controversiality": 0, "created_utc": 1364927186, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973hog", "link_id": "t3_1b9bk6", "parent_id": "t1_c94xh9d", "removal_reason": null, "retrieved_on": 1431697672, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "controversiality": 0, "created_utc": 1364927217, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973i4n", "link_id": "t3_1b9bk6", "parent_id": "t1_c9541o2", "removal_reason": null, "retrieved_on": 1431697666, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "He is fine for his age. \n\nI doubt he'll understand the schedule right away? But might in some time, it is a good idea. \n\nDad isn't in the picture. My bro helps out, I could request him to play more with my son.\n\n", "controversiality": 0, "created_utc": 1364927309, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973jdq", "link_id": "t3_1b9bk6", "parent_id": "t1_c951his", "removal_reason": null, "retrieved_on": 1431697649, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I do let him cry if nothing else works, but I prefer a compromise if possible.", "controversiality": 0, "created_utc": 1364927338, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973jsa", "link_id": "t3_1b9bk6", "parent_id": "t1_c9589s8", "removal_reason": null, "retrieved_on": 1431697644, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "He is, wonder why you are downvoted.", "controversiality": 0, "created_utc": 1364927358, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973k2a", "link_id": "t3_1b9bk6", "parent_id": "t1_c94uota", "removal_reason": null, "retrieved_on": 1431697640, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "Did he just start the day care a few weeks (?) ago when your family left, or was he going there then, too?", "controversiality": 0, "created_utc": 1364927564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c973mwd", "link_id": "t3_1b9bk6", "parent_id": "t1_c973k2a", "removal_reason": null, "retrieved_on": 1431697603, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "He started after they left, so it was  very trying for him.", "controversiality": 0, "created_utc": 1364928898, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9745qw", "link_id": "t3_1b9bk6", "parent_id": "t1_c973mwd", "removal_reason": null, "retrieved_on": 1431697357, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DevonianAge", "author_flair_css_class": null, "author_flair_text": null, "body": "So this sounds like a transition thing for him.  Can you tell that he remembers/misses them?  Maybe he's afraid you'll leave too?  I know he's just a little guy, but have you tried talking about this to him?  The fact that they left because they were relatives, but that you won't ever leave because you're the mommy?", "controversiality": 0, "created_utc": 1364929441, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c974d9b", "link_id": "t3_1b9bk6", "parent_id": "t1_c9745qw", "removal_reason": null, "retrieved_on": 1431697259, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snowellechan77", "author_flair_css_class": null, "author_flair_text": null, "body": "Well if he doesn't like it, then it might not be a good strategy. My kid is a little younger and not quite as clingy but we've been waking up a bit earlier and snuggling and nursing in bed for a while before getting up. He seems to be the most independent while I make the breakfasts and lunches if we've had a reconnect time after sleeping. If he gets clingy, I send him in the bathroom to pest his father on the pot. Could you do a back carry in a baby carrier? It is just like wearing a backpack and most of the weight is on your hips if it is a soft structured carrier or mei tai type.", "controversiality": 0, "created_utc": 1364929649, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c974g4l", "link_id": "t3_1b9bk6", "parent_id": "t1_c9731tl", "removal_reason": null, "retrieved_on": 1431697220, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, probably too young for a schedule. I was just thinking of what's helped us. [: ", "controversiality": 0, "created_utc": 1364935441, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c976qzm", "link_id": "t3_1b9bk6", "parent_id": "t1_c973jdq", "removal_reason": null, "retrieved_on": 1431696136, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "barbedwire_blowjob", "author_flair_css_class": null, "author_flair_text": null, "body": "That's kind of what I do when my two year old is at school. I give my seven month old an area to play in for five or ten minutes, come in and snuggle and play for a minute, then go back to the house work/cooking. I switch the area occasionally and only do two or three cycles of this before I start holding/wearing, nursing, or napping him again. \n\nI usually put him where we can watch what each other are doing, but once or twice a day I put him alone in the playroom to explore independently. If he starts whining a bit, he's finished. ", "controversiality": 0, "created_utc": 1364935838, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c976ws9", "link_id": "t3_1b9bk6", "parent_id": "t1_c973ggk", "removal_reason": null, "retrieved_on": 1431696060, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I tried a mei tai, but it was hard on my shoulders, so I returned it. I also returned the Becco that I ordered, it was very comfortable but bulky. By carrying him on my hips, I could put him down and pick him up anytime. A baby carrier is not as easy.", "controversiality": 0, "created_utc": 1365072722, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c989up0", "link_id": "t3_1b9bk6", "parent_id": "t1_c974g4l", "removal_reason": null, "retrieved_on": 1431677353, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lifeisworthit", "author_flair_css_class": null, "author_flair_text": null, "body": "I will do that :-)", "controversiality": 0, "created_utc": 1365072942, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c989vo2", "link_id": "t3_1b9bk6", "parent_id": "t1_c974d9b", "removal_reason": null, "retrieved_on": 1431677340, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snowellechan77", "author_flair_css_class": null, "author_flair_text": null, "body": "Is he taking the changes ok so far? What have you tried?", "controversiality": 0, "created_utc": 1365079419, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c98avr0", "link_id": "t3_1b9bk6", "parent_id": "t1_c989up0", "removal_reason": null, "retrieved_on": 1431676868, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snowellechan77", "author_flair_css_class": null, "author_flair_text": null, "body": "I forgot another pain free suggestion, music! I often put on some Raffi in the morning and kiddo disappears into his room for an hour to mess with his toys and talk to himself.", "controversiality": 0, "created_utc": 1365079906, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c98azcs", "link_id": "t3_1b9bk6", "parent_id": "t1_c989up0", "removal_reason": null, "retrieved_on": 1431676821, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}