{"submission": {"author": "we_built_turd_city", "author_created_utc": 1357061197, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_a2dxp", "created_utc": 1366726073, "domain": "self.Mommit", "edited": 1366767339, "full_link": "https://www.reddit.com/r/Mommit/comments/1cxp56/how_do_other_moms_curb_the_neverending_mom_guilt/", "gilded": 0, "id": "1cxp56", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 62, "over_18": false, "permalink": "/r/Mommit/comments/1cxp56/how_do_other_moms_curb_the_neverending_mom_guilt/", "retrieved_on": 1412716291, "score": 55, "secure_media_embed": {}, "selftext": "I know it's all societal and/or self-imposed, but I'm really struggling with it as a first time Mom and first time at-home parent.\n\nGuilt I'm not working. Guilt if I DO. Guilt if I turn on the TV. Guilt if I don't feed my son enough vegetables. Guilt I don't LOVE staying home with him.\n\nIt seems never ending. Any other Moms feel bogged down by guilt? And if not- how did you work past it?\n\nEdit: A lot of you have mentioned that society and the Moms who seem to \"have it all together\" have put this pressure on me. But honestly I really think it is self-imposed. I don't compare myself to other Moms really...I just really want to do a great job. I think most of my guilt comes from not really liking being a stay-at-home Mom. I feel guilty that I don't like it because so many Moms wish they could be home raising their kids (or think they do at least) but can't because of financial reasons.\n\nAnyway, thank you all so much for the advice and reassurance. I think I need to talk to adults more often!", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How do other Moms curb the neverending Mom guilt?", "url": "http://www.reddit.com/r/Mommit/comments/1cxp56/how_do_other_moms_curb_the_neverending_mom_guilt/", "user_reports": []}, "comments": [{"archived": true, "author": "megankoch", "author_flair_css_class": "purple", "author_flair_text": "B/G Twins (5), Girl (2)", "body": "I guess I don't really have mom guilt. I don't love staying home (I work part time), and I have the tv on all day. Sometimes I get drive thru for dinner just to make it through the evening and get to bed time. All of the guilt comes from the opinions of others. You just have to trust yourself and forget about what other moms do and say. ", "controversiality": 0, "created_utc": 1366726828, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kxyvi", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431458114, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Beersyummy", "author_flair_css_class": null, "author_flair_text": null, "body": "I struggled big time with this at first. Right now, I'm feeling much better, but I'm sure at points it will come creeping back in. What's been huge for me is talking with other moms and seeing that they're feeling the same things, even those that are in opposite situations than mine. Stay at home moms are feeling guilty for not working, working moms are feeling guilty for not staying home. So, really no matter what you do, you can beat yourself about it all day long.\n\nBut, I'm working on concentrating on all the good things I'm doing, and that really so much of life is out of our hands, so I need to find the balance  between doing what I can and letting the rest go. Also, I try to have a sense of humor about it all, and strike a good balance. Yes, you don't want to plop your kid in front of the TV all day, but if they watch a bit at Grandma's house, they truly will not spontaneously combust. Also true that if my kid spends a bit more time one day than normal in the bouncy chair, or if he's at daycare 20 extra minutes. It's all going to fine, seriously. ", "controversiality": 0, "created_utc": 1366727389, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ky59n", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431458030, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/19/12", "body": "Well, it sounds like you've been dealing with it longer than me (4 months last Friday) but I definitely have it too! I'm a pretty analytical sort, so when I start with the guilt, I try to ask myself some questions. Why exactly do I feel guilty about X? What am I afraid will happen? Are any of the other options I have better? \n\nJust pinning down the amorphous fear that leads to guilt often helps, because I can see it's usually silly (no, she's not going to get ADHD because I let her watch TV to distract her from screaming). If I still feel bad, I can then know that there's really nothing else to be done or, sometimes, I realize I could be doing something different and change it. Either way, helps me let go of the guilt trip! And sometimes I just need to talk to my husband and he'll laugh at me and bring me back down to earth from whatever worry tizzy I've spiralled myself into.", "controversiality": 0, "created_utc": 1366728163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kye9k", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457913, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Where you raised in a house hold of guilt? Religion sometimes can have that effect on people. The Christian religion is all about guilting people. \n\nYou have to find it in you to do what is best. There's nothing wrong with going to work. There's nothing wrong with staying at home. There's nothing wrong with turning the tv on. There's nothing wrong with formula feeding. There's nothing wrong with doing what you're doing. As long as you care, and your little one is happy. You may read a lot of judgemental stuff on here but I an assure you that people who are less fortunate that your baby have turned out just fine. If you're afraid of making mistakes, that's okay. Make them. We all do. Even the self righteous holier than though bitches of the world make those mistakes. They're the first ones to point out yours because, think about how you feel, they feel it too and dont want the finger pointed at them.\n\nI'm unsure exactly why you feel so guilty and who is shaming you but there is absolutely nothing to be ashamed of. If you have a question, ask! If you're unsure about what to do, ask! Reddit has a fantastic community of Momma's who love just chatting with each other. Life is really really short to be worried all the time. \n\nJust remember, take every single piece of advice with a grain of salt. Even my post. \n\nLove and light.", "controversiality": 1, "created_utc": 1366728427, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kyhjp", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457869, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "knottymommy", "author_flair_css_class": null, "author_flair_text": null, "body": "It sound kind of weird, but the documentary *Babies* really helped me.\n\nThere are cultural norms for raising kids in every part of the world and there are huge differences in how babies are cared for.  They all (okay, most) grow and thrive and end up being productive members of society.  Remembering that, as long as I'm doing my best and not abusing or neglecting my kids, they will be fine.... and the less I'm worrying about every detail, the happier we all are.", "controversiality": 0, "created_utc": 1366728560, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kyj6i", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457848, "score": 32, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "KatiexS", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a stay at home mom and I don't feel guilty about BEING one, I feel guilty about not doing as much outside of the home as I [think] I should (library trips, play dates, errands, etc.) I personally find myself at home a lot with my 2 year old, bored, yet not having the energy to go out and do all these exciting, stimulating  things with him. I think what makes me feel even worse about it sometimes is when I turn on the TV and some sitcom comes on that shows a mother always dressed in her best clothes, running around all over the place with her children, as happy and content as could be and I look at myself and think I should be THAT mom. But, I'm not. I think once naps are a thing of the past and he starts joining sports teams or another club of some sort, this guilt I'm feeling now will pass but I'm sure I'll start feeling guilty about something new - perhaps not being part of the PTA or something. ", "controversiality": 0, "created_utc": 1366728665, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kykg8", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457831, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm glad you posted this point of view. I'm happy to hear you're letting life happen and enjoying it a bit more &lt;3", "controversiality": 0, "created_utc": 1366729100, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kypxj", "link_id": "t3_1cxp56", "parent_id": "t1_c9ky59n", "removal_reason": null, "retrieved_on": 1431457759, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "keepswimming9112", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I feel that a lot. I especially feel bad if I have to go out. I've had so many appointments the past couple weeks (straight after nearly 2 weeks apart.) I've also tried to get out at least once a week with a friend. Even if I go out after he's down for the night, I feel a little guilty. \nWe just have to do the very best we can do, and I think we'll be alright. =] ", "controversiality": 0, "created_utc": 1366730226, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kz466", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457574, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LaserKitteh", "author_flair_css_class": "purple", "author_flair_text": "Mom to DD's 3,7, &amp; 13", "body": "Why are you feeling guilt? Is it because of societal expectations of how you should feel about what you're doing? Imo, if you want to work, work. Don't feel bad about not loving having to stay home with your son. I wasn't exactly raised for total domesticity-- my parent's banned me from the kitchen after burning water in the microwave and instead groomed me for college and a career. Staying home with the kids drives me nuts. Love them to bits, but give me more purpose than the same old cook-clean-wipe arse-STOP THAT F-ING FIGHTING routine. It's normal, and it's completely ok. So is being the kind of mom that adores every waking minute of their baby/kids/teenager. It's a personal preference and we should never feel bad about it. **If you're happy, you're a better mom.** \n\nThe tv and veggies are really small beans, man. As long as you're not staring at it all day and ignoring your kid, and you're feeding him *some* veggies, no worries\n\n**TL;DR:** If you're happy, you're a better mom. Don't worry about what society expects or what you think people think of you. ", "controversiality": 0, "created_utc": 1366731060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kzf96", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457428, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jerry_sizzler", "author_flair_css_class": "purple", "author_flair_text": "One girl, 3 years", "body": "I'm doing the best I can, so I have nothing to feel guilty about. Ain't nobody got time for that!", "controversiality": 0, "created_utc": 1366731317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9kziob", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457384, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "drunken_trophy_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "I ignore people's expectations and judgments, the same way I ignore what people think of how much leg hair I have (or don't have), which sizes I wear, which books/news agencies/web sites/TV shows I enjoy, what my spiritual/religious views are, who I vote for, and what my goals and dreams are.   \n\nYou make your choices in life- big and small- based on a million bits of knowledge and complex options that only *you* truly know. No one else has the knowledge or right to judge you.   \n\nIf you feel guilty about a choice you're making, examine it carefully and ask yourself if you really could do better. Include the context of that million bits of information that only you know. Are you turning on the TV because you know your son is likely to hurt himself if he's not distracted while you make coffee? And you're making coffee so that you can be a happier, kinder parent instead of a short-tempered one, because you didn't get much sleep last night? You're opting to have a good relationship with your son, and trying not to damage his self-esteem, instead of limiting TV as much as you think would be ideal.  \n\nIf you really think you could do better, then do it differently next time. If you can't do any better, then reassure yourself that you're doing the best you can. And for heaven's sake, BE REALISTIC. You're only human and *every* choice is a trade-off. Even if you were perfect, you wouldn't be capable of making *all* the \"right\" choices because life doesn't work that way. (By the way, this is an easily proven fact if you take some courses in decision and game theory- it's an interesting field.)", "controversiality": 0, "created_utc": 1366733011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l05id", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431457012, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sarahkali08", "author_flair_css_class": null, "author_flair_text": null, "body": "Well you have no problem pointing fingers and being judge mental towards those you claim that do those things. I'm sorry if the Christianity you've encountered has been that way, but don't judge one church or one family as the way ALL or even most of Christianity is.", "controversiality": 0, "created_utc": 1366733107, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l06vs", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyhjp", "removal_reason": null, "retrieved_on": 1431456994, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sarahkali08", "author_flair_css_class": null, "author_flair_text": null, "body": "To add a different perspective...\n\nWe definitely aren't perfect, but we should strive to be the best person, and mother, we can be. Some guilt is there for a reason. If you feel guilty about letting your toddler watch tv while you make breakfast, before nap, after nap, so you can do a chore in peace, before bed, etc.; that's way too much. I'd suggest listening and figuring out your feelings rather than writing them off and saying you're a \"good enough\" mom by not abusing your child like some other posts said. \n\nGood luck! ", "controversiality": 0, "created_utc": 1366733297, "distinguished": null, "downs": 0, "edited": 1366752008, "gilded": 0, "id": "c9l09i5", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431456960, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamasrsoninja", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that's today's society seeping into your brain. We see movies, tv shows and amazing stories on the news all the time where mom's do it all and are successful. Its not real. Even the amazing moms on the news with 10 special needs kids, a full time job and 5 volunteer jobs have bad days and get outside help. I have been down that road too and back down it again several times. (Just this morning so asked me to get a job so i will dress up more often as i was dressed up for volunteering at the school. It got me doubting for a second and then i came back at him with a \"maybe you should take me out on dates more often instead.\" Boom!) \n\nAll your kids need is your love, attention and some independence. \n\nI try to keep my goals simple and praise myself for goals accomplished. My overall goal, in its simplicity, is to be a better mom than my own mom. She was a good mom and I turned out well. So far so good.", "controversiality": 0, "created_utc": 1366733763, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l0ftk", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431456877, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Slugowski", "author_flair_css_class": "blue", "author_flair_text": "Ethan- June '12", "body": "I was going to post about this movie as well! Mothers all over the world and throughout history, have done just fine with less. I watched the movie with my son when he was about 8 months old and sick with a cold and an ear infection. He was miserable and I was desperate to just have peace for a few minutes.  He loved watching the babies (and the animals) and I saw that kids are resilient and pretty darn good at letting you know when they need something. My son is now 10 months old and if he is happily playing by himself for 15 min, I no longer see it as 15 min of time wasted that I could  have been doing flashcards or going to the library. When he comes crawling up and all over me, that is when I take it as my cue that it's time to play together. He's an impossibly happy baby and I'm far better at dealing with the stress of running a household. \n\nNo ones life is a sitcom!  Thats what makes them enjoyable to watch. They are a fantasy. ", "controversiality": 0, "created_utc": 1366733805, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l0ges", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyj6i", "removal_reason": null, "retrieved_on": 1431456870, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 1, "created_utc": 1366735095, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l0yir", "link_id": "t3_1cxp56", "parent_id": "t1_c9l06vs", "removal_reason": null, "retrieved_on": 1431456633, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dancingfaith84", "author_flair_css_class": null, "author_flair_text": null, "body": "I work hard to do the best of my abilities every day with my little ones. Granted I'm not perfect and there is and will be always something to do. Or something I can do better. But I'm reassured by the fact my kids are happy, healthy, growing and learning. My husband is always the one to say don't worry about it and verbalize that we do good. If something is out of order, we just know we can't be perfect. But instead strive for better.", "controversiality": 0, "created_utc": 1366735161, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l0zey", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431456620, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Interesting point of view. I was not judging. I don't care one way or another. It is fact that the catholic church using shame in their religion to keep its people in check. Especially when it comes to sex but not limited too. I did not mean to imply that you, yourself are into shaming others. You may or may not be, I dont know and I like to believe people are good until proven otherwise. But your actions weren't in question here, just OP's and her feelings of guilt. Sometimes, not always, but sometimes people who come from a strong religious background, one that uses guilt and shaming, tend to have insecurities in a lot of areas of their life. \n\nSorry for the misunderstanding. I should have been more clear. Thanks for pointing it out!", "controversiality": 0, "created_utc": 1366735236, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l10g7", "link_id": "t3_1cxp56", "parent_id": "t1_c9l06vs", "removal_reason": null, "retrieved_on": 1431456607, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366735370, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l12e8", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431456582, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry to hear you feel that way.", "controversiality": 0, "created_utc": 1366735868, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l19it", "link_id": "t3_1cxp56", "parent_id": "t1_c9l0yir", "removal_reason": null, "retrieved_on": 1431456488, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366736504, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l1imu", "link_id": "t3_1cxp56", "parent_id": "t1_c9l19it", "removal_reason": null, "retrieved_on": 1431456369, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Someone asked me the other day.. How do you do it all with 3 kids and a full time job? I said neglect.. I neglect my job, my house, my husband, my kids and definitely myself. No one can give 100% of themselves to anything. And as a Mom when you give less than 100% to your kids you feel guilty. \n\nI look around and I see wow that persons home is so clean.. wow that person does crafts with their kid.. wow that person makes dinner every night.. wow that ones husband gets sex more than once a month.. wow that person never yells.. wow their kid gets straight A's.. and it goes on and on and on..\n\nSo to not feel like a shitty parent, wife, person I focus on what I do have.\n\nJob I mostly like  \nHusband that is kinda hot and likes to have sexy times with me.  \nKids that are kind and hilarious.. a perfect combination.  \nA house where if you step on something you probably won't need a tetanus shot.   \n\nBecause that is all I can do with my 100% and that is enough\n", "controversiality": 0, "created_utc": 1366738154, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l25zk", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431456064, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SeaTurtlesCanFly", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel like too sometimes.  Sometimes I worry that I'm failing my son.  \n\nBut, I think it is perfectionism, at least in my case.  Women (and men, but moreso women in this society, I think) are pressured to be so damn perfect.  Perfect mom, perfect wife, perfect job, perfect house, perfect life... We strangle ourselves with perfection all the time and in infinite ways.  \n\nWhen I get stressed out about something, I get even more perfectionistic.  And, while I love my son more than I thought was possible, he is stress.  Good stress, but stress.  Babies are hard work and we want so badly to do it right.  We are afraid of the consequences if we don't and all that.  \n\nI try to focus on doing the best I can, not perfection, because it is never going to be perfect.  If I'm shooting for perfection, I'm never going to have time for sleeping or eating and then what kind of mother would I be when I'm a sleep-deprived starving mess?\n\nIt helps me to remember that my mom \"inbox\" is always going to have something in it.  There is always something more I could do.  But, sometimes I really just need to relax or I'm going to lose my mind...\n\nHopefully this ramble makes some sort of sense.  ;)  \n", "controversiality": 0, "created_utc": 1366740517, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l32kz", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431455637, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "I was raised in a secular humanist household, and I have a ton of mommy guilt issues, more so than my friend who grew up Catholic. I think religion is pretty irrelevant. if anything, communing with the other women at my church's parenting group and hearing they have similar problems to mine has been hugely helpful.", "controversiality": 0, "created_utc": 1366740850, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l377h", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyhjp", "removal_reason": null, "retrieved_on": 1431455576, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ebmorga", "author_flair_css_class": null, "author_flair_text": null, "body": "I can only speak for myself, but the way I worked past it is that I just let it go.  I accepted the fact that I am not perfect.  That my demons will present themselves from time to time.  That at some point in their lives, my kids will think I was a crappy parent.  That there is nothing I can do about it.  That other parents have just as hard of a time as I do.  And that people are going to judge no matter what I did or didn't do.\n\nFinally, I had to realize that the guilt that I was carrying was making things worse.  \n\nI took the things that I *could* control (how I handled misbehavior and accidents,the state of my home, dinner choices, etc.) and I spent some time constantly reminding myself how I *wanted* to act and compared it to how I *actually* acted.  Eventually, my first instinct went from yelling (I came from a family of yellers) to remaining calm and in control.  I patiently added vegetables to my son's list of \"do and don't foods\".  I de-cluttered so it would be easier to keep up with the house.  I quit caring about what people thought (and subsequently quit trying to 'keep up with the Joneses').\n\nThen I had fewer things to feel guilty about.  Then I was less worried.  Then I was more calm....Do you see the cycle?  \n\nThe same can be applied to other areas.  Be it the TV, the state of your house, the types of dinners your kids eat...  It can be changed, but it won't happen overnight.  It will feel like it's not happening at all.  But it is.  And it will be over before you know it.\n\nAnd don't feel bad about not embracing being a SAHM.  I *hated* it.  It wasn't until I got a very scary smack in the face that I decided to (1) remember *why* I stayed at home in the first place and (2) embrace the little chunder monkeys with their picky palettes and sticky fingers.  BUT, it's not for everyone.  And that is perfectly okay.  You are no less of a mother.  \n\nFinally, keep reminding yourself, it may not be fun *right now*, but it won't last forever.  ", "controversiality": 0, "created_utc": 1366741016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l39ee", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431455548, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kmyrin", "author_flair_css_class": null, "author_flair_text": null, "body": "Lady, you know what's up. Thank you. Your honesty is so refreshing. Every day I am getting closer to my goal: total acceptance and love of my version of mothering. It's imperfect and at times (lots of times) filled with chaos and drive-thru and TV and iPad games...but it's also filled with love and gardening and tea parties and bedtime stories. She sees me trying my best and working hard. I'm not going to win any crafting contests, we've never done professional portraits of her or the family, and the list of things we haven't done goes on and on. Screw it. ", "controversiality": 0, "created_utc": 1366743653, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l4aji", "link_id": "t3_1cxp56", "parent_id": "t1_c9kxyvi", "removal_reason": null, "retrieved_on": 1431455062, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with /u/Emmacat, and you. It depends on the individual, the parish, the priests and lay leadership, and the community as a whole. Some parish communities are loving and supportive, and their parishioners are true believers and don't feel shamed or guilted. Others, like the one in which I was raised, were real \"fire-and-brimstone\" style parishes, condemning everyone for everything. I am still recovering from the emotional abuse of my religious upbringing and the self-esteem issues I developed.\n\nMaking generalizations (even this one) is inherently unfair, because it cuts off the outliers in order to be able to make a simpler statement. Everyone has different experiences, and they are all valid.", "controversiality": 0, "created_utc": 1366745173, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l4w81", "link_id": "t3_1cxp56", "parent_id": "t1_c9l1imu", "removal_reason": null, "retrieved_on": 1431454778, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "Great comeback! I hope you get some date nights :)\n\nYour point about the super-moms getting outside help is spot on. \"It takes a village\" is a phrase because it DID take a village to raise children. The focus on the nuclear family separating from the extended family is a relatively new thing (I'm partly talking out my ass here, because the articles I read about this were 10+ years ago). There is CERTAINLY no shame in asking for help!", "controversiality": 0, "created_utc": 1366745415, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l4zpk", "link_id": "t3_1cxp56", "parent_id": "t1_c9l0ftk", "removal_reason": null, "retrieved_on": 1431454732, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shmeeblybear", "author_flair_css_class": null, "author_flair_text": null, "body": "Your feelings are totally normal. I think it's impossible to not feel mom-guilt at one point or another. The fact that we share so much of our lives via social media means we are constantly comparing ourselves to other moms. It's easy to forget that those other moms are probably presenting the best part of their lives, leaving out the diapers and the failed recipes and the daily failures.\n\nMy advice? Cut back on the facebook, twitter, whatever. Spend more time living in the real world and less in the virtual world. I've severely cut back on my facebook use in the past couple weeks and I'm seriously a happier person because of it.\n\nKeep up the good work momma. It's one of the hardest jobs out there. :)", "controversiality": 0, "created_utc": 1366745770, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l5520", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431454662, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "backyardigan", "author_flair_css_class": null, "author_flair_text": null, "body": "This was lovely. :)\n", "controversiality": 0, "created_utc": 1366746726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l5jde", "link_id": "t3_1cxp56", "parent_id": "t1_c9l25zk", "removal_reason": null, "retrieved_on": 1431454475, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "This is normal.  I just had to look at what I was providing for my child and say \"what did my parents do for me as a child?\" if I feel they did enough for me, then I say \"was this comparable?  Is my child healthy?  Is my child happy?  Am I happy?\" then keep calm and carry on!\n\nIt's hard because we are constantly being told by TV, magazines, other people, the radio, etc. that there are new better things to do to be the best possible parent.  Well, guess what?  We can't do everything!  \n\nMy absolute favorite philosophy was \"WWCMD?\" (What Would a Cave Man Do?).  Seriously, humans have survived for 10s of thousands of years just fine without child psychology, self help books, and the internet.  Not saying it was the best of times, I definitely like that in my early 30s I'm not a senior citizen (as it would have been in the days of the cave person.  However, it lets me take a deep breath and say to myself that the caveman would have just made due with what was on hand.  If the TV is on hand for a brain break for mama, or even more important, to occupy a squeaky babe so mama can poop in peace, the caveman would have loved it!  Cavemen had family and friends around at all times to take the kid, well we don't have that, so we make due the best we can too!\n\nthis also helps greatly in instances where you find yourself without all of your normal accoutrements to care for or entertain the baby.\n\nGood advice might be to join a mommy group, so you can share your feelings.  when you talk about it and realize that it's not just you, it helps you to say \"well, these people are doing a great job, and have no reason to feel this guilt.  I am doing a great job too, so I also have no reason to feel this guilt\" and it gives you the power to IGNORE IT!\n\nGood luck mama! ", "controversiality": 0, "created_utc": 1366746873, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l5lj8", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431454447, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "Amen! ", "controversiality": 0, "created_utc": 1366747240, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l5qz0", "link_id": "t3_1cxp56", "parent_id": "t1_c9kxyvi", "removal_reason": null, "retrieved_on": 1431454375, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "There was no working past it for me. This is my child. I am raising him how I see fit. If you have a better way, I may adopt your way of doing things. If you just think you have a better way, then I probably will nod and smile while you explain it to me and then forget it five minute later. I work. I don't feel guilty. I formula feed, I don't feel guilty. I let my kids watch some television in moderation and I don't feel guilty either for letting them watch, or for not letting them watch. My kids don't watch wrestling, it is not allowed while they are awake. My older son gets teased at school because he doesn't know who all the wrestlers are. I'm supposed to feel guilty, I don't. I let them play outside and don't feel guilty. I keep them inside some days for various reasons and don't feel guilty. Some days they get five servings of fruit and veggies, some days they don't. That used to bother me. Now they get a multivitamin, no guilt. I don't love spending every waking moment with my kids. No guilt, I'm human. \n\nDon't let it suck you in. It will destroy you, and your ability to parent. ", "controversiality": 0, "created_utc": 1366748946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l6gg9", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431454042, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Enidine", "author_flair_css_class": null, "author_flair_text": null, "body": "How old is your kid? I find that it gets easier as the baby gets older and after the second kid, but yeah, guilt the first couple of years can be overwhelming. Is your child happy and thriving? If yes, then you're doing it right, just remember that. ", "controversiality": 0, "created_utc": 1366749476, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l6oel", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431453938, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xboxwidow", "author_flair_css_class": "blue", "author_flair_text": "Three boys, 10, 7, and 1 ", "body": "My mantra when I was a first time mom was \"At least I'm not a crack whore.\" You're doing it waaay better than lots of people. Relax, and know it gets better.", "controversiality": 0, "created_utc": 1366750537, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l744z", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431453732, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "Ha. I find myself often saying similar things and I'll admit that it helsp... but then I'm always like \"Yeah but I want high standards for myself as a parent, dammit!\"", "controversiality": 0, "created_utc": 1366750685, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l76f9", "link_id": "t3_1cxp56", "parent_id": "t1_c9l744z", "removal_reason": null, "retrieved_on": 1431453701, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it is perfectionism for me as well...I don't want to just half-ass an important thing like parenting. But, in trying to be perfect I'm driving myself crazy. I can't do the impossible.", "controversiality": 0, "created_utc": 1366750859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l78ww", "link_id": "t3_1cxp56", "parent_id": "t1_c9l32kz", "removal_reason": null, "retrieved_on": 1431453669, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "See this is where I usually land. I want high standards for myself as a parent and if I don't live up to them I beat myself up for it. I don't know how to not strive to be that perfect parent. It's fucking impossible, and I'm driving myself insane trying to do it.", "controversiality": 0, "created_utc": 1366751038, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l7biq", "link_id": "t3_1cxp56", "parent_id": "t1_c9l09i5", "removal_reason": null, "retrieved_on": 1431453635, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "This is great advice. Thank you!", "controversiality": 0, "created_utc": 1366751066, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l7bxa", "link_id": "t3_1cxp56", "parent_id": "t1_c9l05id", "removal_reason": null, "retrieved_on": 1431453630, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "Great advice. I saw this Doc before I was a parent and I will revisit. Thanks!", "controversiality": 0, "created_utc": 1366751160, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l7da7", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyj6i", "removal_reason": null, "retrieved_on": 1431453612, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "You pegged me. Recovering Catholic here.", "controversiality": 0, "created_utc": 1366751184, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l7dmv", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyhjp", "removal_reason": null, "retrieved_on": 1431453608, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kmyrin", "author_flair_css_class": null, "author_flair_text": null, "body": "It makes perfect sense and is spot on. ", "controversiality": 0, "created_utc": 1366751483, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l7hwr", "link_id": "t3_1cxp56", "parent_id": "t1_c9l32kz", "removal_reason": null, "retrieved_on": 1431453551, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "megankoch", "author_flair_css_class": "purple", "author_flair_text": "B/G Twins (5), Girl (2)", "body": "Gah! The photos!! All of my friends did the engagement, wedding, maternity, new baby, etc. I got pregnant halfway through planning our wedding and surprise! Twins! It's been a whirlwind 4 years and professional photos never fit into that. ", "controversiality": 0, "created_utc": 1366751796, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l7mbx", "link_id": "t3_1cxp56", "parent_id": "t1_c9l4aji", "removal_reason": null, "retrieved_on": 1431453421, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366754980, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l8th7", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431452857, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CatAnxiety", "author_flair_css_class": null, "author_flair_text": null, "body": "I have those moments too..where I know there is something more constructive I could be doing for/with my child but I try to keep it in perspective.  When I compare my parenting decisions to those of friends (those with whom I have an honest relationship about the ups and downs of raising children) I don't think any of them are doing it any \"better\" than I am.  Nor are they doing it worse - no one is a perfect mom 100% of the time, and if your mistakes are occasional chicken nuggets and TV, let it go.  Think of whenever an \"AskReddit\" thread that talks about parents makes the front page and how many of those people have these horror stories about abuse and abandonment.  If you care enough to question if you're doing it right, you're on the right path.  ", "controversiality": 0, "created_utc": 1366755211, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l8whx", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431452818, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366757671, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9l9saw", "link_id": "t3_1cxp56", "parent_id": "t1_c9l25zk", "removal_reason": null, "retrieved_on": 1431452402, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "majoules", "author_flair_css_class": null, "author_flair_text": null, "body": "First of all, just being aware of it is a huge step. \n\nI like to pretend that my first child is my third. This delusion gives me more time to do other things I feel guiltier about. A first child is exhausting and by the time a mother gets to the third, there's no way she can stay as crazy alert as the first time around. If his pants are on backwards and his shoes are on the wrong feet, I let it go. There is nothing more futile than arguing with a toddler. The fewer rules I have, the fewer interventions I have about washing his face, the less likely he is to waste my energy with a fit. He does not get baths every night. We do not have a 30 minute bedtime routine. \n\nI accept I will feel guilty about something no matter what. I can rationalize the cheaper, excellent-quality daycare, but I still feel like hell that he's not going to the Montessori with swimming and ballet class even though we'll save like $400/month, which will make for a sweet vacation at the end of the year. I can still send him to swimming and dance, yet I know I will be judged, by myself.\n\nI also try to look at it from the perspective of my 80 year old self. Will my 80 year old self wish that I would have spent more time with my husband instead of cleaning the house every night? Will my son notice he didn't grow up with the complete Disney DVD library? If my 80 year old self will laugh in my face, then I lay it at her feet and move on. \n\n\n\n\n\n ", "controversiality": 0, "created_utc": 1366758539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9la3bi", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431452257, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zutti", "author_flair_css_class": null, "author_flair_text": null, "body": "This, a million times this. I used to feel SO guilty every time I let my daughter watch TV, then I realized that it was definitely better than me being cranky and irritable all day long because I hadn't had a freaking shower. And oh my goodness, the vegetables. All the moms I saw had kids who would gnaw on a cucumber, and my eldest wouldn't touch anything green. Do the best you can, do what makes you and your kids happy, and screw everyone else (not literally, but you get the idea)", "controversiality": 0, "created_utc": 1366758543, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9la3d7", "link_id": "t3_1cxp56", "parent_id": "t1_c9l05id", "removal_reason": null, "retrieved_on": 1431452256, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zutti", "author_flair_css_class": null, "author_flair_text": null, "body": "SO MANY PHOTOS! Is my little point-and-shoot not good enough? I prefer my messy-kid-hand-shoving-spaghetti-into-her-face pictures better than black and white with weird blankets and beads any day!", "controversiality": 0, "created_utc": 1366758660, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9la4tn", "link_id": "t3_1cxp56", "parent_id": "t1_c9l4aji", "removal_reason": null, "retrieved_on": 1431452237, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "eskimomum", "author_flair_css_class": "black", "author_flair_text": "12,8,7,5,4", "body": "I am. But I know for myself, I am not one of those mothers who is happy to be at home, taking care of everrrything and encouraging the right actions and thinking of the children. I can't cope and I feel guilty that the stress of finances is on my husband (who contracts, which adds more stress to the guilt, never knowing when his last day or first day will be). So i've gone back to work. Do i feel guilty? yes. But are my kids happy? yes, so i stuff it away until i need a good cry and make sure i ask for help when it really bogs me down. \n\nthe problem I have with my guilt or frustration, is not taking it out on my husband, it ssomething i am working on though. (I work full time now with 5 children, from ages 11 to 4)", "controversiality": 0, "created_utc": 1366758959, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9la8kh", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431452188, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366759011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9la98q", "link_id": "t3_1cxp56", "parent_id": "t1_c9l25zk", "removal_reason": null, "retrieved_on": 1431452179, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xboxwidow", "author_flair_css_class": "blue", "author_flair_text": "Three boys, 10, 7, and 1 ", "body": "Just the fact that you spend time worrying about means you probably have pretty high standards. It was just a way to remind myself that regardless of my flaws and failures, my baby had it pretty good thanks to me.", "controversiality": 0, "created_utc": 1366759981, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lali0", "link_id": "t3_1cxp56", "parent_id": "t1_c9l76f9", "removal_reason": null, "retrieved_on": 1431452018, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Enna_hteb", "author_flair_css_class": null, "author_flair_text": null, "body": "Sigh. I don't. I've reconciled myself to the fact that I'm probably going to screw them up somehow anyway, so I do what I can.\n\nMy nine-year old said \"You know, you're really very kind.\" today. So either I'm doing an awesome job, or I'm a pushover. ", "controversiality": 0, "created_utc": 1366766207, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lcv7m", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431450949, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "I like this advice. I am the youngest of five children and I know by the time my Mom got to me she barely knew when she was coming and going. On my hard days I try to picture her with five kids running around and remind myself that we are all fine and well-adjusted.", "controversiality": 0, "created_utc": 1366766844, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ld3oy", "link_id": "t3_1cxp56", "parent_id": "t1_c9la3bi", "removal_reason": null, "retrieved_on": 1431450838, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "I think we have a lot in common. I don't love staying at home and think about going back to work quite often. But someone once told me \"In 20 years you won't regret that you stayed home with your kid...but if you went back to work you might regret THAT in 20 years\". That resounds in my head so I try to make the best of it and have fun with him.", "controversiality": 0, "created_utc": 1366767005, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ld5vm", "link_id": "t3_1cxp56", "parent_id": "t1_c9la8kh", "removal_reason": null, "retrieved_on": 1431450810, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "Very true. Thanks for reminding me!", "controversiality": 0, "created_utc": 1366767034, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ld68y", "link_id": "t3_1cxp56", "parent_id": "t1_c9lali0", "removal_reason": null, "retrieved_on": 1431450804, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "itsthateasy", "author_flair_css_class": null, "author_flair_text": null, "body": "late to the party, but..\n\ni just try to go with the flow. i do what i can and dont worry about what i cant\n\nand i try not to compare us with other families (ya know, unless we are better than them)", "controversiality": 0, "created_utc": 1366767545, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ldd5u", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431450714, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "we_built_turd_city", "author_flair_css_class": null, "author_flair_text": null, "body": "My kid is one and a half. Yes, I can see it getting easier after the second when you have less time to dwell on it and you're just trying to keep your shit together. Maybe a little chaos would benefit me ;-)", "controversiality": 0, "created_utc": 1366767822, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ldgz9", "link_id": "t3_1cxp56", "parent_id": "t1_c9l6oel", "removal_reason": null, "retrieved_on": 1431450664, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "IMO kids need time to themselves just like adults do. ", "controversiality": 0, "created_utc": 1366768074, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ldkf7", "link_id": "t3_1cxp56", "parent_id": "t1_c9l0ges", "removal_reason": null, "retrieved_on": 1431450619, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lazyjane", "author_flair_css_class": null, "author_flair_text": null, "body": "The documentary \"Babies\" really helps me because my son fucking loves watching it.  One of his favorite scenes is when Hattie is peeling the banana. ", "controversiality": 0, "created_utc": 1366768935, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ldw5k", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyj6i", "removal_reason": null, "retrieved_on": 1431450465, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "If you don't compare yourself to other moms, then does your guilt come from you thinking you aren't doing your best? That's where mine does. I'm 7 weeks with our second and I don't want to do *anything*. I feel guilty for not getting my 2.5-year-old to child care at the YMCA, but I just don't want to go anywhere. I keep saying we're going tomorrow.\n\nYou don't have to like being a SAHM. I'm one too and I kind of wish I worked part time -- I did before my husband got a non-student job and it was about the right amount of time away from my child. But if I may ask, how old is yours? Baby stage is pretty isolating, IMO, because you don't *have* to bring them out to get socialized, they don't play with others until at least 2, usually closer to 3 years old.\n\nBut you've got to get out of the house, otherwise it's easy to get in a rut. My local YMCA has a child care area and they take babies as young as 6 weeks. A lot of moms come in for the exercise classes, and then you get to talking with other moms and make some friends. I (and my husband) also get some Me Time twice a week. I go out to my knitting circle with lots of adults.", "controversiality": 0, "created_utc": 1366772618, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lf9vz", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431449744, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xardra", "author_flair_css_class": null, "author_flair_text": null, "body": "Is it still on Netflix? Maybe my monkey would watch it with me!", "controversiality": 0, "created_utc": 1366773751, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lfoyh", "link_id": "t3_1cxp56", "parent_id": "t1_c9kyj6i", "removal_reason": null, "retrieved_on": 1431449546, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "knottymommy", "author_flair_css_class": null, "author_flair_text": null, "body": "It's still on Canadian Netflix.", "controversiality": 0, "created_utc": 1366774226, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lfv5h", "link_id": "t3_1cxp56", "parent_id": "t1_c9lfoyh", "removal_reason": null, "retrieved_on": 1431449464, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xardra", "author_flair_css_class": null, "author_flair_text": null, "body": "Lucky! Thanks for the reply! :)", "controversiality": 0, "created_utc": 1366774346, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lfwq4", "link_id": "t3_1cxp56", "parent_id": "t1_c9lfv5h", "removal_reason": null, "retrieved_on": 1431449444, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cait_o", "author_flair_css_class": "lightcoral", "author_flair_text": "Joss, 12/26/08, Baby E or B, 8/28/2015", "body": "**ALCOHOL**\n\n\nBut really, you just learn to deal. I don't think it ever truly goes away. I'm 24 and my mom still talks about feeling guilty for things she did when I was an infant.", "controversiality": 0, "created_utc": 1366775052, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lg611", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431449322, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mcbuttums", "author_flair_css_class": null, "author_flair_text": null, "body": "I was trying to put in to words how I manage to cope with being less then perfect, and this is exactly it. Very well put. Thanks! :)", "controversiality": 0, "created_utc": 1366820980, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lqjab", "link_id": "t3_1cxp56", "parent_id": "t1_c9l25zk", "removal_reason": null, "retrieved_on": 1431444366, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mcbuttums", "author_flair_css_class": null, "author_flair_text": null, "body": "Well put!\n", "controversiality": 0, "created_utc": 1366834862, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9lvzqc", "link_id": "t3_1cxp56", "parent_id": "t1_c9la4tn", "removal_reason": null, "retrieved_on": 1431441723, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I used to have mom guilt. I spent over a year making myself miserable - doing all the housework myself, making wonderful meals, doing all the \"correct\" parenting things, putting my kid in everything possible, doing all the \"Pinterest mom\" things. It sucks. I was in a horrible mood all the time, was stretched too thin, and I had even more overwhelming guilt over being a bitch all the time. \n\nSo I stopped. No, I no longer make everything from scratch, but I do have a vegetable at every meal. No, I no longer every second of my free time after work with my kid, but I do make it a point to spend time with her throughout the week and talk about her day at school. My husband and daughter both have their own chores around the house. I let go a little big and let her have more responsibilities - no, she does fold or put her laundry away perfectly, but that's one more thing off my plate to deal with. \n\nEventually, I came to terms with how I was going to be as a parent and realized everyone is different and it sucks trying to be perfect. Now I'm of the attitude \"this is what works best for my kid and my family, and eff off if you want to lecture me on my parenting.\" ", "controversiality": 0, "created_utc": 1367350089, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ps9uq", "link_id": "t3_1cxp56", "parent_id": "t3_1cxp56", "removal_reason": null, "retrieved_on": 1431370528, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}