{"submission": {"author": "toulousethemoose", "author_created_utc": 1366877989, "author_flair_css_class": "green", "author_flair_text": "Astrid 12/12/11", "author_fullname": "t2_bg9v1", "created_utc": 1366880105, "domain": "self.Mommit", "edited": 1366921256, "full_link": "https://www.reddit.com/r/Mommit/comments/1d2mms/tear_during_first_delivery_what_to_do_with_second/", "gilded": 0, "id": "1d2mms", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 64, "over_18": false, "permalink": "/r/Mommit/comments/1d2mms/tear_during_first_delivery_what_to_do_with_second/", "retrieved_on": 1412708944, "score": 27, "secure_media_embed": {}, "selftext": "Hi there, I've never posted in this subreddit before, but it seems like the place to ask this...\n\nWe are planning to have a second baby soon, and while it may seem to be jumping the gun a little, given that I'm not even pregnant yet, this is something that I think about quite a lot.\n\nMy first baby was born 9lb1oz, 22 inches long and gave me a third degree tear plus a second small tear on the way out (yeah, thanks, right?), with a total of 28 stitches. I have healed up perfectly, with no issues around bladder or bowel control, but am afraid of delivering my second vaginally as I don't want to tear again. Has anyone else out there been in this situation? If so, what did you decide for your second delivery? I was told that I have no greater risk of tearing than a first time mum, and that I could deliver vaginally, but I'm pretty tempted to have an elective cesarean second time around...\n\nEdit: thanks everyone for your thoughts and experiences. There are other factors that had me considering my options but the tear was the major one. It's great to read so many stories of good experiences following bad. ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Tear during first delivery, what to do with second? Text wall sorry", "url": "http://www.reddit.com/r/Mommit/comments/1d2mms/tear_during_first_delivery_what_to_do_with_second/", "user_reports": []}, "comments": [{"archived": true, "author": "oh-bubbles", "author_flair_css_class": "lightcoral", "author_flair_text": "14 Feb 10 &amp; 3 Jun 12", "body": "Every baby and birth is different. While I didn't tear thay badly with my first I did tear. I changed doctors and hospitals and with the help of a kick ass mid wife I didn't tear at all with my second.\n\n If you're really worried about it make sure you ask specifically about what your doctors techniques and what not are for preventing tearing as that's a big concern for you.", "controversiality": 0, "created_utc": 1366888171, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mayls", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434528, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "delicat", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't tear nearly that bad with my first but I did tear. I had my second baby sixteen years later and the doctor was estimating him upwards of ten pounds. I thought I would tear very badly but I didn't tear at all.\n\nIf you have time to be intimate with your SO and you don't have any worrisome medical conditions you can incorporate some massage and/or stretching of the area to prepare for the birth.", "controversiality": 0, "created_utc": 1366889464, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mb596", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434440, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Wheelerosa", "author_flair_css_class": null, "author_flair_text": null, "body": "Had the same experience. Tore badly with first baby (9 pounder) and no tears for following 3 (all 10 pounds+). The birth practitioner makes all the difference. \n\nTwo things I can recommend - support (as in physically supporting your perineum) and gravity (birth in upright position). This was the main difference between my first and subsequent births. Holding a warm, wet handtowel *down there* as you push supports the skin (midwife holds one from behind). Being upright does half the pushing work for you so you're not straining your muscles and stretching the skin to breaking point.", "controversiality": 0, "created_utc": 1366890387, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbah5", "link_id": "t3_1d2mms", "parent_id": "t1_c9mayls", "removal_reason": null, "retrieved_on": 1431434372, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mickaloni", "author_flair_css_class": null, "author_flair_text": null, "body": "Every delivery really is different, but chances are things will be easier for your second.  It's not a guarantee, but it's likely.  \n\nMy first was 9 lbs 9 oz and I had second degree tear that was very nearly 3rd degree.  The labor was prolonged and very intense and recovery was not fun.  My second was 10 lbs 8 oz(!) with a quick, easy delivery and not a single tear or abrasion.  It was also a water birth, so that may have something to do with it. \n\nDiscuss the issue with your OB/midwife.  You can ask them to apply pressure to your perineum before/during crowning and look into different birthing positions.  Giving birth on your back actually narrows the pelvis and puts more pressure on your perineum.  Squatting or even sitting up is much easier on your body.  You can also try [perineal massage](http://www.youtube.com/watch?v=DK2P8Ziqc6Y).  But, IMO, the most important factor is how tense/relaxed you are.  Even if you do tear, it is likely to be less severe so try not to worry too much.  Ultimately, it's up to you but it's worth mentioning that c-sections (while safe) do have a higher incidence of complications than vaginal birth.", "controversiality": 0, "created_utc": 1366890682, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbc6p", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434350, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Good God, you are a champ. ", "controversiality": 0, "created_utc": 1366891345, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbg4b", "link_id": "t3_1d2mms", "parent_id": "t1_c9mbah5", "removal_reason": null, "retrieved_on": 1431434298, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lilaooo", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey, we just had a thread about tearing over on /r/babybumps! Go check it out :)", "controversiality": 0, "created_utc": 1366891905, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbjm6", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434253, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "samarra", "author_flair_css_class": null, "author_flair_text": null, "body": "I am only commenting about the c-section, as I had one of those after a failed induction and am electing to have another.\n\nIf I were you (and I am not and have no idea what a vagina tear feels like so take this with a grain of salt) I wouldn't. My stomach, after my section in August 2009, has still not fully repaired the muscle. The outside is fine but (I know this sounds silly) I used to could hold in my gut. I can now, but there is a pooch in my lower abdomen that just can't be controlled. If a vaginal tear repairs itself without side effects that stay for years, that is what I would do. I am getting a csection again because my tummy is already in this state, but if I could have avoided this whole mess I would have. After I have this one I am gonna hit the gym again as soon as I am able but it's a long road to hoe. I know this is a first world problem but it was something I hadn't considered prior so I wanted to bring it up. \n\nTl;dr  The c-section has messed up my stomach muscles so consider that possible consequence!", "controversiality": 0, "created_utc": 1366892088, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbkqr", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434237, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you have other concerns with the birth besides tearing? I'm just curious, because to me it doesn't make any sense to replace the chance of tearing with surgery. C-sections are not a walk in the park, and come with more risk than vaginal delivery. You'd be trading some external tearing for cutting open your skin and uterus, and displacing major abdominal muscles. You'll be dealing with the effects of surgery for at least 6 weeks after the birth. \n\nIf you've already done a vaginal birth, it likely will be easier the second time. You can stretch the area, and have the doctors apply oil during crowning. You can even ask your doctor about an episiotomy. But planning a C-sections seems a bit drastic.  ", "controversiality": 0, "created_utc": 1366892184, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mblcy", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434230, "score": 32, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter was the exact same size and I tore pretty bad and an episiotomy on top of it to get her shoulders out. With my second, he was a lot smaller (only 7 lbs., 12 ounces) and I only had one very minor tear, which didn't even need stitches. \n\nEven if the risk of tearing had been higher the second time, I would have taken the tear over C-section recovery!", "controversiality": 0, "created_utc": 1366892645, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbofm", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434189, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366893864, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbx5w", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434075, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "baladapalha", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a 'surprise' episiotomy. My giant headed 9lb 5 oz baby was *finally* on his way out, after much cajoling, and my OB just said \"don't look!\" and snipped the opening a little wider. Surgical grade incision, 5 neat and tidy stitches, speedy healing, no fuss.\n\n I highly recommend episiotomies. It is true that *small* tears heal quicker than incisions, it's impossible to judge where and how big a tear will be. ", "controversiality": 0, "created_utc": 1366893975, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mbxz1", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431434065, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Bette21", "author_flair_css_class": null, "author_flair_text": null, "body": "They did the same to me, they told me they were going to cut me a little and I didn't even notice them do it (guess I was already in so much pain I didn't feel it!). Then they stitched me up as I nursed my baby and the adrenaline and excitement meant I barely felt that either. All healed up within about ten days. ", "controversiality": 0, "created_utc": 1366894814, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mc4k9", "link_id": "t3_1d2mms", "parent_id": "t1_c9mbxz1", "removal_reason": null, "retrieved_on": 1431433978, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "offbeatchicken", "author_flair_css_class": null, "author_flair_text": null, "body": "My first born was 8lb 5oz, vaginal delivery with epidural and I sustained a fourth degree tear and forceps were used. My tear was so bad that the doctor didn't even bother counting the stitches. Luckily I healed up fine with no side effects. \n\nWhen it came time for my second to be born I was strangely not worried about tearing again. But I made a conscious decision to go without an epidural or any other pain meds because I felt that part of the reason forceps were used was because I was pushing incorrectly due to not being able to feel a damned thing. \n\nSecond labor I had a very tiny tear, just a few stitches and honestly I don't even remember any pain associated with it either during labor, during sutures, or postpartum. \n\nSo now I am pregnant with number 3, due in May, and I have planned again for an non medicated delivery. I am more afraid of how my 2 year old will deal with the new baby than I am about the delivery. \n\nTalk with your doctor about the risks vs. rewards of delivering vaginally vs. delivery via cesarean. I think that a cesarean should only be your last option if labor does not progress properly or if there is fetal distress. ", "controversiality": 0, "created_utc": 1366895228, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mc83f", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433933, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "Go for a VBAC! Having another c section is only going to create another scar. Go for a vaginal birth and skip the 4-6 week recovery.", "controversiality": 0, "created_utc": 1366895629, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcbkf", "link_id": "t3_1d2mms", "parent_id": "t1_c9mbkqr", "removal_reason": null, "retrieved_on": 1431433887, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PChuu22", "author_flair_css_class": "lightcoral", "author_flair_text": "3.5-year-old boy, 10-month-old girl", "body": "Don't give birth on your back. Don't push while heavily medicated. No, seriously. Get OUT of the lithotomy position and don't do purple pushing. If the pain is too intense, then you can have something to take the edge off but getting an epidural removes your ability to know WHEN to push, to know how MUCH to push, to know when to pause to let your skin stretch and adjust. And laying flat on your back makes pushing MUCH, MUCH harder. If I need to, I can provide you some links.\n\nRe: elective cesarean: I'd rather a small tear through skin and muscle than a huge incision through multiple layers of fascia, fat, muscle and an organ with the risk of serious complications. It's MAJOR surgery. NEVER elect for MAJOR surgery if it's totally optional.\n\n", "controversiality": 0, "created_utc": 1366896168, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcgdg", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433824, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaGrr", "author_flair_css_class": "purple", "author_flair_text": "Daughter 7, Son 5", "body": "I didn't tear, but the doc cut me a third degree episiotomy.  I know I heard at least two large snips.  It was horrible and took forever to heal.  With my second I had a small tear that was totally doable and not nearly as bad, healed up really quick and she said that the only reason I tore was because when my son came out he had his hand on his cheek.. so I had to birth head+arm lol  I would much rather heal from that than a c-section where your entire stomach is cut into.", "controversiality": 0, "created_utc": 1366896824, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcmhz", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433744, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "StarArcana", "author_flair_css_class": null, "author_flair_text": null, "body": "Shit they didn't even tell me they were cutting me! Apparently I got a numbing shot (everyone else saw it but me, thankfully) then I did feel him cut and was like wtf man?! But it had to happen cuz baby girl wasn't budging!", "controversiality": 0, "created_utc": 1366897082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcp1r", "link_id": "t3_1d2mms", "parent_id": "t1_c9mc4k9", "removal_reason": null, "retrieved_on": 1431433710, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "StarArcana", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel your pain, I needed forceps too :( it was quite traumatic.", "controversiality": 0, "created_utc": 1366897263, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcqud", "link_id": "t3_1d2mms", "parent_id": "t1_c9mbx5w", "removal_reason": null, "retrieved_on": 1431433687, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lovely1108", "author_flair_css_class": "green", "author_flair_text": "Feb 08 &amp; Nov 11", "body": "I tore with my daughter(1st pregnancy) but with my son I didn't. With my daughter I was in the hospital and they just told me to push. With my second I had a midwife and birthed at her birthing center. She was amazing, she had a crockpot full of warm water and oil and she'd dip washcloths in it and apply it to down there(I should mention I delivered on a birthing stool). Then when I started pushing she coached me through it and told me when to not push so things could stretch a bit. It worked. I didn't even tear a little bit. So it is possible to not tear the next time around. ", "controversiality": 0, "created_utc": 1366897314, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcrbm", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433680, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kimberlyann0507", "author_flair_css_class": "purple", "author_flair_text": "Mommy to 3 girls 8, 5 and 1 with one on the way", "body": "As someone who has had three c-sections and is about to have my fourth, don't do it. The recovery is terrible, it takes a long time and makes life much harder if you get pregnant again. \n\nMy first child was natural and took a day and a half of labor to deliver. When I found out my second was going to be stillborn I couldn't go through the delivery and elected to have a c-section. While I am glad I made that decision, it has made things much harder for all the other pregnancies and recoveries and my body will never be the same. Don't do it. ", "controversiality": 0, "created_utc": 1366897920, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mcxgc", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433600, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ShannonOh", "author_flair_css_class": null, "author_flair_text": null, "body": "How did L&amp;D go? Did you baby fly out in a couple pushes or did pushing go slowly? Could you feel what was happening during pushing (i.e., did you have an epi and was it in full strength during pushing)? When your baby was crowning, did you take a break and try to breath through a few contractions to allow some stretching? Did your care provider give your perineum support, physically? Did they give you any oil to help the stretch?\n\nAll these things affect the likelihood of a tear. Like others have said, every birth is different, but there *are* things you can do to try and minimize tearing. And that doesn' tnecessarily mean going \"natural.\" One way some women have success with an epi is to have it for dilation, but try and time it such that it wears off for pushing. ", "controversiality": 0, "created_utc": 1366898185, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9md07l", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433564, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "samarra", "author_flair_css_class": null, "author_flair_text": null, "body": " I wish I were brave enough. I am due in September, and have time to decide otherwise, but last time was just... horrible. Not the c-section, but the events leading up to it. I just want to have a normal experience and not go through that again, and the planned c-section seems to be the way to be in the most control of what happens, if that makes sense. ", "controversiality": 0, "created_utc": 1366898204, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9md0et", "link_id": "t3_1d2mms", "parent_id": "t1_c9mcbkf", "removal_reason": null, "retrieved_on": 1431433562, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "geekymama", "author_flair_css_class": "lightcoral", "author_flair_text": "Zoe (7) and Eva due 8/2!", "body": "Any good nurse will turn down the epidural so you know when to push. And if they don't, ask. I had an epidural and had absolutely no issues whatsoever pushing because they turned down the drip when it was time.", "controversiality": 0, "created_utc": 1366898652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9md52l", "link_id": "t3_1d2mms", "parent_id": "t1_c9mcgdg", "removal_reason": null, "retrieved_on": 1431433500, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loves_dogs", "author_flair_css_class": null, "author_flair_text": null, "body": "I had 2 long second degree tears and an episiotomy. The doctors that stitched me up didn't count stitches but it took them over 30 minutes. I can still sometimes feel the worst tear during sex. it's not super painful, just uncomfortable. \nHowever, I would not even think of electing to have a c section based on that. A c section would have way more than 28 stitches. And so much more risk and recovery time. ", "controversiality": 0, "created_utc": 1366898703, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9md5ma", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433493, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Perineal Massage sounds pretty unsexy but I wish I had known about how fun it could be with my first kid. Don't make it a choir just part of your sexy times that way its not the first time your body has had to accommodate something as large as a kids head. ;)\n\n\nhttp://www.midwife.org/ACNM/files/ccLibraryFiles/Filename/000000000656/Perineal%20Massage%20in%20Pregnancy.pdf", "controversiality": 0, "created_utc": 1366899083, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9md9qg", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433440, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "I'm with you on this one. I know that there are people for whom a c+section is the right, or only option (I have a friend who fell into a ravine on a backpacking trip as a teen, breaking her pelvis in 5 places. Her pelvis is now fused, so it's impossible for her to give birth vaginally since things can't shift around like normal). I feel that many women don't look at this procedure as what it is, major surgery. \nThere are many methods to prevent tearing, including perineal massage in the last months of pregnancy, and episiotomy. \n\nI wish OP luck, with whatever she decides upon, I know that if she's come to ask others she will likely do her homework before making a decision! ", "controversiality": 0, "created_utc": 1366899932, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mdj3r", "link_id": "t3_1d2mms", "parent_id": "t1_c9mblcy", "removal_reason": null, "retrieved_on": 1431433316, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "Talk to your doctor about physical therapy to bring your muscles back together when you have recovered from your next birth. \n\nMy coworker had this, and started doing physical therapy, and it really helped her. Don't suffer in silence! ", "controversiality": 0, "created_utc": 1366900127, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mdl9r", "link_id": "t3_1d2mms", "parent_id": "t1_c9mbkqr", "removal_reason": null, "retrieved_on": 1431433288, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "It's been 10 years since my first was born. Anything I should know as I prep for number 2 in November? (I know this doesn't have to do with the thread, but I have to ask!) ", "controversiality": 0, "created_utc": 1366900279, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mdmzg", "link_id": "t3_1d2mms", "parent_id": "t1_c9mb596", "removal_reason": null, "retrieved_on": 1431433266, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "doublecross", "author_flair_css_class": "purple", "author_flair_text": "1 year!", "body": "The c section left me with no feeling in the area below my belly button and I still get twinges of pain around the incision site.  I have an ugly scar and a pooch I just can get rid of.  Recovery from the c section was absolute HELL as well.  I was crying when they sent me home without prescription pain pills and told me to take ibuprofin.  You can't bend at the waist, you can't wear normal undies because it will touch the incision site and possibly rip it open again.  A c section is MAJOR surgery!  You can't use stairs or drive for weeks (I don't know if that applies for vaginal delivery too).  Do the research before you elect for c section.  If its truly what you want, then go for it.  Just be aware of the consequences.", "controversiality": 0, "created_utc": 1366900592, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mdqj7", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433219, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "The4mccoys", "author_flair_css_class": null, "author_flair_text": null, "body": "It's understandable. But remember each pregnancy and birth are different. With my son (my first pregnancy/birth) the pregnancy was hell, birth was even worse and was seconds from a section when he finally came out with my dr. Pulling him out 17 hours free inducing. My daughters pregnancy was a breeze, labor and birth lasted 6 hours and was easy. She was 3.5 weeks early, but I had no tearing, no hard labor. My body knew what to do this time and it went soooo much better. I'm now pregnant with number 3 and plan to have a home birth. I'm also due in sept! \n\nYou should really think about doing a VBAC. It could be a great experience!", "controversiality": 0, "created_utc": 1366901232, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mdyd1", "link_id": "t3_1d2mms", "parent_id": "t1_c9md0et", "removal_reason": null, "retrieved_on": 1431433117, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantiesinabunch", "author_flair_css_class": "blue", "author_flair_text": "UnSupermom of 2 boys", "body": "OK, during my first delivery (7 pound baby with the head of a watermelon), I broke my tailbone and got a pretty nasty tear.  A lot of the reason my tailbone broke and my tear were directly related to the size of his head and my own personal anatomy.\n\nWhen I got pregnant with my second, my tailbone was still sore and achy most days (this was 3 years later)-- I opted for a C-section early.  I cannot influence my own anatomy in a manner that would have prevented the tailbone issue and you certainly can't influence the size of the baby in a positive manner...so that is how I came to the conclusion that a c-section was my best option.  \n\nAnd compared to my traumatic vaginal delivery and tearing---the c-section was a walk in the park.  Best decision I have ever made in my opinion--regarding child birth that is.", "controversiality": 0, "created_utc": 1366901366, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mdzyr", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433096, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CREAMY_CHICKEN", "author_flair_css_class": null, "author_flair_text": null, "body": "I had Irish twins (11 months apart) &amp; the first Tore up my vagina! Tears, stitches you name it! Her head came out facing the left rather than straight if that makes sense...with the second one OMG it was a breeze! Athough I did needed stitches it wasn't NEARLY as bad as the first. I pushed for 13 minutes &amp; I was able to pull her out of my vagina &amp; put her on my chest :) she didnt tear me up as bad as the first. If you're interested there's massages you can do I believe there called perineum massages I can't link a video because I'm on a cell but basically you rub your \"gooch\" area between anus &amp; vagina. Apparently it helps with preventing tearing. I've never done it but heard lots about it. Hope that helps! But please go for the vaginal birth much better than a c-section. You can't even hold the baby once it's born :( watch TLC's baby story to compare &amp; contrast vaginal births &amp; c sections.", "controversiality": 0, "created_utc": 1366901525, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9me1uf", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433071, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snarklepop", "author_flair_css_class": "green", "author_flair_text": "Mom to one year old", "body": "Perineal stretching might help you. It is something your husband can help you do during your pregnancy.  There are videos on YouTube explaining how to stretch your perineum to prevent tearing.", "controversiality": 0, "created_utc": 1366901595, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9me2oi", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431433061, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snarklepop", "author_flair_css_class": "green", "author_flair_text": "Mom to one year old", "body": "Amen to this!", "controversiality": 0, "created_utc": 1366901838, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9me5n0", "link_id": "t3_1d2mms", "parent_id": "t1_c9md9qg", "removal_reason": null, "retrieved_on": 1431433022, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366902893, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9meixw", "link_id": "t3_1d2mms", "parent_id": "t1_c9md52l", "removal_reason": null, "retrieved_on": 1431432848, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dmxio", "author_flair_css_class": "orange", "author_flair_text": "9 yr boy 7 yr girl 3 yr boy", "body": "Delivered 4 kids vagnially here. I've torn with number 2 and number 4. Both were second degree tears requiring stitches. For me I wouldn't even think of a section because it's major surgery. After a few hours I didn't even feel the stitches but I have friends who are still having issues with their section scars. Since I had a child between the kids I tore with there is no way for you to know if you will even tear again.", "controversiality": 0, "created_utc": 1366903496, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9meqxw", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431432743, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "therealodayaka", "author_flair_css_class": "green", "author_flair_text": "1 Boy, 4; 1 Girl, 6", "body": "I tore pretty bad with my first (she was only 7lbs 3oz) because she birthed so quickly.  My son was much bigger (9lbs 8oz) but because I'd delivered vaginally before it was much easier.  They gave me a small episiotomy and I think I only had 6 stitches total that time.  It was much easier and I recouperated MUCH faster than I did with my first.\n\nI would talk to your doctor about your options with vaginal delivery before you jump to an elective operation.  It's MUCH easier to recover from a vaginal delivery (especially subsequent deliveries) than it is to recover from a major surgery like that.", "controversiality": 0, "created_utc": 1366905823, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mflmt", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431432341, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i also had a failed induction &amp; c-section, and planning to vbac #2 (not pregnant yet though). i also want to have a normal birth experience, but the cornerstone of that is going into labor on my own and delivering vaginally. you can't be induced after a c-section anyway, so if a major part of the trauma of your last birth was the induction process, you can avoid all that. it's almost reassuring in a way to know that all i have to do next time is sit and wait for labor to start, and if it doesn't start by 42 weeks, just schedule a c-section. no pitocin, no artificial water breaking, just \"my body does its thing or it doesn't.\"", "controversiality": 0, "created_utc": 1366905891, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mfmi5", "link_id": "t3_1d2mms", "parent_id": "t1_c9md0et", "removal_reason": null, "retrieved_on": 1431432330, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "my mom delivered me with a pudendal block instead of an epidural. it numbs things up WAY down there so you don't feel the \"ring of fire\" but can still feel contractions and know how hard you're pushing. ", "controversiality": 0, "created_utc": 1366906116, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mfpfd", "link_id": "t3_1d2mms", "parent_id": "t1_c9mcgdg", "removal_reason": null, "retrieved_on": 1431432291, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "geekymama", "author_flair_css_class": "lightcoral", "author_flair_text": "Zoe (7) and Eva due 8/2!", "body": "I felt the full pressure of every single contraction, just not any of the pain. The urge to push was quite intense when it came time.", "controversiality": 0, "created_utc": 1366906902, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mg04q", "link_id": "t3_1d2mms", "parent_id": "t1_c9meixw", "removal_reason": null, "retrieved_on": 1431432152, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gtwerd", "author_flair_css_class": "orange", "author_flair_text": "Girl(6yo) Boy(2yo) Boy(3mo)", "body": "I'm going to be blunt and put it this way:\n\nInstead of a tear that will take about a week of itching and mild pain (witch hazel helps) to heal, you want to get a giant scar across your stomach, from a cut so deep it ruins your stomach muscles and takes 6+ weeks to recover from, and that is only if everything goes well... (i know people with c-sections that had complications where the scar kept opening and oozing, and it took almost a year to heal.)\n\nI have nothing against c-sections.  Sometimes they are necessary, they save lives... but really? to get one just to avoid a tear around your vagina?  i hope this puts it into perspective for you.\n\nAnd sorry if this came off rude, it isn't meant that way.  Just hoping to help!\n\n\nFor personal experience, i tore pretty bad with my first one, got a small episiotomy for the second one.  The second one's recovery was very easy and pain free", "controversiality": 0, "created_utc": 1366908193, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mghie", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431431924, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beckolyn", "author_flair_css_class": "green", "author_flair_text": "Sabina (2/2012)", "body": "[This article](http://www.babyzone.com/pregnancy/labor-and-delivery/perineal-massage_71276), of sorts, explains that it may not be effective for second+ births. Additionally, when I took lamaze at my hospital, the nurse leading the class explained that the type of massage needed to make it effective is very intense and unpleasant. If done wrong, she said, it could cause damage, not to mention, for the intensity needed to achieve \"results\" most women wouldn't want that kind of additional pain during labor. If someone had done light massage on me and claimed it helped, I would never know (In reality, I had NO massage and tore very little, just needed a single stitch). Research is also still up in the air for it. It is possible that some of those women who did it might not have torn (much) anyway.", "controversiality": 0, "created_utc": 1366908642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mgnsf", "link_id": "t3_1d2mms", "parent_id": "t1_c9mdj3r", "removal_reason": null, "retrieved_on": 1431431842, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dinsette", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed. And if you think about it, a c-section is also a tear of sorts. The difference, though, it that aside from the short-term recovery issues, a c-section can also complicate things in the long term if you decide to try for child #3. If you think a c-section would make your birth experience much better and less traumatic, that's something to consider, but definitely think long and hard before asking for an elective c-section. I have had two c-sections and come through just fine, but if I were in your shoes, I'd definitely try the perineal massage and different laboring positions and stay out of the operating room!!!", "controversiality": 0, "created_utc": 1366908700, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mgolg", "link_id": "t3_1d2mms", "parent_id": "t1_c9mblcy", "removal_reason": null, "retrieved_on": 1431431832, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beckolyn", "author_flair_css_class": "green", "author_flair_text": "Sabina (2/2012)", "body": "This was my experience. I do not know if they adjusted my epidural strength at all, but I felt no pain of contractions and was still able to feel my bodies signs to push.", "controversiality": 0, "created_utc": 1366908773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mgpml", "link_id": "t3_1d2mms", "parent_id": "t1_c9mg04q", "removal_reason": null, "retrieved_on": 1431431818, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mizzmo06", "author_flair_css_class": null, "author_flair_text": null, "body": "Just ask to be cut. I did", "controversiality": 0, "created_utc": 1366909322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mgx83", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431431719, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "silver_soul", "author_flair_css_class": null, "author_flair_text": null, "body": "This is so, so wrong. I've pushed three babies out of my vagina (a 9 pounder and twins) all while medicated. I had absolutely zero problems pushing or feeling contractions. I support women who want to have unmedicated births, but scare tactics and bad information drive me nuts. ", "controversiality": 0, "created_utc": 1366909529, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mgzw0", "link_id": "t3_1d2mms", "parent_id": "t1_c9mcgdg", "removal_reason": null, "retrieved_on": 1431431684, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cakemama", "author_flair_css_class": null, "author_flair_text": null, "body": "A third degree tear is kinda a big bad thing, not to be taken lightly.  I had one and was bed ridden for a month. If I had a c-section it would've been safer in my case. I has complications well over the 6 Weeks, and continue to this day. My doctor will not do another v birth, and frankly neither do I want to go thru the pain and risk of having another 3rd degree tear, or have a 4th degree tear which is much much worse. Do some extra research with your doctor before making a decision, and decide what is safest for you and baby. ", "controversiality": 0, "created_utc": 1366909583, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mh0mv", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431431673, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cakemama", "author_flair_css_class": null, "author_flair_text": null, "body": "PS I was terrified of a c section. I have a weighty decision about having another baby. ", "controversiality": 0, "created_utc": 1366910018, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mh6vj", "link_id": "t3_1d2mms", "parent_id": "t1_c9mh0mv", "removal_reason": null, "retrieved_on": 1431431592, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "panthur", "author_flair_css_class": "purple", "author_flair_text": "4 yo boy", "body": "I agree personally that vaginal is better. But it took waaaay longer than a week for me to heal from my tear and episiotomy. And it wasn't \"mild pain\". I had damage down there that was still not normal at the 6 week mark and beyond. And don't get me started on the hemorrhoids!", "controversiality": 0, "created_utc": 1366911694, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mhung", "link_id": "t3_1d2mms", "parent_id": "t1_c9mghie", "removal_reason": null, "retrieved_on": 1431431208, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alpacathecamel", "author_flair_css_class": null, "author_flair_text": null, "body": "My first baby was10 lbs 1 oz. delivered at home naturally after 40+ hours of labor and 2.5 hours of pushing. I had a second degree year, almost 3rd, and 12 stitches.  Second baby was 10 lbs 2 oz, born after 6 hours of labor and 19 minutes of pushing. 3 stitches that she said were almost not necessary. I was amazed at how much less difficult it was and how fast it all went. I think it usually is a lot better the second time around. Good luck!", "controversiality": 0, "created_utc": 1366913126, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9miezh", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431430943, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "VioletMilo", "author_flair_css_class": null, "author_flair_text": null, "body": "There's lots of good advice in this thread already but I just want to repeat what someone said about \"purple pushing.\" As long as baby is doing fine during delivery, you should be able to take your time pushing and decide yourself just how hard or long to push. You don't need to be letting your caregiver coach your pushing unless there's a medical reason to do so. If you go with the flow and give your tissues time to stretch by pushing slowly(and adding the warm cloth and stuff will help in addition to this),you will be MUCH less likely to tear.  I know a lot of women who've said that they couldn't actually wait to push and just wanted to get it over with at that point....however, if you can try to slow it down, it really does make a difference!", "controversiality": 0, "created_utc": 1366914120, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9miszp", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431430759, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "VioletMilo", "author_flair_css_class": null, "author_flair_text": null, "body": "This works for some women, which is great. For me, however, it was extremely uncomfortable, so I'm sure it is for other women too. Perhaps I wasn't as diligent with it as I could've been, but I ended up tearing anyway and definitely won't even bother with my next babies!", "controversiality": 0, "created_utc": 1366914322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mivvw", "link_id": "t3_1d2mms", "parent_id": "t1_c9md9qg", "removal_reason": null, "retrieved_on": 1431430722, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "chocolateaffair", "author_flair_css_class": null, "author_flair_text": null, "body": "You *shouldn't* be induced for a VBAC, that doesn't mean some doctors won't push for it anyway. My doc pressured me so much to induce and even scheduled an induction that I didn't need (I went into labor naturally that morning, if I hadn't I had every intention of skipping it). Some docs just do not care.  For anyone reading this, find a midwife if you can, the experience is a miles and away better.\n", "controversiality": 0, "created_utc": 1366916442, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mjpy4", "link_id": "t3_1d2mms", "parent_id": "t1_c9mfmi5", "removal_reason": null, "retrieved_on": 1431430328, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1366918966, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mkpib", "link_id": "t3_1d2mms", "parent_id": "t1_c9mcqud", "removal_reason": null, "retrieved_on": 1431429862, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "itsnotaonesie", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a bit of a different perspective than some of the other posters...I have had 2 c-sections (one failed induction, one failed VBAC) , and I had a very positive experience with both. My reason for wanting to try the VBAC the second time was only because I was concerned about being able to lift my older child.  The recovery for both of them were managable.  I have no regrets.    The only thing I will tell you is that most OBs will not perform an elective c-section for no reason.  You may be hard pressed to find one willing to perform one.  Good luck with whatever you choose!", "controversiality": 0, "created_utc": 1366920050, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9ml5cb", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431429655, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toulousethemoose", "author_flair_css_class": "green", "author_flair_text": "Astrid 12/12/11", "body": "My labour stalled, baby was partially posterior and had to be delivered by ventouse, the obgyn almost did a section but I asked to give it one more go and success. Pushed for 2 hours after an hour for passive descent once I was fully dilated. Thank god i had an epi. So there are factors other than the year that made it a kind of traumatic experience for me. Then I had a post partum haemorrhage to top it all off. I hear the second goes much smoother for most people, glad to read so many stories to support that!", "controversiality": 0, "created_utc": 1366920750, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mlfb6", "link_id": "t3_1d2mms", "parent_id": "t1_c9md07l", "removal_reason": null, "retrieved_on": 1431429525, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "The problem is that it's hard to find a control subject for research things like this. (I know, very technical term there...from the technical writer...go figure!)  Each woman has a different set of circumstances, do they have an IV, are the on a pitocin drip, is the IV salt free, are they laying down, do they have an epidrual, can they move around, do they have scarring from previous deliveries/surgeries?  So many variables that it's really hard to have a decent scientific research sampling group.  Plus every woman is a different shape, and babies pass through the birth canal in different ways.\n\nI always try to take any research in regards to child birth with a [salt lick](http://en.wikipedia.org/wiki/Mineral_lick) (aka giant block of salt) due to the inherently low sample size as well as the lack of control conditions. \n\nIt's understandable though, because we want to produce an ethical experiment.  We can't FORCE women to be a control patient, and ultimately if they choose or need one of these options, then they should be allowed to make it.\n\nThe massage doesn't have to be horrible before hand...think of stretching an ear lobe.  You don't drop the 00 plugs in right away, there is a certain amount of prep work that occurs over time.  If you work up to it, it shouldn't be too bad.  I'd say it's like Yoga, for your vag (LOL).  Just work with what you can, and improve gradually over time.  ", "controversiality": 0, "created_utc": 1366921004, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mlj4e", "link_id": "t3_1d2mms", "parent_id": "t1_c9mgnsf", "removal_reason": null, "retrieved_on": 1431429475, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "StarArcana", "author_flair_css_class": null, "author_flair_text": null, "body": "That is no lie. :)", "controversiality": 0, "created_utc": 1366927714, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mo52q", "link_id": "t3_1d2mms", "parent_id": "t1_c9mkpib", "removal_reason": null, "retrieved_on": 1431428245, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ShannonOh", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like a rough one. I feel for you. Based on population stats alone you're likely have a better go of it next time. Good luck mama!", "controversiality": 0, "created_utc": 1366935001, "distinguished": null, "downs": 0, "edited": 1366988079, "gilded": 0, "id": "c9mqolu", "link_id": "t3_1d2mms", "parent_id": "t1_c9mlfb6", "removal_reason": null, "retrieved_on": 1431426977, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "boldwaves", "author_flair_css_class": null, "author_flair_text": null, "body": "I tore with my first, received stitches (I dongle how many) and had pain for 6 months. I didn't tear at all with my second and soreness was gone after the first few weeks. So, YMMV, but don't let something like that persuade you from attempting a vaginal birth. ", "controversiality": 0, "created_utc": 1366941560, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mt4g7", "link_id": "t3_1d2mms", "parent_id": "t1_c9ml5cb", "removal_reason": null, "retrieved_on": 1431425827, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toulousethemoose", "author_flair_css_class": "green", "author_flair_text": "Astrid 12/12/11", "body": "Haha, excellent point!", "controversiality": 0, "created_utc": 1366953283, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9mx9l6", "link_id": "t3_1d2mms", "parent_id": "t1_c9mqolu", "removal_reason": null, "retrieved_on": 1431423803, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Pypur", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a small tear with my first and none with my second. My OB says you always tear with the first. Good luck!", "controversiality": 0, "created_utc": 1366996431, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9n6z3a", "link_id": "t3_1d2mms", "parent_id": "t3_1d2mms", "removal_reason": null, "retrieved_on": 1431419157, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "KY!", "controversiality": 0, "created_utc": 1366999711, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9n89gu", "link_id": "t3_1d2mms", "parent_id": "t1_c9mivvw", "removal_reason": null, "retrieved_on": 1431418550, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PChuu22", "author_flair_css_class": "lightcoral", "author_flair_text": "3.5-year-old boy, 10-month-old girl", "body": "Do some research. Your personal experiences are not the norm for epidural deliveries.", "controversiality": 0, "created_utc": 1367159021, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9o9zxm", "link_id": "t3_1d2mms", "parent_id": "t1_c9mgzw0", "removal_reason": null, "retrieved_on": 1431396604, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "silver_soul", "author_flair_css_class": null, "author_flair_text": null, "body": "I've done the research and seen the statistics. I also know plenty of women who loved their epidurals and had zero problems. To say flat out that they WILL cause problems in order to scare women out of them is not productive. It's better to educate about best practices (for instance, waiting as long as possible to get one and not turning it up too high) than to demonize epidurals to promote a natural birth agenda.", "controversiality": 0, "created_utc": 1367162033, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9oap3v", "link_id": "t3_1d2mms", "parent_id": "t1_c9o9zxm", "removal_reason": null, "retrieved_on": 1431396275, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lathomp", "author_flair_css_class": null, "author_flair_text": null, "body": "As some one who had a fourth degree tear, weeks of healing and months before going #2 and sex were less than terrifying events, I just gotta say: everyone's experience is different. However, I've also had abdominal surgery, and, while I'd rather not have either,  the damage to muscles across your core is much harder to recover from in terms of strength.  Though months of hoping I don't lose my shit (literally) is a hard comparison.... ", "controversiality": 0, "created_utc": 1367189010, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9oix9b", "link_id": "t3_1d2mms", "parent_id": "t1_c9mghie", "removal_reason": null, "retrieved_on": 1431392326, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ilikedirt", "author_flair_css_class": "green", "author_flair_text": "1 y/o boy and 1 in the oven", "body": "Well good golly, I guess if I hadn't been medicated, I would've been able to push Boy 2 out in maybe one push instead of the three it took while I was all doped up, prostrate and confused??  ", "controversiality": 0, "created_utc": 1367203072, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "c9onnl6", "link_id": "t3_1d2mms", "parent_id": "t1_c9mcgdg", "removal_reason": null, "retrieved_on": 1431390025, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}