{"submission": {"author": "st0rebrand", "author_created_utc": 1302146149, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_52i97", "created_utc": 1373255616, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1hucoe/any_easy_birth_stories_to_share/", "gilded": 0, "id": "1hucoe", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/1hucoe/any_easy_birth_stories_to_share/", "retrieved_on": 1412079425, "score": 7, "secure_media_embed": {}, "selftext": "As I'm sure most of you did, I've been reading quite a lot of birth stories.  The vast majority of which are terrifying to me.  I'd love to hear some good stories and I'm sure it would be reassuring for those searching in the future to have them collected in one link.  I realize very few people are lucky enough to have an \"easy\" birth but a girl can have hope, right?\n\nWhat I think disqualifies your birth story as an \"easy\" one:\n\n1.)  Agonizing contractions in early labor (active labor is another story, obviously)\n\n2.)  Anything more than superficial/ first degree tears\n\n3.)  Drugs of any type not working the way they were intended.\n\n4.)  Nearly dying.  Either of you.  That should be a given.\n\n\nIt would be amazing if your story also included:\n\n5.)  No drugs\n\n6.)  First time pregnancy\n\n7.)  Labor being relatively short\n\n\nDo you know what totally unrealistic thing I'd love to hear?  \"I was having very mild cramps but I didn't think anything about it because labor is supposed to be horrible, right?  Well, all of a sudden I felt the need to push and fifteen minutes later my precious little [insert name here] practically fell right out.\"  \n\nIf you are one of the lucky few, please also share your words of wisdom.  Did you do the mommy workouts and squat your way to an \"easy\" birth?  Do you swear by willow bark tea?  Bradley Method?  Buddhist prayers while laboring?  Counter pressure by husband with chilled hands?  Perineal massage with coconut oil?  I'm all ears and taking any suggestion, ladies.  \n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Any Easy Birth Stories to Share?", "url": "http://www.reddit.com/r/Mommit/comments/1hucoe/any_easy_birth_stories_to_share/", "user_reports": []}, "comments": [{"archived": true, "author": "Dragynflies", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't do anything physical to prep for labor.  I read a lot of Ina May Gaskin stories and talked with other moms, but that was it.  My water broke at 4:26 am, I hung out at home until nearly 8, went to the birth center, called my doula and hopped into the birth tub, which was awesome and i highly recommend them!! My midwife showed up at 9:30.  I got out of the tub to \"go to the bathroom\" and was 10 cm. I pushed twice and had my baby.  I tore a little, and got some stitches, but I don't know how many or how bad I tore.  He was 8 lbs 10 ounces and 21 inches long, healthy and adorable :).   From water breaking to birth was exactly six hours and I was so happy! ", "controversiality": 0, "created_utc": 1373256210, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay07k2", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430548286, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vanessadawn", "author_flair_css_class": null, "author_flair_text": null, "body": "Good labor stories or bad the little baby in your arms at the end will make if all worth while. ", "controversiality": 0, "created_utc": 1373258206, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay0u79", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430547989, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "geekymama", "author_flair_css_class": "lightcoral", "author_flair_text": "Zoe (7) and Eva due 8/2!", "body": "First baby.\n\nSlightly uncomfortable contractions about 5-7 minutes apart for two days. Nothing that made me feel like I was dying.\n\nNothing at all on day 3.\n\nGo to bed around 10:30pm on Day 3. Wake up at 1:30am with contractions 3 minutes apart and feeling like I was going to die. Got to the hospital around 3:30am. Nearly took out the ER desk worker when she asked me to sign something.\n\nWent in at 3cm. Walked until I hit 4cm. Epidural went in on the first try and worked perfectly. I only felt pressure and was actually planning on trying to sleep. Not so much- went from 4cm to 10cm in an hour. Only minor abrasions, no tearing.\n\nBaby was born at 8:55am. So from active labor to baby it was under 8 hours.", "controversiality": 0, "created_utc": 1373259725, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay1aj3", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430547705, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!  ", "controversiality": 0, "created_utc": 1373264619, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay2ljg", "link_id": "t3_1hucoe", "parent_id": "t1_cay1aj3", "retrieved_on": 1430547002, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "I've heard that.  A lot.  I also believe it.  But the point of the post was to get some hope that I might not be ripped from stem to stern after 70 hours of excruciating labor in order to help me deal with my anxiety.", "controversiality": 0, "created_utc": 1373264782, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay2mvg", "link_id": "t3_1hucoe", "parent_id": "t1_cay0u79", "retrieved_on": 1430546984, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "Lovely.  Exactly the sort of thing I was hoping to hear.  Thank you  :)", "controversiality": 0, "created_utc": 1373264906, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay2nxt", "link_id": "t3_1hucoe", "parent_id": "t1_cay07k2", "retrieved_on": 1430546970, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1373287682, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay6a2v", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430545197, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "discordandrhyme", "author_flair_css_class": null, "author_flair_text": null, "body": "I went to my 37 week appointment to find out if I was dilated or effaced at all. Nope. This was at 2:30 PM. My SO and I went out, shopped, went home and he made dinner. At 11:30 PM we get in to bed and I feel a pop, I just think its my hip but I start leaking. I run to the bathroom and sit on the toilet, still gushing fluid. I call my midwife and she says to come on in to the hospital. Cramps start almost immediately but they're extremely tame. SO and I get to the hospital at 12:09 AM and I'm checked in to L&amp;D. Cramps and contractions are starting to get a bit more brutal now. SO times them for me and he says 2 minutes apart and the nurse says I'm 4cm. Uh, wait what?!\n\n12:45 AM rolls around and I'm in paaaaain. I beg for an epidural but my room isn't ready yet. 1:00 AM happens and I'm wheeled up to my room. Nurses say that the anesthesiologist is filling out paperwork and that I should sit on the bed. Contractions are extremely painful now, but I can work through them. I hesitate getting on to the bed because I have about 20 seconds in between each contraction. My SO is standing there silent and in shock, not knowing how to tend to me. Around 1:35 AM I make it on to the bed and tell to nurses I need to push. They say no I don't, but I insist. My midwife comes in and checks me and I'm 10cm. They tell me to push and at 1:39 AM, Jackson was born. \n\nFTM, 2 hour labour from start to finish, 2 minutes of pushing,, drug free birth with nothing more than \"skid marks\" on the tearing scale. ", "controversiality": 0, "created_utc": 1373294578, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay80tq", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430544375, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NotCleverEnufToRedit", "author_flair_css_class": null, "author_flair_text": null, "body": "Water broke, no contractions all night. Pitocin the next morning, epidural, took a nap, doctor woke me up, we laughed because I couldn't move, tried to figure out how to push while we were still laughing, baby came out before I figured out the pushing.", "controversiality": 0, "created_utc": 1373294892, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay84fh", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430544328, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SadPandaOuch", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, not sure if I am disqualified because I had a very long, internal tear, but it was very superficial and shallow, just long. Took a while to stitch, though. \n\nAnyway. Early labor hurt less then my Braxton hicks contractions. I didn't realize I was in labor for like, 90 minutes because I thought I just had gas. My husband and I went for a long walk, ate breakfast on our balcony, and tied up loose ends. It was seriously no big deal, and my contractions started out 1 minute long &amp; 5 minutes apart. I was happy and excited. Went to doc when it felt to me like things were picking up (but still not painful). Told I was a 3, and since I was so cheery and comfortable they sent me home. Get home 15 minutes later, water breaks when I'm on the toilet. 2 contractions later I have the \"uncontrollable urge to push\". It takes a little bit for my husband to drag me back to the hospital. I was in the zone &amp; didn't think we'd make it back in time (and honestly didn't care! I was so ready to just do it myself). Get back to triage 45 minutes after leaving the first time. Nurses look at us like we are wasting their time, but when they check me I'm complete, +2 into the birth canal. They rush me into a room, I have to try not to push for 20 minutes while they finish triage vitals tracing (that part sucked a lot), push for 20 minutes, switching positions constantly, tore a bit because peanut was compound arm and born fast. I found moaning really helpful while pushing to keep from holding my breath. The whole thing was a little under 12 hours start to finish, no drugs, no interventions, and honestly a lot easier than I expected. First pregnancy. \n\nI didn't do much to prepare aside from listen to hypnobirthing tracks daily and sometimes sit on a birth ball (that was just comfortable). No perineal massage. No yoga. My husband helped me switch positions in labor, but otherwise I didn't want anyone to touch me. ", "controversiality": 0, "created_utc": 1373297300, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay8xiv", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430543948, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zifna", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a very straightforward labor with minimal tearing and no painkillers for my son, which was my first (so far, only) pregnancy.\n\nOn the downside, it was 36 hours long because my water broke before I was really in labor, and I did have a very minimal amount of pitocin... and I did have a dinosaur doctor pressuring to take more drugs for much of the labor... but I really can't complain. I mention these things only because I think that you can still have a lot of things happen you'd rather not have happen and still have a really great experience. =) I did do Bradley exercises and take blackberry/raspberry leaf tea, although I wish I had done more of both.", "controversiality": 0, "created_utc": 1373299504, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cay9pjm", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430543580, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "With The Boything, I'd say labor was pretty easy. I went in around 5 am that morning, had my water broken and pitocin given about maybe an hour, hour and a half later and had the epidural about three hours after that when the back pain got so bad I couldnt' stand it.\n\nThe only real hitch was my son..he was determined to come out sideways, the little stinker. The doctor turned him once and said \"OK push!\". Which I did. And a couple pushes later, he was jammed in there sideways..again. So she turned him the right way round and told me to push again. And again he jammed himself sideways. So she grabbed the salad tongs and pulled him out because clearly, he didn't want to do this on his own the way she wanted him to.\n\nI didn't do anything special to prep for labor..I knew you were supposed to go Lamaze classes but I skipped them since I knew I was going to have an epidural. I thought Lamaze was just for women who had decided to go old-school and didn't want any drugs for whatever reason.\n\nI also had very few Braxton-Hicks contractions...and even those weren't bad. It was more like a slightly annoying twinge than any real pain. \n\nReally, the worst part about being pregnant was the fact that since I was on my feet all day (I was working as a cashier back then) my feet and ankles swelled up so much I almost couldn't get my shoes on. I also had terrible back pain because I was standing all day on bare concrete without a spongy mat (I'd asked for one..the store manager said no because he thought I was being a crybaby). There were days when I would just crawl out to my car and spend ten or fifteen minutes sobbing because my back hurt so much.", "controversiality": 0, "created_utc": 1373302360, "distinguished": null, "downs": 0, "edited": 1373302593, "gilded": 0, "id": "cayas12", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430543005, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "silver_soul", "author_flair_css_class": null, "author_flair_text": null, "body": "First pregnancy: Did absolutely nothing to prepare for birth. Labored at home for 12 hours before going to the hospital at 8:30 AM. Epidural was great. Gave birth at 12:30 PM. Baby had cord wrapped around his neck and needed to get out ASAP, so doc asked if she could do an episiotomy when her stretching wasn't cutting it (no pun intended). Not fun, but not horrible either. \n\nSecond pregnancy (twins): Again, did nothing to prep. Water broke at 37 weeks. Got to the hospital around 2 PM, augmented labor for 8 hours, epidural at 10 PM in case of emergency c-section. Pushed two babies out 5 minutes apart around 11 PM, no tearing. Took a shower and got dressed the next morning, ready to go. Much easier than I had anticipated, that's for sure!", "controversiality": 0, "created_utc": 1373305165, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caybv38", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430542493, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hammond_Cheese", "author_flair_css_class": null, "author_flair_text": null, "body": "I laboured from 5am til 730pm with my first baby and the contractions were just uncomfortable, never painful until the last hour of labour which was probably transition. I did nothing to prepare for labour and birth, no classes or excersies and I didn't get to the hospital until the last half hour. No drugs, not even gas and air just 20 minutes of pushing which to me only felt like 5 minutes. Ok so I did tear 2nd degree which can be normal with first babies, but I didnt even notice it. It's not like all of a sudden you tear like paper ripping or anything, I wasn't even aware that I had I thought I was in the clear because I thought it would hurt alot more. The crowning part was the worst part of labour but once his head popped out it was immediate relief the rest of the way.", "controversiality": 0, "created_utc": 1373307226, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caycocc", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430542110, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lifeofvirtue", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha, your \"totally unrealistic\" labor is pretty much exactly how mine went down! I was dilated to 4 and had no clue so my doctor had me come in to the hospital to get hooked up to the monitors to track the contractions because I couldn't feel them. My water broke at noon, I never had any significant pain, I felt the urge to push around 6pm and at 6:35 after 4 or 5 pushes my perfect 8.5lb baby boy joined the world! I couldn't have asked for an easier pregnancy or labor - they're not all awful!!! Best of luck to you and congratulations on your little one!!! ", "controversiality": 0, "created_utc": 1373309682, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caydna4", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430541654, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": ":O  You are awesome.  I was totally just throwing that out there.  Thank you!", "controversiality": 0, "created_utc": 1373309964, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caydr86", "link_id": "t3_1hucoe", "parent_id": "t1_caydna4", "retrieved_on": 1430541601, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm glad I shouldn't be so scared of tearing.  :)  Thank you", "controversiality": 0, "created_utc": 1373310080, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caydswy", "link_id": "t3_1hucoe", "parent_id": "t1_caycocc", "retrieved_on": 1430541580, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "1.)  Salad tongs made me lol\n\n2.)  Your boss was an a-hole.  :(  \n\nThank you", "controversiality": 0, "created_utc": 1373310237, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caydv2r", "link_id": "t3_1hucoe", "parent_id": "t1_cayas12", "retrieved_on": 1430541551, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm trying to keep that in mind.  I really do believe whatever it takes is what it takes to get a happy, healthy baby into the world.  :)  Thank you.", "controversiality": 0, "created_utc": 1373310390, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caydx81", "link_id": "t3_1hucoe", "parent_id": "t1_cay9pjm", "retrieved_on": 1430541523, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "Totally not disqualified.  I'm glad you shared.  ", "controversiality": 0, "created_utc": 1373310580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caydzyh", "link_id": "t3_1hucoe", "parent_id": "t1_cay8xiv", "retrieved_on": 1430541487, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "LMAO, that's awesome! ", "controversiality": 0, "created_utc": 1373310666, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caye182", "link_id": "t3_1hucoe", "parent_id": "t1_cay84fh", "retrieved_on": 1430541471, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "knottymommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Labour with my first started with PROM at 1:09am. Contractions started within 30 minutes. I was in active labour within a few hours and progressed steadily. Laboured mainly on my hands and knees and/or in the birth pool. It was tiring, but manageable the whole time. Started pushing around 11:30am.\n\nPushing was long and difficult because my daughter's hand was tied to her face by the cord. It was also manageable with the strong support team I had with me. I still only had a minor internal 2nd degree tear that I could barely feel during recovery. I hemorrhaged but didn't \"nearly die,\" my midwives handled everything quickly and my recovery was quick. We were out and about at the store by day 3. She was born after exactly 12 hours of labour (maybe 6ish hours of active labour).\n\nMy second labour started with irregular contractions in the late evening and were more regular by the morning. My midwife came to check me but labour was \"stalling.\" She left and I took a nap. Contractions were easy enough to talk through at this point. By later that evening (8-9ish) I called her back and I was in active labour. Again laboured mainly on hands and knees in or out of the birth pool.\n\nPushing was hard work, shorter than my first but still a bit long on average, but manageable. She was born at 2:33am, so about 8ish hours of active labour. Minor internal \"graze\" as my midwife described it and 1 optional stitch to speed healing. We were out and about for Easter 2.5 days later.\n\nMy girls were 8lbs4ozs 21.75\" and 9lbs3ozs 22.75\" (I'm 5'3\" for reference). Both were born at home with 2 medically midwives present.", "controversiality": 0, "created_utc": 1373315542, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayfyz8", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430540557, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yeuxsee", "author_flair_css_class": "green", "author_flair_text": "O, 1/14/13", "body": "I posted my birth story in r/babybumps, [here ya go](http://www.reddit.com/r/BabyBumps/comments/16u6bi/orion_matthews_very_long_birth_story_unmedicated/). \n\nWe did the Bradley Method and rocked it. I took prenatal yoga twice a week for most of my pregnancy, which I think is really key. I also did some yoga at home and Bradley exercises daily. I was in the best shape of my life I think! I also got a lot of massages, but I'm a massage therapist who had a trade going with a coworker so it was free &amp; kind of a given that I would on the table once a week. I was very determined to have a unmedicated quick labor and that's pretty much what happened. I hope that helps!", "controversiality": 0, "created_utc": 1373316044, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayg6c8", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430540461, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/19/12", "body": "First baby. I didn't do any workouts or yoga or anything, although I am a musician, so controlling my breathing and mind is something I have a LOT of practice in. I also did perineal massage with vitamin E oil and my midwife did a \"pelvic tour\" with me to give me a preview of the kinds of sensations to expect. Highly recommend both of these! Altogether my labor was about 11 hours, but it was only bothersome for maybe 5.\n\nI was a week overdue, very little in the way of BH contractions, no loss of mucus plug, so when at about 8:30 in the morning I felt very mild period cramps, I dismissed them and went back to sleep. By 9:30, I couldn't sleep through them anymore, so I got up and went about my day, still fully expecting them to go away. My Mom was staying with us (first grandchild for her!), so she persuaded me to time them at about 10:30, by which point they were already a minute long and only 2 or 3 apart. I still didn't want to get my hopes up, so I held off on calling my husband home and calling the midwives until noon. I could keep my voice entirely steady through contractions, so they just said to keep in touch. Once my husband got home, I just ate light foods and played video games with him until the contractions got distracting enough, about 4:00. However, at 4:30, I was still able to answer questions on Jeopardy! during them, so I didn't think I was in active labor. My mother thought I should call the midwives back, though, so I humored her. They listened to me (by this point I didn't *want* to talk through contractions but I *could*) and said I could come in if I wanted. We decided to go in and, because it was rush hour, the 15 minute drive took 45. This was the worst part of the entire labor (being stuck in one position in a car SUCKS), however I felt clear-headed and was commenting on the drive and felt no need for medication, though I did feel the need to hum through contractions.\n\nGot to the birth center and they realized that they could actually see her head a bit and that I was 8cm! That whole car ride was not just active labor, but transition--and it was nowhere near as awful as I'd expected. They tried to do monitoring but it didn't work well with her head so low so they gave up and had me get in the tub. Oh, the blessed tub. That took me right back to around 4:00 in terms of intensity, though it was now 6:30-7. My husband did counter pressure, which was also lovely. However again, my mind was totally clear and we were joking around in between contractions--absolutely no desire for meds.\n\n After about half an hour in the tub, they told me I could push, which surprised me as I did not feel any urge to. Consequently, it took a few contractions for me to get the hang of it. She came out after about 3 good pushes (the one before, I could see her hair!!) and I had two tiny tears that needed no stitches, just glue on one. I think I could have avoided even that if I hadn't been slightly impatient and pushed through the end of the last contraction rather than waiting for the next one. I could feel the tear, but it felt only like a paper cut under the intensity of everything else. I had no idea how bad it was until they took a look later.\n\nShe came out so easily that she was born in the caul, which broke as my husband lifted her out of the water and she was so calm about the whole thing that she barely cried and they had to pinch her to do her APGARs. I delivered the placenta easily about 10 minutes later. My husband got to cut the cord and they let us all snuggle together in bed for a couple hours. She latched on immediately and easily. Also, all pain vanishes instantly. I felt quite squidgy around the middle and shaky, but that's it. After doing all the post-birth necessities, they sent us home just after midnight and by 1am, all three of us were tucked into our bed at home.\n\nI feel so blessed--I really couldn't have asked for anything more! And, for what it's worth, I feel I only have about an average pain tolerance.", "controversiality": 0, "created_utc": 1373316988, "distinguished": null, "downs": 0, "edited": 1373317478, "gilded": 0, "id": "caygk2t", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430540281, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "I've never heard of a pelvic tour.  It's a great idea.", "controversiality": 0, "created_utc": 1373320400, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayhv0e", "link_id": "t3_1hucoe", "parent_id": "t1_caygk2t", "retrieved_on": 1430539667, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "Heck yes, yoga!  And massages.  My husband swears he'll actually try now.  \n\nAre Orion's vocal cords alright now?", "controversiality": 0, "created_utc": 1373321273, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayi6sz", "link_id": "t3_1hucoe", "parent_id": "t1_cayg6c8", "retrieved_on": 1430539442, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yeuxsee", "author_flair_css_class": "green", "author_flair_text": "O, 1/14/13", "body": "My yoga teacher is a genius - there's a partner class every session, so dads to be come &amp; try yoga &amp; then want to do more! My guy came to two partner yoga classes! \n\nHis vocal cords are just fine. He got steadily louder until his check up at 1 month and now can scream with the best of them. Sometimes when he's really really really upset the funny goose sound will come back but that rarely happens anymore. ", "controversiality": 0, "created_utc": 1373322247, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayijh9", "link_id": "t3_1hucoe", "parent_id": "t1_cayi6sz", "retrieved_on": 1430539276, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AshLegend", "author_flair_css_class": null, "author_flair_text": null, "body": "I've got one! This was a hypnobirth :) And my first child after intense assistance to get pregnant. I had a uterine septum removed, pelvic adhesions, abdominal adhesions, endo, and annovulatory cycles.\n\nMy son arrived on a rainy Monday at 12:17PM. Sleep did not come easy to me at 40w5d. It was nearly one o'clock in the morning and I was having trouble drifting off because I felt pressure down there and thought I had to use the bathroom. Somehow I managed to finally drift off, only to be awoken around 3:30am with the urge to use the bathroom. As I groggily meandered to the toilet, I really didn't think anything was starting. After sitting there for a half hour, it suddenly dawned on me that these were regular contractions. So I drew a nice warm bath, got in, and relaxed for nearly an hour. I finally called out to my husband, who was still sleeping, that perhaps we ought to time my contractions. He bolted out of bed and rapidly obliged. They were less than 5 minutes apart and getting closer. We called the midwife to let her know that this was the day. Around 6AM, we met the midwife at the birth center. They were closed that day, so it was just the three (soon to be four!) of us. I sat and labored on my birthing ball, gently rocking back and forth, while the massive birthing tub was filled with warm water. The lights were on the lowest dimmer setting and we lit my lavender candles and placed them around the tub. I got in to the welcoming warm water and eased my seemingly massive weight into the tub. It was instant relief. I was weightless and could move around, flipping from my back to my stomach and rolling around in the warm water. My iPad was hooked into the birth center's sound system and I played the playlist I had prepared (mainly Peter Murphy and Dead Can Dance's new album). THe contractions didn't exactly hurt, but I knew they were happening. It was mainly pressure that came in surges. At 11AM, I finally asked the midwife to check my progress. I was at 9cm. It wasn't long after that I felt the urge to push. It was an overwhelming urge. My son was born at 12:17PM still in his gestational sac. I was on all fours and pulled him to my chest through my legs and just held him, crying the best tears of my life. He looked up at me, right in the eyes, as I held him. He let out a quick cry, then I laid back with him on my chest. He latched on and promptly fell asleep on me. We laid in the tub for nearly an hour before cutting the cord. After my husband cut the cord, they took my son away to weight him while I washed myself off and shampooed my hair. It felt great to clean up. The tub was drained and I was helped out and onto the queen size bed. They brought my son to me. When I was checked, I barely had a graze. In fact they really weren't sure if it even was a graze. ", "controversiality": 0, "created_utc": 1373322871, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayirqv", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430539168, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "He really was...I had a note from my doctor stating I *needed* to take breaks throughout the day so I could rest, grab a snack, etc and the boss totally ignored it. A couple of times, I actually passed out in front of customers because I hadn't eaten in so long. I quit not long after the birth of my son and I was never so glad to leave a place..the guy was just so hard on his female employees.", "controversiality": 0, "created_utc": 1373324028, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayj6kv", "link_id": "t3_1hucoe", "parent_id": "t1_caydv2r", "retrieved_on": 1430538974, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AshLegend", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, and i relaxed and practiced my hypnobirthing exercises in a nice warm bath as often as I could. It was almost every night near the end because the tub was the only way I could get comfy. I also drank iced red raspberry leaf tea constantly. I did use gas and air at the last bit because i had some discomfort from my remaining pelvic adhesion. G&amp;A is very popular in Britain, but just now coming into use in the States. A few hospitals offer it but my birth center is among the early adapters. I could have easily gone without it, though.", "controversiality": 0, "created_utc": 1373324284, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayj9vu", "link_id": "t3_1hucoe", "parent_id": "t1_cayirqv", "retrieved_on": 1430538930, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "labbrat", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I took a Bradley method class.  I practiced kegels in a very half-hearted way for a few weeks and then did a few once in awhile if I remembered.  I was incredibly unfit, physically (not too overweight or anything, but also not strong at all).  \n\nI had never had any Braxton-Hicks contractions, so when I was 2 days overdue and started getting mild menstrual cramp-like feelings roughly 30 minutes apart, I figured that was it.  I managed to finish out the workday with no problems whatsoever - those few hours were easier than shark week.  Husband and I got takeout dinner, checked that the bags were ready, and chilled.  I had some more contractions later that night that were more painful than cramps but not too bad.  I showered, which spaced them really far apart, and then I went to sleep for a few hours.  Woke up, had a contraction, browsed reddit, went back to sleep.  Woke up again at 3 AM from another contraction.\n\nHusband was helping me by rubbing my back during contractions.  I was moaning.  They were kind of intense and approaching a minute in duration.  Still, they weren't so bad.  After another shower around 6:30 AM, which spaced them out a bit again, we went to the hospital at 9:30.  I was moaning and kind of spacing out during contractions (still, the pain was manageable with massage).  Got checked - 7 cm and she had dropped quite a bit (plus something, I forget the number station).\n\nAbout 3 hours later, I was pushing, and after 2 hours of pushing, she was born!  No drugs.  No tears.  First pregnancy.  Breathed through everything and zoned out mentally.  Start to finish, it was 24 hours, but I napped and worked and watched a lot of TV for large chunks of that.  \n\nHope this helps!", "controversiality": 0, "created_utc": 1373333154, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayme95", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430537460, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "colesmomma", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have a great story to share -- but I just wondered why you asked this question? Every experience is different no matter what you read, research, plan for or hope for.. It's all part of holding that little peanut in your arms. :) ", "controversiality": 0, "created_utc": 1373333447, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caymi5i", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430537408, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sortaplainnonjane", "author_flair_css_class": null, "author_flair_text": null, "body": "I thought mine was relatively easy.  I was a first timer.  Labored at home without much issue until I decided it was time to go to the hospital.  Checked in at 3 pm at 6 cm.  Draped myself across an exercise ball, then hopped into the tub for a bit.  Got checked a bit later, was at 7 cm.  Crossed from coping to insane pain, immediately got an epidural that worked quickly.  Spent the rest of the night high on the endorphins from the crazy last contractions before the epi.  I could still feel my legs and move them.  Knew when/how to push and that part only lasted 20-25 mins.  Baby was born easy-peasy!  :) \n\nMy husband did squeeze my hips through contractions until the epi.  He also helped me count which was my way of dealing with the contractions.  (I knew they only lasted about 30-40 secs til they were bearable again.)  ", "controversiality": 0, "created_utc": 1373335465, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayn92r", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430537056, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "End_Of_The_Internet", "author_flair_css_class": null, "author_flair_text": null, "body": "By others standards I had an \"easy\" labor.  TLDR:  FTM, contractions started at 4am, got to the hospital at 6am, pushed for 15 minutes and had the baby at 6:29am!  Yup, 2.5 hours.  No time for meds.  I had a 2nd degree tear from him flying out of me, lol.  Pushing through contractions is the wildest feeling ever.  The contraction pain literally stops when you push.  It's crazy!\n\nI will say that I was in denial from 4am-5am that I was actually in labor!\n\nThe long story is in one of my posts :). I think I hit some of your criteria!", "controversiality": 0, "created_utc": 1373339575, "distinguished": null, "downs": 0, "edited": 1373339921, "gilded": 0, "id": "cayotvk", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430536312, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "That kid started life in the fast lane!  lol", "controversiality": 0, "created_utc": 1373340697, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayp97z", "link_id": "t3_1hucoe", "parent_id": "t1_cayotvk", "retrieved_on": 1430536111, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm all for epis that go well.  :)  Thank you for sharing.", "controversiality": 0, "created_utc": 1373340765, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caypa2x", "link_id": "t3_1hucoe", "parent_id": "t1_cayn92r", "retrieved_on": 1430536100, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "A lot of the stories you hear are horror stories.  Nearly died.  Ripped from stem to stern.  Labor lasted literally days.  So doped up I and my baby couldn't breastfeed.  That sort of thing.  I just wanted a repository for positive birth stories.  I'm honestly afraid of child birth.  The thought of it fills me with anxiety.  Hearing positive stories helps ease that anxiety.", "controversiality": 0, "created_utc": 1373340922, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caypc6g", "link_id": "t3_1hucoe", "parent_id": "t1_caymi5i", "retrieved_on": 1430536073, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "It did!  Thank you.", "controversiality": 0, "created_utc": 1373341017, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caypdf8", "link_id": "t3_1hucoe", "parent_id": "t1_cayme95", "retrieved_on": 1430536057, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "If I had a birth exactly like that I would be so happy.  Thanks for sharing.", "controversiality": 0, "created_utc": 1373341215, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caypg0s", "link_id": "t3_1hucoe", "parent_id": "t1_cayirqv", "retrieved_on": 1430536023, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "End_Of_The_Internet", "author_flair_css_class": null, "author_flair_text": null, "body": "I know, right? If it had been rush hour I would be telling you the story of how I delivered in my car, lol!", "controversiality": 0, "created_utc": 1373342337, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caypuwr", "link_id": "t3_1hucoe", "parent_id": "t1_cayp97z", "retrieved_on": 1430535756, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sortaplainnonjane", "author_flair_css_class": null, "author_flair_text": null, "body": "My plan was to remain flexible about it.  I tried a bunch of other things before I realized that they weren't going to work and I was needlessly suffering.  A resident placed it which prob wouldn't have been my first choice, but she actually did a superb job: very quick and it worked well.  :)  ", "controversiality": 0, "created_utc": 1373342500, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caypx1r", "link_id": "t3_1hucoe", "parent_id": "t1_caypa2x", "retrieved_on": 1430535728, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "peachybutton", "author_flair_css_class": null, "author_flair_text": null, "body": "First pregnancy. A week before my due date I was at work on a Friday finishing up a long and stressful project. I finished around noon, had some menstrual-like cramps and light contractions during the afternoon, but I ignored them because it was so early and I figured it was nothing. Once I got home they were more intense but not horrible at all. I'd read Natural Childbirth the Bradley Way with every intention of practicing all the techniques as long as I felt confident and leaving the epidural option on the table. \n\nAnyway, I continued to have contractions and knew by around 10pm that I was in labor. I labored at home until 1 a.m. then checked in to the hospital at 5cm. They broke my water. By 3:30 a.m. I was 7cm and received an epidural, and got to 10cm by 4:30. I pushed less than 10 times, and my son was born at 5:40 a.m. So ~14 hours from first contractions to baby! I was shocked that it went so fast! \n\nI will warn you because no one warned me - the next day I took a shower and didn't ventilate the room at all, and I passed out from the combination of recent blood loss and steamy bathroom. I was fine but had to stay an extra day. So when you shower, ventilate!\n\n ", "controversiality": 0, "created_utc": 1373342946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayq2u4", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430535652, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "-StockholmSyndrome-", "author_flair_css_class": null, "author_flair_text": null, "body": "First baby. I drank Raspberry Leaf Tea from the recommended time, 3 cups a day. On the day before my due date, I decided I'd had enough of being pregnant, and the weeks of slightly painful Braxton Hicks. So I walked around the block twice, walked up and down the stairs in my apartment building as many times as I could, and basically stayed on my feet all day to try and get labour going.\r\rAround 8pm, I suspected I was in early labour, my contractions were coming about 10 minutes apart but weren't very painful. I called the hospital at 8:30 and they told me, \"You aren't in labour yet, call us in the morning.\" Ok. Around 9pm my waters broke (hindwaters, as it happens) so I called again. They weren't convinced, but said to call back in half an hour to let them know how much water had \"leaked\". Called back at 9:30, contractions 5 minutes apart. They told me to come in. I got to hospital around 10pm, the midwife looked at me and told me I would have to go back home, it was too early in labour.\r\rOn a whim, she decided to do an internal exam before I left. I was 5cm dilated, she was amazed, said I looked too calm to be that far along. By 10:30 they had me set up in the birthing room. The midwife said she would check on me in an hour or two, and that I probably wouldn't have the baby until daylight. Things went much quicker than expected, and at 2:08am I gave birth to my little girl. No drugs, no pain relief at all really. Just found a good position and pushed her on out. \r\rThe entire thing was over in around 6 hours, I'm told this was very quick for a first baby. The midwife raved to everybody that it was the one of the easiest labours she had ever seen. I had a superficial tear that required 2 stitches, and I healed ridiculously quickly. The next day, the midwives couldn't feel my uterus at all and said it must have already shrunk back completely. They said they've never seen that happen so quickly before. My \"after pains\" were almost non-existent, they didn't believe me when I kept saying I didn't need any pain relief afterwards. Apparently I was some kind of medical marvel, lol.\r\rThere were more details to my labour, obviously, but the point is that I had a very easy, uncomplicated labour. I can't say for sure that it was down to the Raspberry Leaf, but I would definitely recommend it.", "controversiality": 0, "created_utc": 1373344581, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayqng6", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430535383, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "It's totally worth a shot.  I'll be picking up some of that tea, thanks.  ", "controversiality": 0, "created_utc": 1373349295, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cays2hi", "link_id": "t3_1hucoe", "parent_id": "t1_cayqng6", "retrieved_on": 1430534716, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the warning.  :)", "controversiality": 0, "created_utc": 1373349364, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cays36d", "link_id": "t3_1hucoe", "parent_id": "t1_cayq2u4", "retrieved_on": 1430534706, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "-StockholmSyndrome-", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem. If you can't find the tea, or can't stand the taste, you can also get it in pill form apparently.", "controversiality": 0, "created_utc": 1373356807, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caytqsc", "link_id": "t3_1hucoe", "parent_id": "t1_cays2hi", "retrieved_on": 1430533926, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ProspectGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "First pregnancy: Never had any braxton hicks contractions during my pregnancy. Husband and I had sexy time at 9pm - I noticed a slight pink discharge when I cleaned up, but didn't think too much about it (in retrospect I *think* this is when my water broke). Went to sleep. 1 am, I wake up feeling like I am having cramps - lay there for a while and notice that they are only a couple minutes apart. Time them for a while and call the midwife. At this point, they are clearly contractions but not as painful as I expected them to be. I tell the midwife frequency and duration - they were only about 30 seconds each and she says to call her back when they are more like a minute long. So husband and I continue to time them. I wouldn't say they were painless, but I remember menstrual cramps as a teenager that hurt that much. Finally at 5 am they are frequent and longer. Call the midwife again. She can tell I'm feeling it now, and says come in. We arrive at the Midwife Center and she checks my cervix. I'm 9 cm! I'm not ready to push yet, so I go sit in the jacuzzi tub and husband pours water over my belly (the best thing ever!). Finally feel the urge to push.  The most comfortable initial position for me is on the toilet, so midwife hangs out with me there during initial pushing. Then we move me to the bed for the grand finale. Again, this whole time it DOES hurt, but it's manageable. I was surprised to find that between contractions I was able to have a normal conversation with my husband and the midwives. The hardest part was when the baby was actually in my vagina and almost out. Those pushes hurt a lot! Baby was born at 8:45 am. Minor stitches and tearing. No drugs. Within a few minutes of her birth, I was talking about when we would have baby #2. It was way faster and easier than I expected. For prep, I *tried* doing perineal massage, but it was weird and uncomfortable so I didn't do it much. No other specific prep. Did a lot of walking and my body was still in pretty good shape from a long distance (6 months) hike the prior year. But I feel I just got lucky. I was healthy the whole pregnancy. The only risk factor was that I was over 35 and my fundus was measuring small. Baby was 7 lb 5 oz. She's still a small girl - 10% in weight at her 6 month checkup, but she gets that from her daddy.", "controversiality": 0, "created_utc": 1373373104, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cayw6st", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430532774, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jerry_sizzler", "author_flair_css_class": "purple", "author_flair_text": "One girl, 3 years", "body": "I hardly did anything to prepare, just watched a DVD and asked other moms about their experiences. No exercises. Woke up at 5:30am with contractions that felt like mild period cramps. That lasted all day. They got regular around 8pm, so we headed to the hospital shortly thereafter. I was 3cm when we got there. Walked the halls for 45 minutes, got checked, walked for another 45 minutes. Then the contractions got really painful so I opted for an epidural. Got it around 11:30pm. They broke my water around 4am. Never felt the urge to push, but they kept checking the baby's position every hour or so. Around 7:30am they said she was right there and that we would start pushing soon. Epidural wasn't working 100% by this point, but I didn't really mind.\n\nStarting pushing at 8am, baby in my arms at 8:16am. Pushing was tiring. 2nd degree tear, but the recovery from that was NBD. The nurses said we had great timing, because I didn't have to skip a meal! I had breakfast as soon as we got to my room. I loved my L&amp;D, the whole thing was definitely one of the coolest experiences of my life.", "controversiality": 0, "created_utc": 1373378461, "distinguished": null, "downs": 0, "edited": 1373378679, "gilded": 0, "id": "cayxhe1", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430532091, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BelleLune", "author_flair_css_class": null, "author_flair_text": null, "body": "First baby. Was in labor total of 5.5 hours. Woke up at 9am on a Sunday morning (5 days before his due date) to mild contractions that were already very consistent and about 5 minutes apart. Labored at home for about 3 hours until the contractions were less than 3 minutes apart. Checked into hospital and then active labor really kicked in. Then the contractions stopped, just stopped. I felt overwhelmingly relieved from the pain...then I had to push, like bad and RIGHT NOW. Had to wait a little while for a doctor to come in (it's really strange to try to stop yourself from pushing) and then pushed for maybe 20-30 minutes. My OB did give me an episiotomy, which I feel was completly unnecessary and don't know why she even did it. But that was the only \"intervention\" I had. Baby was born at 2:34pm. No pain medication (not even for the episiotomy -.- ouch). \n\nI did nothing to prepare. Absolutely nothing. My mom and husband held my hand throughout labor and that was all. No massages, no special techniques, no perineal massages, nada. I just trusted me body.\n\nI'm currently 8 months pregnant and I've done a lot of reading this time around (mostly Ina May Gaskin's books), but again that's all. No birthing classes. ", "controversiality": 0, "created_utc": 1373394099, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caz3iiz", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430529250, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "quickrewriteit", "author_flair_css_class": "green", "author_flair_text": "Ninotchka, 4yo", "body": "When my OB came in to do his very minimal baby-catching part, he said, and I quote ‘whoever gave you this epidural deserves a medal’. I pushed 3 times [~20 minutes], I was much more aware of the awkwardness of my splayed body and odd pressure than any pain.\n\nSO I’m not entirely sure what sort of carnage was going on, but I definitely didn’t experience any of it. \n\nI don’t have much advice to give, but speaking subjectively: Armed with all of those unsolicited horror birth stories from the previous 9 months, I just kept expecting it to be on par with being in a torture chamber. And while it wasn’t exactly comfortable, by the time it was over I could only ask ‘That’s it?’— realizing only much later that I was just expecting it to get worse, but it was over well before that ever happened. ", "controversiality": 0, "created_utc": 1373404181, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caz7qum", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430527176, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CheshireLindsey", "author_flair_css_class": null, "author_flair_text": null, "body": "Were you just at a routine appointment when you found out? Apparently I have been having contractions but they are hard to feel. I am only 1 1/2 cm dilated but I don't have another appointment for two weeks and I was told to call if I have more than 8 contractions in a day. but if I can't feel them that might be hard...", "controversiality": 0, "created_utc": 1373405298, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "caz86yr", "link_id": "t3_1hucoe", "parent_id": "t1_caydna4", "retrieved_on": 1430526965, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "seaspray", "author_flair_css_class": null, "author_flair_text": null, "body": "Someone else mentioned Ina May Gaskin. I was also seeking stories of moms who achieved natural birth and found my inspiration from her book. \nI took Bradley and recommend it for a good prep of what your options are in birth. I used a doula for both births. I think this made a huge difference. I switched OBs when I was 7 months to one who was more experienced with natural birth.\nWith the first birth we stayed at home as long as we could. The baby was facing front and yes, counter pressure was my savior! When we arrived at the hospital I was 7 cm and she was born 1 hour later. My OB used perineal massage so no tears; I also did stretching exercises the last trimester. \nThe second baby is more the story you are seeking. I was having Braxton hicks 2 days prior so I ignored these contractions too. I was able to sleep thru them! I had an OB appt that morning and was 8 cm when they checked me! We walked across the street to hospital and she was born 45 minutes later. The only real discomfort I felt was when the bag of waters was broken and she really pushed down on my cervix. I pushed thru 2 contractions and she was born. ", "controversiality": 0, "created_utc": 1373412028, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazas4d", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430525745, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jaskix", "author_flair_css_class": null, "author_flair_text": null, "body": "My wife gave birth at home in a tub of water, with no drugs. Plus a midwife and a doula. Seemed pretty easy to me. ", "controversiality": 0, "created_utc": 1373418844, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazd889", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430524519, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "At about 150p I sat down for lunch and started to feel uncomfortable. Just light stomach cramps. I thought I had to maybe go to the bathroom but I didn't. So I finished my food, took my dog for a walk around the block since I thought maybe I was experiencing just some BH, even though it was the day before my EDD.  The cramps weren't stopping so I called my husband at work and let him know that I *might* be in labor but I really doubted it. He got home around 4 and by this point I was fairly certain I might have a baby in the next 24-48 hrs but didn't think I was very far into my early labor. Just slight cramping but totally manageable. My period cramps were worse than this. I started to time the cramps and found they were coming about every 5-10 minutes, about 20-30 seconds. \nAt about 530 I called the midwife just to give her a heads up since it was a Friday night and I wanted to see what she thought about the times contractions. She agreed that I was probably in early labor but thought I probably would t have my son until the next morning but to call if anything changed. \nAn hour later she called again just to double check and by the point I was actually starting to feel the contractions but I could talk through them. Again she told me to cal of anything changed or the contractions picked up. I decided to hop in the shower 15 mins later and that's when it happened, the contraction that changed everything. It was strong. Not awful, but strong enough to make me realize that I'd have a baby soon. My husband called the midwife and she arrived at 745p. I was 7cm and 80% effaced with a slight lip on right side. \nMy husband frantically pumped up and filled the birthing tub since I was doing this at home. By 830 I was in the tub and that's where I stayed until I started pushing at 1130.  \nAt 1204a on may 12, my son was born. The pushing was cake in my opinion. I had hit a wall and was DRAINED at about 1030 and thought holy crap I cant do this. Then I remembered, THIS IS WHAT NEEDS TO HAPPEN! Everyone told me about \"the wall\" and said when you get there you're almost done. That thought gave me the energy I needed to get my baby OUT! \nI took my sweet time pushing. I pushed when I felt like my body wanted me to. I didn't tear but my labia got caught weird by his hand that was up by his chin and it tore enough to need a single stitch. That's it. \nObviously no meds and I'd go without meds again if I have an other. \nMy son was 9lbs 2oz and pushing him out of me was honestly WAY easier than the 40 weeks I put into making him. \n\n", "controversiality": 0, "created_utc": 1373427091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazgb3w", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430523068, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": ":O  I'll pick up the book.  Thanks\n ", "controversiality": 0, "created_utc": 1373430974, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazhpyy", "link_id": "t3_1hucoe", "parent_id": "t1_cazas4d", "retrieved_on": 1430522403, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "st0rebrand", "author_flair_css_class": null, "author_flair_text": null, "body": "That's probably the most reassuring thing I've read on here.  :)", "controversiality": 0, "created_utc": 1373431060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazhr3i", "link_id": "t3_1hucoe", "parent_id": "t1_caz7qum", "retrieved_on": 1430522388, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LineFailureErr", "author_flair_css_class": null, "author_flair_text": null, "body": "My \"easy\" birth was my second - my first was induced with drugs (only relevant since I'd not experienced natural childbirth - otherwise I'll skip that one).  Woke up at 2 AM on my due date feeling like I really had to go to the bathroom (bad GI cramps).  Took a shower since it wouldn't stop.  Whilst in the shower... realized these were probably contractions (hadn't felt ANY with my first due to the drugs) and they were only a few minutes apart.  Woke up my spouse, got ourselves to the hospital after a little bumbling around getting crap together.  Got to the hospital at 3:45, no one saw me till 4, water broke when I got up to give the urine sample.  Lo and behold I was 10 cm and 100% effaced!  Never even got to change into a gown.  They rolled me down the hall to L&amp;D and I had that baby at 4:13 AM!  Two good pushes and that was it.  The hormone rush afterwards is INCREDIBLE.  After one natural childbirth - I don't think I'd bother with the epidural ever again.\nSomething that *did* help with both deliveries - warm water.  The hospital I stayed in for the first had whirlpool tubs, and then with the second kid I spent probably 45 minutes in the shower at our house before leaving for the hospital.", "controversiality": 0, "created_utc": 1373464534, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazom7s", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430519082, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Debbi_downer", "author_flair_css_class": "blue", "author_flair_text": "Mom to Dom and Grayson", "body": "My first wasn't pretty (not terrible just long) but my second was a absolute breeze. I had thought my waters hd gone on the Monday but decided after talking to the midwife to wait till Tuesday to be seen. Low and behold I just had copious amounts of discharge lol. The exam however seemed to move things along as by Wednesday morning I had my bloody show. I puttered around all day with very mild cramps that slowly were ramping up. By 9pm I decided to try and rest, so I took two gravol and went to bed. I didn't sleep but focused more on relaxing through the contractions. By midnight I had to get up, so I ushered hubby into bed warning him it would be soon. \nI stayed up timing contractions, alternating between swaying and squatting. By 1am I was having them two minutes apart so I had hubby call his parents to come get our toddler. My son was gone by 2:30am and at that point we called the midwives who after listening to me moan said to get to the hospital ASAP. \nI arrived at the hospital by 3:30 and immediately hopped onto the bed on my hands and knees, leaning against the backrest. I gratefully took the gas they offered and went into my own little world while they were getting blood drawn, being examined etc. I was 5 cm at that point and I literally stopped talking and just hung out in my own little world. After 45min the student midwife started yelling that I was pushing (I was not doing it actively), so she went to the exam only to realize baby was about to crown. They said try a little push and out flew my son, waters breaking everywhere lol. One push, no tears lol. My labour and delivery was only 3.5 hrs. Not too shabby!", "controversiality": 0, "created_utc": 1373469484, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazq8xn", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430518313, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsC7906", "author_flair_css_class": null, "author_flair_text": null, "body": "Both of mine were easy. \n\nWent in for water breaking. Was checked and was 3 cm. \n\nI got the epidural, but it didn't work. I could still feel everything, so they took it out. \n\nFirst born was at 39 weeks. I watched movies while I progressed. Most of the pain was in my back. Pushed four times and he was out. No tears. \n\nSecond was born at 37. No real pain beyond cramping until she engaged the last twenty minutes. Pushed when nurse wanted to check me, but she made me stop so she could get everything ready. Pushed again and she was out. No tearing either. \n\nI felt great after both. Nursed as soon as they were put on my chest. ", "controversiality": 0, "created_utc": 1373482005, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cazvaq8", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430515861, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "glasspieces", "author_flair_css_class": null, "author_flair_text": null, "body": "I was on antibiotics due to GBS+, pitocin and IV fluids (something to do with my Pre-E?), otherwise:\nfrom the moment my OB broke my bag of waters to holding my daughter- ~6 hours. No pain medications of any kind with 1 tiny, shallow internal tear that the OB debated even stitching because it was so small. She ended up doing so, just to be on the safe side and I only ended up with 3-4 stitches. I found labor and pushing to be far less painful then I was told to expect. In fact, it didn't hurt so much as I felt my muscles strongly (which sounds weird). The worst part was when the nurse told me not to push when my body started to on its own because only 30 minutes before I was only 6-7cm and they were worried I would hurt myself and my baby by pushing too soon without full dilation. Turns out, I'd simply jumped to 10cm in that time! Once they said to go ahead and push when I felt the need, the pain of holding off went away. My daughter was born 8lb 4.5oz and 19\" long in perfect health.\n\nI also want to throw in that my co-worked said her oldest daughter only took 2 hours from her first contraction to holding her daughter. She said it didn't really hurt and she only pushed three times.", "controversiality": 0, "created_utc": 1373599258, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb0xtvd", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430497348, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1373604433, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb0zlbx", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430496517, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsmoore", "author_flair_css_class": null, "author_flair_text": null, "body": "I got induced. Mildly uncomfortable until epidural. After the epidural I was totally numb. Had to figure when to push based on the toco. Total labor: 12hrs. Minor tear 4 stitches. So much fun, it ws a great day. We spent the whole day laughing and eating Popsicles. No fear, no pain. Pushing took under thirty minutes! ", "controversiality": 0, "created_utc": 1373699127, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb1pv4s", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430483912, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "simplychef", "author_flair_css_class": "lightcoral", "author_flair_text": "Matt's Mom", "body": "I have a fairly easy birth story. My son was a week late so they scheduled an induction. I went in the on a monday night...He was born the next day at 6:42 p.m. I had contractions for about an hour that morning and took every drug I could get...epidural and the other (can't remember the name). I was out of it the most of the day...in and out of sleep...pushing took 2 hours but it wasn't that big of a deal because I couldn't feel anything. I did have to be cut and that a pain afterwards but yeah. ", "controversiality": 0, "created_utc": 1374617583, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb8u1ob", "link_id": "t3_1hucoe", "parent_id": "t3_1hucoe", "retrieved_on": 1430361243, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}