{"submission": {"author": "residualdays", "author_created_utc": 1361982942, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_ar5j0", "created_utc": 1373825513, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1iacam/im_19_years_old_and_due_october_27thneed_advice/", "gilded": 0, "id": "1iacam", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 93, "over_18": false, "permalink": "/r/Mommit/comments/1iacam/im_19_years_old_and_due_october_27thneed_advice/", "retrieved_on": 1412055306, "score": 37, "secure_media_embed": {}, "selftext": "Hey /r/mommit, My name is Jane. I'm a 19 year old first time mom who is going to be due around October 27th! I can feel my baby kicking very frequently throughout every single day. Is it normal if a baby kicks this much? Also, I need help with figuring out what I need to buy for my baby. I know that I need the basic things like diapers, a stroller, crib, toys, etc....but I would like to breastfeed and I was wondering where I could buy a breastfeeding pump and if there is anything else i would need to get for breastfeeding. Please let me know of anything that could help me prepare for my first child!! Thank you!", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I'm 19 years old and due October 27th...NEED advice on preparing for a newborn!!", "url": "http://www.reddit.com/r/Mommit/comments/1iacam/im_19_years_old_and_due_october_27thneed_advice/", "user_reports": []}, "comments": [{"archived": true, "author": "amisure", "author_flair_css_class": null, "author_flair_text": null, "body": "I recommend lucieslist.com she provides a nice list with recommendations on what you need to buy and some good brands. ", "controversiality": 0, "created_utc": 1373826041, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2iv7r", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430470078, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nerdy_mama", "author_flair_css_class": "green", "author_flair_text": "#1 born 5/26", "body": "A couple subreddits you might want to check out individually:\n/r/BabyBumps \n\n/r/buyingforbaby (and [Lucy's list](http://www.lucieslist.com/), an awesome site detailing the \"essential\" items to purchase or ask for)\n\n/r/Parenting \n\n/r/breastfeeding\n\nGood luck!\n", "controversiality": 0, "created_utc": 1373826268, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2iy05", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430470042, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LashFlashingLeda", "author_flair_css_class": null, "author_flair_text": null, "body": "I would also suggest a good carrier that you strap to your body, like a Moby or an Ergo, so you can do things around your house while still keeping your little one close, because that's all they'll want for a while! It's not a necessity in the strictest sense, but it will be good for your productivity and for your baby's happiness :)", "controversiality": 0, "created_utc": 1373826358, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2iz2k", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430470028, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ghostsofaviation", "author_flair_css_class": null, "author_flair_text": null, "body": "One piece of advice I can give is that you always buy too much for your first. We hardly ever used our changing table and ended up cosleeping so didn't use our crib. It's useful at this point, before you buy loads of things, to think about HOW you want to parent. For example, although a stroller's a good option, a lot of people (myself included) find baby-wearing to be more rewarding - I'd highly suggest getting a wrap or other baby harness so you can just walk around and do things while wearing your baby.\n\nIt's also important to think about WHO will be around to help you with your baby, because at some point you will need a break. Is the father in the picture? How about both sets of grandparents? Have you got any friends with children, or just trustworthy friends within very easy distance of your home? Make good, strong connections with these people, because you will need their substantive help.", "controversiality": 0, "created_utc": 1373826515, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2j0xg", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430470003, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "captain_obvious_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Lots of kicks is a great sign! That means you have a healthy active baby. If you suddenly feel like your baby isn't kicking or has nearly stopped kicking then please talk to your doctor about it.\n\nIf you're not signed up for WIC, do it now. They provide a little extra nutrition for pregnant/breastfeeding moms and kids from birth to age 5. I don't know what state you're in, but in my state my local WIC office gave me a brand new, extremely nice dual electric breast pump for free.\n\nAs far as supplies, make sure you have burp cloths. Plain square cloth diapers work best (I like Gerber brand). Make sure you have several fitted sheets for your crib or bassinette because your baby will spit up and also newborns tend to have leaky-up-the-back poop. Don't worry too much about toys because your baby won't be interested in them for a couple of months. Do get a few board or cloth books that you can read to your baby. It's important to read and talk to your baby from birth even when you feel like they're not paying attention. Newborns are fascinated by books with high contrast black/white images because their sight takes a while to develop. I found that a bouncy seat like [this one](http://www.amazon.com/Carters-Cuddle-Comfort-Musical-Bouncer/dp/B0065ZO604/ref=sr_1_3?s=baby-products&amp;ie=UTF8&amp;qid=1373826642&amp;sr=1-3&amp;keywords=bouncy+seat+for+infants) was invaluable for putting my babies in while awake so they could see me as I went about the house.\n\nGood luck to you!", "controversiality": 0, "created_utc": 1373826752, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2j3ov", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469969, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nellapoo", "author_flair_css_class": "green", "author_flair_text": "Girls 17&amp;11, Boys 14&amp;2, Granddaughter 1", "body": "I will put in another recommendation for [Lucie's List](http://www.lucieslist.com/) \n\nI also went to [Alphamom](http://alphamom.com/pregnancy-calendar-overview/) for a little fun pregnancy info", "controversiality": 0, "created_utc": 1373826761, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2j3ss", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469966, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "maumacd", "author_flair_css_class": null, "author_flair_text": null, "body": "To be honest, You really don't need that much at first. The baby will likely be sleeping in the same room as you for the first month or so, so a whole nursery isn't necessary. \n\nI would say, having a pack-n-play at first is nice. A few blankets and onesies (my baby didn't wear anything else for the first months, and she was born last october.)\n\nAlso, Breastfeeding is awesome (as many others will tell you, believe me) but you do need to be prepared if for some reason you are physically incapable to do so. If you sign up online at similac's website, they sent me a free bottle and free formula samples. I didn't end up needing them, but it was free, and its a good thing to just have around the house. I didn't start pumping until I was about a month in, but depending on your supply, it may be comfortable for you to start early. I had a medela breast pump (which can be pricy) but it was awesome for me. I got it from babies r us, but I know that you can probably go on amazon or something to get it cheaper. Also, a lot of hospitals will rent them out to new mothers.\n\nAlso, babies don't really play with toys right away, so you don't need a whole plethora of them right away either. Essentially, keep it simple, and have some money on hand to get anything you realize later you need. All babies are different, so some need things that end up being a waste of money to others. Also, there is a lot of stuff you do NOT need to purchase new. Consignment stores are where it's at!\n\n", "controversiality": 0, "created_utc": 1373827065, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2j7dk", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469920, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dancebeats", "author_flair_css_class": null, "author_flair_text": null, "body": "To add to the things mentioned, some insurance plans also cover or help with purchasing a breast pump. Call your insurance and see if you can get them to help. \n\nAlso, the tips here that are referencing outside sites and lists are a good thing. While reddits are good for some things, I've found that I want to read more about everything to do about parenting and going to different sources helps cross reference information and ultimately empowering you as a parent to make informed decisions about how to raise your baby. things like cosleeping, breastfeeding vs formula, how long to stay on the bottle etc... \n\nGood luck! ", "controversiality": 0, "created_utc": 1373827225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2j9c7", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469893, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LashFlashingLeda", "author_flair_css_class": null, "author_flair_text": null, "body": "Please don't interpret this as criticism, but I'm just curious; did/do you also use a baby carrier, or just the bouncy chair?", "controversiality": 0, "created_utc": 1373827726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2jf7d", "link_id": "t3_1iacam", "parent_id": "t1_cb2j3ov", "retrieved_on": 1430469816, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "residualdays", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! I would like to look into the free formula samples to have at hand just in case something were to happen! Is it better to start breastfeeding right away?", "controversiality": 0, "created_utc": 1373827849, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2jgll", "link_id": "t3_1iacam", "parent_id": "t1_cb2j7dk", "retrieved_on": 1430469798, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "maumacd", "author_flair_css_class": null, "author_flair_text": null, "body": "yeah, in the hospital nurses will help you do the first latch, and are (or at least at my hospital were) very friendly about answering questions and helping get situated. Before your breasts actually produce \"Milk-milk\" they make colosteaum (spelling?) so its good to breast feed right away.. sometimes within minutes of being born. i definitely suggest trying breastfeeding first, but if you don't produce enough or if there are other issues you should be prepared to supplement with formula.", "controversiality": 0, "created_utc": 1373828655, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2jq26", "link_id": "t3_1iacam", "parent_id": "t1_cb2jgll", "retrieved_on": 1430469675, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieMuffysticks", "author_flair_css_class": null, "author_flair_text": null, "body": "Stock up on diapers and nursing pads.  You won't believe how many of those you will go through!  Mostly diapers.  Lots.  Of every size.\n\nFind a multivitamin you can stand to take (some cause horrendous stomach upset), so your baby will get optimal nutrition from the milk.  You'll take the baby weight off faster, because you won't be so hungry, since you'll get the nourishment from the vitamins.\n\nLots of onesies and pajamas.  One or two cute outfits for every stage is fine.  ", "controversiality": 0, "created_utc": 1373829215, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2jwk3", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469589, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "silly87", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi and congrats!\n\nIt is normal for the baby to kick a lot.  Every baby is different, but kicking a lot is a good sign :).\n\nFor breastfeeding, you can buy a pump at most places.  Medela is considered the best, but it's also expensive.  I bought [mine](http://www.target.com/p/medela-pump-in-style-advanced-breast-pump-on-the-go-tote/-/A-10762141#prodSlot=medium_1_1&amp;term=medela+in+style+breast+pump)] at Target ($270 right now).  You can also rent a pump if you can't afford to buy one right now.  If you're having a baby shower, you could always ask people to collectively get you a pump.  Or if you've got the money, spend it!  Medela is worth it.  \n \nSome other accessories you might consider:  \n\n- [washable nursing pads ($7)](http://www.target.com/p/medela-washable-cotton-nursing-bra-pads/-/A-14283624#prodSlot=large_1_8)  \n- [Lanolin nipple cream $10](http://www.target.com/p/lansinoh-hpa-lanolin-40g/-/A-92544#prodSlot=large_2_3) I haven't needed this yet,  but a lot of people do.  \n- [Boppy nursing pillow $30](http://www.target.com/p/boppy-bare-naked-nursing-pillow-white/-/A-10463711#prodSlot=large_1_3) I used miine for a little while, but we nurse in a lying down position now, so it's up to you  \n- [Breast pump accessory set $23](http://www.target.com/p/medela-breast-pump-accessory-set/-/A-10762135#prodSlot=large_1_7) The pump itself comes with two pumps, but you'll want to wash and sterilize them after every using, so having extra pumps on hand is always a good idea.  This also comes with extra bottles.  \n- [milk storage bags $8](http://www.target.com/p/up-up-milk-storage-bags/-/A-14067288#prodSlot=large_1_25) I use Medela bags, but I'm sure it doesn't matter.  I find the bags easier to use than storage bottles because I keep all the milk from one day in one bag (if it fits) and that saves me a lot of room in the fridge.\n- [nursing bra!!! $20](http://www.target.com/p/gilligan-o-malley-women-s-nursing-full-coverage-lace-bra-assorted-colors/-/A-13930653#prodSlot=medium_1_5&amp;term=nursing+bra) Thank goodness for nursing bras!  I cannot express to you how much easier nursing became with nursing bras.  Makes it so, instead of taking off your shirt and bra every time you want to attempt to nurse, you just lift your shirt and unhook one strap, good to go.  \n- [Dr. Brown bottles](http://www.target.com/p/dr-brown-s-bpa-free-bottles-3-pk/-/A-10930727#prodSlot=medium_1_2&amp;term=dr+brown+bottles) These help prevent gas, but your baby is probably going to have gas no matter what.  Their digestive system isn't fully developed until 3 months, so it's kind of unavoidable.\n- [Sterilizer $19](http://www.target.com/p/munchkin-steam-guard-microwave-sterilizer/-/A-10753190#prodSlot=medium_1_2&amp;term=sterilizer)\n\nI would highly suggest you check out /r/breastfeeding.  The people there are very nice and helpful.  \n\nI would also highly suggest checking out /r/babybumps.  I seriously don't know how I would have gotten through my pregnancy without babybumps.  Amazing people, amazing support, just an amazing sub.\n\nAnd once the baby is born, join us at /r/beyondthebump (as well as /r/mommit)!  \n\nLet me know if you have any other questions :).", "controversiality": 0, "created_utc": 1373830423, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2kafv", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469408, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inkathebadger", "author_flair_css_class": "black", "author_flair_text": "one little man", "body": "Check into many companies because I know people keep having to try different brands when they suddenly needed to give their child formula because it didn't agree with their little tummies. I got 3-4 different samples which I really didn't end up using until I went back to work (when he was approx 10 months). You can always donate the ones you don't need to the food bank.", "controversiality": 0, "created_utc": 1373830485, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2kb65", "link_id": "t3_1iacam", "parent_id": "t1_cb2jgll", "retrieved_on": 1430469398, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "I only used a carrier when out and about, never at home.", "controversiality": 0, "created_utc": 1373830724, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2kdwf", "link_id": "t3_1iacam", "parent_id": "t1_cb2jf7d", "retrieved_on": 1430469363, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "b00tler", "author_flair_css_class": "green", "author_flair_text": "19 mo old girl", "body": "Basics: crib/bassinet/pack 'n play, onesies, diapers &amp; wipes, and some blankets for swaddling. You can hold off on buying a breast pump until you see if breastfeeding works for you.\n\nIf you can find any parenting/breastfeeding classes, take them! We took one on how to take care of a newborn, one on breastfeeding, and a series on what to expect for labor and delivery. It is a great place to meet other first time moms and get practical advice. \n\nFor all the decisions &amp; plans you make along the way, try not to get your expectations set in stone. Figure out the way you want it to be (whether the topic is breastfeeding, how the delivery will happen, your child's health, or even what gear you get for the baby) and then keep in mind that you may end up with Plan B, or Plan C etc.  You can only do so much to control this process.  The rest is pretty much the hand dealt to you that you have to figure out how to play with.", "controversiality": 0, "created_utc": 1373831084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ki69", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469307, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LashFlashingLeda", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there a specific reason for that? I'm expecting at the end of September, and I've found it difficult to find anyone who doesn't use it all the time, or not at all. I have very severe pain issues, so I don't think carrying all the time will be possible for me, but I had been thinking it would be nice for straightening up around the house, walking the dog, picking up the mail, etc. If its not too much trouble, could you tell me more about your considerations?", "controversiality": 0, "created_utc": 1373831088, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ki7k", "link_id": "t3_1iacam", "parent_id": "t1_cb2kdwf", "retrieved_on": 1430469307, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "I had way too much back pain to use it. Plus, I had twins so someone would be left out if I used the carrier and it made me feel bad. It was easier to use two bouncy seats and set them where they could see me.", "controversiality": 0, "created_utc": 1373831351, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2klan", "link_id": "t3_1iacam", "parent_id": "t1_cb2ki7k", "retrieved_on": 1430469266, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LashFlashingLeda", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh!!! Wow, yeah, that makes sense. Thanks!", "controversiality": 0, "created_utc": 1373831674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2kp0e", "link_id": "t3_1iacam", "parent_id": "t1_cb2klan", "retrieved_on": 1430469218, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "papillon24", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Mia", "body": "So, I know you are in \" stuff\" preparation mode, but here are a few other ( more \"other thing\" you'll need mode, and these are things to keep in mind.\n\nFirst- people will want to come and see the baby the instant you come home, and they will give you lots of help in that first week ( they will bring food, hold the baby, let you sleep, etc.) and that is GREAT...but make plans for people to come and help you out a bit in the weeks AFTER the baby, if possible.  Weeks one and two are easy-peasy...it's weeks 3 and 4 that are really rough, and weeks 6 and 7 are when it all really starts to set in...THAT is when you need help and support.  So, if  you have friends and relatives who want to come and see the baby, try to push them off for a few weeks and have them come over the course of the first two months instead of all at once.\n\nNext, having a plan is great, and it's great to feel empowered by your plan ( natural childbirth, breastfeeding, cloth diapers, what-have-you), but it's also really important for your own personal sanity to be prepared for that plan to go completely out the window and not beat yourself up over it.  Don't let anyone tell you that things SHOULD be any certain way, or that you are a bad parent if you don't do something a certain way, because that is BS.  The rules are simple- don't beat your kid, make sure they are feed and clean and loved....making sure those things are in place makes you a good parent, and everything else is preference.\n\nGet yourself a support network.  Now, I have a disclaimer, which is that I work for this organization, but The Mommies Network has a bunch of local chapters where you can go online and in person and find a group of moms for peer-to-peer support, and they have a national chapter for online support...finding something like that will help you.  Playdates, for the first year, are more about mom's getting around other adults than they are about child engagement, but that's a good thing.  BEING A MOM CAN BE A LONELY PLACE AND CAN BE VERY HARD.  You will be tired, you will be drained, and you will have times where you don't know which way to turn.  Find other mom's who have been where you have been who will, at the very least, tell you it will all be okay.  You don't have to use my network, but you should find something like that...there will be 2 am feedings where you will be very grateful to have it.\n\nTo be honest, you are young, and the younger you are, the higher the risk of PPD.  If you are depressed, don't disregard it as the baby blues or hormones...get help and get it quick.  You don't have to be depressed, and there is help available.\n\nLastly- be kind to yourself AFTER the baby is born.  Don't take it too far, but make sure that you have a support system that will watch the baby for you a few hours every week, and get your nails done and a haircut.  It's important that you feel good about yourself, because there will be weeks where you feel like 100%mommy- covered in sour milk and spit up and you aren't even sure what day it is.  An hour or two to be a \"real\" person again is good for you.\n\nLastly, get Happiest Baby on the Block and read it cover to cover.  Seriously, those tips WORK on soothing an unhappy baby.  As far as stuff goes, have your friends have a baby shower to get you all the stuff you want and get a Baby's R Us registry....don't buy it if you can get someone else to do it for you.  I would say onesies, good STRETCHY blankets that are bigger then you think you need ( those multipack thin ones are useless for swaddling once your baby is over 9 lbs), spit up towels a plenty, and pick a bottle brand that is reasonably priced and stick with it ( because you will find that you can get one pack of expensive ones, but they won't fit with the cheap ones you end up buying later from Walmart, and then you end up with a bunch of parts for bottles that don't fit each other)\n\nAnd that's all I have for you!\n", "controversiality": 0, "created_utc": 1373832422, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2kxjw", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469105, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beckolyn", "author_flair_css_class": "green", "author_flair_text": "Sabina (2/2012)", "body": "As for a breast pump, do you have insurance? If you do, I would call your insurance company/plan and ask if they cover breast pumps. Many will cover it either like a regular prescription or as a medical service, meaning for many plans, 80-100% of the cost (if you are in the USA). When I had my daughter, her pediatrician wrote a prescription for me for a high quality double pump, the Medala Advanced Pump in Style and I had to pay 20% of retail. Therefore, you might want to hold off on buying a pump until after your child is born (many hospitals have closed-system rental pumps for your use while there).", "controversiality": 0, "created_utc": 1373832997, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2l41y", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430469021, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "canuckitty", "author_flair_css_class": "purple", "author_flair_text": "4yr Girl, 2yr Boy, Special Needs", "body": "For free formula samples, sign up at nestle and similac websites, gerber website, and also sign up on the huggies and pampers websites.  These will send you age appropriate samples and coupons for a couple of years.  THey're handy to have around as  just in case.\n\nAs for breastfeeding, its important you start this right away.  Skin to skin bonding is very important so they'll ask you to put the baby to breast quite soon after the birth, and the nurse will help you learn to hold and get the infant to latch properly.  Keep in mind, hospitals have incentives from companies to push formula samples on new moms, so if you want to breastfeed, be vocal about that and politely but firmly turn down a nurse's offer to feed the infant for you with formula.  They'll often do this and argue its to give you a break.  Sure, that break may seem attractive, but its more important you teach your breasts to meet the infant's demands and keep feeding that way, otherwise you risk nipple confusion and reduction in your milk supply.  Just something to be aware of.  Having said that, its becomes your personal choice, but many new moms don't realize the risks of starting to bottle feed an infant, and if you don't have a hefty cashflow, it becomes a very expensive way to nourish your baby.", "controversiality": 0, "created_utc": 1373833888, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2lep1", "link_id": "t3_1iacam", "parent_id": "t1_cb2jgll", "retrieved_on": 1430468881, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "residualdays", "author_flair_css_class": null, "author_flair_text": null, "body": "I've also heard that people with PPD are unable to breastfeed...is there anything that may put you at risk for PPD? ", "controversiality": 0, "created_utc": 1373834228, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2lite", "link_id": "t3_1iacam", "parent_id": "t1_cb2lep1", "retrieved_on": 1430468827, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "canuckitty", "author_flair_css_class": "purple", "author_flair_text": "4yr Girl, 2yr Boy, Special Needs", "body": "Sometimes people with PPD experience too much psychological stress to bond with baby and the stress transfers to the baby, so breastfeeding can become a problem, until eventually mom gives up, milk dries up, and bottle feeding becomes preferred.  Sometimes, PPD is only in the background, and there remains no physical reason mom can't feed baby.  Its just a mental reason at that point.  Women at higher risk of PPD are women with a history of depression and anxiety, and bi-polar women.   ", "controversiality": 0, "created_utc": 1373835069, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2lt1q", "link_id": "t3_1iacam", "parent_id": "t1_cb2lite", "retrieved_on": 1430468693, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loo_loo", "author_flair_css_class": null, "author_flair_text": null, "body": "That is not necessarily the case. Whether or not you continue to BF if you have PPD is up to you and your doctor. There are medicines compatible with BF!\n\nHere is a link about risk factors for PPD...\nhttp://www.webmd.com/depression/postpartum-depression/postpartum-depression-what-increases-your-risk\n", "controversiality": 0, "created_utc": 1373835140, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ltv1", "link_id": "t3_1iacam", "parent_id": "t1_cb2lite", "retrieved_on": 1430468682, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Underpantsisfunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I am due with my first in September.  I have found my best resources to be 2 books:\n1.) Baby Bargains, by Denise and Alan Fields (they also put out Baby 411, which is also great)\n2.) The La Leche League book called the Womanly Art of Breastfeeding.  Lame name, but they actually address why it has such a lame name in it!\n\nBaby bargains helps you figure out good products vs. Bad products- anything from breast pumps to rocking chairs to carseats.  It was my bible when I was registering!\n\nThe breastfeeding book is generally really great, take from it what works for you, ignore what doesnt.  It has really made me feel more prepared and to have a better idea about what to expect.", "controversiality": 0, "created_utc": 1373837305, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2mji4", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430468347, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "If you really want to breastfeeding, don't use any formula unless absolutely necessary.  Sometimes you have to use it, but if you do, you need to pump extra for any formula you give the baby, to spur your body to produce. \n\nIt's OK to have emergency formula just in case, but a lot of women go to it because they're having a hard time, then they have supply problems and it all spirals down until they give up.  So just be aware of that.  \n\nBut to make it work, ideally, you should hold baby to your chest immediately after birth and try to nurse right away (delaying or feeding g something else the first few days leads to problems for a lot of women).  The colostrun they get the first few days is probably the most important thing they'll ever consume.  \n\n", "controversiality": 0, "created_utc": 1373837345, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2mjyv", "link_id": "t3_1iacam", "parent_id": "t1_cb2jgll", "retrieved_on": 1430468341, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "katyshel", "author_flair_css_class": "purple", "author_flair_text": "3 girls", "body": "Congrats on the little kicker!  Kicking is a fabulous sign - the more the better.  Buy as the baby ages.  For a newborn all you need are a carseat, a place for the baby to sleep/blankets, onesies and a way to feed him/her.  I hope you are successful with breastfeeding as its the easiest and cheapest way to go.  I loved wearing my kids so a wrap or an Ergo are the way to go.  You will find that wearing your baby is so much more convenient than pushing a baby around in a stroller.  But strollers do have their benefits.  A Snap-n-Go stroller is adaptable to most any type of carseat that you get.  \n\nSince it is summer start checking out garage sales in your area. People are always selling kid stuff and most is usually in pretty good shape - plus you can usually talk to the original owner and find out the history.   Baby stuff can be expensive and you really only use things for a short period of time that paying full price is often a waste.  Right now I have a walker, an exersaucer thingy, two play mats, a johnny jump up, several push cars and a double Bob stroller sitting in my garage waiting to be given away or sold. Consignment stores are a good places to check out also.  \n\nGood luck with your little one!", "controversiality": 0, "created_utc": 1373837514, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2mlx8", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430468316, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lolyesok", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't forget /r/beyondthebump", "controversiality": 0, "created_utc": 1373837953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2mqyw", "link_id": "t3_1iacam", "parent_id": "t1_cb2iy05", "retrieved_on": 1430468249, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1373838273, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2mukh", "link_id": "t3_1iacam", "parent_id": "t1_cb2lite", "retrieved_on": 1430468201, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vmt_nani", "author_flair_css_class": null, "author_flair_text": null, "body": "Concerning breast feeding, if it hurts, the baby probably doesn't have a good latch. There are a few ways to hold the baby to make it easier for feeding. La Leche League is a great organization that helps with breastfeeding questions, you should check if there is a chapter near you (mine was with the local WIC office).\n\nAlso, after your little one is done feeding, give your nips a quick wipe. Saliva causes chapping, and chapped nips hurt when being suckled.", "controversiality": 0, "created_utc": 1373839381, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2n765", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430468037, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pilkyO1", "author_flair_css_class": null, "author_flair_text": null, "body": "If you happen to be in the Columbus, OH area, I have a lot of girl stuff about to go to Once Upon a Child. I would be happy to give it to you, it is mostly girl's clothes, a bathtub, blankets and toys. Regardless of location I can ship you some Medela bottles with caps and nipples. They work with any Medela breast pump and have barely been used. If you're interested, PM me your address and I will send them!\n\nEvery one has given great advice, my two cents is to buy clothes as much as possible at consignment shops and to sign up for email alerts. Once Upon a Child frequently has 20% off everything sales.", "controversiality": 0, "created_utc": 1373840424, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2nj2m", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430467881, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "krshelton", "author_flair_css_class": null, "author_flair_text": null, "body": "I just had my first.  A few pieces of advice:\n\n1. Don't go crazy buying newborn/3 month clothes.  My little lady spends 90% of the time just in a diaper (we live in warm SoCal).\n\n2. Velcro swaddles are a-ma-zing.  Let's face it, in the middle of the night when you are half asleep changing a diaper, the last thing you want to do is fiddle with complicated swaddling.  The Velcro makes it quick and tricky for baby's to kick off.\n\n3. Soft toys are the best for newborns.  I got this super cute Elephant from the Taggies company and she really likes it. I brush the silky blanket over her cheek. Save the wooden toys for later on.\n\n4. Find a pediatrician now:-)\n\n5. When it comes to feeding your baby it is your choice. 80% of the bonding time with you baby comes while feeding. I breastfeed and do formula. Formula is expensive, sign up for coupons and freebies.", "controversiality": 0, "created_utc": 1373842948, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2obqn", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430467506, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "captain_obvious_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "I also had twins most recently, so a carrier was really impractical and I only used it on walks if I wanted a heavy workout, especially after they were each 15 lbs. With my first, though, I used a carrier occasionally but she didn't seem to like it.", "controversiality": 0, "created_utc": 1373844631, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2oun6", "link_id": "t3_1iacam", "parent_id": "t1_cb2jf7d", "retrieved_on": 1430467258, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "captain_obvious_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "I also found that if they could both see me then they were just fine and didn't have any need to be in a carrier.", "controversiality": 0, "created_utc": 1373844681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ov7s", "link_id": "t3_1iacam", "parent_id": "t1_cb2klan", "retrieved_on": 1430467251, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Personsanon", "author_flair_css_class": null, "author_flair_text": null, "body": "I know other people have suggested WICK already but I would not be breastfeeding still (7 months) if it wasn't for them. They had consultants and gave me a pump worth$200 once I went back to work.\n\nAlso we spent$200 on diapers the first month. We switched to cloth and only put down $150 for our supplies and haven't had to buy disposables since. It works for us because we have a washer/dryer at home but look into it to see if it will help! \n\nFind a baby resale shop and get on their mailing list. We have a few near us and just switch up whenever she goes into a new size.\n\nCongrats mama!", "controversiality": 0, "created_utc": 1373845283, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2p1wp", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430467163, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Worrywart1234", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, definitely check into this... My insurance covers a medela in style pump at 100%! ", "controversiality": 0, "created_utc": 1373848782, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2q5ro", "link_id": "t3_1iacam", "parent_id": "t1_cb2l41y", "retrieved_on": 1430466642, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "endlesscurry", "author_flair_css_class": "green", "author_flair_text": "Henry 8/29/12", "body": "If you're going for a breastfeeding pillow go for the My Brest Friend pillow. It has a ridiculous name, I know, but it was so much easier to breastfeed with versus the boppy. The pocket really came in handy for keeping my cell phone, lanolin, and snacks. I got mine from amazon's 'open box' deal. http://www.amazon.com/baby/dp/B000HZI1R2\n \nSee if your local hospital offers free parenting classes. I took a breastfeeding basics class; it was pretty informative. The postpartum nurses were also incredibly helpful after my baby was born.\n\nI would recommend getting a pump. I had trouble breastfeeding in the beginning and pumping helped me establish and maintain my supply, as well as gave me some peace of mind. I bought the Ameda Purely Yours based mostly on reviews and the price. It worked pretty well. I bought it from amazon too...if you join their amazon mom program you get a few free months of prime (free 2 day shipping). We did our registry through them and still get our diapers through their subscribe and save deal.\n\nI hope this was helpful. Good luck!\n", "controversiality": 0, "created_utc": 1373849142, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2q9y2", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430466575, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "You won't be able to sleep much for the first month, you have to feed him every 2 hours. Every 3 hours the second month. So, snacks! lots of snacks for you.\n\nThe nursing pillow http://www.amazon.com/gp/product/B002GKC3X4?ie=UTF8&amp;tag=lucslis-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B002GKC3X4 was essential for me.\n\n", "controversiality": 0, "created_utc": 1373849836, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2qhv5", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430466472, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thatonegirl77", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey! I am eighteen and due October twenty ninth with my first! Her middle name is Jane! Just thought that was interesting so had to share. But you can find most of the stuff you need on Amazon. I've also learned that blankets and onsies are great for new-borns. She has also been moving a lot the past month, so I'm pretty sure that it's normal.", "controversiality": 0, "created_utc": 1373853210, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2rlex", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430465954, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "Just butting in here to say if you do decide to get a carrier I'd recommend one that puts most of the weight on your hips rather than your back/shoulders. We loved the ergo, but I think beco and boba carriers are similarly designed too. But hey, if your baby is happy being layer down then thank your lucky stars. My little guy much preferred riding along on my back while I did chores. You just have to remember to squat instead of lean forward to pick stuff up, for your back but mostly so the baby doesn't spill out the top ;)", "controversiality": 0, "created_utc": 1373853439, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ro4a", "link_id": "t3_1iacam", "parent_id": "t1_cb2ki7k", "retrieved_on": 1430465918, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lovest", "author_flair_css_class": null, "author_flair_text": null, "body": "Congratulations on your baby! I found that we didn't need many things for ours... We are ebf, and I got the pump on style breast pump from Medela, I really like it because you can take it anywhere with you... \r\rFor breastfeeding get the hydrogel nipple pads, I though I wouldn't make it because my nipples where so sore! And that really help me, also get lanolin, I got earth mamas nipple cream but really dislike the smell and didn't seem to help much, but the lanolin from medela was a life savior after I stop using the nipple pads.\r\rIt'll be hard, but you can do it! Good luck!", "controversiality": 0, "created_utc": 1373853937, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ru0c", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430465841, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "glasspieces", "author_flair_css_class": null, "author_flair_text": null, "body": "As someone who became a FTM only 2 months ago, the things I've found most valuable to have are:\n-carseat and stroller (she goes in the carseat and then we snap her onto the stroller wherever we go, which makes for a much easier time shopping/trips out of the house. Plus, walks around the neighborhood!)\n-Cloth diapers Check out r/clothdiap (seriously. It saves us SO much money! In the first two weeks of her life, we used disposables and it cost us $75! We bought enough prefolds, covers and snappis, as well as various fitted diapers (such as http://www.amazon.com/Dappi-Pinless-Contoured-Diaper-Medium/dp/B0035JL94E/ref=sr_1_1?ie=UTF8&amp;qid=1373851849&amp;sr=8-1&amp;keywords=dappi+pinless+diaper), and serveral brands of pocket diapers (babyland and fuzzibunz) and All-in-ones for $300 used. These diapers will cover her from birth to potty training. For $300. You cannot beat that deal with disposables anywhere with any coupon.)\n-Onsies and footie PJs (We were gifted tons and tons of clothes and blankets, many of them fancy and adorable, but 90% of the time, we keep her in simple onsies and footie PJs most of the time.)\n-Swaddle sacks with velcro (our favorite are the Halo sacks. They give you the option of arms in or out.)\n-Someplace for the baby to sleep. (So far, our baby has only spent her nights in an Arm's Reach Mini Co-sleeper (http://www.amazon.com/Arms-Reach-Co-Sleeper-brand-Bassinet/dp/B00009Q6G6/ref=sr_1_1?s=baby-products&amp;ie=UTF8&amp;qid=1373852177&amp;sr=1-1&amp;keywords=arms+reach+mini+co+sleeper) we bought used on craigslist for $20(!!!). It is good for 6 months, which gives you time to decide if you want/have room for/can afford a crib or want to go with another option. Plus, because we can respond to her so quickly, our baby has learned not to cry at night, she just fusses a little louder and that wakes me up and she gets her needs met ASAP.)\n-Electric swing (this is not a 100% need, per say, but this is sometimes the only way we can get our LO to take naps during the day. Again, buy used. We got one in brand-new condition for 1/3 of retail price!)\n-Diaper bag (Go with what you like, but aim for something light as they can get heavy when packed with baby things! Also, we bought ours at TJ Max for 1/3 retail price. So I pad $20 instead of $65!)\n-Wipes, in bulk (seriously, we go through a Target 720 wipe box every 3-4 weeks. If you can afford it, I'd buy/ask for 4-6 boxes to start, that way you are not like us and having to run out to buy some more every few days for the first week(s)! http://www.target.com/p/up-up-sensitive-skin-baby-wipes-refill-pack-720-count/-/A-12944260#prodSlot=medium_1_2&amp;term=sensative+wipes)\n-pacifiers (I started out against them, but nothing calms an upset baby like a pacifier. Sometimes babies want to suck on something that is not your boob.)\n-Speaking of boobs...a pump if you plan to go back to/start working/spend more then 30-90 minutes away from your baby for weeks. (I got my Medela 100% through my insurance here in the US. I've heard WIC will give you one for free if you are really in need, and finally, you can buy used for fairly cheap (although, make sure it is either brand new never used or a closed system (something about milk getting in the open system pumps (like Medela) and getting gross/possibly passing on diseases from other users)\n-Bottles (Again, I bought used off of craigslist. I got $125 worth of glass bottles, caps, and brand new nipples (still in package) for $25. I LOVE our glass bottles and so does my LO. You might want to just get 1-3 of a bunch of different kinds, as some babies are really picky!)\n-Burp clothes/swaddle blankets/flats (Basically make sure you have lots and lots of various sized cloths for catching spitup/diaper leaks/wiping face/cleaning up spills/etc. We were gifted tons of these and I thought there was NO way we'd ever used them all. I was wrong. We actually run out of them and then have to hope we don't need to clean up anything until the laundry is done! There is no such thing as too many of these!)\n-Baby gym (We got a wood one at Ikea and it has already provided hours and hours of amusement and learning experiences for my daughter. At first she just liked to stare at the dangling bits and watch us spin the side toys, but she's already reaching for the hanging things and laughs after spinning the side things all on her own. I think this will provide at least a year, if not more, of fun and learning. http://www.ikea.com/us/en/catalog/products/70108177/)\n-Nursing pads and bras/tops/sleepwear (I actually use an old workout tank with built-in bras for night. Believe me when I say you WILL want something for night time! I woke up in a puddle the first night home after just putting on my usual tank top. Lesson learned!)\n\nEveryone else has said it, but breastfeeding is a great way to go. Its free (you will make the milk if you want it or not), super healthy for your baby and such a great bonding experience. I love looking into my daughter's eyes and cuddling with her while she feeds. If it is difficult for you, there are many resources, on and off the web, that can help you. If you have insurance, they now have to pay for 1-2 visits with a lactician who can help you after you have the baby.\n\nMy biggest tip is to buy used- craigslist, garage sales, ebay (great for cheap cloth!), goodwill/thrift stores/etc. What I do is research, research, research items for safety, durability, parent reviews, etc. Then I try to find the big items (carseat, stroller, crib, etc.) in a store to see if I like it in person, and finally, I search for it used. If you know what you are looking for, ask the right questions, and are a careful buyer, you can get SO much baby stuff significantly cheaper used then new. Just be sure to check for recalls and turn down anything that doesn't seem right/is in bad shape/isn't exactly what you want.\n\nIf you want to chat more or ask questions, please feel free to message me!\n\nGood luck!", "controversiality": 0, "created_utc": 1373854072, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2rvko", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430465821, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Johnsonsi", "author_flair_css_class": null, "author_flair_text": null, "body": "Just popping in to say I had absolutely no pain with breast feeding at all. It doesn't hurt for everyone and it's not always difficult. I was tired in the first month, no question, but I found nursing peaceful and lovely. I did not feel it was an exhausting chore. \nProps to OP for wanting to BF. you go girl!\n", "controversiality": 0, "created_utc": 1373854844, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2s4xb", "link_id": "t3_1iacam", "parent_id": "t1_cb2mukh", "retrieved_on": 1430465698, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Leaper_colony", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll just share what I used and what I didn't: \nUsed or wish I'd gotten sooner- carriers, god so many carriers. In hindsight I would have started with an ergo with an infant insert and a ring sling/pouch (but make sure baby is snug against your chest not fallen into the abyss of the the pouch.) I also loved Velcro closure swaddling blankets, I could never swaddle very tightly with just a blanket. I also got tons of mileage from waterproof pads since his diapers leaked for the first few months. They also double as changing mats on the go. And honestly, the only other things I'd wished I had from the get to we're my smartphone for those endless hours of nursing day and night (got one right as he started nursing less around one). I also wish we had a kingsize bed instead of the fancy crib and organic mattress, since we ended up cosleeping anyway. I also loved having the infant carseat that unlatched so I could bring him in while he slept or snap him into his stroller.  I also wish I'd gotten monitors right at the start. I actually thought I'd never leave him alone so wouldn't need a monitor. Haha! Foolish woman! Oh and we ended up getting just a changing pad instead of a whole changing table. I didn't think we'd need even that but it was nice being able to stand and change him. But I bet a pack n play with a changing attachment would accomplish that too. \nThings I didn't use: aforementioned crib, swing and bouncy seat (but maybe I should have tried harder to get him used to them, he really just loved being in a carrier though), we didn't really use a pacifier and my son wasn't really into them, we also only had a brief stint with bottles before he decided he wanted milk from the tap. During those few months I just used the handheld pump the hospital gives you for free (oh yeah, get as much free stuff while you're there- if you're having a hospital birth). \n\nI agree with the person who said a lot of your stuff needs will be dictated by the type of parent you plan to be, or end up being once the baby's there. I wasn't entirel sure of much of anything except I really wanted to breastfeed. Also if you're going back to work then you'll definitely need a serious pump, if not then a handheld should be enough. Sorry for the novel. But one last piece of advice hat you'll hear but really really should follow is that you need to conserve your sleep. Sleep before and during labor if you can. Sleep during that first night when baby's still groggy. It's hard to fathom how little sleep you'll be getting for a good long while. Sleep deprivation will no longer be a temporary state. It will be your new reality. Sleep whenever you can. ", "controversiality": 0, "created_utc": 1373854915, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2s5ri", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430465688, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ADVentive", "author_flair_css_class": "green", "author_flair_text": "Two girls, age 5 and 8", "body": "Yes, and under Obamacare, insurance companies in the US are now required to cover breast pumps and other lactation services.", "controversiality": 0, "created_utc": 1373855427, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2sbvx", "link_id": "t3_1iacam", "parent_id": "t1_cb2l41y", "retrieved_on": 1430465607, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dropkickpa", "author_flair_css_class": null, "author_flair_text": null, "body": "One caveat is that if you are allergic to lanolin,  it is a SUPER bad idea.  An alternative that worked great for me was to use a damp cloth to wipe off my nipples and then to express a little bit of breastmilk and rub it on them and let it air-dry. ", "controversiality": 0, "created_utc": 1373855922, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2shs2", "link_id": "t3_1iacam", "parent_id": "t1_cb2ru0c", "retrieved_on": 1430465530, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "chellerator", "author_flair_css_class": null, "author_flair_text": null, "body": "It can take a little bit of practice for baby wearing to be easy. I have a Moby wrap and an Ergo, and both have a learning curve! But once you wear the baby a few times, it is so easy. \n\nI will say that if you plan on wearing the baby around the house a lot, for a few minutes at a time, get a ring sling that you just slip over your head. One of my neighbors had one, and I wish I would've gotten one before my little guy was too big. They're super convenient for getting one and off quickly.", "controversiality": 0, "created_utc": 1373856350, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2sn3z", "link_id": "t3_1iacam", "parent_id": "t1_cb2ki7k", "retrieved_on": 1430465461, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "chellerator", "author_flair_css_class": null, "author_flair_text": null, "body": "And definitely take lanolin to the hospital. My nipples were super sore at first, and that stuff is MAGICAL.", "controversiality": 0, "created_utc": 1373856459, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2soiv", "link_id": "t3_1iacam", "parent_id": "t1_cb2mukh", "retrieved_on": 1430465441, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "chellerator", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a different perspective on this. Breastfeeding hurt like a bitch for me, and my baby's latch was fine, we didn't have thrush, etc. It just HURTS for some women. It stopped hurting after about a month, but those first four weeks were rough. There would've been absolutely no wiping my nipples with anything. I used a ton of lanolin and wore silky shirts when I even bothered to wear a shirt, and that helped. \n\nI say this not to scare the OP, but because I heard from so many people that breastfeeding shouldn't hurt after the first couple of days or else something was wrong. I would've been way less stressed if I'd known that it was just a temporary thing and that nothing was wrong.", "controversiality": 0, "created_utc": 1373856671, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2srae", "link_id": "t3_1iacam", "parent_id": "t1_cb2n765", "retrieved_on": 1430465408, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lovest", "author_flair_css_class": null, "author_flair_text": null, "body": "Totally makes sense! The earth mama nipple cream doesn't have lanolin, so maybe that could work :)", "controversiality": 0, "created_utc": 1373858593, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2tf07", "link_id": "t3_1iacam", "parent_id": "t1_cb2shs2", "retrieved_on": 1430465095, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "My sister got a free breast pump from a local catholic charity. Consignment stores are great for gently used items. I loved my little baby bouncer, made it easy to put him down while I got some things done. Good luck!", "controversiality": 0, "created_utc": 1373860768, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2u4mo", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430464760, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LaserKitteh", "author_flair_css_class": "purple", "author_flair_text": "Mom to DD's 3,7, &amp; 13", "body": "Congrats! I don't have much to offer more than what's already been said, other than some breastfeeding advice:\n\nBaby will go through a few growth spurts the first couple months. During this time, s/he is going to want to feed like crazy and you'll probably freak out and think you're just not making enough milk for him/her. **Don't give up.** Feed him/her as much as they want and your body will adjust and start making more milk to meet the new, higher demands. They aren't going hungry. You aren't \"not making enough.\" Just relax during this time, drink plenty of water, and be prepared to to sit and nurse a lot.", "controversiality": 0, "created_utc": 1373861017, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2u7g0", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430464723, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "celtlass", "author_flair_css_class": null, "author_flair_text": null, "body": "Also, [moist burn pads](http://cloudfront.ojcommerce.com/img/prods/large/spe4702700_3_2nd_skin_moist_burn_pad_3x4_ster.jpg) between feeding were SO soothing!  You can cut the big ones to size rather than buying the more expensive circular ones.", "controversiality": 0, "created_utc": 1373862042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2uj3s", "link_id": "t3_1iacam", "parent_id": "t1_cb2soiv", "retrieved_on": 1430464571, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vmt_nani", "author_flair_css_class": null, "author_flair_text": null, "body": "Good point. Everyone is different, and I was just speaking from my perspective. Thanks for sharing yours!", "controversiality": 0, "created_utc": 1373862241, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ulc9", "link_id": "t3_1iacam", "parent_id": "t1_cb2srae", "retrieved_on": 1430464542, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "travelingmama", "author_flair_css_class": "purple", "author_flair_text": "Nate 5 Audrey 3 and Due 3/21", "body": "As a mom of almost 3, what I have come to find is that many things are completely unnecessary, but it all depends on each individual baby/mom. I am pregnant now and do not even plan to get a crib. We had one with my son and it was old so we threw it away. We coslept with my daughter and it has been a wonderful experience. She still cosleeps and when the new baby comes we are going to move the full mattress we got for her into our room and just have a huge family bed. I know it's not for everyone, but it took SO much stress off of us. I won't get into the specifics, but if you look it up, there are many benefits. I also found that my moby wrap was an absolute must-have. And my daughter was an October baby. It's perfect for the first few months during the winter. It really keeps them warm. Just by doing those two things saves a lot of money on little gadgets you would get and never even end up using. A bouncer is nice to have to so you can set them down occasionally, but the more you hold them and keep them upright their head will not get misshapen and their legs will be stronger. Also, one thing I WISH SO BAD I would have done with my son is baby led weaning. I didn't buy any baby food for my daughter at ALL, we just gave her what we were eating, but broken up to baby size so she wouldn't choke. She will eat almost anything now because she trusts that what I'm eating is going to be good. I highly recommend that. \n\nLastly, my daughter moved a TON when I was pregnant. So so much. The worry is when they don't move. :D", "controversiality": 0, "created_utc": 1373862282, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2ulru", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430464536, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "heavysouldarlin", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with everything you said, except for one thing. Don't buy car seats used! You don't know if they've been in an accident unless you know and trust who you are buying them from. They are a one off sort of thing, the second they've been in an accident (even if they look okay) they can ( and most likely will) fail if they get in another one.", "controversiality": 0, "created_utc": 1373863452, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2uygr", "link_id": "t3_1iacam", "parent_id": "t1_cb2rvko", "retrieved_on": 1430464369, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whyunogivemegoodname", "author_flair_css_class": null, "author_flair_text": null, "body": "Baby kicking is very normal. {aww I miss that :)} \n\nOkay, you're gonna need spit up rags. Don't ever think you have enough of those things cause you always need more. Teething rings, a boppy pillow isn't a necessity but they're nice to have and can make breast feeding more comfortable, a mat for tummy time (some babies don't like tummy time- it helps if they have something fun and colorful to lay on and look at), a baby bath, diaper rash ointment, a walker for when they get to be about 5 mo +.\n\nMy kids are 8 and 4 now so I haven't had a newborn for a while. That's all I can think of for now besides the obvious things like diapers, wipes, clothes, crib, changing table, stroller, high chair.", "controversiality": 0, "created_utc": 1373864105, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2v59r", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430464280, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "you need to check out /r/BabyBumps and /r/breastfeeding !!\n\ncongratulations, and good on you for being proactive!  Babies don't need a lot of stuff, contrary to what Babies 'R Us and Amazon baby registry would have you believe!  Here is a super basic list:\n\n* easy to remove clothing - newborns have a lot of diaper changes, so having clothing that is easy to get to the diaper is essential!  I absolutely recommend Layette gowns, they come in unisex and whatever other colors and patterns as well.\n* Bassinet - you don't need a full on crib until they start to be mobile, until then, save some space (and maybe $$).  This is a great second hand item, just get a new mattress/pad for it.\n* Car seat - essential!  This is one of those items you gotta get new (or from a trusted friend), as the carseat can be compromised during a crash, and will no longer be warranted by the manufacturer if it is found to have been in a crash and you are still using it.\n* Toys - not really needed!  Your baby won't be able to do anything with toys for at least the first 6 months of her/his life.  After that the most you'll need is some kind of ring thing that they can grab easily, trust me, babies are not picky!  I got a ring of plastic keys for my daughter, and that was the absolute favorite (mama has keys, baby has keys, everyone is happy), we took them everywhere, and she pretty much ignored everything else.\n* Stroller - this might be my preference, but strollers are a PITA, even the easy fold ones.  I'm borrowing a basic frame one to go with the car seat as a \"pram\" until she can sit up, and then I plan to go wear my baby, or use an umbrella stroller.  They take up less room in the trunk of your car, and weigh nothing.  No cargo room?  Hang a backpack on the back...just make sure you move it to the seat when the kid starts walking around or it will tip over...not a big deal though, and obviously a concern waaaaay down the line.  I also had a backpack for outdoorsy type stuff.  REI used gear sale!\n* breast pump - I got mine on ebay!   Yes this is totally safe!  You can get the attachments (everything the milk touches) brand new from most baby stores, so it will be fresh and clean and ready to go!  Check with your health care provider, you may be able to rent or buy one at low/no cost through them.  The rental ones from the hospital are AWESOME, and work way better than anything you can buy for a decent price online.\n\nGenerally speaking all you need for successful breastfeeding is a baby (check!), boobs (check!), and a lot of support.  If your mom breastfed, she will be a great resource!  If not, there are groups like the breastfeeding subreddit linked above who can provide tons of advice and support for you!  I will tell you the first month is the hardest.  Stick it out through that and you will be fine.  It is normal to \"get it\" and then all of a sudden whatever you were doing doesn't work anymore.  Just remember, you've never done it before, but the baby has never done ANYTHING before, you're both learning.  Best idea is not to let the baby get over hungry (and therefore completely worked up into a fit) so s/he has the patience and energy to latch on.\n\nAlso, People will give you tons of advice based on their own experience, which is awesome, but may or may not work best for you.  Ultimately, each kid is different, so don't feel bad if it doesn't work, or you need to modify for it to work....it is normal.\n\nLast piece of advice I can give you is that none of us really knows exactly what we're doing.  Every day is a learning experience, and it starts again with each child.  If you can accept that you're going to have to make it up, and/or fake it at some points, and that that's just the way it is, you'll be golden.\n\nI had my daughter at 21, and she is now turning into a beautiful young lady, and will be 10 this fall.  I'm having my 2nd now, and the biggest thing I've noticed is I don't have the energy I once did!  Enjoy being young with your young one, you have an advantage that many parents do not!", "controversiality": 0, "created_utc": 1373864422, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2v8le", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430464237, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "residualdays", "author_flair_css_class": null, "author_flair_text": null, "body": "From what i've heard about co-sleeping, it seems to be a more common and easier choice! Thank you!", "controversiality": 0, "created_utc": 1373864583, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2vaac", "link_id": "t3_1iacam", "parent_id": "t1_cb2ulru", "retrieved_on": 1430464214, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "residualdays", "author_flair_css_class": null, "author_flair_text": null, "body": "What is tummy time?? I've never heard anybody say that before. ", "controversiality": 0, "created_utc": 1373864745, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2vbw9", "link_id": "t3_1iacam", "parent_id": "t1_cb2v59r", "retrieved_on": 1430464193, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "orchd84", "author_flair_css_class": null, "author_flair_text": null, "body": "Just wanted to put in a plug for the Ameda Purely Yours or Lansinoh Double Electric pumps (they are the same). These keep the milk out of the tubes, while the Medela does not not. This keeps it more hygienic and makes it much easier to clean. Food for thought, and something I wish I'd have known the first time around. ", "controversiality": 0, "created_utc": 1373865964, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2vo54", "link_id": "t3_1iacam", "parent_id": "t1_cb2l41y", "retrieved_on": 1430464034, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Tenoreo90", "author_flair_css_class": "lightcoral", "author_flair_text": "mommit of a 4 year old", "body": "Hey Jane, I had my first baby at 19, too. Don't worry so much about having every single gadget on Parenting mags 'must have' list. Baby needs food, love, and safety. That being said....get a decent newborn first aid kit and learn how to use it, a baby monitor, you can get a breast pump at babies r us or their website (I reccomended medela), blankets for swaddling, a small baby bathtub is really handy, or you can just use a sink, some brightly colored grasping and teething toys, and a diaper bag. Also reccomended if you are using disposable diapers...a diaper pail.", "controversiality": 0, "created_utc": 1373865990, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2vof9", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430464030, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "orchd84", "author_flair_css_class": null, "author_flair_text": null, "body": "Just wanted to reply that I had PPD with both my kiddos and breastfed both to a year. What helped me was getting medication the second time around. I \"toughed\" it out with my first and in hindsight really regret how much I missed due to my depression. But, it did not prevent me from nursing, and honestly I felt like BFing was the easy way to go (it was always ready when my L/O was didn't require me to wash bottles!)", "controversiality": 0, "created_utc": 1373866096, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2vpfj", "link_id": "t3_1iacam", "parent_id": "t1_cb2lite", "retrieved_on": 1430464016, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beckolyn", "author_flair_css_class": "green", "author_flair_text": "Sabina (2/2012)", "body": "How is it as far as pumping? Is it as efficient as the Medela one? Does it last as long?", "controversiality": 0, "created_utc": 1373868225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2w9g7", "link_id": "t3_1iacam", "parent_id": "t1_cb2vo54", "retrieved_on": 1430463755, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "travelingmama", "author_flair_css_class": "purple", "author_flair_text": "Nate 5 Audrey 3 and Due 3/21", "body": "I think people are starting to come out about it more and more. Truthfully, that's what parents did years ago. I don't know when sleeping in the other room became popular, but I really think it's something that comes naturally. I found it took the stress off when my daughter woke up in the middle of the night because I could roll over, breastfeed her, then go right back to sleep without having to get up. I truly believe kids need it and thrive from it. I didn't do it with my son because my parents acted like it was bad. I wish I didn't listen. Sometimes it just takes someone saying \"it's really ok\". ", "controversiality": 0, "created_utc": 1373869350, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2wjdj", "link_id": "t3_1iacam", "parent_id": "t1_cb2vaac", "retrieved_on": 1430463624, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HAND92", "author_flair_css_class": null, "author_flair_text": null, "body": "Congratulations! I was also 19 when my daughter was born. I wish you all the luck and just know, you will never have it all figured out. Just go with what you feel is right. Also don't waste your money on a diaper genie, its just a trashcan with a lid and scented bags, trust me lol I would stock up on diapers, wipes, shampoo and onesies. If you need to talk just PM me.", "controversiality": 0, "created_utc": 1373869831, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2wnd4", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430463572, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HAND92", "author_flair_css_class": null, "author_flair_text": null, "body": "Tummy time is a time when you lay your child down on their stomachs and put a few toys in front of them. They try to play with the toys and look around. It helps strengthen their necks.", "controversiality": 0, "created_utc": 1373869988, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2womt", "link_id": "t3_1iacam", "parent_id": "t1_cb2vbw9", "retrieved_on": 1430463556, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mamawannabe", "author_flair_css_class": null, "author_flair_text": null, "body": "If you have pain or it is hard when you get home, go back to the lactation consultants for help! It can be very very difficult for some while easy for others.  \n\nI really like the Mayo clinic books for pregnancy and the first year. Also the wonder weeks app helps to know what is going on with baby. \n\nAlso, although not for everyone I  found the hospital classes really helpful in getting prepared and for asking questions. I would see if yours has them.", "controversiality": 0, "created_utc": 1373870092, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2wpgn", "link_id": "t3_1iacam", "parent_id": "t1_cb2lite", "retrieved_on": 1430463545, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "raegunXD", "author_flair_css_class": "lightcoral", "author_flair_text": "Phoenix Raen 8/8/12", "body": "There have been a couple comments already, but I'm gonna send you a private message!", "controversiality": 0, "created_utc": 1373870932, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2wvv0", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430463461, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Congratulations! (My son was born Nov1st last year so fistbump for similar due dates, hehe!) You're getting great advice already so here's 5 Breastfeeding +1 money tip!\n\n*Lanolin cream.  Put this on after EVERY feed.  Nipples commonly crack and even bleed/blister at first.  I didn't experience this because I put on lanonlin after every feed.\n\n*Water cup with lid and straw.  You will be so thirsty while breastfeeding.\n\n*Nursing tank top(s).  I have four.  Get at least ONE.  Nursing tops make it easy to breastfeed day and night.  I lived in mine for months! (You can easily layer with other shirts to stay fashionable for going out ;)!\n\n*Nursing pillow.  At first my son nursed for &lt;1hr at a time every 90minutes-2hrs all day!  Having a comfortable set-up is essential for staying comfy and keeping baby safe, too!\n\n* Nursing chair.  A nursing chair with good arm support, head support and a bit of rocking is nursing bliss!  \n\nJane, I recommend buying most items for baby off craigslist.  Babies wear clothes for such a short amount of time and most of the gear you need for them is just for a few months to a year.  You can get so many things for great deals second-hand, I was never into thrift stores prior to having my baby and we've saved hundreds of dollars which we can now use for fun things to do with our baby when he's a little older! (Family vacations, sports, etc...) ", "controversiality": 0, "created_utc": 1373872139, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2x4j9", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430463348, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "youdidwhatnow", "author_flair_css_class": null, "author_flair_text": null, "body": "I breastfed all of my four kids for various lengths - my first one, hurt, a lot, for a couple of weeks and never with the others (even after a several year span).  After that, all was great!  Nursing was wonderful and he ate like a champ.  More moms need to know that it's just an adjustment period and it will get better.", "controversiality": 0, "created_utc": 1373872935, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2x9w0", "link_id": "t3_1iacam", "parent_id": "t1_cb2srae", "retrieved_on": 1430463277, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smoike", "author_flair_css_class": null, "author_flair_text": null, "body": "My cousin gave us her old medela dual pump and my wife said that that thing was fantastic. It was ridiculously expensive but did a fantastic job. ", "controversiality": 0, "created_utc": 1373876745, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2xwb7", "link_id": "t3_1iacam", "parent_id": "t1_cb2q5ro", "retrieved_on": 1430462913, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't use it around the house, my baby was heavy enough without it!\n\nI used it until she was 18 months, but my back has been bad for a while, and she got too big/too heavy.\n\nI don't think there is any one perfect carrier for a baby of all sizes/needs.  I used two main ones, and retrospect they were as near perfect as possible for each situation:\n\n1.  The Ergo Sport (my use: newborn to six months) was very comfortable, and I could easily breastfeed in it.  The \"infant insert\" was also wonderfully snug and useful for other purposes, like a breastfeeding elbow pillow etc.\n\n2.  The Beco Butterfly II (my use: six months +) was very secure (the baby has material between their legs so can't slip down) plus it's much easier to get it on your back solo.  Its disadvantage, for a newborn, is that the fabric between you and the baby would make breastfeeding while walking around pretty tricky.\n\nIf you have a bad back, you will particularly appreciate back carrying.  It's much easier, and helps share the strain between different muscle sets.\n\nOne caution:  do not get a \"parachute\" style carrier, like the Bjorn.  Newborns should not face out for starters, they should face you.  And the backs of their thighs need supporting, they should not drop straight down.  The knees should effectively be higher than the bottom.", "controversiality": 0, "created_utc": 1373882987, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2yper", "link_id": "t3_1iacam", "parent_id": "t1_cb2ki7k", "retrieved_on": 1430462533, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anditron", "author_flair_css_class": null, "author_flair_text": null, "body": "If you're concerned about ppd, consider getting the placenta encapsulated and taking those in the recommended dosage by the person who did it. You can do it yourself too, but I wasn't confident in doing it myself so had a doula who was trained do it. People will tell you it's disgusting and that its just a placebo. Maybe it is, by my mother had sever bouts of depression and I had in my past to. I didn't want to run the risk so was willing to pay for the encapsulation on the chance it would offset ppd for me. It really worked for me. The number of pills made will depend on the placenta but you'll end up with around 100-120. You take some regularly at first, lowering the frequency over the first couple weeks and then you just take one when you notice your mood shifting negatively. I swear within an hour or so I'd feel better. The great thing is, you keep them in your freezer for life. Wen you go through menopause they can help you, and when your child is older and has a bad day or something, you can give one to your child to help them as well. No one else can take them though. So if you have two kids, you'll need to label them with names.\n\nThis might totally gross you out and it's totally not everyone's thing but I still feel it was the single best purchase I made when preparing for baby.", "controversiality": 0, "created_utc": 1373890505, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb2zpbg", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430462062, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whyunogivemegoodname", "author_flair_css_class": null, "author_flair_text": null, "body": "When you lay the baby on their tummy so they can develop motor skills in their arms and legs. It's how a lot of babies learn to crawl. ", "controversiality": 0, "created_utc": 1373893284, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb307jm", "link_id": "t3_1iacam", "parent_id": "t1_cb2vbw9", "retrieved_on": 1430461823, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "I read through most of the comments and didn't see anyone mention a nursing pillow!! Out of all the stuff I've bought my daughter, this is the thing I use the most. As a newborn, it's extremely hard to get them as close to your body as they need to be to nurse comfortably. Also, you should definitely see a lactation consultant. Nursing is painful the first week or so because the baby hasn't had a chance to learn how to latch well and they nurse usually about every two-three hours (from the start of the last feeding) for 40 minutes. Make sure you have some antibacterial cream. Lansinoh cream is good for the pain of the cracked nipples, but that's all it's good for.  Having open sores is a breeding ground for bacteria. You can use the antibacterial cream after every feeding and it won't hurt the baby at all if its still on your breast when he/she feeds. \n\nGood luck to you! The breast feeding journey usually starts out pretty hard. My nipples had bruises the size of quarters for the first few weeks. But now, I'm reluctant to stop and my daughter is six months. \n\nALSO, GET A NIPPLE SHIELD!!!! Burlington has a nice selection and they're cheap", "controversiality": 0, "created_utc": 1373906467, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3491l", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430459918, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "That's really interesting, have there been any studies on this?", "controversiality": 0, "created_utc": 1373908016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb34tjc", "link_id": "t3_1iacam", "parent_id": "t1_cb2zpbg", "retrieved_on": 1430459651, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "I'm nineteen too with my daughter :)\nBut I kinda disagree about the diaper genie. After you start solids, the poops STINK! Just urinated diapers don't smell so I use a regular can for those but the diaper genie is good if you only have trash day once a week like me. It's all about preference though", "controversiality": 0, "created_utc": 1373908237, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb34wip", "link_id": "t3_1iacam", "parent_id": "t1_cb2wnd4", "retrieved_on": 1430459611, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "It also helps when they're learning to sit. The more they do the mini-push-ups, the faster their little tummies strengthen up ", "controversiality": 0, "created_utc": 1373908324, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb34xqs", "link_id": "t3_1iacam", "parent_id": "t1_cb307jm", "retrieved_on": 1430459595, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "Also, with co-sleeping, you're definitely gonna want to get bed rails. They're only like $10-$15 and when you're baby starts rolling over they can easily roll off of the bed. I know I slept a lot easier once I knew she was safe", "controversiality": 0, "created_utc": 1373908506, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3506t", "link_id": "t3_1iacam", "parent_id": "t1_cb2vaac", "retrieved_on": 1430459564, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "You start like 20mins after baby is born. It's called colostrum and referred to as \"liquid gold\". You have Received fantastic advice so far but as a side note to keep in your mind- exclusively pumping is an option. Docs may tell you otherwise but it is an option if breast feeding doesn't work out for whatever reason. There's a support-group on Facebook for exclusive pumpers that's amazing. I wish someone would have told me this the first time around. I'm now 4 months in exclusively pumping for the second :)  ", "controversiality": 0, "created_utc": 1373918617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb38yly", "link_id": "t3_1iacam", "parent_id": "t1_cb2jgll", "retrieved_on": 1430457688, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "glowworm2k", "author_flair_css_class": null, "author_flair_text": null, "body": "Here's my list of essentials for my kiddo (now 6 months):\n\n* cloth diapers\n* second-hand clothes (check craigslist for freecycled items or cheap bagged lots)\n* a portable change pad\n* lots of washcloths (for wiping up spit, bathing, washing stuff, etc.)\n* a rocker or bouncy seat to put the baby in when you need your arms free.\n* a baby carrier (you can get them cheap - my snugli cost me $18 off of kijiji)\n* a breastfeeding cushion (makes it so much easier in the middle of the night or when you're tired)\n* lanolin nipple cream for sore boobs.\n\nAll in all, I spent about $700 and got all the stuff I listed, plus a crib and a whole bunch of toys, receiving blankets, etc.  I didn't have a shower and didn't get many gifts, and I still have more stuff than I really need.  \n\nDon't forget: your baby doesn't know and doesn't care if the stuff you use is brand new or gently used, so don't be shy about shopping second-hand! \n\nGood luck :D", "controversiality": 0, "created_utc": 1373925101, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3bhko", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430456497, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "chellerator", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I had known about those! I used the lansinoh gel breastpads, but I thought that teabags worked better.", "controversiality": 0, "created_utc": 1373933683, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3efpj", "link_id": "t3_1iacam", "parent_id": "t1_cb2uj3s", "retrieved_on": 1430455036, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HAND92", "author_flair_css_class": null, "author_flair_text": null, "body": "It's true, it's all about preference. We had a trash with a lid so it wasn't so bad. I think I have blocked out most of the smell lol my daughter is a little over two and potty trained so I don't have to worry with that anymore. Thank goodness lol. ", "controversiality": 0, "created_utc": 1373948331, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3jkso", "link_id": "t3_1iacam", "parent_id": "t1_cb34wip", "retrieved_on": 1430452614, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "celtlass", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah yes, my mother told me to put teabags on my sunburn (or vinegar) to toughen up my skin - I could see how that would help. But with my kid's sleeping habits, I couldn't stand closer than 10 feet from anything with caffeine. :)  \n\nI liked how the moist burn pads were cheap and sanitary.", "controversiality": 0, "created_utc": 1373948614, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3jo3y", "link_id": "t3_1iacam", "parent_id": "t1_cb3efpj", "retrieved_on": 1430452571, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "Already fully potty trained at two?? Good job momma! What method did you use?", "controversiality": 0, "created_utc": 1373982578, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3qn3a", "link_id": "t3_1iacam", "parent_id": "t1_cb3jkso", "retrieved_on": 1430449272, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HAND92", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks lol it's been hard. We bought a toilet seat that has a built in child seat. We just took her constantly to the potty and read books while on the potty. One day it just clicked and she started using the toilet. She is scared to go poop in the potty so we are still working on that but she tries. We never used a potty chair. She also came with me every time I would go potty and it made her want to go like a big girl. Her birthday was almost three months ago so she's a little over two. ", "controversiality": 0, "created_utc": 1373989094, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb3sunk", "link_id": "t3_1iacam", "parent_id": "t1_cb3qn3a", "retrieved_on": 1430448159, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "glasspieces", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! Yes! This! I am sorry I was not clear about this in my original post. Used is great to many things, but never carseats! Your baby's life is worth the cost of a good, brand new one! Put it on your baby registry and maybe someone will gift it to you. That's how we got ours. My co-workers pooled their money and bought us our carseat and gave us a Target gift card.", "controversiality": 0, "created_utc": 1374028735, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb482cs", "link_id": "t3_1iacam", "parent_id": "t1_cb2uygr", "retrieved_on": 1430440847, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "you don't need too much at first. some onsies, both the newborn and the 0 to 3 month size. some diapers. a safe place to set baby such as a swing, and a carseat. as far as breastfeeding is concerned, you might want some washable nursing pads. they are much more comfortable than the disposable ones. some nipple cream is good. and unless you plan on being away from baby, or building a freezer stash of milk, you don't need a pump.", "controversiality": 0, "created_utc": 1374036536, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb4anqj", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430439625, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bananas4anna", "author_flair_css_class": "purple", "author_flair_text": "1 boy, born 1/13", "body": "Invest in an ergonomic carrier or wrap (babywearing). I would not have survived the first 2 months of my son's life without our Beco Butterfly 2. He wanted to held at all times, and this made that possible. And I could still do things, like feed myself, cook dinner, clean up a bit. He also napped like a champ in the carrier. \n\nHe's now 6 months old, and nothing calms him down faster when he is fussy than being worn. ", "controversiality": 0, "created_utc": 1374081879, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb4loqj", "link_id": "t3_1iacam", "parent_id": "t3_1iacam", "retrieved_on": 1430434358, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anditron", "author_flair_css_class": null, "author_flair_text": null, "body": "I was about to say none that I know of, but apparently somewhat recently there has been, at least according to [this article](http://www.lasvegassun.com/news/2013/mar/01/more-mothers-turning-placenta-pills-overcome-postp/#axzz2ZRoXaCly). There are plenty of articles about it. [Offbeat Families](http://offbeatfamilies.com/2012/02/placenta-encapsulation-faq) has quite a few articles but that one gives you sort of an FAQ from a national company that has people in different areas who do it for you. They're not everywhere. The site might have an article on how to do it yourself. There's a big difference between the encapsulation and eating. Eating you can't have it for longer in life. The practice of encapsulation is ancient Chinese medicine, take that phrase how you like. I can't tell you it's going to work for you. But when I weighed my personal history I decided that paying to have it done was worth the cost if it kept me off of anti-depressants after having my daughter. I really can't describe well enough how peaceful and at ease I would feel after taking one. There really are moments when you just feel overwhelmed and think you're going to crack. One day my daughter just couldn't stop crying and I thought I'd tried everything. I was exhausted, at home alone, had no family nearby, no friends that were parents and I just didn't know what I was going to do. I put my daughter down someplace safe, walked back, got a pill, took it, within 15-20 minutes I felt 100% in control again. During that time I took a few minutes to take some deep breaths and chill, then picked up daughter, and started going through my usual list of things to try to make her feel better, and this time was able to find it. But when I was freaking out, I just couldn't remember my list of things to check. I needed to calm down and couldn't. The pressure was insane and there was no snapping myself out of it. Like I said, it may be placebo, but a well-worth it placebo, imho.", "controversiality": 0, "created_utc": 1374195768, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb5myxm", "link_id": "t3_1iacam", "parent_id": "t1_cb34tjc", "retrieved_on": 1430416429, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "muhkayluh93", "author_flair_css_class": "lightcoral", "author_flair_text": "6mo DD", "body": "How much did it cost? ", "controversiality": 0, "created_utc": 1374195960, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb5n169", "link_id": "t3_1iacam", "parent_id": "t1_cb5myxm", "retrieved_on": 1430416400, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anditron", "author_flair_css_class": null, "author_flair_text": null, "body": "It was $250 and that was 3 years ago. You can do it yourself, there are plenty of resources out there about how to, but my husband wasn't really digging the idea of it. Apparently it is stinky.", "controversiality": 0, "created_utc": 1374196965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cb5nd7f", "link_id": "t3_1iacam", "parent_id": "t1_cb5n169", "retrieved_on": 1430416242, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}