{"submission": {"author": "tootsiepopz", "author_created_utc": 1366845460, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_bg3c8", "created_utc": 1376233608, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1k59vb/i_didnt_expect_to_have_to_watch_one_of_the_kids/", "gilded": 0, "id": "1k59vb", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/1k59vb/i_didnt_expect_to_have_to_watch_one_of_the_kids/", "retrieved_on": 1411945696, "score": 48, "secure_media_embed": {}, "selftext": "My husband went camping with coworkers Friday night right after work. So we didn't see him at all that day. Then he came back around 4 super exhausted and wanting to sleep. I was not happy about that but let him anyway. My daughter went to a birthday party with my mom and the hubs wasn't happy about it because he wanted to spend time with her. But she was ready so she went. An hour or two after they left she called and wanted me to come. So I woke the hubs up. He wasn't happy. So once I was there she wanted to wait for the piñata and cake which took like three hours. He wasn't happy. So he says \"you knew I was really tired. I didn't expect to watch the kids by myself. \" oh my goodness. He felt entitled to rest after a night of drinking and a day of fishing. Am I within reason of being pissed at his attitude? Anyone else deal with this kind of view?", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "\"I didn't expect to have to watch one of the kids alone\" said my husband after a night of camping and a day of fishing", "url": "http://www.reddit.com/r/Mommit/comments/1k59vb/i_didnt_expect_to_have_to_watch_one_of_the_kids/", "user_reports": []}, "comments": [{"archived": true, "author": "coffeegeek", "author_flair_css_class": "blue", "author_flair_text": "Gideon's Momma", "body": "Sure you have a right to be upset; but if you guys agreed for him to go out and drink/fish, what's wrong with him getting appropriate rest? In our house we both like to go out with friends, so we take turns, knowing that the other will take primary role of toddler wrangler...and we're okay with it. If this is a pattern and you don't get to go out with your friends then yea, it's definitely something to talk to him about. ", "controversiality": 0, "created_utc": 1376235944, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblioxg", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867784, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "I understand how you feel.  Maybe it's not \"right\" because technically he does need rest because he's had none...BUT...when my hubs does stuff like this is because there have been so many times I've been tired (not from partying) and just had to suck it up and make lunch anyway. It's a little like the SAHM thing, which I am.  I know he's tired when he gets home from work and I know he works hard, but I didn't exactly sit on my ass all day either and I want ten minutes to go take a poo or sit in my room and read for a minute.  It's not that I have stuff I \"need\" to do, but I would like a sec for just me.  Even he gets a 40 minute ride home from work with the radio on.  I can't make a pediatrician appointment without ninja skills and distractions. \nI'm not trying to start anything between moms and dads. I'm just stating how I feel when things like this happen in my marriage.  Then, I calm down, remember the times he shaved my legs for me when I was too preggo to bend, let alone sit in our tub, and I remember that he doesn't do very much besides work without his family. If my hubby had gone somewhere with his buddies, it would have been a rare occurrence.  Not because I keep him locked up, but because more times than not he prefers to be with us.  I'd probably just let it go, let him sleep this once, and use it as a bartering tool later ;P I totally understand you're pissed, I totally would be too, and I'm not saying I would do this with a smile, but I would do it. I'd only remind him how awesome I was a few dozen times. Good luck!!", "controversiality": 0, "created_utc": 1376236595, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbliviv", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867698, "score": 25, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "This sounds like something you should have been something you guys talked about before he went. I understand your annoyance but I'm sure he honestly didn't expect to have to watch the kids by himself when he got home. Next time something like this happens maybe he gets to rest when he gets home but you get to do something special the next weekend, so you both get mini-vacations.", "controversiality": 0, "created_utc": 1376236666, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbliw8o", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867689, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "I have this issue with my husband often.  He will be gone all day doing something fun and then is worn out and angry if I want him to do parenting things.  \n\nIt is funny that your husband cranked that your daughter was leaving because he wanted to see her and yet what he wanted to do was sleep.  Did he want her to stay home from the party and just be in the house sleeping while he slept? \n\nHonestly I try not to feel angry and bitter about this attitude.  I have a right to feel angry and bitter.  I have a reason to feel angry and bitter.  I am entitled to feel angry and bitter.\n\nThe problem?  The only thing I was left with was feeling angry and bitter.  My bad feelings didn't change him.  All they did was make me feel bad.  Again when this stuff happens I have a right, reason and am entitled to feel angry and bitter but feeling that way hurts and I am sick of it so I try not to wallow there.\n\nNow I try and ask in advance if I am going to need him and I try to plan for those times to be when my son will be fresh and easy to deal with.  I try to have everything that might be needed  available and I write a note with details about snacks, meals, drinks, potty issues, activities he might set my son up with and so on..\n\nIf my need to ask him to do solo care of my son is unexpected I often point out a few activities and snacks that my son enjoys and I have things he likes set aside to keep the novelty fresh.\n\nShould I have to do all this?  No.  Do I know woman who have partners who assume that often and unanticipated care of the children alone is part of it all and regularly care for their kids without getting bent out of shape?  Yep.  Do I get jealous and bitter and feel like 'why not me? why don't I deserve that partner?'  You bet I do! Two of my sisters have husbands who are a thousand times more involved fathers than my husband.  But I didn't get super dad.  I got my husband whom I love and who has many other fine qualities but gets childish and irritable and sometimes even mean about unanticipated responsibility for my son.  So I try to avoid surprising him and deal with a certain amount of jerkiness when it is unavoidable.  \n\nSo having been there and done that you have all of my sympathy a hundred fold and you are within reason to be pissed but try and not live in that feeling if you can because it is an ugly place that hurts you and you deserve to feel good.", "controversiality": 0, "created_utc": 1376236769, "distinguished": null, "downs": 0, "edited": 1376237168, "gilded": 0, "id": "cblixdf", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867674, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm glad I'm not the only one. Not glad that someone else has to deal with this too though. My friends husband's are like yours too. I do all the preparations too. I'm trying so hard not to dwell. I'm so frustrated though. How do I get over it?", "controversiality": 0, "created_utc": 1376237501, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblj54u", "link_id": "t3_1k59vb", "parent_id": "t1_cblixdf", "retrieved_on": 1429867574, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AllOfTheColors", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like you were both a little on edge to begin with, based on the number of times you used the phrase \"not happy.\" Perhaps no matter how any of these situations were handled was going to satisfy both of you, because there was an irritable predisposition there. What I mean is: you're irritated that he went out drinking, he's hungover, and you began reacting to each other's bad attitudes? My husband and I accidentally slip into these cycles sometimes and I can't figure out why we're even being so pissy with each other in the first place. Usually it's a matter of \"suck it up and snap out of it\" for me.", "controversiality": 0, "created_utc": 1376237659, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblj6tx", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867552, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Teriyaki_Pterodactyl", "author_flair_css_class": null, "author_flair_text": null, "body": "He's a parent. He should feel obligated to be as responsible for those children as you are. It isn't always fun or easy (as you know). Tough luck for him. ", "controversiality": 0, "created_utc": 1376237680, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblj71w", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867549, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "I would be ok with it if that's how it was. My night out consists of crafting or doing our nails at someone's house, which is fun. But I am expected to be home by 10, get up with the kids while he sleeps in. And usually the kids are asleep half the time he watches them. ", "controversiality": 0, "created_utc": 1376237939, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblj9y3", "link_id": "t3_1k59vb", "parent_id": "t1_cblioxg", "retrieved_on": 1429867511, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "You are right. He isn't a bad guy. Just priorities are messed up. ", "controversiality": 0, "created_utc": 1376237976, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbljad0", "link_id": "t3_1k59vb", "parent_id": "t1_cbliviv", "retrieved_on": 1429867506, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "He did sleep for over an hour. A mini vacation ha ha ha I wish. He would never let me stay out passed 11 let alone drink", "controversiality": 0, "created_utc": 1376238035, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbljazs", "link_id": "t3_1k59vb", "parent_id": "t1_cbliw8o", "retrieved_on": 1429867498, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "It wasn't planned for me to leave but I had to get my daughter.  I did let him sleep", "controversiality": 0, "created_utc": 1376238318, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbljdyj", "link_id": "t3_1k59vb", "parent_id": "t1_cblj6tx", "retrieved_on": 1429867459, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "One day when I was stewing on some issues about feeling as if I parent alone got really dark for me.  More dark than I can express.  It also happened to be a day where my husband was going to be gone the entire day but was coming home for one hour.  I was all twisted up and miserable and I just was sick and tired of feeling so horrible. I decided that the only person suffering was me and even though I had good reason to feel the way I did I just couldn't bear it anymore and I was going to take charge of my feelings and do whatever it would take to feel peace regardless of how entitled I was to feel otherwise.\n\nOn that day I put on my smile, changed my clothes, styled my hair and make-up to look decent and pushed my son in his car to the park.  I texted my husband that we were looking forward to the time we had to be together in the midst of his busy day and would enjoy it if he met us at the park.\n\nI went from feeling like I was in hell to feeling pretty good and in charge.  My husband did meet us at the park and I had him snap a pic of me and my son.  The picture came out gorgeous and I am not photogenic so it ends up being a picture I cherish because not only do I look good but I see it as a reminder that I decided that day that I was going to take charge of my happiness no matter the circumstance and that I was going to do whatever I could to help my son have the best dad my husband could be by accepting who my husband is rather than who I wish he was.\n\nI wish I could say that I made the decision not to be bitter once and never struggled again.  That would be a lie.  The decision to be happy and do what it takes to stay that way has to be renewed often.  For me looking at that picture helps.  Also I wrote a letter to myself reminding myself of all the things my husband does that are fantastic that I look at when I am focused on his attitude about parenting.  Also I sometimes imagine not having his help at all and how hard that would be.  I mean even though I have to prep him well I can trust him to do it and I know women who don't have any help who can't so much as go out for coffee without struggling to find a volunteer or forking over wads of cash to a sitter. Also I try to remember important areas that I am poor at where my husband shoulders more of the burden and how he doesn't act bitter and mean about my shortcomings. (my husband is the social gatherer in our relationship for instance) I try to love my husband for who he is not who I wish he was and try to view the extra prepping he needs to be a good dad as a loving gesture rather than a martyrdom.\n\nAnyway I am rambling and maybe not making sense.  The tl:dr; One day I said enough is enough and took responsibility for my happiness and decided I would do whatever it took to feel peace. I often have to remind myself about that resolve but it is worth it.\n \n\n", "controversiality": 0, "created_utc": 1376239571, "distinguished": null, "downs": 0, "edited": 1376240045, "gilded": 0, "id": "cbljrqi", "link_id": "t3_1k59vb", "parent_id": "t1_cblj54u", "retrieved_on": 1429867240, "score": 24, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "It happens to us all from time to time. ", "controversiality": 0, "created_utc": 1376240007, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbljwm0", "link_id": "t3_1k59vb", "parent_id": "t1_cbljad0", "retrieved_on": 1429867178, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Let\" you?  You are an adult and do not have to get \"permission\" from anyone to do what you want to do. As a loving parent and part of a parenting team you do have a responsibility to make sure your kids are adequately cared for and that your partner is aware and able to care for them in your absence (or find other care if he cannot). Your husband does not give you \"permission\" any more than you give him \"permission\" to go out.\n\nI'll step off my soapbox now. I have this SAME problem with my husband and I have had to work REALLY hard to find ways to fix the problem.  Changing my perspective and vocabulary has helped me a lot.\n\n", "controversiality": 0, "created_utc": 1376240383, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblk0vn", "link_id": "t3_1k59vb", "parent_id": "t1_cbljazs", "retrieved_on": 1429867121, "score": 17, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. Thank you. I will try doing this cause I feel like I'm at my wits end.", "controversiality": 0, "created_utc": 1376240604, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblk3dp", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429867089, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Coookiepuss", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd be pissed with his attitude as well.  I donno, I guess my mind set is...welp welcome to fucking parenthood.  Does it suck that he's tired, yes it does.  But you know us moms we're tired but we suck down some caffeine and get through the god damn day. It's the sacrifices we make. ", "controversiality": 0, "created_utc": 1376240615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblk3ib", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429867087, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "You're welcome.  Wits end is a terrible place but it can be a great place to grow from too.", "controversiality": 0, "created_utc": 1376241669, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblkfl7", "link_id": "t3_1k59vb", "parent_id": "t1_cblk3dp", "retrieved_on": 1429866932, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "auroranoel", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously... the roll over and take it method is not for me. I'd be putting his ass back in his place. He helped you make those babies and now he needs to step the f*ck up and help take care of them. Being a parent is being tired! Get over it, put your big boy britches on and step up dude! ", "controversiality": 0, "created_utc": 1376242505, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblkpg3", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429866803, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Q-Kat", "author_flair_css_class": null, "author_flair_text": null, "body": "I would be pissed off too, if my hubs is ill hes in bed all day until hes better and if in ill i chug counter drugs and do everything as usual through a haze, god forbid i want to go out i have to choose one of the children to take and then come back to them having watched Dora all day and had macdonalds for lunch and nothing tidied up.\n\ntoday i actually got a day out alone, hopefully a sign of things to come though there was still nothing done in the house", "controversiality": 0, "created_utc": 1376242794, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblkspq", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429866761, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "charlie6969", "author_flair_css_class": "green", "author_flair_text": "Tabby's Mom", "body": "&gt; But I am expected to be home by 10, get up with the kids while he sleeps in. \n\nWhy? Why does he get a night and a day off, but you have to be home by 10?", "controversiality": 0, "created_utc": 1376243074, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblkw1y", "link_id": "t3_1k59vb", "parent_id": "t1_cblj9y3", "retrieved_on": 1429866717, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SHE_LOVES_YOU", "author_flair_css_class": null, "author_flair_text": null, "body": "That is inspiring and very helpful.  Thank you for sharing this.", "controversiality": 0, "created_utc": 1376243888, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbll5t1", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429866591, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sasha_says", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like there's a larger issue in your marriage of not equitable down time, freedom and responsibility. If your needs were being met, you wouldn't be as bitter about your husband having some time. You also need to set an expectation of how you expect to be treated and what will make you happy in your relationship. This is a symptom. Don't attack him for going out and not jumping right up to take care of the kids, but talk about how you need some time too and help with responsibilities.\n\nFurther, expectations do make a big difference and it's hard for some people to just wing it when those expectations don't fit reality. I almost always wake up with my daughter on weekends while the SO sleeps in because I get up early. Sometimes I ask him to so I can get a break and he does it because I do it most days. However, he's asked me to let him know the night before when that happens so he's prepared but I don't always know how I'll feel in the morning. Those types of situations are difficult.", "controversiality": 0, "created_utc": 1376244187, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbll9e9", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429866544, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh well then you should *definitely* be mad. You guys should be trading off! Its not fair to think that he should get breaks but you shouldn't. Why shouldn't you get to drink or stay out or have a spa day?", "controversiality": 0, "created_utc": 1376244696, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbllfar", "link_id": "t3_1k59vb", "parent_id": "t1_cbljazs", "retrieved_on": 1429866468, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1376245598, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbllq0j", "link_id": "t3_1k59vb", "parent_id": "t1_cblj54u", "retrieved_on": 1429866329, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "I try to remind myself, you can't help how you feel, but you do have power over how you respond to those feelings.", "controversiality": 0, "created_utc": 1376246301, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbllyf2", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429866149, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Ha ha, that's why I make sure I have at least one or two good friends with husbands and kids so we can occasionally get together and bitch about the bad things, and then feel better that everyone feels the same way, and then realize that we don't have it so bad after all.", "controversiality": 0, "created_utc": 1376246359, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbllz4a", "link_id": "t3_1k59vb", "parent_id": "t1_cbllq0j", "retrieved_on": 1429866140, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JaynesWay", "author_flair_css_class": null, "author_flair_text": null, "body": "This kind of attitude would make me so angry- you are totally justified in your feelings. This isn't the 1950's- in my book dads are expected to be full time parents no different than mom. My husband is all in 100%, and if he weren't, I would have a huge huge problem with that. I get previous poster's don't make yourself miserable by being mad attitude- but that would be a total last resort for me and probably steps ahead of my divorce. I could not live with inequity like that in a partnership, no matter how hard I tried. This kind of parenting by fathers perpetuates the stereotype of dad as babysitter instead of parent. \nIf I were in your shoes, it'd be time for a serious come to Jesus talk. Good luck! ", "controversiality": 0, "created_utc": 1376246529, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblm151", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429866114, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, it's tough to say without more information if this is a self-imposed thing, or a husband-imposed thing.  It think if she asks for reciprocal treatment: a night out with friends and \"extra\" rest the next day, and is denied, then this is a big problem.  But it could also be a case of the OP expecting herself to get home and get up the next morning because her husband doesn't step in and offer to let her rest.  And if there's one thing I've learned from marriage/raising kids it's that husbands aren't always willfully withholding help.  Sometimes, as baffling as it may seem, they just don't realize when help is needed unless they're explicitly asked.", "controversiality": 0, "created_utc": 1376246564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblm1ka", "link_id": "t3_1k59vb", "parent_id": "t1_cblkw1y", "retrieved_on": 1429866108, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "charlie6969", "author_flair_css_class": "green", "author_flair_text": "Tabby's Mom", "body": "You might be right, but it's hard for me to imagine a grown person being unable to figure out how to pour cereal or get a kid dressed.\n\nI get that child-rearing doesn't come easily to some men, but that's no excuse. *I'm a woman and terrible with babies! Thank God my husband was good with them, since we had one.* If someone has the Dad title, then they need to do the Dad job that goes along with it.\n\nI stepped up to be a better Mom. He can step up to be a better Dad. He has to prove to his kids that they can count on him, just like they know they can count on Mom.\n\n*It's not just for her sake, it's also for the sake of Dad and the kids.*\n\n", "controversiality": 0, "created_utc": 1376247171, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblm8ml", "link_id": "t3_1k59vb", "parent_id": "t1_cblm1ka", "retrieved_on": 1429866017, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "merewenc", "author_flair_css_class": null, "author_flair_text": null, "body": "You need to sit him down once the kids are in bed sometime in the next day or two (but definitely before the next weekend) and explain that you want to talk about adult time. Say that you think it should be an equal amount between the two of you and that if he expects to get time to recuperate after a night out with friends then you deserve the same thing. \n\nMy husband and I take turns being the one to wake up with our annoyingly early-bird children on the weekends. If I take Saturday, he takes Sunday. This lets us each sleep in. \n\nIf he tries to pull some bullshit answer like, \"I work and all you do is stay home with the kids all day every day,\" tell him you'll be going to spend the weekend at your parents' house this next weekend so that he can get the full experience of being \"just\" home alone with the kids every day. I hate when I hear about husbands (or wives with a SAHD) pulling that BS. ", "controversiality": 0, "created_utc": 1376247299, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblma2s", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429865998, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "It depends.  If I ask my husband to watch our son in the morning while I take a shower, sometimes that's all I get.  If I ask him explicitly to feed our son breakfast and get him dressed while I take a shower, that's what I get.  I don't think that makes him a bad dad.  Part of it is he genuinely doesn't realize what needs to be done, and part of it is he doesn't do some things without asking me because I had a habit of getting pissed off when things didn't get done right.  I'm trying to be better about that.  It frustrates me to no end that he doesn't always consider breakfast or clothes or morning schedules, but then, he never refuses to do those things if I ask him to.  That would be the real red flag.", "controversiality": 0, "created_utc": 1376247700, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblmerp", "link_id": "t3_1k59vb", "parent_id": "t1_cblm8ml", "retrieved_on": 1429865937, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BoulderCat", "author_flair_css_class": null, "author_flair_text": null, "body": "You nailed it.", "controversiality": 0, "created_utc": 1376248599, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblmp70", "link_id": "t3_1k59vb", "parent_id": "t1_cbliviv", "retrieved_on": 1429865802, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "Thanks! ", "controversiality": 0, "created_utc": 1376248685, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblmq7o", "link_id": "t3_1k59vb", "parent_id": "t1_cblmp70", "retrieved_on": 1429865789, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "charlie6969", "author_flair_css_class": "green", "author_flair_text": "Tabby's Mom", "body": "&gt; because I had a habit of getting pissed off when things didn't get done right.\n\nRock, meet hard place.\n\nDo you think he is scared to parent? Not so much scared that he will screw up, but that you will think that he screwed up, somehow?\n\n*you know, doesn't want to let you down?*\n\n \n\"It frustrates me to no end that he doesn't always consider breakfast or clothes or morning schedules, but then, he never refuses to do those things if I ask him to. That would be the real red flag.\"\n\n\n\nVery true. That would frustrate me too. Every situation is different and every relationship is different, so there's no one-size-fits-all answer to this question.  Good luck, a good husband is worth the trouble. :)\n\n", "controversiality": 0, "created_utc": 1376249729, "distinguished": null, "downs": 0, "edited": 1376251137, "gilded": 0, "id": "cbln2gd", "link_id": "t3_1k59vb", "parent_id": "t1_cblmerp", "retrieved_on": 1429865630, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sarahkali08", "author_flair_css_class": null, "author_flair_text": null, "body": "Your responses are amazing. Thank you so much! The thought process can be applied to a couple different problems in my life regarding my husband. Especially the mindset of doing prep out of love for him an for your son. Anyway, Thank you for the new perspective! ", "controversiality": 0, "created_utc": 1376251147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblnj55", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429865414, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "usandthings", "author_flair_css_class": "lightcoral", "author_flair_text": "4 rugrats", "body": "This! Once, in the morning, I went out for a run and I said, \"[Child] has a doctor's appointment at [X time],\" which was about an hour from when I was leaving.  I thought that translated perfectly to, \"so please feed her breakfast and change her clothes so I can come home, take a quick shower, and be off.\"  I was so ticked when I came home and she was still in her jammies, watching cartoons.  Husband saw me and jumped up to leave and I just stared after him with my mouth open.  After getting over being mad (which took a while) I asked him why he didn't do those things and he said, \"you didn't ask me to...?\"  I have learned that with my husband at least, I have to be very specific if I want it done.  No, it's not fair, but that's how it is.", "controversiality": 0, "created_utc": 1376252486, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblnyy8", "link_id": "t3_1k59vb", "parent_id": "t1_cblmerp", "retrieved_on": 1429865209, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh wow. I'm actually going to save this post and re-read it when I'm having a bad day. Thank you. ", "controversiality": 0, "created_utc": 1376256332, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblp7zw", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429864625, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "madmaxine", "author_flair_css_class": null, "author_flair_text": null, "body": "I have felt the imbalance many a times. I don't complain much. At least I try not to. My husband works overnights and I day shifts at a café. So when I had a really hard night and baby wakes up before the crack of dawn, I just take it. But when all I hear is how tired he is, it's hard to not take it personally. Eventually we needed a time out and went on a date. I brush off his exhaustion like it's nothing and don't take it seriously. He doesn't realize how much it sounds like he's rubbing it in. We're all tired. We're all worn out. It's annoying to hear complaints you yourself have to hold in. Hopefully you can level soon. But if you need to swear at the dishes while washing them at the end of the night, by all means, let it out. \n\nTL/DR; I verbally abused my dishes from time to time. ", "controversiality": 0, "created_utc": 1376264720, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblrze1", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429863337, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "Lol I shall try that. Yeah the entitlement attitude sucks. Mine has the I've worked all day while you've been at home all day mentality", "controversiality": 0, "created_utc": 1376265436, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbls7en", "link_id": "t3_1k59vb", "parent_id": "t1_cblrze1", "retrieved_on": 1429863233, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "I haven't slept in in months. He stopped letting me cause he was too tired", "controversiality": 0, "created_utc": 1376265478, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbls7ui", "link_id": "t3_1k59vb", "parent_id": "t1_cblma2s", "retrieved_on": 1429863228, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "I know. I never wish him away. Grass is always greener but at the end of the day grass is grass", "controversiality": 0, "created_utc": 1376265551, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbls8od", "link_id": "t3_1k59vb", "parent_id": "t1_cbllq0j", "retrieved_on": 1429863217, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Googly-bear", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't believe how well you just described MY husband. \n\nHe'll go off on a motorcycle ride for 3-4 hours while my son is in prime awake time, then will come back just when he goes down for nap, giving him about 1.5 hours of rest. \n\n Then, if I want to go for a motorcycle ride, or need to shop or go get a haircut or whatever, he says \"you should go while he's napping\" or \"you should go when he's in bed\", you know, so he's inconvenienced for a shorter period of time...", "controversiality": 0, "created_utc": 1376267191, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblsqy6", "link_id": "t3_1k59vb", "parent_id": "t1_cblixdf", "retrieved_on": 1429862981, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shaynami", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe just don't worry too much about his complaining and just let him be tired and have to watch the kids. You know, don't get upset with him but don't make adjustments for him either. Sometimes just complaining about it makes the work easier. ", "controversiality": 0, "created_utc": 1376270789, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbltwhn", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429862431, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "merewenc", "author_flair_css_class": null, "author_flair_text": null, "body": "And that's when you \"accidentally\" let the kids wake him up, or see a huge spider that make you scream, or whatever. Then if he complains too much about being tired say, \"Okay, I'll make you an appointment with the doctor if you're this tired because there must be something medically wrong with you if you're feeling like that while getting so much more sleep than me.\"\n\nYou're his wife, not the nanny. He needs to keep up with his side of parenting just as much as you do. That includes giving you as many breaks as you give him, whether he likes it or not. ALL parents of young children are tired. He needs to grow up and realize that it's just for this little while and you deserve just as much consideration as he does. ", "controversiality": 0, "created_utc": 1376273325, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cblupeu", "link_id": "t3_1k59vb", "parent_id": "t1_cbls7ui", "retrieved_on": 1429862055, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "classypancake", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! My poor husband works a weird shift. When he got home at 3ish Friday morning, I reminded him that I was going to lunch with a friend and he said, \"You're taking Mira with you, right?\"  \"No\" \"You can't leave me alone with her! I have to sleep!\"  Yeah...anyway...I'm there with you.\n", "controversiality": 0, "created_utc": 1376273403, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbluqex", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429862042, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "YES!!! My fiance says I wanted the kids and he didnt, thus he doesnt have to do anything", "controversiality": 0, "created_utc": 1376301480, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbm1kty", "link_id": "t3_1k59vb", "parent_id": "t3_1k59vb", "retrieved_on": 1429858779, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "glowworm2k", "author_flair_css_class": null, "author_flair_text": null, "body": "This is us, right down to the motorcycles.  My SO is really great a lot of the time, but there's often the request that I have my kid napping before I leave if I go out and that kiddo be well-rested and in a good mood every evening when the SO gets home from work :P", "controversiality": 0, "created_utc": 1376305662, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbm2440", "link_id": "t3_1k59vb", "parent_id": "t1_cblsqy6", "retrieved_on": 1429858528, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AnyelevNokova", "author_flair_css_class": null, "author_flair_text": null, "body": "I've just had to have a talk with my SO on the problem.\n\nWe needed money, bad. His income isn't cutting it, even when we stick to basics. So I got a job, which is great. I'm making more than I thought I would and getting good hours. But my SO took one look at how much they scheduled me and instantly said, \"uh-uh. This isn't going to work. You *can't* be working this much.\" I asked him why, and he responded with, \"I'm never going to have time to do *anything* but watch the kid or work.\"\n\nI wanted to explode. Are you freaking kidding me? I've felt that way for the past *six months*. And when I complained to you that I wanted just *one* day off -- not halvsies, not \"but I'm tired from working\" on days he worked and \"but it's my day off\" on days he's off -- I was told that, oh, well, yeah, *it sucks, too freaking bad*.\n\nAs it stands right now, I'm probably getting a second job or going full-time. Not because I want to, not for the money; because it'll mean that we can afford to send the kiddo to daycare so that his father has time to play video games.", "controversiality": 0, "created_utc": 1376315085, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbm3wqz", "link_id": "t3_1k59vb", "parent_id": "t1_cblm151", "retrieved_on": 1429857691, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tootsiepopz", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my goodness that's mean. Hope your kids don't hear him. But yeah my husband assumes it's my job always cause I'm their mom", "controversiality": 0, "created_utc": 1376316528, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbm4adp", "link_id": "t3_1k59vb", "parent_id": "t1_cbm1kty", "retrieved_on": 1429857514, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zifna", "author_flair_css_class": null, "author_flair_text": null, "body": "Did he want you? Then he has to do something. You can't pick and choose. That's a terrible philosophy.  \n\nFortunately, it's easy to show how terrible it is.\n\n\"You wanted steak for dinner, honey, so you have to go to the grocery store, cook it, and do all the dishes.\"  \"Oh, honey, you wanted to meet with your friends on Friday. I'll need these clothes clean. They're your friends, so you have to clean them for me. Don't do them all in one load - here are the cleaning instructions for each.\" \"Oh, yes, well, I stopped dressing up or doing makeup around the house because YOU want me to look good. If you want it, you'll have to apply the makeup for me and dress me in cute clothes. I can't be bothered.\"\n\nDon't be afraid to be TOO asinine. His argument is stupid enough.\n", "controversiality": 0, "created_utc": 1376318107, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbm4r75", "link_id": "t3_1k59vb", "parent_id": "t1_cbm1kty", "retrieved_on": 1429857296, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FemalesListenToUsCum", "author_flair_css_class": null, "author_flair_text": null, "body": "THAT comment would cause MY fiance to be an X real quick !", "controversiality": 0, "created_utc": 1376324069, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbm6ufu", "link_id": "t3_1k59vb", "parent_id": "t1_cbm1kty", "retrieved_on": 1429856321, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you tell him how selfish and unreasonable and childish this is?", "controversiality": 0, "created_utc": 1376405100, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbmuirx", "link_id": "t3_1k59vb", "parent_id": "t1_cbm2440", "retrieved_on": 1429845047, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, that is cold. I would suggest he pack his cases, I wouldn't want a man living in my house who didn't care for my kids. ", "controversiality": 0, "created_utc": 1376405429, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbmumme", "link_id": "t3_1k59vb", "parent_id": "t1_cbm1kty", "retrieved_on": 1429844994, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I think they have serious issues with communication.", "controversiality": 0, "created_utc": 1376405524, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbmunrj", "link_id": "t3_1k59vb", "parent_id": "t1_cblm1ka", "retrieved_on": 1429844978, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Why would you put up with that shit?", "controversiality": 0, "created_utc": 1376405592, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbmuok8", "link_id": "t3_1k59vb", "parent_id": "t1_cbljazs", "retrieved_on": 1429844969, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beejeans13", "author_flair_css_class": null, "author_flair_text": null, "body": "It happens to all of us. I've found that a little more discussion of expectations is really helpful. If my guy takes the day off to golf and go out with the guys, I'm happy for him to get the opportunity. But... I also remind him that he has to be a father the next day, and that I will be planning a spa/dinner with my best friend the following week. It makes him feel better prepared for what role he plays and I don't feel left out.", "controversiality": 0, "created_utc": 1376409109, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbmvwhz", "link_id": "t3_1k59vb", "parent_id": "t1_cblj54u", "retrieved_on": 1429844400, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "r04r04r", "author_flair_css_class": null, "author_flair_text": null, "body": "Reading this made me inspired to apply this logic to other areas of our life as well. What a refreshing and inspiring take on things, especially since I lean towards pessimism in most cases and make myself the martyr in our relationship. Thank you. ", "controversiality": 0, "created_utc": 1376416723, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbmyspd", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429843048, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lynn", "author_flair_css_class": "green", "author_flair_text": "Daughter, 3; boy, 4 months", "body": "Dude. You're going to give in to that?", "controversiality": 0, "created_utc": 1376444113, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbn900d", "link_id": "t3_1k59vb", "parent_id": "t1_cbm3wqz", "retrieved_on": 1429838182, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "luv4bunnies79", "author_flair_css_class": "purple", "author_flair_text": "3 year old's zookeeper, newb 9/13", "body": "This is a beautiful story. None of us are perfect, and it is great how you take charge of your happiness. ", "controversiality": 0, "created_utc": 1376510189, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbnrgmm", "link_id": "t3_1k59vb", "parent_id": "t1_cbljrqi", "retrieved_on": 1429829357, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you.", "controversiality": 0, "created_utc": 1376536946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbo1cm9", "link_id": "t3_1k59vb", "parent_id": "t1_cbnrgmm", "retrieved_on": 1429824669, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeegeek", "author_flair_css_class": "blue", "author_flair_text": "Gideon's Momma", "body": "Oh that's BS. He needs to take his turn. We each love having our alone time but we both love having our one on one time with kiddo. It's called being a parent. \n\n*Sorry for the delayed response. I've been sick. ", "controversiality": 0, "created_utc": 1376789579, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbpz933", "link_id": "t3_1k59vb", "parent_id": "t1_cblj9y3", "retrieved_on": 1429791508, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}