{"submission": {"author": "moonfetus", "author_created_utc": 1375749486, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_cn4xg", "created_utc": 1377581317, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1l656r/how_do_you_guys_get_anything_done/", "gilded": 0, "id": "1l656r", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/1l656r/how_do_you_guys_get_anything_done/", "retrieved_on": 1411890982, "score": 18, "secure_media_embed": {}, "selftext": "I am having a hard time getting stuff done around the house with my 9 month old son...\nOn an average day I need to do laundry, wash dishes, make the bed, take care of the dogs, vacuum, swiffer &amp; sweep the wood floors so baby doesnt find anything to put in his mouth, clean up messes we make throughout the day, make dinner etc...and that's not counting the breastfeeding, making him meals, keeping him happy and changing diapers. \nHe is crawling and pulling himself up onto things now and can walk when holding onto furniture. He is also very clingy and needy. I have been reading The Wonder Weeks and it seems like this is very normal but I can't seem to get anything done. He wants to be held all day. If I put him down and walk a few feet away he crawls over and stands up pulling on my leg which leaves me unable to move. If I move him he'll just do it again. He usually throws a tantrum if I dont pick him up or I finish what I'm doing. A few times this has led to him falling and banging his head.\n If I put him in anything that restricts him moving around the house (playpen, swing, exersaucer) he freaks out. I know it's probably ok to let him cry for a few minutes but it makes me so anxious and gives me a headache. Not to mention it makes me really sad. \n:( I worry he is stressing out his brain or something.\n\nI've tried using an Ergobay carrier but he doesn't care for that unless we are outside. \nI am not getting anything done unless he's sleeping and sometimes if he falls asleep on the boob I just have to leave him bc he wakes up if I move him and I'd much rather have a few quiet moments to play on my phone or watch tv instead of him waking up and being cranky. His nap(s) is usually only 30 minutes anyway. \nHe has a bunch of toys but doesn't seem very interested in them unless I'm playing with him. He loves the Baby Einstein movies but it really only keeps his attention for 5 minutes or so. \n\nHow do you ladies get stuff done in your house? Is it while they are napping mostly? I feel like I never get a break! I forget to feed myself most days and can't get a shower in until my husband comes home. \n\nSorry for the rant/rambling. Thanks in advance for advice!\n\n\n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How do you guys get anything done??!", "url": "http://www.reddit.com/r/Mommit/comments/1l656r/how_do_you_guys_get_anything_done/", "user_reports": []}, "comments": [{"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1377583777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw4p2z", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429686293, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "So I just need to have two more kids and I'll be good to go! Lol. \nJk. Still trying to figure out this one! :)\n\nThanks for your comment! I will try some of your techniques! I might have to do the dishes thing; I despise dishes!", "controversiality": 0, "created_utc": 1377584026, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw4qyt", "link_id": "t3_1l656r", "parent_id": "t1_cbw4p2z", "retrieved_on": 1429686268, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meltedicecube", "author_flair_css_class": null, "author_flair_text": null, "body": "Lower your expectations. I can't get shit done and I'm not going to worry about it.", "controversiality": 0, "created_utc": 1377584224, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw4sf2", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429686250, "score": 53, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1377584316, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw4t4n", "link_id": "t3_1l656r", "parent_id": "t1_cbw4qyt", "retrieved_on": 1429686240, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm happier in a clean house myself. Everything in its place...even if it's organized chaos like his play area. \nIf it's a phase, I hope I go through it soon! :)", "controversiality": 0, "created_utc": 1377584586, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw4v07", "link_id": "t3_1l656r", "parent_id": "t1_cbw4t4n", "retrieved_on": 1429686216, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "easycheesus", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like my first. Honestly, the shit just didn't get done. It will get better eventually! Prioritize the most important things (like getting baby fed/changed, taking care of the dogs, etc and go from there. It's hard to let go but if you can you'll be happier. ", "controversiality": 0, "created_utc": 1377585641, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw52cz", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429686121, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nerdykitty", "author_flair_css_class": null, "author_flair_text": null, "body": "It took me a while to get into my cleaning groove.  I'm always trying to make things more efficient.  I have found that cleaning in little 5-10 min. spurts worked best when DD was a baby.  It's super hard to clean when they don't understand what it is you're doing and why all your attention isn't on them.  \nMaybe I'm a mean mommy, but I would play with my daughter, then tell her I have to clean ____ and I would be back to play with her after.  I would do said chore as fast as I could.  Even if she screamed bloody murder and was clawing at my legs and trying to get me to hold her I would grit it out and finish it.  Big hugs and kisses afterwards.\nShe's 3 now and while she still fusses for my attention she now understands when mommy needs to clean she needs to clean and she plays by herself.  Also I totally get the want to break when your kid sleeps.  I still to this day sleep or surf on my computer when she naps.  It's what recharges me.  I'll be sad when those days are over, lol!\n\nBasic cleaning tips I've picked up along the way.  Quick clean the house every day 30 mins before husband gets home.  Only because that way you aren't picking up toys off the ground for the 50th time that day.  Throw whatever dishes into the dishwasher or sink.  Things on counters?  Stuff em into drawers.  Basically do a clearing of anything you can see.  Didn't get to the bedroom?  Shut the door.  I realize this might be hard with a 9 month old.  Many times I would run around the house playing catch me if you can while I grabbed stuff to throw in drawers and just talked and made a game of it with her.  Funny sounds &amp; weird arm movements are also welcome.  At least my daughter loved it.\n\nEverything must have a home.  Be it in a closet, a drawer, a basket, etc.  If it does not have a home it goes into a basket during the quick 30 min clean I do everyday.  When the misc. baskets get too full then I organize them and find homes for the things.  It really helps when cleaning &amp; picking things up to know where everything goes.", "controversiality": 0, "created_utc": 1377588204, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw5i2y", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429685917, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "saints_chyc", "author_flair_css_class": null, "author_flair_text": null, "body": "Had the same problem with my DD when she was that age.  I couldn't put her down without her following me around, or crying.  I finally just made sure that all the dangerous things were off the floor and kept to the things that wouldn't be such a nuisance.  I would make it a game to follow me around, she would love it.  I would ALWAYS sit her right behind me on the couch as I folded laundry and then set her on the floor and let her follow me when I put things away.  I saved the major cleaning for nighttime, took an hour after she went to bed to get whatever done, then it was less of a hassle.  Floor swept nightly, mopped once a week.  Dishes and kitchen completely clean every night.  Wiped down bathrooms with lysol sheets once every couple days, cleaned toilet bowls once a week.  Spot clean everything else.  Vacuum one room a day. \n\nKeep easy one handed snacks handy for you to munch on while you are breastfeeding, try to walk around and do one handed jobs while feeding as well.  You can swiffer with one hand right?  Carry baby and swiffer at the same time.  Put on a Baby Einstein with his Exer-Saucer in front of the TV for a quick dish wash.  \n\nBottom line, you're a mommy to a new baby.  Enjoy it rather than being stressed that the house isn't spotless or that a load of laundry doesn't get done. ", "controversiality": 0, "created_utc": 1377588898, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw5ly0", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429685867, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SadPandaOuch", "author_flair_css_class": null, "author_flair_text": null, "body": "For me, that 9-15 month or so stretch was the hardest. They are old enough to have opinions and get into everything, but not old enough to follow directions or be left alone for a minute or \"help\" with chores. Let it go. It will get easier as he gets older. Also, the playpen can be your best friend for getting quick chores done. It's good for your kid to start learning to entertain himself for short periods (10-15 min) while you do some dishes on the other side of the room &amp; just talk to him. I think modeling chores helps encourage them to participate in said chores later, too. \n\nBut seriously, let it go. And be creative- do meal prep for the following day after he goes to bed if you can, for example. Have chores divided between you &amp; your partner. Trade of 30-60 min of whirlwind chore time on the weekends, and have a regular game plan so you don't spend too much time thinking about it.", "controversiality": 0, "created_utc": 1377597898, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw6r1r", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429685334, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1377607566, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw88af", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429684644, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "miseleigh", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my god woman, are you trying to kill yourself?\n\nForget the bed. Letting it air out is good for it anyway.\n\nWhy on earth do you need to do laundry every day? Use towels, sheets, pajamas and jeans a few times before washing. Baby eats in a diaper.\n\nSweep or vacuum only when it's visibly needed. For me that would be twice a week but we usually do it once anyway (with two cats, though I'm sure the dog fur is worse.)\n\nDinner can be sandwiches. Frozen veggies and meatballs are one of my favorites. Hard boil a dozen eggs at once to keep around for when they're needed - they last ages in the fridge. Bananas and avocados are fast and nutritious too.\n\nMany dishes can simply be rinsed in hot water and used again that day - cereal bowls, sandwich plates, your coffee mug doubles as a water glass all day. Eat leftovers straight out of the Tupperware.\n\nAlso, I found the moby wrap to be a lifesaver. My baby gets carried and I can still play with my toddler.\n\nGood luck mama. Two key things: reduce the amount of things you have to do by reusing stuff, and reduce your expectations.", "controversiality": 0, "created_utc": 1377608092, "distinguished": null, "downs": 0, "edited": 1377608462, "gilded": 0, "id": "cbw8cew", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429684591, "score": 40, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "screwthebankiworkfor", "author_flair_css_class": null, "author_flair_text": null, "body": "The cleaning priority is things that will get crusty or smelly. Sippy cups of milk get rinsed, floor under the high chair gets vacuumed, the occasional outfit with some poop gets rinsed. Everything else can wait. Also, if you can do anything whatsoever that saves a step, do it. Like keeping a cup in the dog food for scooping, or making double meat one night to cover dinner the next day. My partner and I have an okay tag team system every evening. One makes dinner while other parents. Eat together. Play together. One does bath while other cleans up after dinner (ilu dishwasher). One does bedtime routine while other throw in a load of laundry if necessary that day and tidies so we don't step on any blocks at 230 am (grumble grumble). ", "controversiality": 0, "created_utc": 1377609356, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw8myf", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429684454, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaPear", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in the same situation w my 9 month old. In the mornings, before I get him out of his crib, I go around the house picking things up and removing any hazards. I may also put some clothes in the washing machine. If I have to vacum or do the dishes I usually place him where I can see or hear him. If he comes to me wanting to be picked or something I stopped what Im going, play w him for a while and wait for him to get distracted again so I can continue my tasks. But seriously is good to lower your standards when it comes to cleaning and getting things done. Being a mom is stressful enough to also have to worried about this cleaning stuff. \n\n\n", "controversiality": 0, "created_utc": 1377609831, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw8rb8", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429684398, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "k_hall_313", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep. My husband would come home from work and get pissed that a lot of stuff didn't get done. It wasn't until I let him stay with our kids (22 months and 3 months) alone that he realized its not that easy during the day! There's always something to be cleaned, kids are young once.", "controversiality": 0, "created_utc": 1377611550, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw97ww", "link_id": "t3_1l656r", "parent_id": "t1_cbw4sf2", "retrieved_on": 1429684183, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "The age you're at is really hard because they want your attention 100% and they are moving around and needy and everything. At this point you might just need to lower your expectations a bit. Try to go with the bare minimum. Or try to relax during the day with baby and get everything done when your husband gets home. It might just be easier to do things efficiently in the evening when you can just get it all done then stopping every few minutes to tend to your son. \n\nIt will get better though. In a few months he should start to play more independently and he might actually be occupied for 15-20 minutes at a time so you can get a chance to do things. Of course until he gets a bit older he will need to be in the same room as you but at least you will probably be able to do dishes while he pulls all the magnets off the fridge or throws tupperwear around the kitchen!", "controversiality": 0, "created_utc": 1377612413, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw9gqq", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429684068, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smartache", "author_flair_css_class": null, "author_flair_text": null, "body": "You might have to let some things go for a while. It's ok.  Maybe some things can be done every other day or every few days instead of every day- like sweeping/swiffering, laundry, vacuum, etc.  Kiddo is your number one priority, as he should be! :)  Hang in there!", "controversiality": 0, "created_utc": 1377612814, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw9l1r", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429684012, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "eelassirak", "author_flair_css_class": "lightcoral", "author_flair_text": "May2011 &amp; Feb2013", "body": "I like the way you think! I already do all this stuff, but my germoaphobe friends cringe when they see me rinse things instead of wash them. I've been a mom longer than they have... they'll get it.", "controversiality": 0, "created_utc": 1377613456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw9sc3", "link_id": "t3_1l656r", "parent_id": "t1_cbw8cew", "retrieved_on": 1429683918, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "eelassirak", "author_flair_css_class": "lightcoral", "author_flair_text": "May2011 &amp; Feb2013", "body": "I love doing diaper laundry too! I think it's because I don't have to put any of it on hangers and it all gets plopped into the same basket when done - no sorting or anything, just three stacks and one basket.", "controversiality": 0, "created_utc": 1377613633, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbw9ub8", "link_id": "t3_1l656r", "parent_id": "t1_cbw4p2z", "retrieved_on": 1429683821, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "badtooth", "author_flair_css_class": "purple", "author_flair_text": "Jack's Mom 05.05.12", "body": "You have a very similar style to me. I know every mom is different with letting their kids cry, but if I didn't let my son cry his eyes out and pull on my legs while I cooked, then I could never cook.", "controversiality": 0, "created_utc": 1377615930, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwam9m", "link_id": "t3_1l656r", "parent_id": "t1_cbw5i2y", "retrieved_on": 1429683459, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SerryChoda", "author_flair_css_class": null, "author_flair_text": null, "body": "I have two kids (4 months and 3 years), so I feel your pain. I have come to find that working out a schedule for myself has really helped with keeping the little ones satisfied and letting me get things done around the house (I am NOT the kind of person that can just let things go. If my house is a sty it just brings me down). Children and babies generally function on routine and as soon as you establish one with them, life will become much easier. For example, we all get up at around 7 or 8 each morning, have breakfast, I give the little one a bath and get him dressed, then get the big one dressed. We play/do crafts/watch TV/whatever until lunch time and then after lunch it's \"quite time\" (or ideally \"nap time\") for about an hour. That is the time in which I can start doing my chores. After quiet time I usually have the 3 year old watch a little TV or pick a \"solo activity\" with a snack and that allows me a little more time (if the baby allows), then it's back to focusing my attention on the kids until daddy comes home. It's a fair compromise and it's now gotten to the point where my 3 year old knows exactly what to expect and when to expect it. \n\nYour baby sounds like he is in the \"I don't want mommy out of my sight\" phase (which I have been through myself) and that can be tough. Still, I would recommend sticking to the routine and perhaps either making it so he can still see you or else occasionally talking to him or popping your head in the room so he knows you are still there when it's time for him to play on his own. ", "controversiality": 0, "created_utc": 1377617644, "distinguished": null, "downs": 0, "edited": 1377617842, "gilded": 0, "id": "cbwb8tv", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429683167, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! A lot of that sounds like it will help. A quick clean before my husband gets home is a good idea. I know he is stressed out when the place is a mess (as am I) but I guess I'm just trying to constantly clean throughout the day and it becomes overwhelming. I guess there's no reason to pick up the toys a million times a day, huh? :) Thanks again. ", "controversiality": 0, "created_utc": 1377618966, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwbqq7", "link_id": "t3_1l656r", "parent_id": "t1_cbw5i2y", "retrieved_on": 1429682935, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, it's hard for me b/c I know what needs to be done and It makes anxious to leave it. But it sounds like I need to prioritize and let some stuff just be, even if I leave it and then do a quick clean right before my husband or visitors come over like someone commented. \nThanks!", "controversiality": 0, "created_utc": 1377619089, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwbsio", "link_id": "t3_1l656r", "parent_id": "t1_cbw52cz", "retrieved_on": 1429682911, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "avonelle", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm surprised baby-wearing hasn't been mentioned yet. My son loved to be held too! My mom and I sewed a ring sling and I used to wear him everywhere, even while I was doing laundry/washing dishes/whatever.\n\nI agree with the PPs though, too. The key to not driving yourself crazy is to know when you should let shit slide. Baby is your number one priority, not neatly washed and pressed sheets.", "controversiality": 0, "created_utc": 1377619118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwbswc", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429682906, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for your comment. \nIt seems like I need more of a cleaning schedule and to let some things go.\nYour techniques sound pretty helpful! Thanks!", "controversiality": 0, "created_utc": 1377619289, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwbvay", "link_id": "t3_1l656r", "parent_id": "t1_cbw5ly0", "retrieved_on": 1429682875, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! Very helpful! \n\nI definitely think things would be easier with the help from my husband. I've never asked him b/c I think of taking care of the house and baby as my \"job\" and I want him to be able to relax when he comes home, but my job is 24/7! Thanks again. ", "controversiality": 0, "created_utc": 1377619427, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwbx6n", "link_id": "t3_1l656r", "parent_id": "t1_cbw6r1r", "retrieved_on": 1429682851, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "A list would be good...something to work towards. Thanks! ", "controversiality": 0, "created_utc": 1377619475, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwbxu0", "link_id": "t3_1l656r", "parent_id": "t1_cbw88af", "retrieved_on": 1429682843, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the advice! I guess I'm overwhelming myself when I don't need to. Just trying to keep up with everything I guess...\nThe unanimous advice seems to be \"lower your expectations and try and make your tasks easier.\" I will attempt to do that. \nThanks for the luck! I need it! :)", "controversiality": 0, "created_utc": 1377619663, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwc0d4", "link_id": "t3_1l656r", "parent_id": "t1_cbw8cew", "retrieved_on": 1429682810, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "I definitely need to prioritize stuff...\nIt's hard getting help from my husband without complaint but I will try that more. \nThanks so much!", "controversiality": 0, "created_utc": 1377619781, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwc1y9", "link_id": "t3_1l656r", "parent_id": "t1_cbw8myf", "retrieved_on": 1429682789, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "I co-sleep with him, but I would love that cleaning time in the morning before he wakes up to get a fresh start. Unfortunately, since he's in the bed with us, when I wake up he usually wakes up and vice versa. \nI love sleeping with him but it does have its downsides for sure. \nThanks for the advice though! I am going to try and just let some things go to save my sanity! :)", "controversiality": 0, "created_utc": 1377620186, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwc7ix", "link_id": "t3_1l656r", "parent_id": "t1_cbw8rb8", "retrieved_on": 1429682717, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Aa_is_for_Aardvark", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is 17 months and only now am I starting to get shit done.  He's the type of kid who needed to not only be near me 24/7 but required my undivided attention. If I were to even get up and walk across the room for something, he would FREAK. My house was just piles of dishes and mountains of laundry and colonies of dust bunnies. I would get what I could done while he was napping but it was impossible to get it all done. These days he's starting to entertain himself so I find it's a lot easier to tackle the messes. Not that it matters. Once something is nice and neat, it must be destroyed again :)", "controversiality": 0, "created_utc": 1377620493, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwcbqb", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429682662, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; How do you ladies get stuff done in your house? \n\nI don't. =) \n\nSeriously, though, I never worry much about being a super neat freak. I like things clean, but my house looks messy because things aren't picked up. We sweep 2-3 times a week, vacuum once a week, dishes as needed (no dishwasher), we share the laundry room with 4 other people so we have 2 days/week for laundry, and before dinner LD and I do cleanup together. Everything else is on the back burner. \n\nBreakfasts and lunches are easy stuff. Breakfasts are either pancakes, eggs with peppers, potatoes and sausage, or yogurt with cheerios or bread with peanut butter. Lunches are either mac n cheese with chicken nuggets, baked potatoes (with butter, cheese and I mix minced veggies in with hers), or leftovers. Dinner is the meal my SO and I put any real effort into.\n\n&gt; Is it while they are napping mostly?\n\nAt 9 months, yes, if I wasn't also napping. I think that age has the clingy phase. You just have to learn your child's limits. Mine had to be close by, but didn't necessarily need my attention. So I'd set her in her high chair facing me with a few toys while I did some dishes or swept. Now, at 18 months, I can leave her in the living room for 5 minutes while I change laundry.\n\nYou'll figure it out. Don't worry. Just relax and stop trying to be super woman. (besides, you're showing me up. I hope my SO doesn't see this!)", "controversiality": 0, "created_utc": 1377620644, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwcdsq", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429682636, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "This is where I'm at. I get stuff done where I can, and if it doesn't get done, it's not the end of the world. I used to feel really bad about having whole days where I couldn't do anything. Now that I'm in school, my husband is home with our son in the mornings and he's like \"Are you almost home? I can't leave him alone in the living room for more than 2mintues\" It makes me feel a LITTLE better. ", "controversiality": 0, "created_utc": 1377620970, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwciat", "link_id": "t3_1l656r", "parent_id": "t1_cbw4sf2", "retrieved_on": 1429682577, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "He really does need me 100% lately. It's really frustrating. I want to be a good mom but also a good wife. Looks like I'll have to let some things go and give in and ask hubby for help. Thanks!", "controversiality": 0, "created_utc": 1377621209, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwclla", "link_id": "t3_1l656r", "parent_id": "t1_cbw9gqq", "retrieved_on": 1429682535, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "I think a schedule and a routine is really what we need. Thank you! ", "controversiality": 0, "created_utc": 1377621286, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwcmmg", "link_id": "t3_1l656r", "parent_id": "t1_cbwb8tv", "retrieved_on": 1429682521, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "I really need to go through or hit this phase.... O.o", "controversiality": 0, "created_utc": 1377621411, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwcobm", "link_id": "t3_1l656r", "parent_id": "t1_cbw4t4n", "retrieved_on": 1429682499, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "screwthebankiworkfor", "author_flair_css_class": null, "author_flair_text": null, "body": "You guys are partners. You are not a slave and you both deserve breaks, because parenting is a job too and you don't want to start breeding resentment. Does he want a super unhappy wife that is too exhausted to snuggle and/or ready to run away? Probably not! ", "controversiality": 0, "created_utc": 1377623562, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwdi7m", "link_id": "t3_1l656r", "parent_id": "t1_cbwc1y9", "retrieved_on": 1429682112, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "timeforstars", "author_flair_css_class": null, "author_flair_text": null, "body": "At that age I honestly got nothing done other than picking up after us and feeding/entertaining her. I spent so much time out and about because I couldn't take the constant clingy-ness. \n\nThe only way I actually made a dent on the housework was if my SO took her out of the house for a few hours. That only actually happened twice and the first time it was only an hour, by the time I came out of the blissful shock of not having anyone home, they were back and I had achieved nothing. ", "controversiality": 0, "created_utc": 1377624321, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwdt01", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429681972, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dalaim0mma", "author_flair_css_class": "purple", "author_flair_text": "SAHM; 3 gremlins", "body": "I'm a mom of three (11, 4, 1), and your comment just changed my life. The thought of just rinsing and reusing dishes for the day has never occurred to me. Of course, this is a trick for when we don't have company over, but still!\n\nThanks!", "controversiality": 0, "created_utc": 1377624888, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwe142", "link_id": "t3_1l656r", "parent_id": "t1_cbw8cew", "retrieved_on": 1429681867, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish my SO would take the baby once in awhile. Unfortunately the baby is so so clingy and cries after about 15 min without me and my husband claims everytime that he is just hungry and can't do anything b/c he doesn't have boobs!", "controversiality": 0, "created_utc": 1377626534, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbweo12", "link_id": "t3_1l656r", "parent_id": "t1_cbwdt01", "retrieved_on": 1429681570, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Right. Things to change before I resent him. ", "controversiality": 0, "created_utc": 1377626818, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbweryw", "link_id": "t3_1l656r", "parent_id": "t1_cbwdi7m", "retrieved_on": 1429681519, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meltedicecube", "author_flair_css_class": null, "author_flair_text": null, "body": "If I'm honest with myself the house would still be a mess even if we didn't have kids.  I like having the excuse.", "controversiality": 0, "created_utc": 1377627642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwf3rn", "link_id": "t3_1l656r", "parent_id": "t1_cbwciat", "retrieved_on": 1429681366, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ChelloMello", "author_flair_css_class": null, "author_flair_text": null, "body": "You've already gotten a lot of good advice so I won't rehash that stuff. What helped me the most with my Velcro baby was letting him help me do chores. I know it sounds crazy but it really works. Buy him a toy vacuum. Give him one piece of clothing at a time to put in the dryer. Let him hand you silverware from the dishwasher. Take all the breakable and dangerous stuff out of the sink and give him a sponge. I started this with my now 19 month old at about the 9month time frame and even though things take twice as long, they do get done. And yes, you sometimes have to rewash a spoon when they put it in their mouth our throw it on the floor but again, that's better then all of your dishes being dirty. My toddler is demanding my attention - Best of luck!", "controversiality": 0, "created_utc": 1377628687, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwfihi", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429681175, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "timeforstars", "author_flair_css_class": null, "author_flair_text": null, "body": "That line drives me insane! Or if I ask to sleep in one day he brings her back 20 mins later 'I think she's tired again'", "controversiality": 0, "created_utc": 1377630465, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwg7xp", "link_id": "t3_1l656r", "parent_id": "t1_cbweo12", "retrieved_on": 1429680845, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "Oh yeah. :) I'm the same way. I'm a clutter bug. But I like to think it wouldn't be AS crazy if the kids weren't here. ", "controversiality": 0, "created_utc": 1377634538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwhwfw", "link_id": "t3_1l656r", "parent_id": "t1_cbwf3rn", "retrieved_on": 1429679989, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "xoxLove", "author_flair_css_class": null, "author_flair_text": null, "body": "It's harder once they are toddlers! LOL I have an almost 4 year old and a 6 month old. My 6 month old crawls around everywhere, and like your son he puts everything in his mouth so I have to vacuum daily. I usually carry him in my baby carrier or put him in the bouncy while I vacuum. And my 4 year old usually colors or looks at his books. After that we play and I let him crawl around we might all read some books together, then at his nap I go back to cleaning and all that. My almost 4 year old runs around bringing everything I just cleaned up out again. lol... so it's not always easy .. but I make sure every night at their bed times to clean up too. I know it can be tiring it will get better! ", "controversiality": 0, "created_utc": 1377642946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwl5pr", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429678469, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Omg, are we married to the same person?! Lol. In the same boat for sure! Hubbies don't know how good they have it!", "controversiality": 0, "created_utc": 1377643288, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwla6m", "link_id": "t3_1l656r", "parent_id": "t1_cbwg7xp", "retrieved_on": 1429678411, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meltedicecube", "author_flair_css_class": null, "author_flair_text": null, "body": "At least there wouldn't be Legos to step on in the middle of the night.", "controversiality": 0, "created_utc": 1377649773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwnl2l", "link_id": "t3_1l656r", "parent_id": "t1_cbwhwfw", "retrieved_on": 1429677337, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "No...there would be at my house... My husband and I build Star Wars lego figures sometimes. In our old house we had like 5 of the ships built. But when we moved, they got destroyed and with the way they were packed, we couldn't get them back together (because who keeps instructions). ", "controversiality": 0, "created_utc": 1377650163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwnq1o", "link_id": "t3_1l656r", "parent_id": "t1_cbwnl2l", "retrieved_on": 1429677273, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "meltedicecube", "author_flair_css_class": null, "author_flair_text": null, "body": "Can't you download them from somewhere? And I'm sure you're very responsible with those random pieces otherwise ow.", "controversiality": 0, "created_utc": 1377650484, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwnu1n", "link_id": "t3_1l656r", "parent_id": "t1_cbwnq1o", "retrieved_on": 1429677221, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "Oh yeah, they are all packed up and put away. (I admit, the 2yr old finds the random piece, but I think those are from his sisters toys) \nBut we have given up on trying to have stuff like that until the boy is older, just because he's a destructosaurus.  It's the age, and he's like a bull in a china shop. ", "controversiality": 0, "created_utc": 1377650861, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwnyy8", "link_id": "t3_1l656r", "parent_id": "t1_cbwnu1n", "retrieved_on": 1429677157, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the reassurance! :) I'm pretty overwhelmed!", "controversiality": 0, "created_utc": 1377651306, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwo4nr", "link_id": "t3_1l656r", "parent_id": "t1_cbwl5pr", "retrieved_on": 1429677083, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "colesmomma", "author_flair_css_class": null, "author_flair_text": null, "body": "This has helped my 18 month old and me get the house somewhat clean. ", "controversiality": 0, "created_utc": 1377652846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwoo4p", "link_id": "t3_1l656r", "parent_id": "t1_cbwfihi", "retrieved_on": 1429676831, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "phoenixink", "author_flair_css_class": null, "author_flair_text": null, "body": "I love doing laundry in general, but especially diaper laundry! I think it's a combination of satisfaction from cleaning something that's really important for the baby's well-being and daily life, and then the satisfaction of cleaning a bunch of things that are undoubtably very dirty and getting them nice and fresh again.", "controversiality": 0, "created_utc": 1377665464, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwt3ce", "link_id": "t3_1l656r", "parent_id": "t1_cbw9ub8", "retrieved_on": 1429674696, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "that_girl83", "author_flair_css_class": null, "author_flair_text": null, "body": "I have two, with the third on the way. Here's what I do: Clean as you go, don't let messes pile up. Dishes for each meal get done mostly before we even eat it (as I'm cooking). I can clean the bathroom in a few minutes while they are sitting in the tub. Laundry I bring into the living room (where all the toys are) and sit on the floor to fold it. Mopping I do while they are asleep because that's just impossible. Vaccuming I just do, and they follow me around or chase the vacuum cleaner. Also as others have mentioned, I had to lower my exoectations A LOT! I'd rather spend time with them then clean all day. I do what I can and sometimes we wear clothes straight from the dryer for a week. It's no big deal. Also once your son starts walking, it gets a bit easier because he will be off exploring and having fun chasing you. ", "controversiality": 0, "created_utc": 1377698573, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbwytcq", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429671996, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Piggybacking. Husband help is always good. Def dont need to clean ur floor every day. If you can adopt this habit I highly recommend it: empty ur dishwasher in the am. Any dishes u use toss in the counter w a quick rinse. After lo is in bed fill up w the days dishes. Voila mostly clean every day n it took like 15 mins!!Made me life so much easier. Also \"a load a day keeps the chaos at bay\". Fold it while he plays on the floor and try to get it put away. Just one load. That's it. No more. One load a day.  My lo hated being restrained too so we just put away sharp stuff (read as most thing), put up gates and let him b wherever I was. They get bigger and more independent eventually. There is hope! Oh and the crockpot is ur friend! U can put frozen chicken breast a bottle of BBQ sauce turn it on low for 6-8 hrs and bam! Dinner. Make enough to freeze for later. Good luck!", "controversiality": 0, "created_utc": 1377713956, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbx4ez3", "link_id": "t3_1l656r", "parent_id": "t1_cbwc0d4", "retrieved_on": 1429669312, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "And that's why I pumped. Milks in the fridge he took some middle of the night feelings so I could rest an stay sane. Helps a ton!", "controversiality": 0, "created_utc": 1377729886, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbxaagq", "link_id": "t3_1l656r", "parent_id": "t1_cbwla6m", "retrieved_on": 1429666500, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "labbrat", "author_flair_css_class": null, "author_flair_text": null, "body": "On the cleanliness thing - I like to remind myself that a little ingested dust/dirt/fur/etc. is good for training that little immune system. Our ancestors didn't Swiffer the caves every day, after all!", "controversiality": 0, "created_utc": 1377740134, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbxdtca", "link_id": "t3_1l656r", "parent_id": "t1_cbw8cew", "retrieved_on": 1429664855, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeeeah, we might have to start that...\n\nThanks. ", "controversiality": 0, "created_utc": 1377744159, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbxf7hl", "link_id": "t3_1l656r", "parent_id": "t1_cbxaagq", "retrieved_on": 1429664206, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "All good advice! Thank you! :)", "controversiality": 0, "created_utc": 1377744195, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbxf7ya", "link_id": "t3_1l656r", "parent_id": "t1_cbx4ez3", "retrieved_on": 1429664200, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "elleth", "author_flair_css_class": "red", "author_flair_text": "Boy 9/27/12", "body": "Exactly. I pick a \"chore\" daily like laundry or something. Floors and cleaning are for the weekend when husband can help. I'd rather look after my baby than clean. The other stuff can wait. Also, I rarely cook dinner. My husband is the cook!", "controversiality": 0, "created_utc": 1377752820, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbxi0mb", "link_id": "t3_1l656r", "parent_id": "t1_cbw4sf2", "retrieved_on": 1429662823, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": "I know, right? I started today just trying to give him pumped milk and it was a nice break!", "controversiality": 0, "created_utc": 1377896212, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbyms9s", "link_id": "t3_1l656r", "parent_id": "t1_cbxaagq", "retrieved_on": 1429643524, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Yay, happy for you :)", "controversiality": 0, "created_utc": 1377901560, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbyoqul", "link_id": "t3_1l656r", "parent_id": "t1_cbyms9s", "retrieved_on": 1429642537, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "moonfetus", "author_flair_css_class": null, "author_flair_text": null, "body": ":)", "controversiality": 0, "created_utc": 1377923749, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbyvesg", "link_id": "t3_1l656r", "parent_id": "t1_cbyoqul", "retrieved_on": 1429639414, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kinkyrainbow", "author_flair_css_class": null, "author_flair_text": null, "body": "I think the house can wait! Not everything has to be done! One load of laundry a day.. Don't worry about making the bed.. Seriously your just gonna mess it up again. Take care of your baby first, then take care of yourself, make dinner and do one to two chores a day. Having a baby only lasts until they arnt babies anymore, enjoy it while you can.", "controversiality": 0, "created_utc": 1378007250, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cbzey91", "link_id": "t3_1l656r", "parent_id": "t3_1l656r", "retrieved_on": 1429630145, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}