{"submission": {"author": "laughablyginger", "author_created_utc": 1322545091, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_6c0yz", "created_utc": 1379456846, "domain": "ireport.cnn.com", "full_link": "https://www.reddit.com/r/Mommit/comments/1mlpn2/the_unnatural_mom/", "gilded": 0, "id": "1mlpn2", "is_self": false, "media_embed": {}, "mod_reports": [], "num_comments": 75, "over_18": false, "permalink": "/r/Mommit/comments/1mlpn2/the_unnatural_mom/", "retrieved_on": 1411812135, "score": 46, "secure_media_embed": {}, "selftext": "", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "http://d.thumbs.redditmedia.com/AhNWsI3b5q0GecUE.jpg", "title": "The Unnatural Mom.", "url": "http://ireport.cnn.com/docs/DOC-1033811?hpt=hp_t3", "user_reports": []}, "comments": [{"archived": true, "author": "TaraTLC", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. I really liked this read. I'm currently 25 weeks pregnant and I'm of the \"you should do whatever makes you happy\" camp when it comes to being pregnant and delivering a baby. \n\nFor my first pregnancy/birth I was a planner. Oh.... I had plans. But those plans were eventually demolished.\n\nNow? I'm a non planner. My birth plan for this baby? I'm going to eventually have a baby. How that happens will depend on what happens. I won't make plans in advance. I'm going to totally wing it. Me? I'm just completely looking forward to delivering a baby that doesn't require life support for months. I'm so excited.\n\nI read this article and I felt so bad for this mom. I sometimes wonder what it would have been like if my daughter hadn't been so sick. Would I have felt guilty? Heck... I felt so guilty when she was horridly sick because I just couldn't produce breast milk. All of the consultants I talked to told me that if I just tried hard enough, I would make milk. LOL. For me... thinking back, the \"natural parenting\" method is just so completely nothing I could have ever ever done. My first year of parenting was all hospitals, surgeries, ventilators and feeding tubes. Nothing about my parenting experience was \"natural\" but that doesn't mean I was more or less of a parent than anyone else.\n\nFor this baby? I feel like it will be so simple (but who knows?). My plan for being a parent involves caring for and loving my child.... what type of diapers I choose, whether I breast or formula feed, what type of laundry detergent I use is all moot. Completely moot. ", "controversiality": 0, "created_utc": 1379460577, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaffcr", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429428077, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a \"natural\" birth with my first. It was overrated. People need to get over themselves. If that's the choice they make - to have a painkiller-free birth in a tub of their own fluids - that's fine, but it doesn't make them stronger, braver, tougher, or better than moms who choose/wind up having different births. What matters is that you and your baby are okay.\n\nAlso, all birth is natural! There's nothing more natural than giving birth, and there's also nothing more natural than wanting to escape the pain either. ", "controversiality": 0, "created_utc": 1379461178, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccafm7f", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427987, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing this. I felt horrible guilt when everything didn't work out the \"natural\" way. The first few days I was a wreck feeling like I failed as a mother already. Everyone should read this before their baby is born and maybe it would spare some people some heart ache.", "controversiality": 0, "created_utc": 1379461193, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccafmdg", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427985, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an unplanned c-section in June too! I don't feel guilty about the c-section (bummed, yes, but it's *her* that decided to kick her sack open while breech, the stinker!) but I do feel pretty down over supplementing with formula. And disappointed I couldn't con my husband into cloth diapers. But mostly because I'm cheap.", "controversiality": 0, "created_utc": 1379461589, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccafqwm", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427926, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaGrr", "author_flair_css_class": "purple", "author_flair_text": "Daughter 7, Son 5", "body": "I just don't get why it has to be a competition, so what if you're natural or not.  I do some things very natural, and other things not even close.  Honestly I don't care if someone had a c/s or a drug-free at home birth.. you both made it out okay? That's all that matters.  People get way to worked up with comparisions.", "controversiality": 0, "created_utc": 1379462135, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccafx0i", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427847, "score": 27, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "I love this. I have had so many friends who have felt like failures because they couldn't breast feed, or 'gave in' to having an epidural (and have been berated..because you know, people suck) and on and on. \n\nI agree with /u/taraTLC. You need to do what makes YOU happy with your birth/mothering things. Whether you are the kind of person who is more comfortable with everything being planned out (babies don't always care about your plans when they are coming out), or someone who insists that everything you feed your child is organic. I don't think it means that person is a better parent. \n\nMy daughter, I was 19 and terrified. Her father was in Afghanistan and was supposed to be back before she was born (Mid-September). She decided that she was impatient and wanted out at the end of July and spent 2wks in the NICU. She actually got out of the hospital the day before her dad came home. \n\nMy son, I thought I had it all planned out. I was going to have an epidural, because I am admittedly a huge wuss about anticipating pain. Then my Doc told me that I could be induced around my due date. I decided I wanted to be induced, and my son was supposed to be born on my sisters birthday. The night before we were going to go to the hospital, I took a shower with my daughter and shaved my legs (woo 40wks and shaving my own legs!) My mother came up to stay with my daughter during the day. My mom had been at the house about 15min, and my daughter was in bed....and my water broke. I apparently had been in labor ALL damn day and had no pain. 20 min after my water broke, with no epidural and crowning on the way to the hospital, my son was born. Didn't even get fully checked in because the nurse went to check how far I was dilated and called for towels because she had to catch him. Yeah. Babies don't come according to any plan but their own. \n(Sorry...I digressed)\n\nIt just really aggitates me when one mom passes judgement on another because she does something they didn't do with their snowflake. So she had an epidural, so she uses formula, as long as that child is healthy, loved and not being abused, it is not anybodies business. ", "controversiality": 0, "created_utc": 1379462303, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccafyxy", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427823, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "Happy moms make for happy families.", "controversiality": 0, "created_utc": 1379464147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccagj2w", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427561, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i don't see anything \"natural\" about laying on a table full of anesthesia while a surgeon cuts my child out of my abdomen. isn't that the point of this article? quit trying to rope wholly artificial things into the \"natural\" camp just to be able to say you did it \"naturally\" and just own the truth - formula is unnatural. epidurals are unnatural. cesareans are unnatural. some of us do things the unnatural way, because it's the way we need to do them. it's okay to be \"unnatural.\"", "controversiality": 0, "created_utc": 1379465670, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccagzvo", "link_id": "t3_1mlpn2", "parent_id": "t1_ccafm7f", "retrieved_on": 1429427273, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "OcelotCircus", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't want to wash cloth diapers or make dish detergent? Cool. Don't. I have been living such a lifestyle for years before having a baby and not once had I ever met anyone else who would even consider making dish detergent until I became a mom. Suddenly if you're not making pinterest recipes you're deliberately poisoning everyone. Fuck it. I refuse to be around these judgmental asshats, and I forgot they exist until I read this article. These fads will fade and people will return to their old habits and favorite brands. \"The best\" will forever change, and what youre doing for your baby now will be the blueprint of what not to do 30 years from now. I think it's bullshit that those who successfully make the sacrifices to have those natural, unmedicated births and breastfeed for 12+ months aren't allowed to be proud of themselves because it makes you feel bad. Grow up. They earned those badges of honor, and you'll earn your own on this wonderful motherhood experience. People care too much about what other people are doing.  All birth is natural, and you do whatever works for you and your family.", "controversiality": 0, "created_utc": 1379465747, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccah0q6", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427262, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I relate to the article because even though I had a drug free birth and breastfed into toddlerhood and wore my babies and used cloth diapers, I realized pretty quickly that the 'attachment parenting ideal' was setting me up to fail. Of course I was going to be unable to get anything done if I tried to hold the baby all day. And when I started going insane from sleep deprivation I waited months until I nearly killed myself from wandering out into traffic from misinterpreting traffic signals in a sleepy haze to do CIO. I will do CIO much sooner with future children and I won't feel bad.\n\nI find the formula/ breastfeeding debate insane because by the time they are toddlers we mostly all feed them granola bars and cookies and juice boxes at least once in a while. It's the rare 2 year old who is gulping down kombucha while nibbling on solely crackers made from sprouted grains and eating organic everything. \n\nAnd I wash my cloth diapers with tide. there. I said it :p\n\nI swore I would always be loving and responsive but sometimes I holler at my kids to stop fighting this very instant or I'm putting you all in a box and mailing you to grandma.\n\nFWIW I find the polarizing attitudes much more prevalent online. IRL, in my own experience anyways most moms understand that things don't always go according to plan and no one judges anyone else on how they gave birth or what their baby eats.\n\nI also found that I was far more blindsided by my lack of instant bonding than anything else. I feel as though the mom in this article was in some ways luckier than I was. She had a csection but still fell head over heels in no time flat. I spent a few weeks staring at my newborn, feeling like I'd stolen him, and waiting for the fireworks and violins that everyone told me would happen when I first laid eyes on him. (it happened, but it took time.) I felt unnatural because what kind of mother looks at their screaming baby and wants to give them back? what kind of mother sometimes wishes she hadn't had a baby so she could just get some sleep? What kind of mother worries that she will accidentally get the baby and the garbage mixed up and throws the wrong one down the chute (I had some postpartum anxiety). Anyways it all resolved itself in time. But I felt lonely in my new parenthood and unnatural for those reasons. I worried I'd never get the hang of things. I did. But I felt so ashamed of these feelings that I never voiced them to anyone because motherhood and all the things surrounding new motherhood are held up on such a pedestal in our society. we need to bring it back down to earth.", "controversiality": 0, "created_utc": 1379465754, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccah0st", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427261, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsAnthropy", "author_flair_css_class": "green", "author_flair_text": "Two girls, 1.5 and 5.5", "body": "This reminds of the latest parenting method: [CTFD](http://www.thedaddycomplex.com/post/55268573331/latest-parenting-trend-the-ctfd-method).\n\nI don't know what it's like to be a person who's seriously subscribed to much of any philosophy. Pregnant? Don't smoke, don't drink. But, sure, I'll have a little coffee. Going into labor? I'd *like* to avoid a c-section, but let's do whatever's necessary to get a healthy baby out. Breastfeeding? Okay, sure. It's best for the baby. Breastfeeding not going well? Let's try something else. Except, in that situation, I wasn't that calm.\n\nI admit I suffered A LOT of guilt the first time around when, for three weeks, I didn't get any sleep. She was clusterfeeding. It wasn't coming out on one side. I was *so* committed to breastfeeding that every little ache or pain or cry from her made me feel like I was losing at being a proper mother. The second time around, I already had formula on-hand at the house. I hadn't decided for certain if I was even going to try to breastfeed. I know this isn't a popular idea, but it's what I did.\n\nAnd guess what? That weight, the pressure to EBF, that feeling that I just HAD to do it, was gone. And I was able to nurse my baby. I enjoyed it. I was relaxed about it. She latched on. We had tender moments together in the mornings when everyone else was still sleeping and I could feed her without feeling angry or resentful. Because I knew there were other options, just in case.\n\nI think if we can try not to build up all of these ideas about how we *have* to perform as superparents, we might just have a slightly easier time getting through the truly challenging stuff. \n\nI don't know if this hardcore parenting-philosophy stuff has been going on for a while or if it's just recently that people have (as it seems to me, anyway) *obsessed* over how they classify themselves. I just know that it seems as though, the more pressure we put on ourselves to fit into all these specifics with all these rules and regulations, the worse we feel when one of those things doesn't really fit. ", "controversiality": 0, "created_utc": 1379466402, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccah7uj", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427170, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ninzga", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your honesty.  I had a difficult time bonding with my firstborn and felt like a horrible mother for not even wanting to touch her.  You're right, the bonding happens, but at different times for different moms.  Now I cannot even begin to imagine a day without my kids.", "controversiality": 0, "created_utc": 1379466571, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccah9oj", "link_id": "t3_1mlpn2", "parent_id": "t1_ccah0st", "retrieved_on": 1429427145, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsAnthropy", "author_flair_css_class": "green", "author_flair_text": "Two girls, 1.5 and 5.5", "body": "So did I! Mine was on her cord and they couldn't shift her. Plus, I labored for many hours with no progress, so they put me on Pitocin and her heart rate would drop whenever they raised it. Glad you all got through it!", "controversiality": 0, "created_utc": 1379466622, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaha96", "link_id": "t3_1mlpn2", "parent_id": "t1_ccafqwm", "retrieved_on": 1429427139, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1379467284, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccahhn3", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429427043, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "twitty310", "author_flair_css_class": null, "author_flair_text": null, "body": "I have to say, I agree. I think the \"natural\" and \"unnatural\" thing is blown up by bloggers looking for traffic. If you're a mother with a happy kid, be happy too. No one should be rude to other parents who do things differently. ", "controversiality": 0, "created_utc": 1379467767, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccahmzg", "link_id": "t3_1mlpn2", "parent_id": "t1_ccah0q6", "retrieved_on": 1429426974, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alpacathecamel", "author_flair_css_class": null, "author_flair_text": null, "body": "As a mom who did a home birth, breastfed till age 3.5, and other stuff like that I feel a need to say a little something.  I do advocate for natural birth and breastfeeding.  Not because I think anyone who does otherwise is a bad parent, but because I think research shows that those are best for babies and moms when possible.  I don't look down on moms who don't do them.  Every family needs to do what is best for the family, not just the baby, not just the mom.  And different people balance it differently.  \n\nThe thing I do get angry about is that our systems make it so damn hard and miserable to have a natural birth.  Once this mom said she had the induction (I certainly don't have enough info to make any judgement on that decision) I figured it was really unlikely she could do it naturally, pitocin makes that nearly impossible, so the avalanche of interventions begins - resulting in c-section, trouble breastfeeding, and all.  It isn't because she wasn't tough enough.  It isn't because she doesn't care about her baby.  Maybe that is just the way things had to go down for her and there wasn't really any avoiding it.  I don't know.  But I truly believe that our hospitals and our doctors suck at helping people have uncomplicated births.  Nearly every friend I have who has had a hospital birth was induced, most for no medical reason that I could ever determine.  And I hear the same stories over and over of the snowball of interventions.  This is not moms' faults.  I really believe our hospitals are failing us.  And most moms think that that is just the way it is and they have to deal with it.  And some don't really have any other choices.  Same story for breastfeeding mostly.  Hospitals and society do not set us up to be successful.  It isn't easy, it doesn't always come naturally, and a lot of what happens during labor and delivery and early postpartum can set us up for failure. \n\nI just wanted to put in my two cents.  I don't get angry at other moms, or judge them.  Again, everyone needs to make the best decisions they can for their family, and don't know anyone's story but my own.  I get angry at the system for giving us crappy care and telling us that is the way it has to be.  ", "controversiality": 0, "created_utc": 1379472520, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaj6cu", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429426256, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "Technically none of it is \"unnatural\". It is natural for humans to use their brains and the tools around them to keep themselves alive. We've been doing it since we first crawled out of the cave into the sunlight, and our tools keep improving. I don't know why we get it into our heads that the only way things can be 'natural' is if they are primitive and simplistic. The natural order of things is progress, the evolution of society and medicine and technology. Being able to perform caesareans to save mom and baby is natural for us now, because it came about as a result of the normal evolution and progression of society.", "controversiality": 0, "created_utc": 1379474091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccajo76", "link_id": "t3_1mlpn2", "parent_id": "t1_ccagzvo", "retrieved_on": 1429426025, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "Natural birth extremist here. I give zero fucks what other people do with their bodies. But, statistics matter to me because I worry about my own future options. The more people have c-sections, the less confident I feel that I will be able to have a birth that is not a medical event. In the last year almost every celebrity birth has been a c-section or induced etc. SO I'm worried they wont even have the INFRASTRUCTURE when I give birth. We already know the economics don't support births that are not medical events. Culture, too?", "controversiality": 0, "created_utc": 1379474681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccajuzv", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429425937, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Perhaps it would have worked out better for her if she just stuck out the pregnancy a little longer (we all have swelling!). Pitocen induced labors are horrible as far as I have heard. Most can't do it without drugs.", "controversiality": 0, "created_utc": 1379474985, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccajyd5", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429425893, "score": -7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "whyunogivemegoodname", "author_flair_css_class": null, "author_flair_text": null, "body": "This. I hate that parenting has become some sort of weird game to some people and the rules are that you have to be the definition of perfection. I have never in my life experienced anything as brutal as some of the outbursts and remarks from mothers that are so sure their way is the only way to parent. Being a mother is the hardest job on the planet because you are 100% emotionally, financially, intellectually invested and everyone and their brother will try to tell you you're screwing up. You have to do it your way. My perspective is as long as you parent with your child's best interest in mind you are doing a damn good job.", "controversiality": 0, "created_utc": 1379476302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccakcro", "link_id": "t3_1mlpn2", "parent_id": "t1_ccafx0i", "retrieved_on": 1429425706, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ksandifer138", "author_flair_css_class": "blue", "author_flair_text": "6 year old girl 2 year old boy", "body": "I agree so much with everything you just said. \nI had to be induced, but I did the drug free labor thing. The biggest thing for not getting an epidural was so I would still be able to walk around, squat, bend over the bed and have my back rubbed etc. \nNOPE. That bed was a prison. I wasn't allowed to get out of it. I lied SO many times saying I had to go to the bathroom just so I could get out of that damn bed and make myself comfortable. My hospital sucked so bad. ", "controversiality": 0, "created_utc": 1379477698, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccakqst", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaj6cu", "retrieved_on": 1429425524, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anonynomnom9", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for a different opinion and saying everything I wanted to say. I honestly DON'T think it's as simple as saying \"Do what's right for you, ladies!\" Or \"Happy moms make happy families\". What makes me happy is not having chapped nipples bleeding all over and sleeping 10hrs a night. That, however, would not have been best for my newborn. There is a balance! Research shows that breast feeding is best - so I tried my hardest to do that and it worked great for both my kids. Research says that responding to your newborns needs are important - so unfortunately I wasn't getting those coveted hours of sleep for a long while. \n\nIt's not about just making mom happy - parenting is personal sacrifice. But it's also not ONLY making baby happy. Balance!\n\nI think anyone who has taken the time and effort to educate themselves (about birthing, about newborns, about parenting) and then made an informed decision for their family and personal circumstances deserves respect. To me, neither taking the easy way out (lazy parenting that puts moms needs first) OR dogmatic parenting that harshly judges others and recognizes no gray area, deserves no respect. ", "controversiality": 0, "created_utc": 1379477783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccakrlc", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaj6cu", "retrieved_on": 1429425514, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mynameisluca", "author_flair_css_class": null, "author_flair_text": null, "body": "So have you ever even given birth?", "controversiality": 0, "created_utc": 1379478300, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccakwes", "link_id": "t3_1mlpn2", "parent_id": "t1_ccajuzv", "retrieved_on": 1429425451, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "nope, that's why it matters. I will literally refuse to have children if it means cutting me open. Lately that seems more and more like a certainty.", "controversiality": 0, "created_utc": 1379484194, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccam9uy", "link_id": "t3_1mlpn2", "parent_id": "t1_ccakwes", "retrieved_on": 1429424811, "score": -12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mynameisluca", "author_flair_css_class": null, "author_flair_text": null, "body": "My first baby was born at 35 weeks but with no intervention and no epidural. My second baby was born by emergency csection at 34 weeks because I had full blown eclampsia and HELLP. My baby and I most likely would have died were it not for an emergency csection. You do realize that there are life or death situations and the only way you or baby will survive is a csection right? Please tell me you would choose a csection over your death or your babies death?", "controversiality": 0, "created_utc": 1379485071, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccamfsj", "link_id": "t3_1mlpn2", "parent_id": "t1_ccam9uy", "retrieved_on": 1429424734, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "That's a totally different situation. I'm talking about the statistics before I choose to have a child, not how I would handle a birth that became a medical event for me.", "controversiality": 0, "created_utc": 1379487359, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccamu2h", "link_id": "t3_1mlpn2", "parent_id": "t1_ccamfsj", "retrieved_on": 1429424549, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Totally the way to go. The only real natural method of parenting/birthing is figuring out what is best for baby. Fads will come and go (seriously. By the time baby is having a baby all the rage will be having babies in zero gravity on a bed of organic,  free-range eggs ;)). ", "controversiality": 0, "created_utc": 1379487360, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccamu2p", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaffcr", "retrieved_on": 1429424549, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PinkleopardPJ", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, you say you give zero fucks about what others do with their births, yet you go on to say how horrible it is that other people having csections brings up the statistics of having a csection. If you really don't care, you'll do whatever you think is the \"right way\" to give birth regardless of statistics.\nSecond, when you give birth, you have the right to do it your way as much as possible. If you want to give birth in a tub at home with the assistance of a midwife, that's cool. If that doesn't work out, for whatever reason, that's ok too. The birth of your child is an amazing experience no matter how it happens, but in the long run its not important HOW they got here, it's important that both you and your baby are safe. ", "controversiality": 0, "created_utc": 1379487944, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccamxb6", "link_id": "t3_1mlpn2", "parent_id": "t1_ccajuzv", "retrieved_on": 1429424507, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "\"it's not important how they got here\" that's just, like, your opinion man. I'm afraid i disagree.", "controversiality": 0, "created_utc": 1379488524, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccan08g", "link_id": "t3_1mlpn2", "parent_id": "t1_ccamxb6", "retrieved_on": 1429424469, "score": -8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I think people are so defensive about their c sections, that they can't admit that it is usually better for mom and baby to deliver natural. Labor isn't so terrible if you have freedom. It is so hard to find anyonw supportive of a normal natural birth, because the midical community got used to doing things their way. Pitocen, as the other of the article was on, can and does cause horribly painful and long contractions. Natural labor (without pit) is incredibly different to labor with labor enhancing drugs in the mix. If you really want to avoid a c section, avoid the hospital for your birth. Home births have very low transfer for c section rates.", "controversiality": 0, "created_utc": 1379488825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccan211", "link_id": "t3_1mlpn2", "parent_id": "t1_ccajuzv", "retrieved_on": 1429424446, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a controlling midwife at my home birth. I also lied a lot about having to pee so I could get out of bed. If I'M not in bed in the first place, it's because I don't want to be. The worst part was that I thought we were on the same page. I thought she was going to leave me alone to do what I wanted in labor. I am filled with rage whenever I think of her. Labor wasn't so bad. My body did well. She was awful. I even had travel an hour to go to a midwife, only to get a medwife.", "controversiality": 0, "created_utc": 1379489086, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccan3l7", "link_id": "t3_1mlpn2", "parent_id": "t1_ccakqst", "retrieved_on": 1429424426, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PinkleopardPJ", "author_flair_css_class": null, "author_flair_text": null, "body": "And that's fine. In that case, if you ever decide to have children, do your research and find a midwife who's willing to assist you in whatever kind of birth you want. Learn ways to cope with the pain and discomfort of labor and delivery. Have a partner who's willing to help you. ", "controversiality": 0, "created_utc": 1379489197, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccan47y", "link_id": "t3_1mlpn2", "parent_id": "t1_ccan08g", "retrieved_on": 1429424416, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "thanks! I fully plan to! As my mother did before me :)", "controversiality": 0, "created_utc": 1379489387, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccan57s", "link_id": "t3_1mlpn2", "parent_id": "t1_ccan47y", "retrieved_on": 1429424404, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "andarial", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, this could have been written for me! I was overdue, induced, had an epidural, an unplanned c-section and couldn't breastfeed.\n\nNot one thing fit my birth plan. \n\nI also felt like a failure for all those reasons which, piled on top of no sleep and extra hormones, was just terrible. \n\nI firmly believe I enjoyed my son's infancy less because of all of the perceived pressures and judgements from others.  \n\nNow my son is almost 3 and I enjoy (almost) every minute I get to spend with him. \n\nHaving lived well past that time of my life, I can look back and wish I could have just relaxed more and not give a crap about what other people were thinking. ", "controversiality": 0, "created_utc": 1379499917, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaocqe", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429423803, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JanetSnakehole24", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm confused here. Do you think simply because some celebrities you've read about are getting c-sections and inductions that doctors will soon take away the choice of just having the baby when it's ready? If not, I'm not sure what you mean by refusing to have children if it means getting cut open. There are no certainties in pregnancy. You have no idea going in that first time whether you will have a vaginal, non-induced birth. You can't make that call beforehand.", "controversiality": 0, "created_utc": 1379501710, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaok7b", "link_id": "t3_1mlpn2", "parent_id": "t1_ccamu2h", "retrieved_on": 1429423707, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; i don't see anything \"natural\" about laying on a table full of anesthesia while a surgeon cuts my child out of my abdomen. isn't that the point of this article? quit trying to rope wholly artificial things into the \"natural\" camp just to be able to say you did it \"naturally\" and just own the truth - formula is unnatural. epidurals are unnatural. cesareans are unnatural.\n\nWell said!!!!", "controversiality": 0, "created_utc": 1379506659, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccapbew", "link_id": "t3_1mlpn2", "parent_id": "t1_ccagzvo", "retrieved_on": 1429423354, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "THANK YOU for this awesome response!!!!! :) :) :)", "controversiality": 0, "created_utc": 1379506872, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccapcw0", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaj6cu", "retrieved_on": 1429423335, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "It's also very important \"how they got here\". Hundreds of thousands of women who have \"ended up with\" a type of birth they didn't choose are now in therapy, have PPD, chronic depression years later, intense guilt and shame because they failed THEMSELVES and their own desires, have issues bonding with their baby because of the birth manner, etc.\n\nIt VERY, VERY much matters how the baby got here. Please don't discount that for those who live with these demons every day. And no, it's not because of some standard that someone else has decided we needed to live up to, of having a drug-free birth. For me, it was because drug-free what what *I* chose; what *I* wanted for myself and my baby. Not because some natural-birth-junkie told me to do this with my life.", "controversiality": 0, "created_utc": 1379507666, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccapii4", "link_id": "t3_1mlpn2", "parent_id": "t1_ccamxb6", "retrieved_on": 1429423262, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for disagreeing. I disagree right along with you. :) See my post above...I also believe it VERY much matters \"how the baby got here\". Thanks for being a voice for others!", "controversiality": 0, "created_utc": 1379507730, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccapiyq", "link_id": "t3_1mlpn2", "parent_id": "t1_ccan08g", "retrieved_on": 1429423256, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ShannonOh", "author_flair_css_class": null, "author_flair_text": null, "body": "Fuck natural. Go with evidence. Advocacy for midwifery, low-intervention birth, and Breastfeeding often feels dogmatic. Since these are messages firmly based in medical evidence but run counter to standard maternity and postpartum care, they need to be aggressive.\n\nThe problem is that the better the message gets across, the more we will feel guilt when we can't follow it. And it's really hard to navigate a system like OB care in the US and be confidence that ones interventions were necessary versus iatrogenic (problems caused by the care itself). \n\nI am a midwifery-, Breastfeeding-, Babywearing-, clothdiapering-, fully vaccinating-loving parent, and I really HATE the \"natural\" moniker my choices seem to attract.\n\n", "controversiality": 0, "created_utc": 1379511175, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaqbiz", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429422886, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "trees_make_me_happy", "author_flair_css_class": "maroon", "author_flair_text": "Mommit User Flair", "body": "I wish I could give you more than one upvote.", "controversiality": 0, "created_utc": 1379513454, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaqys1", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaj6cu", "retrieved_on": 1429422514, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "Actually you can know the likelihood of having a birth that is not a medical event. For instance, we know that in ten years surgical birth went from 1/6 births to 1/3. which is definitely a change in the odds (http://www.cdc.gov/nchs/data/databriefs/db35.htm). It is simply much less likely these days that my birth will not be a medical event.", "controversiality": 0, "created_utc": 1379518120, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccashu4", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaok7b", "retrieved_on": 1429421801, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "I planned on having an epidural but ended up going natural because of how fast things went (and I was suddenly scared of the needle).  But never once has it ever occurred to me that I was any better than anyone else.  ", "controversiality": 0, "created_utc": 1379518203, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccasiwl", "link_id": "t3_1mlpn2", "parent_id": "t3_1mlpn2", "retrieved_on": 1429421786, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "The independent birthing center I was born in has been shut down, as well as two other birthing centers that were affiliated with hospitals in the area where I grew up. It makes me nervous. There's now only one left and it's very hard to get to.", "controversiality": 0, "created_utc": 1379518722, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccaspk7", "link_id": "t3_1mlpn2", "parent_id": "t1_ccan211", "retrieved_on": 1429421700, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "a1icey", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess this thread doesn't want to understand where us nonmedical birth nutters are coming from. it's a shame.", "controversiality": 0, "created_utc": 1379518806, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccasqma", "link_id": "t3_1mlpn2", "parent_id": "t1_ccapiyq", "retrieved_on": 1429421686, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "asymptotex", "author_flair_css_class": null, "author_flair_text": null, "body": "Home births also have significantly higher intrapartum mortality rates. \n\nI had a completely drug free water birth with my first pregnancy, and an emergency c-section with my second. In the last three weeks of my pregnancy with my second, I had a terrible feeling that something was going to go wrong - I ditched my home birth plan, let go of my midwives and found an OB at a local hospital. After an emergency c-section my son was found to have a congenital heart defect. Had he been born at home he would not have survived. I am so grateful that my instincts led me to change my mind at the last minute, and horrified at how close I came to choosing an option that would have resulted in my son's death. \n\nMy first delivery was wonderful and spiritual and holistic. But my second was high intervention and saved my son's life. I am grateful that I had both, but have completely changed my mind about the safety of home births. I certainly could have had the same intervention free vaginal delivery in a hospital with my first. There is no reason why I should have chosen my personal preference over the safety of my child. ", "controversiality": 0, "created_utc": 1379520177, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccat8au", "link_id": "t3_1mlpn2", "parent_id": "t1_ccan211", "retrieved_on": 1429421457, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JanetSnakehole24", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not denying the numbers rose, but sometimes you can't take those numbers at face value as there are contributing factors to the rise. One is that more mothers CHOSE the c section. I've known women that wanted their baby born on a certain day so they chose a c section, or didn't want to \"destroy their body\", or wanted to be induced a certain day because it would be more convenient, and inductions tend to lead to more c sections. \n\nThen there are doctors who just want more likely to perform C-sections. It is up to each mother to decide whether not they want to go with the doctor who is pro early induction or one who is going to wait past the due date if there is no medical reason not to. I specifically chose my doctor because she was going to wait until my son was ready to be born and not induce early. There are more choices if you choose to do research. ", "controversiality": 0, "created_utc": 1379528677, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccawd39", "link_id": "t3_1mlpn2", "parent_id": "t1_ccashu4", "retrieved_on": 1429419995, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "by that logic, nothing in the entire universe is unnatural and the word loses all meaning. it's not about what is \"primitive and simplistic,\" it's about what is organic. you may think it \"natural\" for humans to use their brains and tools to invent the pacemaker, but that doesn't make the pacemaker a natural device. the natural way to give birth is vaginally and unmedicated - we devised epidurals and cesareans for situations when the natural way wouldn't work. there's nothing wrong with taking advantage of medical technology, but that's exactly what it is: TECHNOLOGY, not nature.", "controversiality": 0, "created_utc": 1379530158, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccawx8i", "link_id": "t3_1mlpn2", "parent_id": "t1_ccajo76", "retrieved_on": 1429419734, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "Maybe they feel like they failed because of all this ridiculous pressure to give birth a certain way.", "controversiality": 0, "created_utc": 1379534850, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccayq0l", "link_id": "t3_1mlpn2", "parent_id": "t1_ccapii4", "retrieved_on": 1429418824, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Surely_Jackson", "author_flair_css_class": null, "author_flair_text": null, "body": "I was surprised to learn that it IS a competition.\n\n\"...then we find ourselves divided again in the breastfeeding versus formula war, yes war.\"\n\nNo. No war. There is no war. There is you feeling insecure, and a bunch of other people minding their own business. I can't speak for all breastfeeding moms, but I personally have zero mental bandwidth to devote to caring what you feed your kid.", "controversiality": 0, "created_utc": 1379538388, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb016j", "link_id": "t3_1mlpn2", "parent_id": "t1_ccafx0i", "retrieved_on": 1429418212, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1379538631, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb04az", "link_id": "t3_1mlpn2", "parent_id": "t1_ccam9uy", "retrieved_on": 1429418172, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alpacathecamel", "author_flair_css_class": null, "author_flair_text": null, "body": "Painkiller free birth is healthier for babies.  Less likely to lead to complications for baby and mom.  That is a good thing, and scientifically measurable.  Saying it is just another choice and all that matters is that you are okay is similar to saying that wearing seatbelts or not is just another choice and all that matters is that you are okay.  It makes you less likely to be okay.  Does it always work?  No.  Do hospitals make it easy or pleasant?  Absolutely not.  Like I said it my main response to the article -  I am angry at the hospitals and doctors and the system that makes it so damn hard and unpleasant to have a drug free birth, not at the moms.  ", "controversiality": 0, "created_utc": 1379559843, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb76wv", "link_id": "t3_1mlpn2", "parent_id": "t1_ccafm7f", "retrieved_on": 1429414834, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my natural birth in a birthing clinic. I was allowed to get up and walk around and to labour in whatever position I needed. There was a beautiful deep bathtub that I floated in for a few hours until labour intensified too much. My doctor was more like a midwife - she informed me early in pregnancy that she does not perform epidurals or episiotomies because they aren't needed. I prepared for the birth for months, and I had all the support I could need or want during labour. It was still damn hard and unpleasant. It isn't just \"the system\" that makes labour painful and strenuous...it's a physically demanding task, and even in third-world countries where drugs aren't really available or expected women still find it terribly painful. It's just the nature of the beast.\n\nAlthough there is clearly a big problem when hospitals have a 1 in 3 rate for c-sections!! That's screwed up.", "controversiality": 0, "created_utc": 1379560814, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb7i1u", "link_id": "t3_1mlpn2", "parent_id": "t1_ccb76wv", "retrieved_on": 1429414690, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "unfortunately, \"a bunch of other people\" *don't* mind their own business. they see you popping a bottle in your baby's mouth, without even knowing what's in it, and start lecturing you on how \"breast is best.\" or you're nursing your kid and some twatwaffle comes up and goes off on you about how gross it is and it's sexual abuse and junk. the moms who feel insecure feel that way because of all the other asshats judging and giving them a hard time on both sides of the fence.", "controversiality": 0, "created_utc": 1379561559, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb7qh3", "link_id": "t3_1mlpn2", "parent_id": "t1_ccb016j", "retrieved_on": 1429414581, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i sure wish i knew why \"EVERYTHING is natural!\" is getting upvoted and \"no, steel and concrete and synthetic drugs are not natural, and that's okay\" is getting downvoted. ", "controversiality": 0, "created_utc": 1379561707, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb7s5c", "link_id": "t3_1mlpn2", "parent_id": "t1_ccapbew", "retrieved_on": 1429414559, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Surely_Jackson", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm out and about with my son every day- I guess I've been unusually lucky to not feel assaulted from all sides at every turn. I know everyone has that one person in their life who nags them, or, like my cousin's husband, cracks ridiculous nervous jokes at the sight of my breast and has to be told to grow up. But come on- \"war\"? Kinda dramatic.", "controversiality": 0, "created_utc": 1379563843, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccb8eyj", "link_id": "t3_1mlpn2", "parent_id": "t1_ccb7qh3", "retrieved_on": 1429414263, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "phoenixink", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Hundreds of thousands of women who have \"ended up with\" a type of birth they didn't choose are now in therapy\n\nI can't help but think that there is way too much pressure for them to have a specific type of birth, and that's why it's so stressful when it doesn't end up that way. I am totally not trying to sound high and mighty but I am really glad that I didn't 'choose' a specific type of birth. I just waited to go into labor, went into the hospital, and when the pain ended up being more than I anticipated, I got the epidural. It was an extremely relaxed experience for me, I think because I didn't go into it with a page of expectations and rules about what should happen. It just unfolded on its own.\n\nThere's just so much pressure on women to have a specific type of birth, making up multi-page birth plans, planning everything for months, that when it doesn't go as they expected, that's months of planning and expectations \"gone awry\"\n", "controversiality": 0, "created_utc": 1379575506, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbat6z", "link_id": "t3_1mlpn2", "parent_id": "t1_ccapii4", "retrieved_on": 1429413146, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not about pressure being put on women to birth a certain way.\n\nIt's about the women WANTING something for their lives and their families, and oftentimes having that forced away from them simply because the medical practitioner was going on vacation the next day. (Yep...that would be my medwife.)\n\nIf a woman is \"making up multi-page birth plans, planning everything for months\"...don't you think they WANT things to go a certain way, for THEMSELVES and their families? There's no one holding a gun to their heads telling them they \"must\" birth drug-free or with a birth plan.\n\nI see your point, but you're off the mark.", "controversiality": 0, "created_utc": 1379590256, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbcibh", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbat6z", "retrieved_on": 1429412354, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "Because people don't know what truly \"natural\" even IS. A lot of people confuse \"going natural\" means having a vaginal delivery...when in reality, \"natural\" birth means drug-free. Miseducation at play again when people don't do their research.\n\n\"Everything\" is NOT natural. When you let nature take it's course, and listen to your body, and give birth with the mentality that our ancestors had (which did not include drugs)...THEN you're thinking naturally and will more than likely deliver as such. You're right...having epidurals and pitocin and c-sections are NOTTTTTTT natural by any means.\n\nOccasionally they have their place...but generally, women these days have been indoctrinated (pardon the pun) to believe they simply can't birth their baby on their own; that childbirth is some sort of a \"medical issue\" that requires someone who tells us they are far better at this than we are, or that they have gone to school for 12 years to know how to catch a slippery tiny human entering the world...when the parents generally know better, but they choose to believe differently. It's sad.", "controversiality": 0, "created_utc": 1379590580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbcjzr", "link_id": "t3_1mlpn2", "parent_id": "t1_ccb7s5c", "retrieved_on": 1429412332, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "There is no pressure from anyone else to give birth a certain way. There is a PLAN in place and when things don't go according to that plan (which has often been thought about, created, edited, added to, and worked on for MONTHS or YEARS), then it is a massive disappointment in oneself. \n\nA lot like a book writer (or anything else). An author gets an idea. Starts writing it down. Months and years go by; she is still working on that idea and pouring her thoughts and research into her book. She finally finishes it. She takes it to a publisher. He shoots it down; telling her she needs to change this and that, and then bring it back. She feels totally defeated...all that time; all that work...to be dismissed. Childbirth for those with a natural birth plan is similar. All that time, all those years of planning and perhaps TRYING to have a baby...and then the day comes; all is going according to plan...until suddenly, it's not. Except the difference here is that there are no do-overs with birth. You can't go back and rewrite the ending. It's a once-in-a-lifetime event with that unique baby...and once the opportunity for a drug-free birth passes...it's gone forever.", "controversiality": 0, "created_utc": 1379590915, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbclso", "link_id": "t3_1mlpn2", "parent_id": "t1_ccayq0l", "retrieved_on": 1429412309, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "Um, yes there is pressure. If you've never felt the pressure then you're a rare and lucky unicorn.", "controversiality": 0, "created_utc": 1379591030, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbcmfy", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbclso", "retrieved_on": 1429412300, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "You only feel the pressure that you CHOOSE to feel. Most women who choose to create a drug-free birth plan...simply don't care about other people's opinions on their choice of birth. Therefore...pressure from others goes out the window.", "controversiality": 0, "created_utc": 1379591564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbcpep", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcmfy", "retrieved_on": 1429412262, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "Lol okay! So the many women I've talked to who felt pressure are lying and you know what they REALLY felt. Ok, lady, whatever.", "controversiality": 0, "created_utc": 1379591711, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbcq82", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcpep", "retrieved_on": 1429412251, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "No, I'm just saying what the thousands of women said whom *I* have talked to. That's all. General consensus.", "controversiality": 0, "created_utc": 1379593132, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbcyta", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcq82", "retrieved_on": 1429412140, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "Thousands? Ok. Lol", "controversiality": 0, "created_utc": 1379593530, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd1gn", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcyta", "retrieved_on": 1429412037, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "Btw, even if \"thousands\" of women claimed they felt no pressure, it doesn't mean it's true. It's very naive of you to think otherwise.", "controversiality": 0, "created_utc": 1379594065, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd50d", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcyta", "retrieved_on": 1429411991, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "They have no reason to lie.", "controversiality": 0, "created_utc": 1379594102, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd59s", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbd50d", "retrieved_on": 1429411987, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, thousands. It's not a difficult number.", "controversiality": 0, "created_utc": 1379594123, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd5ff", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbd1gn", "retrieved_on": 1429411985, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "Didn't say lie. Pressure can be felt subconsciously.", "controversiality": 0, "created_utc": 1379594165, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd5pg", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbd59s", "retrieved_on": 1429411982, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jrebeclee", "author_flair_css_class": "purple", "author_flair_text": "12y Girl, 3y Girl, &amp; baby boy", "body": "It's a delusion or a lie, but thanks for the laughs! I think you've amused me enough for one morning. I won't be responding to you anymore. ", "controversiality": 0, "created_utc": 1379594232, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd678", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbd5ff", "retrieved_on": 1429411976, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "Or not at all. Like those I mentioned earlier. :)", "controversiality": 0, "created_utc": 1379594435, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd7oe", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbd5pg", "retrieved_on": 1429411956, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bunchareality", "author_flair_css_class": null, "author_flair_text": null, "body": "Or it's neither one. :)\n\nDo some research, sweetie. Talk to more than just your closest friends (who may or may not have actually had a baby).", "controversiality": 0, "created_utc": 1379594517, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbd8a6", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbd678", "retrieved_on": 1429411947, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i know what you mean about pregnancy &amp; delivery being treated as a \"medical condition\" instead of a normal life process. and i totally understand how women would want to take advantage of the technologies we've developed to make that process more comfortable - i got an epidural myself, and will probably get one this time around too. i just don't see how you can look at a needle full of anesthesia, or a surgical table, or a synthetic powder, and go \"yeah, this is natural! there is no unnatural way to give birth, period.\" i mean what if i shot my kid out through my nose? I'd call that pretty damn unnatural. or maybe decades into the future we have transporters that just beam the baby out a la star trek. that sounds like an unnatural way to give birth to me. the whole point of the article was that there is nothing wrong with doing things the \"unnatural\" way, so we can knock it off with the mental gymnastics trying to justify EVERYTHING as somehow natural. ", "controversiality": 0, "created_utc": 1379609969, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbi0ci", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcjzr", "retrieved_on": 1429409718, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i do think the hostilities are more severe online than irl, but there is a lot of anecdotal evidence of moms being attacked for their feeding choices, even by strangers.", "controversiality": 0, "created_utc": 1379610187, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbi36g", "link_id": "t3_1mlpn2", "parent_id": "t1_ccb8eyj", "retrieved_on": 1429409681, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Orinna", "author_flair_css_class": null, "author_flair_text": null, "body": "I wasn't even allowed out of bed at all. They said that the cord could fall through if I stood up. So if I had to pee she had to bring a bed pan for me to pee in. Ugh.", "controversiality": 0, "created_utc": 1379645564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccbuade", "link_id": "t3_1mlpn2", "parent_id": "t1_ccakqst", "retrieved_on": 1429403845, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1379876784, "distinguished": null, "downs": 0, "edited": 1379877050, "gilded": 0, "id": "ccdbdc6", "link_id": "t3_1mlpn2", "parent_id": "t1_ccajuzv", "retrieved_on": 1429378647, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "venisonfurs", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree, isn't it pressure when, say, all your coworkers and friends ask if it was natural or cesarean? Why do people bring this up as if it is anyone's business?", "controversiality": 0, "created_utc": 1379877432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccdbl5h", "link_id": "t3_1mlpn2", "parent_id": "t1_ccbcmfy", "retrieved_on": 1429378546, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "This is what I was not able to articulate. If you want a natural birth, it seems that you have to jump through a million hoops, and hope that your provider doesn't pull a bai9t and switch. You have to do a million hours of research, just to get a standard of care that has your best interests in mind, instead of a timetable.", "controversiality": 0, "created_utc": 1380094158, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccezstb", "link_id": "t3_1mlpn2", "parent_id": "t1_ccaj6cu", "retrieved_on": 1429350014, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}