{"submission": {"author": "HillaB", "author_created_utc": 1351711495, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9gta6", "created_utc": 1380288365, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1n8vhp/taking_the_hard_way/", "gilded": 0, "id": "1n8vhp", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 68, "over_18": false, "permalink": "/r/Mommit/comments/1n8vhp/taking_the_hard_way/", "retrieved_on": 1411779046, "score": 64, "secure_media_embed": {}, "selftext": "I took my girls to meet with a friend at the mall. Things were going well, the girls were (for the most part) behaving. When it was time to leave, I told A she could pick out a book at the book store. She selected a Sophia the First book, which is one of the few princesses I don't entirely mind.\n     \nWaiting in line to buy the book, A got out of our sit n stand stroller because she wanted to put the book on the counter. E started getting angry that A was allowed to walk around and yet she was stuck in the stroller like some kind of chump. Because of this, I asked A to get in the stroller and she could put the book on the counter from there. This is, apparently, where I went wrong. By avoiding a mini-tantrum from the 1 yr old, I inadvertently set into motion the beginning of a great, gigantic tantrum from the 5 yr old.\n    \n After arguing with me (apparently she thought I thought she couldn't reach the counter without being in the stroller - and that was a direct threat to her ability to be a \"big girl\") we walk up to the counter and A chucks the goddamn book on the counter. Now, seeing as she is usually my good one (E throws things regularly), I was momentarily taken aback and thought it was an accident. But one look at her stubborn-set chin and fierce blue eyes told me that she'd done this deliberately. She was testing me.\n     \nGame on.\n    \n I pick the book off the counter and say, \"If you don't apologize to the cashier, you will not be getting this book.\"\nThe waterworks started immediately. She grabs the book from my hand and tosses it on the counter again, while telling me that she won't apologize.\n    \n At that moment, I had a decision to make. The tears were already here, the screams were likely on their way. I had a split-second to decide how I would handle this: Give in and buy the little brat her the book, or haul a very pissed off, very loud 5 yr old out to the car. Just glancing at the daring, almost menacing glare she shot me, gave me my answer.\n     \nI calmly handed the book to the cashier, apologized and told him we wouldn't be buying the book. I'm not sure if he ever said anything. The screams had begun, and with them, came stomps on the stroller, mad words, and screeching pleas to let her say sorry so we could buy the book. As best I could, I ignored the disapproving looks from strangers as I pushed my stroller - complete with raging five year old.\n     \nWe got to the car, and A was still pissed at me. She got into the car and did the thing where the door didn't slam loud enough the first time so she kept opening it and slamming it shut again. After the third time, I put an end to that, too. We talked on the way home - after she'd calmed down - about her feelings at  the time of the incident, and how she felt afterwards.\n     \nNow we're home, and I made she sure understood why she wasn't going to get the book. Not today. Not tomorrow. Perhaps not anytime in the near future. And as I recounted the story in my mind, I remembered the disapproving strangers and I questioned myself. Had I dealt with that scenario the \"right\" way? In the second I had to react and make a choice on how to deal with A and her 'tude, my first instinct had been to give in. Is that what I should've done? After all, it's only a book.\n    \n But giving in would've been the easy thing to do. By giving into your child's tantrums, you're not only potentially creating a bigger problem for yourself, you're letting your kid down. Your job is to teach them how to function properly in society. To be considerate of others. To continue on and control your temper even if something doesn't go your way.\n    \nSo despite the judgmental glares and tsks of people I don't know, I stand by my choice. For my child's sake, I refrained from taking the easy way out. And I can only hope that, at the very least, she grew a little because of it. I know I have.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Taking The Hard Way", "url": "http://www.reddit.com/r/Mommit/comments/1n8vhp/taking_the_hard_way/", "user_reports": []}, "comments": [{"archived": true, "author": "zestfullyclean14", "author_flair_css_class": null, "author_flair_text": null, "body": "I was unsure of where you going with this, but I think you made the right choice and did a great job!! You explained to her what she did wrong, her actions had consequences, and you gave her a chance to correct her behavior and apologize to the cashier. This is one I will have to remember. You would have got the looks and tsks no matter if you gave in or stood your ground. Good job mama!", "controversiality": 0, "created_utc": 1380290643, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgem1l", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429325868, "score": 26, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you made the right choice about not buying the book after her misbehavior...but can I ask why your 5 year old sits in a stroller? That seems a bit old to me.", "controversiality": 0, "created_utc": 1380291511, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgevjh", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429325743, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "I think your reaction to her small display of attitude escalated the whole situation out of proportion.\nShe was obviously having a hard time managing to feel 'big' and I don't think being punitive helps a child manage their frustration or anger or attitude.  Modeling and gentle instruction DO.\nI certainly agree that one cannot allow their children to misbehave and it is not out of line to expect a certain standard of behaviour...but I also think you over reacted.\n\nA little empathy and a little explanation in the moment could have gone a long way to keeping 'the little brat' from having a melt down.\nSometimes it's about being proactive and not punitive.\n\nThe audacity of referring to a child as a little brat, is beyond me.\n\n*edit* I am also of the belief and understanding (child brain development) that forcing a child to apologize is not the way they learn how to be empathetic or sorrowful for their actions.  If you're interested in the material, let me know and I will link it.", "controversiality": 0, "created_utc": 1380292259, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgf3yu", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429325634, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HillaB", "author_flair_css_class": null, "author_flair_text": null, "body": "It is a sit and stand (joovy caboose ultralight) stroller we got when my youngest was born and my oldest was 3. At the time, (this was a few months ago) we didn't have any other one and find this one works well when we're walking long places, however we now have an umbrella stroller that we use most of the time. The five year old hopped in and out but at the time I needed her to stay in.", "controversiality": 0, "created_utc": 1380292929, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfblg", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgevjh", "retrieved_on": 1429325535, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HillaB", "author_flair_css_class": null, "author_flair_text": null, "body": "Judgemental much?  I dont call her a brat around her. I wrote this an hour afterwards and was still upset. \nI did what I thought was best at the time and am proud at the lesson I both taught and learned. I shared not for criticism, but to let others that have or will experience something similar know that they're not alone.", "controversiality": 0, "created_utc": 1380293245, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgffbl", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgf3yu", "retrieved_on": 1429325432, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "Not judgmental at all.  Just offering my view of the situation. \nIf you posted it not wanting anyone to comment in disagreement with your process, perhaps that could have been included in your post so we'd know not to share alternative views/actions.\n\nI believe strongly in peaceful/kind/gentle/positive parenting so I don't agree with what you did nor with spreading the word that what you did was a good idea.\n\nThis is reddit, you're bound to encounter people who disagree with you, but since when is having view that is completely opposite to yours, judgmental? ", "controversiality": 0, "created_utc": 1380293607, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfjp9", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgffbl", "retrieved_on": 1429325375, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "The judgemental looks from strangers are what I struggle with the most. If I choose to discipline my son because he's misbehaving, I get looks, if I choose to allow him to misbehave, I get looks. It's frustrating, and at times I worry that I'm just failing. But you know what? It's none of their damn business. If they want complete peace and quiet all the time, they should stay home. Not my problem. I will have a well adjusted child who knows how to behave in public, and that's what matters.", "controversiality": 0, "created_utc": 1380293854, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfmqt", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429325336, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "Ignore them, you did the right thing. When a child goes into meltdown mode, reasoning is not always an option.", "controversiality": 0, "created_utc": 1380293929, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfno3", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgffbl", "retrieved_on": 1429325324, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, what she should've done is gotten down on A's level, talked to her through her screaming and explained that this was not acceptable behavior, the continued to buy her the book and reward the unacceptable behavior because as long as it was rationalized with her, it's ok! /s", "controversiality": 0, "created_utc": 1380294017, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfopz", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgf3yu", "retrieved_on": 1429325310, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "I just learned about these strollers, and seeing as I have an almost 3 year old and another on the way i'm dying to get one! You should google it, they are pretty cool.", "controversiality": 0, "created_utc": 1380294091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfpkc", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgevjh", "retrieved_on": 1429325299, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "I mean if that is how you think non punitive parenting works, then you have some extra reading to do.\n\nSadly people who are ignorant of the process respond the way you have.  Believing that non punitive and peaceful means being permissive and rewards unacceptable behaviour.  It doesn't and I encourage you to learn more about it before assuming. ", "controversiality": 0, "created_utc": 1380294159, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfqfg", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfopz", "retrieved_on": 1429325290, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vitaminmary", "author_flair_css_class": null, "author_flair_text": null, "body": "Get one!!  I have a 3 year old and a 1 year old and it's been great.  The 3 year old thinks he's like a big boy able to get on and off himself, but it still keeps him fairly contained.  Awesome :)", "controversiality": 0, "created_utc": 1380294331, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfsij", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfpkc", "retrieved_on": 1429325261, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vitaminmary", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm genuinely curious, what would you have done in her situation?  I agree with what OP did, so I'm interested here.  You don't agree with having her apologize for being rude to someone, but you say you can't allow them to misbehave.  So what do you do?\n\nAlso, you do come off as judgmental when you judge someone for referring to their kid as a brat in an anonymous internet post.  Maybe you don't intend to, but that's how it sounds.  Sometimes parents let off steam.  ", "controversiality": 0, "created_utc": 1380294634, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgfw5h", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfjp9", "retrieved_on": 1429325214, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "That's EXACTLY what I was hoping it would do for the big one. I mean he's not quite a big boy yet, but he reminds me daily that he's not my baby anymore. Lol", "controversiality": 0, "created_utc": 1380295317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgg4jg", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfsij", "retrieved_on": 1429325105, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "Different Strokes.", "controversiality": 0, "created_utc": 1380295336, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgg4ss", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfqfg", "retrieved_on": 1429325102, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/19/12", "body": "What comes across as judgmental is your assumption that she was not showing empathy or explaining the situation and referring to harmless blowing off of steam as audacious.\n\nIf you'd simply written something like \"well, I prefer not to handle situations like this in that manner because X. I try to handle them like Y instead,\" I don't think anyone would have a problem.", "controversiality": 0, "created_utc": 1380295995, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccggcyz", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfjp9", "retrieved_on": 1429324996, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "Forced apologies are only done because they're forced.  There is not usually remorse.  So when we force a child to say things which they do not mean, what is the actual lesson they're learning?\n\nNot knowing her child specifically, I can't advise based on knowledge of her personality the way I would with my own kids.\n\nIt is totally ok for a Mom to take her kids out of the line up, stand aside and have a connected moment so everyone can organize their feelings.\n\nIt seems that in this case, the child was struggling with being interrupted from her goal of putting the book on the counter.  At that point, getting on her level and helping her rationalize the idea (as /u/Skywalker87 suggested) may have worked to settle the situation right there.  Reassurance that YES you can reach the counter and it's all going to work out fine to purchase this book and shall we read it on the couch when we get home or on the bed? To encourage distraction from the frustration.  Coaxing her that this purchase is going to go off without a hitch and she's going to be a big girl putting it on the counter so nicely.\n\nIn terms of tossing the book on the counter, I likely would have mentioned that this is not how we treat the book, the counter or the 'pay lady' and let us try that again with gentleness.  I likely would have demonstrated. \nIn our family we allow reactions.  Reactions are what they are.  You, /u/vitaminmary said that yourself when you said \"some parents let off steam\"....ALL kids let off steam and need to know that their emotional responses are valid.  Always.  We as parents don't always see the innuendos of life the way kids do because we have a more vast understanding of how the world works and what processes we go through to navigate the world.\nLittle ones are still on the learning curve and rather than being punished for a valid reaction, as traditional parenting would dictate, kids REALLY need a safe place to have emotions and an understanding that their reactions will be met with compassion and empathy rather than punishment.\n\nIt would be interesting to know what exactly the 5 year old thought.  We don't know because Mama didn't try to find out, Mama reacted to the reaction.\n\nIn the moment, we can all be sucked into that, but being mindful that this is a wee person, just learning how to navigate the world, needing instruction not punishment goes a long way in helping us temper our responses.\n\nIt's about a paradigm shift from believing that a child needs to be 'taught a lesson' to believing that we need to SHOW the child how it is done by modeling it and that when it is done incorrectly, punishment leads to resentment not learning.\nSince our goal is learning, we want to make the environment and the message as conducive to learning as possible.\nGiven what I know about brain development in children, I know that the best way to do this is by positive, gentle and kind parenting.\n\nConsider that as an adult you'd likely dig your heels in if someone disrespectfully ordered you to apologize for having a reaction...but you're grown and able to rationalize the situation whereas a 5 year old is not.\n\nTeaching children how to behave includes helping them understand the feelings of others as well.  Forced apologies do not help them see the other side.  Repeated instruction is needed for children to 'get it' and the best instruction for children is modeling.\nFor the mama to say to the daughter, \"I cannot let you treat books or people this way\" while removing the book from the counter and say  to the clerk, clearly, in front of the daughter \"I am sorry that (book being thrown to her) happened to you, I bet that didn't feel nice.  Are you ok?\"\nDemonstrates that there is something to be sorrowful about the action and shows the child the way to empathize with the person they've 'wronged'.  There is no punishment needed further.  She's been taught, shown and told.  Asking her to copy the gentle way Mama puts the book down is the demonstration of the lesson and will be remembered as the lesson more so than the punishment of not getting a book.\n\nIt is OK for a parent to not feel like they have the time or the place to do this very involved, very hands on type of parenting, many of us feel like we have to just nip it in the bud right then and there.\nReality is, it takes many repetitions for a child to understand each lesson we give them and we need not be overly harsh.\n\nIf we look at how we'd want to be treated when we're learning new things, we can easily see how to treat our small humans.\n\nIt is not a stretch to offer them respect when we expect to get respect.  How can they give something they've not had or seen or experienced?  Respect is not a one way street.  The more we offer the more we get but first we have to believe that these are little humans who need teaching and just like in schools we no longer allow the teacher to rap a child's knuckles for missing a spelling word because we know it isn't conducive to learning, we also need to shift that view to our parenting.\nDiscipline means to guide and a well disciplined child is one who is well guided.\n\n\nIn terms of the \"brat\" issue, it's just so harsh to view a child that way, as deliberately being unacceptable, a child GIVING a hard time rather than a child HAVING a hard time.  I FIRMLY believe, no, I KNOW that children who are having a hard time will be children who give a hard time and that the former must always be present for the later to be the case and so addressing the having will fix the giving. \n", "controversiality": 0, "created_utc": 1380296713, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgglzm", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfw5h", "retrieved_on": 1429324879, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "Hmm, interesting.  This mama didn't give her daughter the benefit of a \"harmless blowing off of steam\" reaction the way everyone here is giving the mama and she is the adult. \n\nI wonder if that is noteworthy?", "controversiality": 0, "created_utc": 1380296822, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccggnec", "link_id": "t3_1n8vhp", "parent_id": "t1_ccggcyz", "retrieved_on": 1429324861, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "If you're cool being misinformed.", "controversiality": 0, "created_utc": 1380296898, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccggocm", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgg4ss", "retrieved_on": 1429324848, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vitaminmary", "author_flair_css_class": null, "author_flair_text": null, "body": "I really appreciate your answer, and I'm glad you didn't take offense in the way I had worded my comment (as I was afraid might have happened).  You make some very valid points and definitely have a good point of view.  You have given me a lot to think about in terms of my own parenting.\n\nThe brat issue, we can probably agree to disagree.  Only because I look at that just simply an exasperated parent saying something that they (or at least I) don't really mean.  I know I have said things like this to my husband while knowing that my kids are kids and I actually have a lot of patience for their behavior, and can usually laugh or at least brush off the difficulties.  But to each his own, I see what you are saying here as well.", "controversiality": 0, "created_utc": 1380297632, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccggxu1", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgglzm", "retrieved_on": 1429324726, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BoulderCat", "author_flair_css_class": null, "author_flair_text": null, "body": "Screw people and their judgements. Either they don't have kids or they've forgotten what it was like to have kids. ", "controversiality": 0, "created_utc": 1380299350, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccghkl5", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429324431, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "siriuslynotamuggle", "author_flair_css_class": "green", "author_flair_text": "Adahliah's Mommy", "body": "I really like your response. There have been times where I will try to sit and talk to my two year old when she's freaking out and acting kind of \"bratty\" (and I'm relieved to hear someone else that thinks it's not entirely fair to call little ones that) and some family and friends have criticised me bc \"she's only two\" but I've had a lot of luck talking to her about things (although admittedly she is a little advanced when it comes to things like that). \n\nWhile I agree that if the tantrum doesn't stop its not productive to give in, I also feel that the whole thing could have been remedied quickly if they had talked about why she wanted her to get in the stroller (but then again I don't know her kids). Either way, my point is you gave some really great advice in this comment.", "controversiality": 0, "created_utc": 1380301118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgi88v", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgglzm", "retrieved_on": 1429324112, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's silly to argue my parenting method vs your parenting method. Point is, we are here, we are doing the best we can, and following our own belief systems and trying to raise our children to be productive members of society. I fail to see why you think that you are so much better than anyone else at parenting just because you feel you are an expert on a certain method. It is a shallow minded and judgemental way to be, parenting is challenging enough without people attacking eachother.", "controversiality": 0, "created_utc": 1380301790, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgihj4", "link_id": "t3_1n8vhp", "parent_id": "t1_ccggocm", "retrieved_on": 1429323992, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "siriuslynotamuggle", "author_flair_css_class": "green", "author_flair_text": "Adahliah's Mommy", "body": "Maybe it has something to do with wear people live, but I've actually gotten a significant amount of approving looks when I won't buy something for my daughter and she's upset about it. But yeah, it's hard sometimes to make patenting decisions when you're in public and have to worry about other people judging you. I've actually gotten really good at ignoring them, but every once in a while someone feels compelled to actually say something to me and it's so hard not to just tell them to shut up and mind their own business. ", "controversiality": 0, "created_utc": 1380301809, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgihsd", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429323988, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "I honestly don't think I'm so much better than anyone else. \n\nKnowing facts about how children learn and develop and tailoring parenting methods to those facts in order that each child has the best possible outcome with the parents who ARE doing the best they can because they KNOW and follow best practices....\nFacts about brain development and how to nurture that are not about belief systems. \nJust like vaccination facts are not about belief systems.\nIf I said \"Facts show that vaccinating children is the best practice\" would you say that I'm telling you I'm better than you because I KNOW that fact?\n\nI'm not trying to sound arrogant. Facts are facts, we know what we know and hopefully when we know better we do better and have better outcomes.\n", "controversiality": 0, "created_utc": 1380303227, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgj1ac", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgihj4", "retrieved_on": 1429323736, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "I see your point. Thank you.", "controversiality": 0, "created_utc": 1380303387, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgj3gc", "link_id": "t3_1n8vhp", "parent_id": "t1_ccggcyz", "retrieved_on": 1429323708, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1380303809, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgj97x", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgglzm", "retrieved_on": 1429323633, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaGrr", "author_flair_css_class": "purple", "author_flair_text": "Daughter 7, Son 5", "body": "My 4yr old would be embrassed to be in a stoller! lol I let him ride in the cart but the strollers are long gone.  If you're old enough to be in school you can walk in the store.", "controversiality": 0, "created_utc": 1380304483, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgjidr", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgevjh", "retrieved_on": 1429323514, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1380304918, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgjobh", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgj97x", "retrieved_on": 1429323437, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Chocobean", "author_flair_css_class": "lightcoral", "author_flair_text": "mom of a happy toddler", "body": "I think you did the right thing! I don't know about those people at the store, but these days, when I hear children screaming, I immediately switch to \"dude, I hear you, hang in there! You do your thing!\" mode. Maybe they weren't judgmental looks: maybe some of them sympathize. Maybe some of them are even cheering you on for doing the hard thing, and not helping to make one more entitled brat. ", "controversiality": 0, "created_utc": 1380305234, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgjsiy", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429323383, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeegeek", "author_flair_css_class": "blue", "author_flair_text": "Gideon's Momma", "body": "Good for you! I know it's difficult in those moments to do the right thing and not give in. Those strangers can be all judge-y. Let 'em. They don't have to deal with the fall out if you gave in this time. Good for you! ", "controversiality": 0, "created_utc": 1380305692, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgjyhh", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429323305, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "littlehippo", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is still young but when this age comes around I hope to be this way and ignore any judgemental looks! Good for you.", "controversiality": 0, "created_utc": 1380306439, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgk8bn", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429323178, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HillaB", "author_flair_css_class": null, "author_flair_text": null, "body": "How do you know? I wrote a 13 paragraph post about an event that took well over 10 minutes to play through. For the record, my daughter and I had a long discussion about her feelings, which I did say happened in the OP. It was after the fact because she was too upset to express herself. \n\nYou don't know my child, you don't know me. I'm glad that you've found a parenting style that works for you, but please don't presume that it works for every other family out there and please don't attempt to belittle others with a know-it-all attitude. \n\nI am sorry if my post offended you in some way, but no one made you read it and no one made you comment. It never ceases to amaze me the things mothers feel they can say to and about the way other moms raise their children, and the anonymity of the internet seems to make them even more inclined to step up on their soapboxes. This is the last I will be responding to you and your opinions.", "controversiality": 0, "created_utc": 1380307456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgklwt", "link_id": "t3_1n8vhp", "parent_id": "t1_ccggnec", "retrieved_on": 1429323002, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pseudonym1066", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe the 'looks' are partly just people glancing over because there is a sound and it makes people glance over; and partly the social disapproval for correctly disciplining the child is imaginary. As you rightly say the important thing is you have a \"well adjusted child who knows how to behave in public, and that's what matters.\". If anyone has a problem with that, then that's their issue, not yours.", "controversiality": 0, "created_utc": 1380307771, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgkq2j", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfmqt", "retrieved_on": 1429322948, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "I only commented based on what you shared.  She 'threw the book' and you punished her.\nI don't exactly call that allowing her to have her \"letting off steam\" reaction.\n*shrug* maybe I'm mistaken in my interpretation of being punished for an emotional reaction.\n\n\nYour post didn't offend me but I hardly think you posted to reddit and expected everyone to cheer.  Thanks for sharing but I don't agree with what you did or how you handled it.\nI don't mean to come across belittling in telling you what I don't agree with.\n\nI also don't think I'm on a soap box.  I'm sharing information for the benefit of others, just exactly the same way you said you were sharing information to potentially benefit others. \nApparently neither of us agrees with what the other has shared. \nThat's cool.  No one agrees with everyone all the time.\nI did indeed address the fact that I don't know you or your child in one of my other comments.\nI also addressed the \"style\" point in another comment.", "controversiality": 0, "created_utc": 1380308177, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgkvg5", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgklwt", "retrieved_on": 1429322878, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "found_alaska", "author_flair_css_class": null, "author_flair_text": null, "body": "good for you!  i always try to give strangers with screaming children a sympathetic smile because until they're about 30, we're all a wrong word away from a complete meltdown.  glad you stuck with it, momma! ", "controversiality": 0, "created_utc": 1380308615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgl1g1", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429322803, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "taraga185", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep because it was likely me with a screaming kid the week before. Solidatary, yo.", "controversiality": 0, "created_utc": 1380311345, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgm1q9", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgjsiy", "retrieved_on": 1429322330, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NoOnesAnonymous", "author_flair_css_class": "blue", "author_flair_text": "boy 3/2013", "body": "I agree with not giving in to your child's tantrums, and all in all you sound like someone who's on the \"above average\" side of the parenting scale.  But there's always room for improvement so I'm going to play the devil's advocate for a moment.\n\n&gt; By giving into your child's tantrums, you're not only potentially creating a bigger problem for yourself, you're letting your kid down. Your job is to teach them how to function properly in society. \n\n1) At what age does this start?  You admit you were essentially giving in to the younger child's potential tantrum.  Why not explain to the younger child that there are different rules for children of different ages?  I know E is a bit on the young side for this, but it may be the time to start.  There are going to be many things that are OK for the older child to do (play with toys with small parts, for example) that your younger one cannot safely do, and she needs to start learning this.  Coming from an oldest sibiling here, when older children are forced to limit themselves for the sake of the younger, it can create resentment of younger siblings as well as slow the natural learning process of the older child.\n\n2) A second consideration for future public interactions, though it may not apply to your child.  At 5, many children are very shy.  The idea of speaking to a stranger in even a positive context may be very difficult (\"say hi\" \"ask where the bathroom is\" etc) for many young children.  When forced to apologize to a stranger, they must not only deal with the necessary embarrassment of apologizing for their bad behavior, but also with the fear of speaking to a stranger, which may be downright paralyzing and lead them to resist much more stubbornly than they would if asked to apologize to you instead.\n\nJust my thoughts.  Thanks for listening!", "controversiality": 0, "created_utc": 1380311725, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgm6y7", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429322263, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "havfrue", "author_flair_css_class": null, "author_flair_text": null, "body": "Even though people were giving her looks for being a brat, I'm sure they were relieved and actually to see that you didn't give her the book. I would kiss your feet if it wasn't totally weird!\n\nI always expect a child to be bratty in public. I know that they're YOUNG and usually inexperienced and just learning how to be polite little people, for christ sakes. It's the adults who feed into the tantrums and do whatever the kids want in public that that make me lose respect. You would have gotten a thumbs up from me if I was one of those people in line.  \n\nJust a quick story to share: I was in a Starbucks waiting for my drink. A woman bought her six year old girl and her ten year old boy each blended drinks. The six year old girl took ONE sip out of her $5 drink, then hovered the drink over the trashbin, looked her mother in the eye, heard her mother say, \"You will NOT-\", then just chucked it in the bin and laughed. Okay, maybe when this kid realizes that she's screwed herself out of a treat, it'll be a good learning opportunity for her to be grateful for what she's given, not be wasteful of food, etc. right? Once it dawned on this little girl that she actually did want something to drink and that her drink was essentially gone, she threw a fit. You think her mother bought her another drink, right? WRONG. Actually, it would have made me cringe a lot less to have her buy her another drink: *This woman made her very reluctant 10 year old share his drink with the six year old.* Make the 10 year old who was actually being good share his treat with the kid who was being a brat and threw her treat away? Gah! I couldn't wait to get out of there, I was so angry. \n\nEdit: Why was I downvoted for this? Did I break a rule? ", "controversiality": 0, "created_utc": 1380312275, "distinguished": null, "downs": 0, "edited": 1380314221, "gilded": 0, "id": "ccgme9e", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429322168, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "space0ddity", "author_flair_css_class": null, "author_flair_text": null, "body": "Thats terrible.. when she realized it I would have gotten her water.", "controversiality": 0, "created_utc": 1380314057, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgn1qg", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgme9e", "retrieved_on": 1429321864, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mynameisluca", "author_flair_css_class": null, "author_flair_text": null, "body": "Why is your five year old in a stroller?! I'm sure she hates sitting in a stroller like a baby or toddler. My just turned 3 year old never has to ride a in stroller. You should really let a kid that age walk", "controversiality": 0, "created_utc": 1380314380, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgn5y7", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429321809, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HillaB", "author_flair_css_class": null, "author_flair_text": null, "body": "please read all everything before replying with such a judgemental comment. It is a sit and stand that she gets in and out of. She is 5, so she is capable of telling me if she \"hates\" it, which she does not. In fact, she used to get jealous and as the sit and stand is my only stroller (bought when she was 3 - the age your child is now, who never \"has\" to ride in a stroller), it's easier in parking lots for them both to be in there, rather than me trying to keep her hand while pushing my youngest (who is 2 now - I assume *that's* an acceptable age for stroller riding for you?). Two kids are harder than one, not all kids are the same, and perhaps you should get all information before making such assumptions. ", "controversiality": 0, "created_utc": 1380314702, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgna4p", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgn5y7", "retrieved_on": 1429321755, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HillaB", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry you were down voted. There are some very... interesting... folks in here, apparently. I would have had the same reaction as you! Wow! ", "controversiality": 0, "created_utc": 1380314793, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgnbbh", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgme9e", "retrieved_on": 1429321742, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mynameisluca", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes I know 2 kids are harder as I have 2 kids 3 years apart. Still by 3 neither were in a stroller. Just sounds like severe babying to have a school aged kid riding in a stroller", "controversiality": 0, "created_utc": 1380315023, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgnefn", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgna4p", "retrieved_on": 1429321699, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HillaB", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your opinion.", "controversiality": 0, "created_utc": 1380316446, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgnw8c", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgnefn", "retrieved_on": 1429321468, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Orannis0", "author_flair_css_class": null, "author_flair_text": null, "body": "You did the right thing, though I would be one of the ones staring judgementally because loud noises give me migraines. =_= ", "controversiality": 0, "created_utc": 1380318529, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgolmy", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429321139, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Chocobean", "author_flair_css_class": "lightcoral", "author_flair_text": "mom of a happy toddler", "body": "haha the Reddit Parenting version of \"Today me, tomorrow you\"", "controversiality": 0, "created_utc": 1380320286, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgp5eg", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgm1q9", "retrieved_on": 1429320883, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jane6677", "author_flair_css_class": "blue", "author_flair_text": "2yr old boy and 4 month old girl", "body": "Oh man, My dear friend has a 6 month old and a 2.5 year old who is the size of a 5-year old with a sit and stand double stroller. I can't imagine how she would get anything done without that device. I was confused as to how that type of stroller works until I saw it in action. It reminds me a lot of a shopping cart, with the baby sitting in the top part and the older child holding on to the back. And I sure remember being 5 years old and wanting to ride on the back of the shopping cart in the supermarket. That was way more fun than walking! \n\nSounds like you're doing a great job and congrats for not giving in! I'm not nearly at the \"gimme gimme\" phase, but I hope I'll be strong enough to say no :-)", "controversiality": 0, "created_utc": 1380325949, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgqtlk", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgna4p", "retrieved_on": 1429320091, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Surely_Jackson", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't downvote you, but I don't care for the word 'brat'- maybe others downvoted because of that?", "controversiality": 0, "created_utc": 1380328335, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgri35", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgme9e", "retrieved_on": 1429319773, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Surely_Jackson", "author_flair_css_class": null, "author_flair_text": null, "body": "I completely agree with this. I probably would have gotten annoyed with her tossing the book and reacted the same way OP did, but I think your way is the right way. And contrary to what I keep reading on these boards, disagreeing about parenting strategies does not constitute, \"judging.\" Which is evidently the worst thing anyone can do to a parent.", "controversiality": 0, "created_utc": 1380328570, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgrkhc", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgglzm", "retrieved_on": 1429319742, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Surely_Jackson", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like Dr. Sears to me, but I'd be curious to hear what she's reading, too.", "controversiality": 0, "created_utc": 1380328729, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgrm21", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgj97x", "retrieved_on": 1429319722, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "&gt; disagreeing about parenting strategies does not constitute, \"judging.\"\n\nIt seems that this is the cliff I stepped off of here. :) Thanks.", "controversiality": 0, "created_utc": 1380329526, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgrtve", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgrkhc", "retrieved_on": 1429319621, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "It is certainly similar to Dr. Sear's attachment parenting instructions.  When my oldest was a fresh one, we practiced attachment parenting principles and it led into more in depth look at other principles of child brain development and how to free the child to develop without creating road blocks with our parenting.\n\nThat led us to finding out about non punitive parenting.  So you're entirely correct, it does have a basis in attachment parenting. :)", "controversiality": 0, "created_utc": 1380330033, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgryvr", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgrm21", "retrieved_on": 1429319556, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "As far as I'm concerned good job. Way to many children get away with that . And if people disapprove MEH! You kids your choice ", "controversiality": 0, "created_utc": 1380331489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgscx2", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429319374, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1380334055, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgt12r", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgf3yu", "retrieved_on": 1429319061, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsAnthropy", "author_flair_css_class": "green", "author_flair_text": "Two girls, 1.5 and 5.5", "body": "I kept my three year old in a stroller when we lived in Chicago. Although she was perfectly capable of walking and often did, we lived near one of the busiest three-way intersections in the city and I felt more comfortable waiting for and riding the train if I could keep her contained. My biggest fear, despite teaching her to hold hands and stay with us at all times, was that she might dart out into traffic or the train doors would close with one of us on the other side. \n\nIt sounds like OP has [one of these](http://www.diapers.com/p/joovy-caboose-ultralight-tandem-stroller-black-46011?site=CA&amp;utm_source=Google&amp;utm_medium=cpc_D&amp;utm_term=JY-025&amp;utm_campaign=GooglePLA&amp;CAWELAID=1338716471&amp;utm_content=pla&amp;ca_sku=JY-025&amp;ca_gpa=pla&amp;ca_kw=%7Bkeyword%7D) where the smaller child rides up front in a seat and the older one can stand on the back and hang on if s/he wants to. ", "controversiality": 0, "created_utc": 1380334090, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgt1e0", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgnefn", "retrieved_on": 1429319057, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pantsRdown", "author_flair_css_class": "orange", "author_flair_text": "1boy3girls", "body": "I posted them. *edit*http://www.reddit.com/r/Mommit/comments/1n8vhp/taking_the_hard_way/ccgjobh", "controversiality": 0, "created_utc": 1380334945, "distinguished": null, "downs": 0, "edited": 1380335173, "gilded": 0, "id": "ccgt9cy", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgt12r", "retrieved_on": 1429318953, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "Can I ask if you live in a rural area? I ask because I do and notice when I go to the more suburban area my parents and in-laws live in that I get disapproving looks when I punish in public there as opposed to the more rural area I live in.", "controversiality": 0, "created_utc": 1380337606, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgtxvg", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgihsd", "retrieved_on": 1429318636, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DinosaurSprinkles", "author_flair_css_class": "purple", "author_flair_text": "1/9/09 + 10/12/13", "body": "The only thing I would have done differently would have been to explain why you were asking your 5 year old to get back in the stroller after saying she could get out, since you had said one thing then changed your mind. Afterthat 100% with you on what you decided. ", "controversiality": 0, "created_utc": 1380341621, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgux56", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429318179, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clasi", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not sure if it works for everyone, but when my daughter starts to scream and yell in public I kind of smirk at her and ask her \"are you sure this is what you want to do? Do you REALLY think that this kind of fit will get you what you want?\" I find that people hear that or see the smirk and figure it out. Then I tend to get nods and smiles instead of mean looks.", "controversiality": 0, "created_utc": 1380341665, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccguxkb", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgfmqt", "retrieved_on": 1429318173, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TaiDollWave", "author_flair_css_class": null, "author_flair_text": null, "body": "Point 1 was what I was going to say. In order to avoid a tantrum from the little one, there was one in the big one. But you said you can't give in to tantrums. I don't really understand the difference?\n\nI don't think you were wrong in how you handled your daughter's tantrum, though. I'm not going to buy you a book if you're being disrespectful about it. I know you're frustrated and angry, but you don't get to take that out on cashiers and disobey Mommy. ", "controversiality": 0, "created_utc": 1380342398, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgv3w4", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgm6y7", "retrieved_on": 1429318091, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TaiDollWave", "author_flair_css_class": null, "author_flair_text": null, "body": "She made her ten year old, who was behaving, share? What a way to make you feel like you're being punished for doing what you're supposed to! ", "controversiality": 0, "created_utc": 1380342513, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgv4sz", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgme9e", "retrieved_on": 1429318079, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "siriuslynotamuggle", "author_flair_css_class": "green", "author_flair_text": "Adahliah's Mommy", "body": "I live in little rock, ar which I feel is relevant to tell exactly where a live bc its so mixed up. When my daughter was born we lived in a very rural area, but it only takes minutes to get to the more suburban areas. When I went out around the rural area where we lived they were much less judgemental, but I'm not sure i can attribute that to it being rural or bc i grew up around there and people knew me and my mom, so there's a bit of a confounding variable there. I will say that I've been more harshly judged with passive aggressive remarks and dirty looks in the upper middle class areas, specifically what is known as \"the rich people walmart\", but my most nasty acting person was in a really poor area, specifically what is known as \"the ghetto walmart\". Lol. Which now that I think about it though, the walmart and target and other places we go that are close to us where we lIve now are where I receive the least judgement and they're very mixed. Like the area I live in consists of people with a variety if incomes and backgrounds and most of my bad experiences come from areas (as I mentioned earlier) where the majority of the people are from the same socioeconomic status. I wonder if that might have something to do with it.", "controversiality": 0, "created_utc": 1380347535, "distinguished": null, "downs": 0, "edited": 1380347798, "gilded": 0, "id": "ccgw66z", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgtxvg", "retrieved_on": 1429317595, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FlissShields", "author_flair_css_class": null, "author_flair_text": null, "body": "You did EXACTLY the right thing - in that split second you had the easy choice and the 'right' choice - to discipline your child and continue to set her on the road to growing into a decent human being.\n\nWell done.  I hope I will be the same when my 16month old is 5 and testing us xxx", "controversiality": 0, "created_utc": 1380357190, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgxkty", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429316927, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kathleenis", "author_flair_css_class": null, "author_flair_text": null, "body": "You did good.  Don't worry about the looks from other people...", "controversiality": 0, "created_utc": 1380369424, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccgyrzb", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429316367, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "major_lugo", "author_flair_css_class": null, "author_flair_text": null, "body": "Father here. \n\n1. Get your 5 year old out of a stroller. I do not care what kind it is. She's 5. She needs to walk. This bullshit is why we have such a rampant childhood obesity problem. \n\n2. You did exactly what you should have done, except I'd have whooped her ass when we got to the car. ", "controversiality": 0, "created_utc": 1380377781, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cch045p", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429315743, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamapanda13", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you! ", "controversiality": 0, "created_utc": 1380391921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cch3v5l", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429313993, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "Forget about the stares. You did good mama! It's so tough to make that decision and some moms would have given their kid some extra time to apologize and maybe caused an even bigger scene but you nipped that in the butt quick! Tough to do but it was the right choice. \nThose glaring people have no real idea what was going on and why she was crying. They have no right to judge you or your parenting skills because they are only seeing a few seconds from your life. Like you said, your 5 yr old is the better behaved one. They dot know that in thy split moment where she lost it that one out of 100 time. So don't worry about it. There glares only lasted a moment, but the lesson you taught her will last a lifetime!\nGood job! \n", "controversiality": 0, "created_utc": 1380435794, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cchg1j6", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429307148, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "snowellechan77", "author_flair_css_class": null, "author_flair_text": null, "body": "Here is a great start. http://www.amazon.com/Peaceful-Parent-Happy-Kids-Connecting/dp/0399160280/ref=sr_1_fkmr0_1?ie=UTF8&amp;qid=1380506382&amp;sr=8-1-fkmr0&amp;keywords=laura+aha+parenting She also has a website. My boy is still young but I feel like I am having fantastic results with it.", "controversiality": 0, "created_utc": 1380506520, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cchxlb7", "link_id": "t3_1n8vhp", "parent_id": "t1_ccgj97x", "retrieved_on": 1429298876, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "End_Of_The_Internet", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think those were judgmental stares.  They were stares of jealousy and amazement because you did what they could not do.  If I had been in that bookstore I would have cheered you on as you left!", "controversiality": 0, "created_utc": 1380655897, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ccj1etu", "link_id": "t3_1n8vhp", "parent_id": "t3_1n8vhp", "retrieved_on": 1429279849, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}