{"submission": {"author": "jadebear", "author_created_utc": 1304100376, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_55zyq", "created_utc": 1382908751, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1pc5hs/coming_to_terms_with_one_and_done/", "gilded": 0, "id": "1pc5hs", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 56, "over_18": false, "permalink": "/r/Mommit/comments/1pc5hs/coming_to_terms_with_one_and_done/", "retrieved_on": 1411663536, "score": 23, "secure_media_embed": {}, "selftext": "My son is 4 months old, super happy, and a joy to be around 90% of the time. I love him dearly, but these last few months have been the hardest of my life. I always wanted to have two kids, but I cannot imagine going through this again with the added craziness of a toddler or pre-schooler. I might explode. I think my husband would go bald.\n\n\nBut now I'm really sad about it! I feel like I'm grieving the loss of the family that I always imagined I'd have. I also would love for my son to have a sibling to play with as he grows up, but the thought of actually delivering anther baby (I had a 59 hour labor with him), going through the newborn phase again, and dealing with all the sleepless nights makes me physically sick. I wish I could just skip that and have a toddler right out of the gate.\n\nI know I don't have to make the decision now, or even for a few years yet. I'm a compulsive planner. \n\nSo, those of you who are \"one and done.\" How did you come to that decision? Did anyone think they were done after one and then change their mind?", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Coming to terms with \"one and done\"", "url": "http://www.reddit.com/r/Mommit/comments/1pc5hs/coming_to_terms_with_one_and_done/", "user_reports": []}, "comments": [{"archived": true, "author": "TattooedHousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm one and done. My son is 8yrs old. I came to that decision mostly because by the time we were financially stable and I was able to be a SAHM he was already 6. I feel like I waited too long to give my son a sibiling he could grow up with. Ideally I would of liked to have a 2nd child closer to my first one. My sister is 16 months younger than me and we are best friends, always have been. My other sister is 7yrs younger and we were never close growing up til she was an adult. I like parenting a single child. I'm never overly stressed or worn out. He has my undivided attention at all times. (He's sitting next to me on our balcony playing minecraft and we are listening to the Beatles, so peaceful :) ) Also with one child I still have a life outside of being a mother. I get to travel with my husband often and by myself often. When you have 1 child, I feel like it's easier to find child care help from family. I do want a little girl but that can't be guaranteed, so I'm happy with my family of 3, in my quiet, peaceful, clean house. ", "controversiality": 0, "created_utc": 1382910084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0vhor", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428962682, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FluffKitty", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I wish I could just skip that and have a toddler right out of the gate.\n\nThere are many young children looking for a loving home. Just a thought too keep in mind for the future.", "controversiality": 0, "created_utc": 1382910179, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0vj00", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428962665, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TattooedHousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Also with one child I feel like we can provide for him better financially. His college is already paid for, we will be able to HELP him buy a car when he's older (must have good grades/job), birthdays and christmas aren't stressful, clothes and shoes don't leave me broke. He has a lot because he's an only child but I've always made sure to never spoil him. ", "controversiality": 0, "created_utc": 1382910449, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0vmnv", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0vhor", "retrieved_on": 1428962618, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh absolutely. It's something that I've been thinking of even before we had the baby. I've always been interested in adopting :)", "controversiality": 0, "created_utc": 1382911146, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0vw34", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0vj00", "retrieved_on": 1428962496, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "That actually sounds really wonderful. Thank you for the perspective!", "controversiality": 0, "created_utc": 1382911173, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0vwfw", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0vhor", "retrieved_on": 1428962491, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "_spookie", "author_flair_css_class": null, "author_flair_text": null, "body": "There's nothing wrong with waiting a few years to decide. Though my friend's toddler can be a nightmare, she loves taking care of the newborn baby sister, and they love having two kids even though the first was really difficult. See how things go with this one! Maybe you'll get baby hungry and you'll both decide you're ready for another?\n\nAs an only child.... it's lonely. My mom was going to have another child and miscarried, and I was really broken hearted about it. I really wanted a little sister.", "controversiality": 0, "created_utc": 1382912633, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0wgkz", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428962230, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Once you get to toddler hood you will miss baby hood! ", "controversiality": 0, "created_utc": 1382913174, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0wnzi", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428962134, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrs_sgtpeppermd", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is 2 months old. In my late pregnancy, I started to feel like I would be a \"one and done\" mom too. And after my scary c section, I only felt more strongly that he would be my only child. But now, I'm not so sure. It's only been 2 months and I miss being pregnant and his newborn baby-ness. It's something I would love to experience again one day. But on the other hand, I really like the freedom and flexibility one child offers. I like being able to give him all of my attention and all of our family's resources. My husband and I both have 3 siblings, so I am hoping some cousins come along soon so he will have playmates to grow up with. \n\nI'm like you. Unsure, but I like to have a plan. I want to know what the future holds, so I've been thinking about it lots. ", "controversiality": 0, "created_utc": 1382913397, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0wqz0", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428962095, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, people keep telling me that.... but the more he grows up, the *cooler* he gets. His milestones are amazing, and seeing how his brain changes and gets better at figuring out his world astounds me. I can't wait to see what he does next. I don't miss the newborn stage at all. ", "controversiality": 0, "created_utc": 1382913670, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0wunh", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0wnzi", "retrieved_on": 1428962048, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Just enjoy it cause eventually he will b telling you off in baby language !", "controversiality": 0, "created_utc": 1382913929, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0wy6e", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0wunh", "retrieved_on": 1428962002, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bigfromage", "author_flair_css_class": null, "author_flair_text": null, "body": "I think we will be a one and done family. My son is 19 months old and I feel like he is just enough for us! I do go back and forth on what I want because seeing him interact with other kids definitely makes me wonder what kind of big brother he would be.  But then you have the days when you can't even deal with one, let alone imagine dealing with two or more.  Plus I think about all the fun stuff we can do just the three of us!\n\nThe most trouble I have had is actually other people.  From telling us he will be lonely to saying we will deprive him of a chance of a great relationship with his sibling, like just because you're family, you will get along.... yeah, OK.  You have time to decide.  Maybe you will want another in 5 years, maybe never.\n But I think as long as you guys are happy with one for now, enjoy!", "controversiality": 0, "created_utc": 1382915050, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0xd40", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428961808, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha I cant wait! Seriously :) ", "controversiality": 0, "created_utc": 1382915052, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0xd58", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0wy6e", "retrieved_on": 1428961808, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": ":) ", "controversiality": 0, "created_utc": 1382915576, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0xk71", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0xd58", "retrieved_on": 1428961717, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Martinaco", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm pretty sure no one makes the decision to have another at 4 months. They are way too in the thick of it at that point. Give it a few months and your memory may start playing tricks on you. There's nothing really wrong with having one child, you can make that great too. For now just focus on getting your sanity back :)  It will happen, I swear!", "controversiality": 0, "created_utc": 1382916155, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0xs72", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428961613, "score": 26, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sae1", "author_flair_css_class": null, "author_flair_text": null, "body": "We always only wanted one child.  Everything from pregnancy, birth and raising my daughter for the last 10 months has been pretty ideal, but still so hard.  I really can't imagine putting in this much work to have another one and would feel bad if I didn't care for a second child in the same way (AP, EBFing, co sleeping, babywearing).  So we are one and done.  If an accident happens, of course we'll step up, but we aren't planning on having anymore.  I feel like our family was perfectly complete with my daughter.\n\nI have always thought that if I ever do feel the need for more in the future, then becoming a foster parent would be a good alternative.  I do love teaching and guidance, just do not want to go through the baby stage again.", "controversiality": 0, "created_utc": 1382916818, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0y1hn", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428961493, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clasi", "author_flair_css_class": null, "author_flair_text": null, "body": "You might check with your Doctor about PPD. I felt similarly with my first, and after a long talk with my midwife she said that I probably had PPD. I felt tons better after being on Meds. We had our second 18 months after the first, and things were good. If your kiddo is only 4 months old, I think you should really give it more time before you decide one way or the other.", "controversiality": 0, "created_utc": 1382918174, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0ykf0", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428961247, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "llamasays", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel awful for saying this, but I didn't enjoy the newborn stage at all.  I really thought I would, because I've loved holding friends' newborns, but when it was actually my kid?  Well, it was kind of boring.  But my son's going to be a year old soon, and his personality cracks me up.  It's so much fun watching him interact with the world and figure new things out every day.  It's been a rough year - this kid could make the energizer bunny look like a slacker - but I still think I want at least another kid because of my experiences as an only.\n\nI grew up an only, and there's lots of great things about it.  We took vacations, I got tons of attention, got spontaneous presents whenever my parents felt like it - basically I was very spoiled :)  However, I do remember being lonely and wishing I had a brother or sister like most of my friends did.  Living in a dorm / with a SO took some getting used to as an adult as I'd never had that experience before.  The biggest factor - both of my parents had passed on by the time I was in my early 20s.  Watching my husband interact with his brother and sister, I wish I had someone like that who I could reminisce with about my parents.  My situation is - thankfully - very unusual, but just another datapoint for you to consider.  So many people talk about the high points of an only childhood but don't go into what's it like as an adult.", "controversiality": 0, "created_utc": 1382919291, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0yzp2", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428961049, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "We have twins. We wanted two but it they had been one, we'd have stopped at one. ", "controversiality": 0, "created_utc": 1382919591, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0z3pc", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428960997, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaD_Cooks", "author_flair_css_class": null, "author_flair_text": null, "body": "For the longest time after my daughter was born I was convinced I was done. After about a year I changed my mind...then got really sick and am not in the position to have another baby for a long time. I'm really sad about it. I never wanted my daughter to be an only child. I wanted three! My husband however, is convinced we are done. So we are.\n\nMy point is, it's OK to not want them now. You may or may not change your mind later. Siblings don't have to be close in age to appreciate each other. ", "controversiality": 0, "created_utc": 1382921033, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd0zp60", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428960719, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not upset about this, it's more like confusion. I can confidently say that I don't have PPD. I may have when he was just born, but I'm pretty happy now. Sleepy as heck, but good.", "controversiality": 0, "created_utc": 1382922355, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd108sl", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0ykf0", "retrieved_on": 1428960465, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DaikonAndMash", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel you on the traumatic birth experience and exhausting babyhood.  Husband and I are not \"baby people\". Our son is much more interesting the older he gets. \n\nBut as they get older, you start to see how fleeting babyhood is.  We gritted our teeth and bit the bullet for a second. Pregnancy sucked, and its chaos right now. But its only about 2 years of flat out mayhem for a lifetime of the family we wanted.\n\nNow I'm in the same position for a third.  Every fibre of my being abhors the idea of pregnancy and heading back into newborn territory once we're out of it this time.  But ask me again in 18 months.... ", "controversiality": 0, "created_utc": 1382923314, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd10nmd", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428960272, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yespls", "author_flair_css_class": "purple", "author_flair_text": "River Elise 6/28/2013", "body": "I'm 35, my daughter is 4 months in a few days.  By the time I even want to think about trying for another, I'd be close to 40.  I don't want to be 40 running after a toddler - there's nothing wrong with that, it's just not something I want in my life.  Plus my SO might reach into my body and yank my ovaries out if I even thought about it.  lol\n\nI was a little sad about it too - not because I want another child, but because I was thinking about all the things she'd never experience, like family trips with a brother or sister.  And then I thought about my own fucked up relationship with my two sisters and decided that was probably a good thing.", "controversiality": 0, "created_utc": 1382923475, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd10q1e", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428960241, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "aprylka", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for posting this. I've been trying to convince my husband to have a second child. Sharing your story with him tipped the scales. He said he had never considered adulthood as an only. And said well I guess we have to have two! ", "controversiality": 0, "created_utc": 1382923796, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd10uvh", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0yzp2", "retrieved_on": 1428960178, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "colesmomma", "author_flair_css_class": null, "author_flair_text": null, "body": "Just give yourself time - soon you will forget and when baby is about 9 months and super perfectly adorable -- you will want another one. Just take things one day at a time.. You don't have to plan your whole life today.. :)", "controversiality": 0, "created_utc": 1382923815, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd10v56", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428960175, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yespls", "author_flair_css_class": "purple", "author_flair_text": "River Elise 6/28/2013", "body": "out of curiosity, did you have any other family close by growing up?  I have an only and all the concerns you've listed are ones I've considered, but my daughter will be very close to her dad's family - including a cousin who's only a year older than her.  I have to wonder if it will alleviate some of that loneliness, or if I'm just trying to make myself feel better about choosing a different experience for her.", "controversiality": 0, "created_utc": 1382924016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd10ybt", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0yzp2", "retrieved_on": 1428960134, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yespls", "author_flair_css_class": "purple", "author_flair_text": "River Elise 6/28/2013", "body": "&gt;  Siblings don't have to be close in age to appreciate each other.\n\nthis is so true.  I get along far better with my sister who is 10 years younger than me, as opposed to the one that's only 3 years younger.", "controversiality": 0, "created_utc": 1382924116, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd10ztn", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0zp60", "retrieved_on": 1428960114, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clasi", "author_flair_css_class": null, "author_flair_text": null, "body": "For me, the PPD wasn't about being sad, I just felt out of control. I felt like everything was going crazy around me and I just kept getting mad. \n\nBut I still think 4 months is pretty young to make that kind of decision. I didn't really connect to my daughter till she was almost 9 months old. That's when I knew I wanted a second.", "controversiality": 0, "created_utc": 1382924227, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd111hc", "link_id": "t3_1pc5hs", "parent_id": "t1_cd108sl", "retrieved_on": 1428960093, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shaynami", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't decide now. In a few months it will be easier. And the second baby is a ton easier because you already halfway know what you are doing. Hang in there mama. ", "controversiality": 0, "created_utc": 1382925485, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd11lfl", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428959768, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "chocolatechipbrownie", "author_flair_css_class": null, "author_flair_text": null, "body": "An alternative view. I'm in toddlerhood. I don't miss baby hood :)", "controversiality": 0, "created_utc": 1382925569, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd11mp5", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0wunh", "retrieved_on": 1428959751, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TattooedHousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "On only child loneliness: \"I think that there's the concern that only children are lonely children. And I think that when parents consider having a second child as a gift to their first, that is probably the thing that they are most often concerned about, which I understand. I think that we have a very visceral response to seeing a child alone in a sandbox. \"But it was interesting, speaking to psychologists about the experience of loneliness for only children, a lot of them believe that we have the strongest primary relationship with ourselves, which is incredible armor against loneliness; that for a lot of only children, being alone is the experience of solitude, which is a very rich thing, instead of loneliness, which is a very painful thing. Great article on NPR. http://www.npr.org/2013/06/11/190695188/one-and-only-the-argument-for-raising-just-one I haven't gotten around to reading her book but definitely plan on it soon.  ", "controversiality": 0, "created_utc": 1382926008, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd11teg", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428959665, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "withoutamistress", "author_flair_css_class": null, "author_flair_text": null, "body": "Dude, I hate newborns.", "controversiality": 0, "created_utc": 1382926076, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd11ufj", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0yzp2", "retrieved_on": 1428959651, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "withoutamistress", "author_flair_css_class": null, "author_flair_text": null, "body": "4 months is still so young. I would wait until at least a year before making that decision.\n\nCongrats!", "controversiality": 0, "created_utc": 1382926192, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd11w6c", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428959628, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thaen", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously, something about the sleep deprivation makes you have idiotic conversations at 18 months like, \"Let's do this again, it would be so easy the second time!\" and \"Don't you think it would be wonderful if we could have it to do a second time?\"", "controversiality": 0, "created_utc": 1382927973, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd12nkv", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0xs72", "retrieved_on": 1428959273, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I say this to anyone willing to adopt an older child:  Do it!  So many want babies.  When I was three and put up for adoption there was a long period of time I still remember when I had no family.  It was scary after my baby brother got snapped up and then my toddler sisters and they were worried that no one would adopt a kid my age.  Then my mom came along and I was safe and had a home.  You can give that to a child and it's the best feeling ever for them.  My mom says it was pretty awesome on her end, too.", "controversiality": 0, "created_utc": 1382929121, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd135ax", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0vw34", "retrieved_on": 1428959043, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "I knew those people were out there! I think once they can talk and move and get their ideas across they're way more fun. Babies are adorable, but kids are hilarious.", "controversiality": 0, "created_utc": 1382929948, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd13h9z", "link_id": "t3_1pc5hs", "parent_id": "t1_cd11mp5", "retrieved_on": 1428958888, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "I would love to adopt a 2 or 3 year old. I'm so glad you and your mom found each other. ", "controversiality": 0, "created_utc": 1382930058, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd13iwn", "link_id": "t3_1pc5hs", "parent_id": "t1_cd135ax", "retrieved_on": 1428958867, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "There was a week or so there when he was sleeping 7 hours a night where we were like \"yeah, we'll totally have another!\" and then a sleep regression/growth spurt/teething/who the fuck knows hit and we started to reconsider. ", "controversiality": 0, "created_utc": 1382930160, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd13kb0", "link_id": "t3_1pc5hs", "parent_id": "t1_cd12nkv", "retrieved_on": 1428958849, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup. They kinda suck. My kid is so much cooler now, even at 4 months. I can't wait to see where he ends up. ", "controversiality": 0, "created_utc": 1382930229, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd13lb5", "link_id": "t3_1pc5hs", "parent_id": "t1_cd11ufj", "retrieved_on": 1428958836, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "This is an excellent article! Thank you for that link. ", "controversiality": 0, "created_utc": 1382930318, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd13mke", "link_id": "t3_1pc5hs", "parent_id": "t1_cd11teg", "retrieved_on": 1428958820, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "You'll be a hero and inspiration if you do.  Thank you.  We've made each other happy.  Someday I hope to be in a position to adopt a little brother for my daughter.  ", "controversiality": 0, "created_utc": 1382930998, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd13w9l", "link_id": "t3_1pc5hs", "parent_id": "t1_cd13iwn", "retrieved_on": 1428958694, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thaen", "author_flair_css_class": null, "author_flair_text": null, "body": "Wait what? He's 4 months old and you already had a period where he was sleeping 7 hours a night?\n\nLook I hate telling people what to do or how to parent or whatever. But seriously: don't do anything drastic for a few more months. Give it until he is at least three before you do anything permanent. Life changes so dramatically. ", "controversiality": 0, "created_utc": 1382931600, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd144nn", "link_id": "t3_1pc5hs", "parent_id": "t1_cd13kb0", "retrieved_on": 1428958585, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not doing anything permanent like a tubal ligation. I'm just saying that at this point I can't imagine having more kids, and that kinda makes me sad. \n\nYeah, he teased us by doing 7 hour stretches for a few nights. Then he stopped, pretty dramatically. ", "controversiality": 0, "created_utc": 1382934262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd152ds", "link_id": "t3_1pc5hs", "parent_id": "t1_cd144nn", "retrieved_on": 1428958148, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1382934335, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1536w", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0wunh", "retrieved_on": 1428958137, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thaen", "author_flair_css_class": null, "author_flair_text": null, "body": "Man I hated that. I had such a hard time with it. Good luck. ", "controversiality": 0, "created_utc": 1382934791, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd158e9", "link_id": "t3_1pc5hs", "parent_id": "t1_cd152ds", "retrieved_on": 1428958070, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shafonfa", "author_flair_css_class": "purple", "author_flair_text": "9/30/13 Baby Girl &lt;3", "body": "My husband and I always said we wanted 2 to 4 kids. Now our first is 4 weeks old, and HOLY CRAP I can't imagine doing this even one more time, much less three!! I had no idea it would be this hard.  I'm trying not to think about it right now... Too overwhelming.", "controversiality": 0, "created_utc": 1382966874, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1axjq", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428955339, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "The adoption idea is great since as a child gets older, they become less adoptable. (So sad) Also, keep in mind that at 4 mo postpartum, your hormones are still pretty wacky and you are likely sleep deprived.  Focus on the now and worry about more kids later. It can take up to a year for your hormones to level out again and once you get some serious Mommy-ing under your belt, you will have a ton more confidence in your abilities.  By the time your son is 3, the thought of a newborn isn't so scary anymore. :)", "controversiality": 0, "created_utc": 1382970846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1c2de", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428954810, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "I'm an only child and as an adult, I wish I had siblings to share my Mother with.  She's more of a handful than my boys sometimes, haha!", "controversiality": 0, "created_utc": 1382972604, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1cne5", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0vwfw", "retrieved_on": 1428954538, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jyxtrant", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh yeah, my daughter did the same thing!  And then ALL the developmental stuff hits, and you really miss those nights.  Good luck on the next two months, they were a doozy for us!", "controversiality": 0, "created_utc": 1382974502, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1dbu7", "link_id": "t3_1pc5hs", "parent_id": "t1_cd152ds", "retrieved_on": 1428954221, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jadebear", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, the past few nights have been an exercise in patience. I said screw it and let him fuss last night when he woke up at midnight and the little stinker put himself back to sleep until 4am! I didn't have to get out of bed from 9 to 4. It was glorious. I'm sure tonight will have me up every hour just to throw me off. Yay optimism!", "controversiality": 0, "created_utc": 1382974839, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1dgfp", "link_id": "t3_1pc5hs", "parent_id": "t1_cd1dbu7", "retrieved_on": 1428954161, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "b00tler", "author_flair_css_class": "green", "author_flair_text": "19 mo old girl", "body": "We are \"one and done\" for some of the same reason others have mentioned. We don't want to stretch our time &amp; resources with a second. We feel lucky to have had a healthy, happy first child (so far) and don't really want to test fate. Age is a factor for us too.\n\nI had one sibling and my partner had none. She was lonely sometimes without a sibling, I was lonely sometimes *with* my sibling, an older brother who resented me and competed with me from Day One, teased me relentlessly, never stood up for me a single time, and never showed me any particular affection. As adults, we have a cordial relationship, but very little in common. So I am not going to undertake all the work and responsibility of raising a second child, just on the off chance that he or she would end up friends with my daughter! \n\nI would encourage you to discover what you most want to do--in your heart of hearts--and don't make your decision based on fear. Basically, no matter which way you go, you can't know what the other choice would have brought. And people will judge you either way for different reasons, but that can't be helped. ", "controversiality": 0, "created_utc": 1382980407, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1fnjw", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428953136, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I started to desire a second at about 3 months postpartum... It hasn't happened yet, and little man is a year old. Some people actually do crave children pretty fast. But it is probably unusual.", "controversiality": 0, "created_utc": 1383008551, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd1rhg2", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0xs72", "retrieved_on": 1428947482, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anditron", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup, I've read this from so many parents. When you're going through the initial adjustments, and the whole first year is a bunch of constantly changing adjustments. Funny enough, we were never going to be parents, until life changes made us reconsider and decide to have 1 kid. For nearly 3 years, we were 100% certain, we were never having a second. Until one moment watching our daughter we both thought to ourselves (and later talked about it) that we did want a second. So now we're on number two. My point here is that 4 months in, don't be so sure you're on one side of the fence or the other. The thing parenthood has told me is to never say never, that things could always occur that will change my decision.\n\nSaying that, if you're not feeling it right now. Take concerted measures to not have another one, because you're in what I like to call \"the super prime fertile phase\" right now. I know so many people who experienced \"Surprise, pregnancy!\" around 3-4 months because they figured that it wasn't really possible to get pregnant so soon after a baby. My nephews are Irish twins because my brother and his wife figured that since they needed help getting pregnant the first time, that #2 would take as much effort. Apparently a lot of women's bodies just need a little kickstart to understand what to do and once that happens the making is easy.\n\n", "controversiality": 0, "created_utc": 1383155823, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd31ysl", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0xs72", "retrieved_on": 1428923985, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nedonedonedo", "author_flair_css_class": null, "author_flair_text": null, "body": "what is involved with adopting a toddler?", "controversiality": 0, "created_utc": 1383168519, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd37lg7", "link_id": "t3_1pc5hs", "parent_id": "t1_cd0vj00", "retrieved_on": 1428921287, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jenn42ifer", "author_flair_css_class": "orange", "author_flair_text": "toddler girl", "body": "The main reason for us (we have an 18mo daughter) is just a feeling: We are the family we were meant to be.\n\nA lot goes into it, of course. I have a younger sister, and we lost our mom when I was 12yo. My husband is an only child and never knew his dad. My husband never felt lonely or sad that he didn't have a sibling. We feel partly selfish because it's part of it is that we would like to maintain our quality of life, and we want it to include being able to afford more family vacations (and maybe even letting her bring a friend along), pay for her college, still be able to do the things we did before her, and even now (not that having more kids necessarily means we couldn't). I have also felt like I am more maternal than I thought I would be, but it still feels like it requires more work and effort than others. I like being able to focus on my little girl, and I think staying in my new comfort zone will keep me a better mother to her, rather than spreading me thinner across more kids.", "controversiality": 0, "created_utc": 1383174214, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd39zvv", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428920167, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FluffKitty", "author_flair_css_class": null, "author_flair_text": null, "body": "It really depends on where you are from and public vs private adoptions and open vs closed.\n\nWhere I am from, all adoptions are open (the bio family continues to have access to the child). \n\nThere are some basics though. You will have to go though a police check, the placement and fit interviews , and mountains of paper work.\n\nSome of my friends are in the process of adopting some toddler - younger kids right now. They registered with the agency/government, did the full record checks, had their finances examined and went to numerous interviews. After all of that, they have access to the database of adoptable children and can indicate which kids they are interested in. The guardians can see their profile and agree to meet with them. Then the fit interviews and home inspection etc. Then, if everyone is happy, they can move onto the legal transfers.\n\nI don't know all the details, but that is the process as I know it.", "controversiality": 0, "created_utc": 1383175593, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd3ak9v", "link_id": "t3_1pc5hs", "parent_id": "t1_cd37lg7", "retrieved_on": 1428919903, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "llamasays", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry, just saw your response.  I have three older half-siblings who all have kids, so I have two nieces who were a year younger than me that I spent a lot of time with growing up.  I went away for college, though, and then moved away for work afterwards, and everyone else in the family stayed in the same location (roughly within an hour's drive of each other).  I still talk with each of them at least monthly, but it's not the same kind of relationship my husband has with his siblings, you know?  \n\nI don't want to like guilt you into having another kid - I mean, thinking back, there's a lot of things I can think of that would've made my life \"better\" in my mind.  One silly example - I'd always ask for board games for my birthday / Christmas, but then I'd have no one to play them with because my parents didn't care for board games.  When I'd invite friends over, occasionally we'd play the games, but we'd usually end up doing something else rather than figuring out how to play a board game neither of us had played before.  And who knows, maybe I'd have had a board game hating sibling any way :)  So, I think if you have the knowledge of some of the \"pitfalls\" and can alleviate them, she'll be fine!  Like I said - I have a weird situation, and honestly, if that hadn't happened, I'd be singing the praises of only child ness (and probably still living in my hometown!)", "controversiality": 0, "created_utc": 1383183877, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd3e32p", "link_id": "t3_1pc5hs", "parent_id": "t1_cd10ybt", "retrieved_on": 1428918188, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm definitely leaning towards one kid but my husband desperately wants another. He doesn't do all of the \"heavy lifting\" so of course it's no big whoop to him.\n\nBoth my mother and his really messed up their second kids because they couldn't handle two kids. We all suffered as a result. Like they gave up. I don't want to do that to my daughter.", "controversiality": 0, "created_utc": 1383308564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd4dafq", "link_id": "t3_1pc5hs", "parent_id": "t3_1pc5hs", "retrieved_on": 1428901545, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}