{"submission": {"author": "bravelittletoaster87", "author_created_utc": 1310515530, "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "author_fullname": "t2_5i8wc", "created_utc": 1383418031, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1prh3j/feeding_question_first_time_mom/", "gilded": 0, "id": "1prh3j", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 68, "over_18": false, "permalink": "/r/Mommit/comments/1prh3j/feeding_question_first_time_mom/", "retrieved_on": 1411640807, "score": 11, "secure_media_embed": {}, "selftext": "Firstly Hello mommit! I'm a first time mom to a child of my own, I have a step son but this will be my first biological child. I'm due April 11th and I'm trying to figure out things as I'm growing. I'm 26 years old and have been married for 6 years.\n\nAt anyrate, I went through some pretty traumatic abuse as a kid, and though I've worked through most all of it and work on it on a regular basis there is one thing with motherhood I CANNOT stomach, and I've known it for a long time. Breast feeding. I know I know, I've read how beneficial it is, and no pumping isn't an option for me either. That being said, please don't judge too much, although I welcome well placed ADVICE, I'm trying to get information from mom's who've bottle/formula fed from the start. How do you approach that with doc? How to start and deal with it at the hospital? What formula is the best to start with? I really want to know from some women who've been there if possible, or if you know someone who took this approach, but again any advice is welcome.\n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Feeding Question, first time mom.", "url": "http://www.reddit.com/r/Mommit/comments/1prh3j/feeding_question_first_time_mom/", "user_reports": []}, "comments": [{"archived": true, "author": "twofivetwelve", "author_flair_css_class": null, "author_flair_text": null, "body": "It's nobody's business how you feed your child and why. You should probably be prepared for some criticism though, some subtle and some open. Breastfeeding moms get it too. You can't win either way really! ", "controversiality": 0, "created_utc": 1383422225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd59mcc", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428886193, "score": 28, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaD_Cooks", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, Congratulations! I will preface this with saying I am a supporter/advocate of breastfeeding,  but I realize that all circumstances are different, and we all want to do what is best for our family. It helps that you already know what you want. Do not feel that you have to explain your situation or decision to anyone. \n\nYou will constantly be given surveys by formula companies asking you if you are planning on formula feeding or bfing.... always put bfing because you will get more free cans of formula. I had multiple cases appear at my doorstep in hopes that I would give up and formula feed. I also got many coupons monthly. This will give you a variety of formulas to try if you have problems finding one that works. Then once you find one, see if there is someone you know that would be willing to swap containers for the ones that you don't use. \n\nIn the hospital they will probably give you something that most babies tolerate, such as similac advanced. I would just start with what your baby gets at the hospital and change it if you see any issues such as gas or allergies. I do not recommend stocking up on formula because if for some reason you can't use that particular brand, most stores will not allow unopened cans to be returned. I found that out the hard way.  \n\nAs for bringing it up with your doctor, there's really no need. Just ask how to ensure your milk either does not come in or is stopped as soon as possible. You will probably become engorged, and my best solutions is to put frozen cabbage leaves on your breasts when they feel full. It not only relieves the pain, but will inhibit milk production. Also invest in a small box of nursing pads to stop leaking problems.", "controversiality": 0, "created_utc": 1383422589, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd59qze", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428886135, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TattooedHousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "\nhttp://www.reddit.com/r/Mommit/comments/1ppzx6/benefits_of_breast_feeding/ this was my personal post from last night.", "controversiality": 0, "created_utc": 1383427397, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5bevz", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428885358, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ALighterShadeOfPale", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, I was unable to produce enough for breastfeeding the first couple of days after my son was born, then unable to entirely after my son was 4 days old. The hospital started him on enfamil a+ ready to serve. We kept him on that (pricey pricey) for about 2 months. He had terrible gas pains that would have him shrieking. We switched to enfamil a+ gentle ease powder, and since then we have not had a single gas pain (he's almost 6 months old now). We had a lot of success with that formula. We use the playtex ventaire bottles\n\n:)\n\n", "controversiality": 0, "created_utc": 1383427750, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5bj5q", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428885303, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "acupcake", "author_flair_css_class": null, "author_flair_text": null, "body": "I have three kids. First one I was so amped up to breastfeed. We started out good, but a week after delivery I was back in the hospital with an infection. I pumped and dumped while there and he was given bottles. I had zero support, besides my husband. I pumped and supplemented what I had to for 6 weeks before going all formula. No one cared much then(5 years ago) and the hospital even pushed formula. \nSecond time, I wanted to breastfeed and I did, until we had a family emergency (my mom almost died) less than a month after having my son. I was overwhelmed,  depressed and felt like a failure. My baby needed to be supplemented and i didn't want to introduce bottles, so we would feed him by a syringe.  I developed ppd pretty bad. I stopped breastfeeding again at about 7 weeks. Ppd stuck around for what seemed like forever because I couldn't come to terms that I failed yet again. \nThird baby I already was in therapy and knew before I delivered he would be a formula baby, but there was still some guilt. I made the choice to breastfeed for the days while in the hospital and switch over when we got home. I seen a midwife this last time around and only one of the nurses was kinda a bitch about me switching and at my six week checkup they wanted to know why i wasnt breastfeeding. Every other nurse was really supportive when i stated that i knew breast was best, but its not for me. Even the his doctor didn't question why i was formula feeding. I knew if I tried and failed again it would be worse for me and what the baby needs was a happy mommy and formula feeding made me happy. \nAny future babies for husband and I will probably be breastfeed for the first few days and then switched over. \nMy kiddos are pretty darn healthy,  I can count on one hand how times the older two have been sick and needed antibiotics.  \n\nEveryone is different, no matter what you do someone will disagree with your choices. Its part if parenthood. ", "controversiality": 0, "created_utc": 1383428024, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5bmio", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428885258, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "HappyTortoise", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey. My philosophy is happy mum = happy baby....... If you choose to do something or not to do something then it is up to you. I breast fed for 5 months then combi fed for 2 then formula only after that........ I did this because its what I wanted to do and it suited me. I didn't get stressed, and so it didn't affect baby. Where as if I'd have listened to others I'd have been tormented and would have found live difficult. Those that are around you should support you no matter what. ", "controversiality": 0, "created_utc": 1383429818, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5c8lk", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428884972, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "I had supply issues and needed to supplement.  Our pediatrician recommended Enfamil, and that was what the hospital provided us with as well -- I'm sure your pediatrician will have an opinion, though.  \n\nI wouldn't worry about how to approach it with the doctor -- if/when he brings it up, I'd just tell him what you told us.  At the hospital, they'll be used to dealing with formula feeding moms too, and if anyone is judgemental about it I'd just tell them what you told us, then make a point of telling their supervisor all about it.", "controversiality": 0, "created_utc": 1383431178, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5cp23", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428884759, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I formula fed from the start as a motorbike accident left me having chest reconstruction that made me unable to breast feed. I did run up against a few people who scorned me for not breast feeding but at the end of the day, if you cant, you cant. There is no right or wrong formula, every baby will like a different one, and at 6 weeks my baby suddenly became intolerant to the one she had been getting since birth, so we had to change it. Get a few bottles to start with. yes it will mean cleaning one as soon as its used but babys also differ on which bottle they like so dont go buying 12 until you know baby likes that brand of bottle. make sure you only keep one brand of bottle once you know which they prefer because there is nothing worse than playing hunt the bottle cap at 3am when the little ones screaming. we got an electric steam sterilizer and it was brilliant. I highly recommend them. As for all this \"make sure baby takes xozs\"...baby will take what it wants to take, no more, no less. Winding...22 pats top of the back, middle of the back, bottom of the back. keep doing it until they burp. You will know, trust me. ....oh and put a towel or cloth over your shoulder when you do it. what else? have 2 change bags, and when you take one out, make sure the one you leave at home is fully stocked too. i used to refill my nappy stash in my bag as soon as i got back. Having 2 prepped and ready will cover you in case of emergency long journeys or side trips. I dont know what country you are in but in the uk you can get premeasured multi compartment contains for formula powder that you just tip into the sterilised water filled bottle as you need it. my baby liked it room temperature so dont worry about warming it. try it unwarmed first.Dont pressure yourself, dont listen to all the \"well i would do this if it were my baby\"....its your baby. while people can give practical advice like keep a pack of wet wipes in the fridge as well as one at room temperature.....you WILL know your baby better than they do and you will learn what cry means what and ho they like to sleep.You will be fine.", "controversiality": 0, "created_utc": 1383431584, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5cu1j", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428884694, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "oh yeah, go online and go to all the nappy/diaper brand sites, and all the formula sites and every baby club run by a supermarket you can find, you will get free samples and vouchers galore!", "controversiality": 0, "created_utc": 1383431645, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5cure", "link_id": "t3_1prh3j", "parent_id": "t1_cd5cu1j", "retrieved_on": 1428884685, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Cadense", "author_flair_css_class": "green", "author_flair_text": "Matthew Ryan 7/3/2013", "body": "I had your mindset about breast feeding when I gave birth to my son four months ago. I was in the delivery room having contractions with an oxygen mask on my face when one of the nurses asked me if I planned to formula feed or breast feed. I immediately said formula because that had always been my plan. My husband talked to me though and asked me just to try breast feeding and if I couldn't do it for any reason then we could switch to formula. So I gave it a try and here I am four months later EBFing. Maybe just give breastfeeding a try before you delve into formula. Even a little bit helps your baby tremendously. But if you can't stand the idea, then that's alright too!", "controversiality": 0, "created_utc": 1383432150, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5d0uv", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428884606, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1383433538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5dhi2", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428884390, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "katykat29", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't stock up on too many of one type of bottle.  Babies can be picky about this.  That being said, we love the Playtex Ventaire.  They are easy to clean and easy to put together and we have had very few gassy days.", "controversiality": 0, "created_utc": 1383434534, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5dtla", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428884233, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TattooedHousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so sorry you felt like a failure because of not being able to breast feed. That is what annoys me about pushing breast feeding so hard on women. I never breast fed my son once and never felt any guilt whatsoever. He is an incredibly healthy smart child. I made a post about \"the benefits of breast feeding\" and got only comments about \"breast is best\" IMO, I just think there are so many other factors that go into play with children's health that women shouldn't be pressured to breast feed if that's not what they want.", "controversiality": 0, "created_utc": 1383434680, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5dvcw", "link_id": "t3_1prh3j", "parent_id": "t1_cd5bmio", "retrieved_on": 1428884210, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "asymptotex", "author_flair_css_class": null, "author_flair_text": null, "body": "In my experience, that bit about telling formula companies that you are planning on breast feeding is incorrect. My sister and I were pregnant at the same time and we signed up for all the formula and diaper clubs together - she ticked the box for formula and I ticked it for breast feeding. I received backpacks and diaper bags including coupons for formula, but no samples. She received samples from every formula company. ", "controversiality": 0, "created_utc": 1383436018, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5eboi", "link_id": "t3_1prh3j", "parent_id": "t1_cd59qze", "retrieved_on": 1428883999, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "asymptotex", "author_flair_css_class": null, "author_flair_text": null, "body": "Why should she seek out professional help regarding breast feeding?", "controversiality": 0, "created_utc": 1383436177, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5ednc", "link_id": "t3_1prh3j", "parent_id": "t1_cd5dhi2", "retrieved_on": 1428883973, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1383436546, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5ei26", "link_id": "t3_1prh3j", "parent_id": "t1_cd5ednc", "retrieved_on": 1428883916, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "asymptotex", "author_flair_css_class": null, "author_flair_text": null, "body": "OP stated that she has worked through most of it and is continuing to work through it. But she does not want to breast feed (and that is an entirely reasonable choice especially given her past), so why should she seek help to do so?", "controversiality": 0, "created_utc": 1383436880, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5em91", "link_id": "t3_1prh3j", "parent_id": "t1_cd5ei26", "retrieved_on": 1428883862, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thank you, that's very good to hear, at least I know it comes from both sides.", "controversiality": 0, "created_utc": 1383438063, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5f10l", "link_id": "t3_1prh3j", "parent_id": "t1_cd59mcc", "retrieved_on": 1428883670, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Everything I have filled out so far has not asked one way or the other, I did get given some instant feed bottles from my OB but they expired already lol. They also gave me a bunch of other stuff that came from enfamil and such, like a bottle cooler. I will def. remember the cabbage leaf trick and also ask my doctor the best way to stop it. I'm taking a no nonsense stance on it that this is what I want. I have great insurance so if I don't agree with or feel comfortable with my doctor I will switch. ", "controversiality": 0, "created_utc": 1383438589, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5f7pw", "link_id": "t3_1prh3j", "parent_id": "t1_cd59qze", "retrieved_on": 1428883585, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Since they haven't made me put down which I want yet maybe that'll change things. I already get oodles of coupons and such because I'm a freebie hunter and I used to get the coupons for friends. I also get neat ones from places like BuyBuy Baby and Burlington kids. Maybe they won't make me pick! lol", "controversiality": 0, "created_utc": 1383438656, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5f8is", "link_id": "t3_1prh3j", "parent_id": "t1_cd5eboi", "retrieved_on": 1428883573, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thank you I'll remember that, You are also the second person on here to say the ventaire bottles are good, seen good reviews on those other places too. I'm sorry you were unsuccessful, that sucks if it's what you want to do.", "controversiality": 0, "created_utc": 1383438714, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5f98f", "link_id": "t3_1prh3j", "parent_id": "t1_cd5bj5q", "retrieved_on": 1428883564, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I agree about the pressure to breast feed. Some women just can't for their own reasons, and some it just physically doesn't match up. That's not your fault and it's no bueno that you had to feel that way. The hospital I'm delivering at is very progressive and super awesome so hopefully the staff will be understanding. ", "controversiality": 0, "created_utc": 1383438821, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fal3", "link_id": "t3_1prh3j", "parent_id": "t1_cd5bmio", "retrieved_on": 1428883546, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Those around me do thankfully and my husband is on board with my choices because well, he wants me to be comfortable and happy. Like you said that's pretty important. I just read and article in Smithsonian where they were saying babies spike in stress from hearing parents fight. I can imagine they know if you're depressed to. Me being happy is important for baby to be happy too. ", "controversiality": 0, "created_utc": 1383438921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fbsh", "link_id": "t3_1prh3j", "parent_id": "t1_cd5c8lk", "retrieved_on": 1428883531, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "If any other mothers in the hospital want to impart their opinion without provocation I'll find a kind way to tell them to stuff it LOL I don't like people who feel the absolute need to but in and tell others what they think you are doing wrong as a parent. Your way isn't everyone's way and just because YOU don't like it doesn't mean jack squat. Again advice is one thing, pushing is another, and I have never given adverse parenting opinions without provocation from the parent. As for the nurses and such I hope so, I said farther up, the hospital is pretty progressive and awesome so i'm hoping they'll be understanding.  ", "controversiality": 0, "created_utc": 1383439074, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fdpz", "link_id": "t3_1prh3j", "parent_id": "t1_cd5cp23", "retrieved_on": 1428883506, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ShannonOh", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi mama. Congratulations on your pregnancy! I don't know about formula brands but here is some info about how to soothe pain of enforcement after delivery, and how to decrease supply. Frozen cabbage leaves (I cut out a hole for the nipple) and icing are definitely helpful. If a doc offers you medication to stop lactation be very skeptical. Good luck with it all! \n\nhttp://www.lactationconsultant.info/dryup.html", "controversiality": 0, "created_utc": 1383439263, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fg5c", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428883474, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "body": "At my hospital, they asked formula or breastfeeding.  You don't owe them any explanations and I doubt they'll try to pressure you, but I'd have a quick response ready anyway, such as \"I'm not comfortable breastfeeding\" or whatever you feel comfortable sharing.\n\nI'm not sure how hospitals handle formula/bottles, so it might be worth asking when you do the hospital tour.  In my experience, the hospital has their protocol and your OB isn't involved with your child after the delivery.  Your pediatrician might be a better source of advice.  Either way, I'd have a relative or close friend available for last minute shopping the week after delivery for last minute purchases such as formula, bottles, stool softener, pads, etc.", "controversiality": 0, "created_utc": 1383439628, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fksf", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428883414, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thank you, I'm sure the mom instincts will kick in and I'll know good ways to cope and I might even depart from ANYTHING I have planned, I never know. I did not have good parents and I just want to do it well and give my child a good home where they feel safe secure and loved. Honestly I haven't bought any baby things yet at all, for two reasons, I don't know what it's going to be, and yes we are finding out. Two, the baby is not going to waltz in tomorrow demanding diapers and formula, and it makes complete sense not to stockpile. Thanks for the tip on the bottles too, I was going to buy a bunch of different kinds but maybe one at a time is a good idea given the bottle/tip mismatch at 3 am lol", "controversiality": 0, "created_utc": 1383439828, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fn9w", "link_id": "t3_1prh3j", "parent_id": "t1_cd5cu1j", "retrieved_on": 1428883383, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Been workin on this :-p\n", "controversiality": 0, "created_utc": 1383439844, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fnhk", "link_id": "t3_1prh3j", "parent_id": "t1_cd5cure", "retrieved_on": 1428883379, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "I3km", "author_flair_css_class": "green", "author_flair_text": "3+1year old", "body": "First thing you should do is check your hospitals policies. If its a baby friendly hospital you need to level with them (your nurses/drs) about being a sexual abuse survivor. This means make sure it goes on your birth plan that you do not wish to breastfeed and anything the medical people might do during the birth that you would find triggering. This is the sort of thing that would be helpful for your medical team to know. If its not a baby friendly hospital not breastfeeding is less likely to be a contentious issue while in hospital. Either way, make or ask for a sign stating-formula feeding (no discussion please)- to stick on your door or chart etc.\n\nOnce you are in your pediatricians care, presumably you can interview and find one that you can talk to. \n\nThe other advice on not getting all one type of bottle is good. I would also add just buy the big bottles right off. Babies need very little to start off-might want to look into newborn stomach volumes.\n\nGood luck.", "controversiality": 0, "created_utc": 1383439897, "distinguished": null, "downs": 0, "edited": 1383440092, "gilded": 0, "id": "cd5fo4y", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428883371, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Second mention of this, putting on a good to know list. ;-)", "controversiality": 0, "created_utc": 1383439933, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fok8", "link_id": "t3_1prh3j", "parent_id": "t1_cd5dtla", "retrieved_on": 1428883365, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Well that's great for you, and who knows it may come out differently but I want to try to have plans. ", "controversiality": 0, "created_utc": 1383439973, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fp24", "link_id": "t3_1prh3j", "parent_id": "t1_cd5d0uv", "retrieved_on": 1428883359, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thank you, I am still working through it but it was years of systemic abuse, not something you can really erase quickly. I'll be in therapy for a very long time, I've not had too many physical issues with it, this is one of the only ones. It's about boundaries and while I'm doing my best to get past that, rather than try to push through it, it seems that formula feeding is just as adequate for baby, so why put myself and the baby through it?", "controversiality": 0, "created_utc": 1383440165, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5frdh", "link_id": "t3_1prh3j", "parent_id": "t1_cd5dhi2", "retrieved_on": 1428883329, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1383440667, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fxkn", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428883248, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "goody2shoen", "author_flair_css_class": null, "author_flair_text": null, "body": "I work at an OB/Gyn, and while they do encourage breast, if you are decided to bottle feed, the doctors will not question that. You will get plenty of freebies from the formula companies, and I suggest signing up for all of the freebies you can get as it gets expensive. \n\nCongratulations! I am very pro breastfeeding in general, but at the same time, respect every mother's right to determine how to best feed her baby. If you approach your child with dread &amp; negative feelings, I think baby will pick up on that. I encourage you to continue to work on your own recovery (I continue to work on mine, and reading some of your other responses it sounds similar), but not to the detriment of your relationship with your little one. ", "controversiality": 0, "created_utc": 1383440846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5fzse", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428883220, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I agree with this, Again, why put myself and my child through it if I don't expressly have to. ", "controversiality": 0, "created_utc": 1383441078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5g2md", "link_id": "t3_1prh3j", "parent_id": "t1_cd5em91", "retrieved_on": 1428883183, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I'll give that a read ;-)", "controversiality": 0, "created_utc": 1383441353, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5g5zl", "link_id": "t3_1prh3j", "parent_id": "t1_cd5bevz", "retrieved_on": 1428883118, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thank you! Must remember to stock up on cabbage! LOL", "controversiality": 0, "created_utc": 1383441426, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5g6x0", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fg5c", "retrieved_on": 1428883106, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thanks! Yeah My husband will be on hand and my neighbor is pretty helpful and has pseudo adopted me so both will I'm sure be on hand for anything needed during my stay. I am having a C-Section and have already discussed my abuse issues with my Doctor but we haven't got into the nitty gritty of the birth plan yet because I'm only 4 months. I will remember and note this kinda stuff for reference when I do get to do the tour and such. ", "controversiality": 0, "created_utc": 1383441763, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gb2a", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fksf", "retrieved_on": 1428883053, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "The hospital is pretty progressive and it was just put up in 2007, My doc is 33, and most of the staff is younger in nature. Large part of the reason I did that is because of the fact that I feel people closer to my age understand things like this better. ", "controversiality": 0, "created_utc": 1383441946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gdd1", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fo4y", "retrieved_on": 1428883023, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ALighterShadeOfPale", "author_flair_css_class": null, "author_flair_text": null, "body": "It does suck, but at the end if the day we are feeding our babies. Please don't let anyone's judgements get to you. I used to cringe having people look at me when I took out a bottle and god forbid they asked me. I felt like such a failure. Now, it's none of their business what happened, it is what it is and my baby is just fine and happy on formula. You are doing what is best for you and baby and that's all that matters :)", "controversiality": 0, "created_utc": 1383442109, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gfdo", "link_id": "t3_1prh3j", "parent_id": "t1_cd5f98f", "retrieved_on": 1428882997, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thank you for the support &lt;3 The one great thing for me when it comes to all this is I've never wanted something more in my entire life. I have ALWAYS wanted to be a mom. I have been planning and waiting for this since I was a little girl. It's only been put off until now because I wanted a good stable environment to bring a baby into, I had an injury recently and have been off work on workers comp since May, Since then my husband has started a business and we are fully supporting ourselves on that alone, my income is extra right now, if it continues this way I may actually get to be a stay at home mom, WITH a stay at home dad. I don't anticipate any PPD nither does my doc but I know it is a possibility. The OB knows full well what happened which is also why he's okayed a scheduled birth instead of a a VBAC, because he knows it will be more comfortable for me, and because it's what I wanted. I really do appreciate your kind words and I'm glad to see others who've been through bad things being great parents. ", "controversiality": 0, "created_utc": 1383442296, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5ghqg", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fxkn", "retrieved_on": 1428882966, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I am a freebie HOUND, always have been, already on it lol. Thank you, and I agree I think the best thing is for me to be as comfortable and relaxed about the situation as possible, and my sweetie will follow suit. ", "controversiality": 0, "created_utc": 1383442354, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gig6", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fzse", "retrieved_on": 1428882957, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a c-section due to breech baby and other complications.  The one thing that surprised me was how defensive I felt when they called it an \"elective\" c-section.  I *knew* that the only options were \"emergency\" and \"elective\", but I was still surprised at my gut/emotional reaction.  Perhaps it's because on the day of the surgery, about 5 people had to ask the same questions to make sure that they didn't make any mistakes.\n\nI know nursing vs formula is a different issue, but I predict that you will have a similar gut/emotional reaction to having to tell the nurses that you're formula feeding.  Be prepared to be asked by 5 or 6 people if you're breast feeding or formula feeding, and know that you are being asked repeatedly because it is hospital protocol for every nurse/doctor/anesthesiologist/whatever to ask you the same questions - not because they are judging your choice.", "controversiality": 0, "created_utc": 1383442502, "distinguished": null, "downs": 0, "edited": 1383442785, "gilded": 0, "id": "cd5gkbq", "link_id": "t3_1prh3j", "parent_id": "t1_cd5gb2a", "retrieved_on": 1428882933, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaD_Cooks", "author_flair_css_class": null, "author_flair_text": null, "body": "When I was pregnant my doctor said to do that and that you tend to get more samples. I was even at a baby expo and one of the formula booths tried to give me a whole case when I told them I breastfed my daughter. I turned it down because I was planning on weaning in the next few weeks since she was turning one soon. That's just my personal experience with it though. ", "controversiality": 0, "created_utc": 1383442611, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5glog", "link_id": "t3_1prh3j", "parent_id": "t1_cd5eboi", "retrieved_on": 1428882915, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1383442642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gm38", "link_id": "t3_1prh3j", "parent_id": "t1_cd5frdh", "retrieved_on": 1428882910, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "I3km", "author_flair_css_class": "green", "author_flair_text": "3+1year old", "body": "Progressive and/or newer is more likely to mean baby friendly, which is more pro breastfeeding. BFHI Hospitals arent the majority in the US though. Also younger medical staff often means more pro breastfeeding. \n\nI'll clarify that I am pro breastfeeding support for those who want it, and pro all infant feeding support in general. Didnt want to comment because I try to give the ff vs bf bullshit a wide berth. ", "controversiality": 0, "created_utc": 1383442897, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gp9w", "link_id": "t3_1prh3j", "parent_id": "t1_cd5gdd1", "retrieved_on": 1428882868, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I'm having an \"Elective\" C-section as well, I hate that term. I'm considered medically deemed for a C-section why the beejezuz isn't there a term for that? I appreciate that they have to ask, and that's fine. I'm not a monster and I understand it's the status quo, I'm not gonna bite their heads off for it. ;-P ", "controversiality": 0, "created_utc": 1383443114, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gs46", "link_id": "t3_1prh3j", "parent_id": "t1_cd5gkbq", "retrieved_on": 1428882832, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "So far they seem to be all good with the weird stuff in my situation, so hopefully they'll at least be understanding, so far they've been great. I work at General Motors and the first thing the doc was all over was do we need to get you pulled from work? I don't want you in there! And when I told him about the abuse before I even asked about c-section he asked which I would prefer given my circumstances, and suggested the C-section.", "controversiality": 0, "created_utc": 1383443266, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5gu1s", "link_id": "t3_1prh3j", "parent_id": "t1_cd5gp9w", "retrieved_on": 1428882807, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1383444764, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5hcnk", "link_id": "t3_1prh3j", "parent_id": "t1_cd5em91", "retrieved_on": 1428882565, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Thanks! Things get miscontrued on forums and reddit and such. I appreciate the support and I will continue with my healing for as long as it takes, and I will give my child a wonderful life with all the love in the world. &lt;3", "controversiality": 0, "created_utc": 1383445076, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5hgg9", "link_id": "t3_1prh3j", "parent_id": "t1_cd5gm38", "retrieved_on": 1428882516, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "I think identifying that you do not want to bf is a good thing. Forcing yourself to do it will only add stress later. You're doing what's best for you and your family. Any pediatrician you decide to go to should not judge you and in my experience, won't. I'd let them know bc my pedia gave me formula cans every time I went.   I tried bfing and my supply was low and in conjunction with working at the time, it just wasn't worth the stress. It comes easy for some, not so much for others and for a variety of reasons.  You will probably be judged at some point, but if it isn't your feeding choices, you'll be judged for something else. It goes with the Mommy territory.  The main thing is do what's best for you and build your own confidence. That's the only sure thing to fight judgement.  Another tip since I am expecting as well in Feb....I am already getting formula coupons and they will be expired by the time I deliver.  In the interest of not stocking up as mentioned before, Enfamil told me that if I keep all the expired coupons til after I deliver and return them together, they will replace them with good ones.  Good Luck!!", "controversiality": 0, "created_utc": 1383457162, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5l5ts", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428880788, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Good to know, for whatever reason I signed up for the coupons and haven't gotten like any and that was back in September. Maybe I need to call and make sure it went in right. I signed up at the doctors office for enfamil and similac.", "controversiality": 0, "created_utc": 1383457663, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5ladf", "link_id": "t3_1prh3j", "parent_id": "t1_cd5l5ts", "retrieved_on": 1428880729, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Marlboro_Gold", "author_flair_css_class": "purple", "author_flair_text": "SAHM 7,4,&amp; 1 BOYS!!", "body": "You can sign up on both their websites.  I have gotten more from Enfamil than Similac but maybe one had my due date wrong.", "controversiality": 0, "created_utc": 1383458082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5le41", "link_id": "t3_1prh3j", "parent_id": "t1_cd5ladf", "retrieved_on": 1428880680, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Check out the ingredients in the different formulas. For the most part theyre very similar, but i remember reading that Similac stuffs their formula full of artificial sweetener, which the infant grows accustomed to and will refuse non-sweet foods. I dont know this for sure, but see what info you can find about it.\n\nAlso: you owe no one an explanation. Just ask what type of formula they provide and say that you'll ne using formula. If they ask about it, give them a short, precise answer that says youre not interested and end of discussion. Both bfing moms and ffing moms get some kind of judgement at some point, its not their business. Ignore the crazy and they'll eventually go away. Or you can embarass them by making a scene and acting the victim. Might make them tthink twice about wearing their judgy pants out in public :-P", "controversiality": 0, "created_utc": 1383470304, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5nkj7", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428879593, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "starly", "author_flair_css_class": "blue", "author_flair_text": "Mom to two sons (2009/2011)", "body": "I'm with cadense, don't dismiss the possibility of your feelings changing after birth. Prepare best for formula feeding from the start. Have the equipment, know how to clean it (and which intervals), whatever else there is to learn. But, if you should develop a feeling like it won't hurt you to try breastfeeding, don't immediately dismiss this feeling. (If you shouldn't develop such a feeling, well, you are prepared to bottle feed). A doctor you should be able to tell you can't imagine breastfeeding because of trauma and it should be ok, I would think. Any other judging person should be ok with either no explanation or 'it isn't possible for me to breastfeed'. ", "controversiality": 0, "created_utc": 1383496758, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5ss33", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fp24", "retrieved_on": 1428877159, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I've considered being a huge butt about it because I feel like there are women out there that just won't even consider that there are situations like this. Judgmental people kill me, I've never been one to judge anyone for their choices, if you're happy you're happy so long as you know what you're dealing with! Thanks for the tip on the sweetness thing I'll do some more research on that. ", "controversiality": 0, "created_utc": 1383500605, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5u6ik", "link_id": "t3_1prh3j", "parent_id": "t1_cd5nkj7", "retrieved_on": 1428876443, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "My body will tell me what it wants, but knowing what I know mentally now, prepping hard is the best thing I can do, so you are right, I won't ignore the possibility but I will do everything I can to prepare for how I feel now. No one really knows how they will react after the baby is born, some women are COMPLETELY happy with being pregnant and still end up with PPD. You just don't know, humans are unpredictable as are emotions, hormones, and situations. I've learned that all too well!", "controversiality": 0, "created_utc": 1383500708, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5u7vv", "link_id": "t3_1prh3j", "parent_id": "t1_cd5ss33", "retrieved_on": 1428876423, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i don't know why medically-indicated c-sections are still labeled \"elective\" rather than just \"scheduled\" (or, god forbid, \"medically necessary\"), i guess their main concern is distinguishing the emergencies from the non-emergencies? i'd still be calling it a scheduled c-section if i were you. :)", "controversiality": 0, "created_utc": 1383502928, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5v26r", "link_id": "t3_1prh3j", "parent_id": "t1_cd5gs46", "retrieved_on": 1428876030, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "it's not just similac, all formulas use some form of artificial sweetener unless they are organic (and i'm pretty sure at this point all the brands have their own line of organic formula as well). it's worth pointing out, though, that even with the artificial sweeteners, formula is still less sweet than breastmilk. it doesn't result in a baby that refuses non-sweet foods - my daughter was combination-fed, still nurses a bit but she LOOOOVES herself some veggies. she won't eat seafood, which is generally on the sweet side, but she'll steal the spinach garnish off my seafood cannelloni. :p young palates are much more sensitive than adult ones (which is why they can stand to eat cardboard-Os, i mean, cheerios) and when they start exploring solid food, anything different from the milk/formula they've been drinking is exciting, so it's easy to encourage a love of veggies and healthy foods regardless of what they started out drinking. :)", "controversiality": 0, "created_utc": 1383503352, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5v8bh", "link_id": "t3_1prh3j", "parent_id": "t1_cd5nkj7", "retrieved_on": 1428875951, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't find the article I read, so I'm going off memory from a year ago. I do remember it saying that yes, there's sweetener in all formulas, but there was more in one of the Similac varieties. We used Enfamil since my daughter was failure to thrive. I'm beginning to think that she likes the flavors of veggies, but not the textures. After a year of trying to get her to eat carrots in varying forms, I pureed some (we did baby led weaning, so we didn't do purees), and she ate the hell out of them. So, off to the races with purees and smoothies.... at 20 months old.", "controversiality": 0, "created_utc": 1383503792, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5vejb", "link_id": "t3_1prh3j", "parent_id": "t1_cd5v8bh", "retrieved_on": 1428875870, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I am, because even my insurance isn't viewing it as \"elective\" because it's covered. Elective c-section are consistently not covered by insurance. It's probably for ease of use by doctors like you said but still craptacular.", "controversiality": 0, "created_utc": 1383505431, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5w2qp", "link_id": "t3_1prh3j", "parent_id": "t1_cd5v26r", "retrieved_on": 1428875557, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "but please look into a steam steriliser, they are quick, easy and no chemicals! good luck x", "controversiality": 0, "created_utc": 1383508206, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5x6h8", "link_id": "t3_1prh3j", "parent_id": "t1_cd5fn9w", "retrieved_on": 1428874556, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ladykoko", "author_flair_css_class": null, "author_flair_text": null, "body": "My sister's a physician and she is currently pumping exclusively for her baby but hates it. In fact she's thinking about quitting pumping in a few months when baby is 6 months old. Despite tons of research saying breast is best she thinks it's a bunch of propaganda because she pretty much sees equal amounts of sick kids who were breastfed or formula fed and didn't see much difference. Formula is not poison and being a happy and healthy mommy is best for your baby.", "controversiality": 0, "created_utc": 1383512281, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5yvox", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428873762, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I absolutely plan on it, I've found they aren't as expensive as you would think they would be and It would be super handy to have around. ", "controversiality": 0, "created_utc": 1383512522, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5yzb4", "link_id": "t3_1prh3j", "parent_id": "t1_cd5x6h8", "retrieved_on": 1428873715, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Good to know, My research so far has led me to believe it's either or, I don't see anything definitive one side over the other. With where we are in technology it seems to me the engineered stuff is just as good. Again like you said, the more comfortable I am the more comfortable baby is going to be. ", "controversiality": 0, "created_utc": 1383512603, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5z0k0", "link_id": "t3_1prh3j", "parent_id": "t1_cd5yvox", "retrieved_on": 1428873699, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "i think we paid £20 for ours and it was so much nicer than using the milton sterilising tablets. we also got one of those nappy wrapper bins. best 2 purchases we got", "controversiality": 0, "created_utc": 1383514067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd5zm9e", "link_id": "t3_1prh3j", "parent_id": "t1_cd5yzb4", "retrieved_on": 1428873418, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "In my experience, doctors just ask if you're breastfeeding or formula feeding and that's that... Not really something to \"approach.\" Though I half breastfeed, half formula feed, so I suppose it's always possible you'll get a judgey doctor who wants to lecture you on the benefits of breastfeeding. Hopefully not though.  \n  \nWe started LO on Similac newborn formula. Then the doctor wanted her on the high calorie stuff because she was a premie, but it made her constipated. You should get a lot of free samples (sign up for formula companies mailing lists!) so just try 'em out and see what LO likes.  \n  \nSidenote: Target brand emulates Enfamil brand, and I believe Costco brand emulates Similac brand. We get Target formula; it's sooooo much cheaper!", "controversiality": 0, "created_utc": 1383527867, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd65a9q", "link_id": "t3_1prh3j", "parent_id": "t3_1prh3j", "retrieved_on": 1428870761, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Very good to know, thank you so much. I read that the target brand diapers are the best too, they even beat huggies in almost every test I've seen for absorbency. I found that totally bizarre and awesome. ", "controversiality": 0, "created_utc": 1383528795, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd65oln", "link_id": "t3_1prh3j", "parent_id": "t1_cd65a9q", "retrieved_on": 1428870576, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, we also use Target brand diapers. We've used Huggies and Pampers as well, but Target ones seem just as good and they're the cheapest.", "controversiality": 0, "created_utc": 1383529397, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd65xpj", "link_id": "t3_1prh3j", "parent_id": "t1_cd65oln", "retrieved_on": 1428870458, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Exactly. I'll probably get a grab bag but I think the up &amp; up is probably what we'll end up with if the baby's cool with it.", "controversiality": 0, "created_utc": 1383534778, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd6875x", "link_id": "t3_1prh3j", "parent_id": "t1_cd65xpj", "retrieved_on": 1428800094, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Libera", "author_flair_css_class": null, "author_flair_text": null, "body": "Target actually has a few different generic versions of the different brand name formulas. They have that is similar to Similac, another for Enfamil, etc. We used the generic Similac one and actually preferred it over the brand name. It mixed easier and had less bubbles after shaking/mixing.\n\nAlso, on the back of the can of Target formula, there should be a phone number for the manufacturer. You can call and get coupons. Sometimes Target has sales or deals on the formula too (like buy so many cans and get a $10 gift card).", "controversiality": 0, "created_utc": 1383541288, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd6ap85", "link_id": "t3_1prh3j", "parent_id": "t1_cd65a9q", "retrieved_on": 1428798927, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Libera", "author_flair_css_class": null, "author_flair_text": null, "body": "I like the Target diapers and that's what we used for a long time after I got too lazy for cloth diapers. But, I recently switched to the diapers that Aldi (discount grocery store) sells and they work just as well. A 27 count (I think it's 27) pack of size 5's cost $4.99.", "controversiality": 0, "created_utc": 1383541502, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd6arsr", "link_id": "t3_1prh3j", "parent_id": "t1_cd65oln", "retrieved_on": 1428798894, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "We have Aldi around here but I probably wouldn't opt for those early on. My step son was extremely sensitive to all of the things apparently and had to have certain kinds of diapers, lotions, and soaps when he was young, and both I and my SO have sensitive skin, we'll just have to see what the munchkin can work with. I will say I've been trolling Diapers.com and some of the deals on there, holy crap, I'd be willing to go for the huggies and stuff at their prices!", "controversiality": 0, "created_utc": 1383542652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cd6b57n", "link_id": "t3_1prh3j", "parent_id": "t1_cd6arsr", "retrieved_on": 1428798720, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}