{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1384785202, "domain": "self.Mommit", "edited": 1385000739, "full_link": "https://www.reddit.com/r/Mommit/comments/1qwapd/mommit_where_do_you_cut_corners_when_there_are/", "gilded": 0, "id": "1qwapd", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 73, "over_18": false, "permalink": "/r/Mommit/comments/1qwapd/mommit_where_do_you_cut_corners_when_there_are/", "retrieved_on": 1411579297, "score": 40, "secure_media_embed": {}, "selftext": "Long story short, I have 6 kids, a husband and a roommate. 2 of my kids are special needs, my husband is an epileptic (who also works 13 hours a day),and my roommate suffered an injury at work that left him with 2 broken arms, screws and plates and everything else in his elbows. \n\nMy kids are 10, 7, 6, 4, 2, and 5 months. No need to really explain what goes into being a Mom, you guys already know. My husband is on meds that make him tired, and when a seizure is coming on, he is basically useless. Also, after a seizure, he weak and shaky, and there's not much we can do until it just totally passes. My roommate is in a mechanical brace, double casts, has insurance that won't cover in home nursing, and I'm his sole caregiver. That means I feed him, I dispense his meds, I bathe him, and yes, I even wipe his butt. On top of that, he was his 96 year old grandmother's only assistant. Her house burned down a few months ago, and she is in assisted living, at the moment. I hold her power of attorney since the roommate broke his arms. \n\nAt the moment, there are 9 people semi or fully dependent on me. The only help I have is a friend that sits with the kids for about 2 hours twice a week, so that I can devote myself to cleaning and get a shower. \n\nNeedless to say, there are not enough hours in the day. The house is dirty (really dirty), I'm 3 weeks behind in clearing permits at work (could potentially get my business shut down), I haven't cooked a real meal in over a week, nor have I eaten one. I was so tired last night that I nearly gave my son my roommate's morphine and nearly gave my roommate my son's antipsychotics. Getting my kids dressed for school this morning involved digging through the dirty clothes with a bottle of Febreze because I simply didn't get to laundry. I can't do this, there simply isn't enough time in the day, even if I cut out sleeping (which, fuck it, I pretty much have already). My ten year old is helping as much as she can, but I'm not going to put too much on her. My seven year old is schizophrenic (literally, that's the diagnosis) and my 6 year old has a cystic fibrosis variant, so they are less than no help. (Not that I can blame them, it's just the way it is.) \n\nWhat the hell can I cut out, just to save some more time? I'm already feeding all of us out of the microwave, off of paper plates at that. I have asked every single person I know for help, fat lot of good that did me, and I\"m pretty sure that at some point pretty soon, I'm just going to fall down on the floor and sleep whether or not I can afford to at that moment. \n\n\nEDIT: Thank you guys, so much for the suggestions, and a good deal of them will be used. People at my husband's work donated vacation days, and he has a solid week off to help me. \n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Mommit, where do you cut corners when there are just not enough hours in the day?", "url": "http://www.reddit.com/r/Mommit/comments/1qwapd/mommit_where_do_you_cut_corners_when_there_are/", "user_reports": []}, "comments": [{"archived": true, "author": "erinmichele819", "author_flair_css_class": "blue", "author_flair_text": "Devon's Momma of 8 years", "body": "Can I ask what state you are in? I'd come by and do some laundry or prep some meals for you. ", "controversiality": 0, "created_utc": 1384786930, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5fk0", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610817, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in MI. And even if you can't help, just the fact that someone offers means a lot to me. Most of my \"friends\" can't be bothered to take even an hour. I appreciate it. ", "controversiality": 0, "created_utc": 1384787118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5hlu", "link_id": "t3_1qwapd", "parent_id": "t1_cdh5fk0", "retrieved_on": 1428610790, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "arsenicookie", "author_flair_css_class": null, "author_flair_text": null, "body": "You need help, you poor thing. I wish I could take you on a spa day.\n\nAside from hiring someone, my suggestion would be to enlist the children. Assign everyone 4 and over at least 1 age appropriate chore they can take off of your plate. My 4 year old likes to put away silverware and dishes she can reach. My 7 year old sweeps. They both loves cleaning glass with Windex. Your 10 year old can help with the wee ones.\n\nThere simply isn't enough time to do everything so you just have to prioritize what needs to be done most. ", "controversiality": 0, "created_utc": 1384787347, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5k4l", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610757, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "erinmichele819", "author_flair_css_class": "blue", "author_flair_text": "Devon's Momma of 8 years", "body": "Oh, NJ here. I'm sorry that you are going through so much right now. The bright side is that there is an end in sight, at least where your roommate is concerned. I'd like to assume that he will be a big help to you once he is able. Good Luck!", "controversiality": 0, "created_utc": 1384787453, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5ldq", "link_id": "t3_1qwapd", "parent_id": "t1_cdh5hlu", "retrieved_on": 1428610741, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "arsenicookie", "author_flair_css_class": null, "author_flair_text": null, "body": "I just saw the part about how your 10 year old is already helping and the two that are special needs... :(\n\nWhat area do you live in? Maybe you can enlist the moms of reddit for some assistance?", "controversiality": 0, "created_utc": 1384787562, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5mmk", "link_id": "t3_1qwapd", "parent_id": "t1_cdh5k4l", "retrieved_on": 1428610725, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "housesister3", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like you're completely stressed out!   If you are anywhere near me I would volunteer some of my time.  What area are you in?  Other than that  I can just say do one thing at a time. No one can do everything all at once. Whatever the most pressing task is focus on that until finished and move on. I think the hard part in your case is going to be deciding what makes a task pressing. Your kids might think their wants are more important than everything else but you will have to get that work stuff done somehow. I'm assuming money is tight so paying for help isn't an option. Maybe look for a mother's helper?  I did that for a while when I was younger. A young teen to be around and kind of learn the ropes of running a household. Someone that's looking to be in the healthcare or childcare industry might be willing to do some volunteer or cheap work to get some experience. Good luck!", "controversiality": 0, "created_utc": 1384787772, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5p0w", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610694, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RiverSong42", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom of 3 AMA", "body": "Well, I am officially ashamed of myself for complaining about the amount of laundry I need to do.\n\nHonestly, I think you need help. Surely your situation qualifies for some assistance from the county in the form of a home health nurse, or aid? If not, can you hire a maid a couple times a month to do the deep cleaning?", "controversiality": 0, "created_utc": 1384787931, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5qvg", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610670, "score": 43, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hottoddy4me", "author_flair_css_class": null, "author_flair_text": null, "body": "Try this sub reddit. Maybe someone in your area can give you a hand. \n\nhttp://www.reddit.com/r/Assistance\n\nor\n\nhttp://www.reddit.com/r/RandomKindness", "controversiality": 0, "created_utc": 1384788170, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh5tpl", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610634, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, he owes me some help, and he knows it. I try not to mention it right now, because I don't want to make him feel even worse, but when he gets the casts off, and can at least use one hand, he's going to be using it to help out.  ", "controversiality": 0, "created_utc": 1384788825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh61qv", "link_id": "t3_1qwapd", "parent_id": "t1_cdh5ldq", "retrieved_on": 1428610529, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "look into crock pot cooking.  And soups/chilis.  It's getting cold where i am, so i cook a ton of dump and forget meals.  I dump a bunch of stuff into a big pot or a crock pot in the morning set it on medium or low and its ready by dinner.  it will probably be healthier than microwave food. Eating unhealthy is probably affecting everyone.  \n\ndoesn't your roommate have anyone else they could ask...seriously? It is very unfair to put more on top of what you are going through.  \n\nI'm sure your 10 yr old is a big help, but is there nothing the other older ones can do?  Help sort laundry into colors. Help start a load of laundry.  Grab the load from the dryer. mate socks.  Anything.  You NEED help. If you can think of little tiny job they can handle, it is still less for you to do. \n\n Make sure everyone (that can) is rinsing their own dishes, putting their own clothes in to the dirty laundry.  plastic cups, plates.  \n\nDont forget, you all are a family. One Big team, and a team can only function correctly if everyone works together.  I understand your kids have disabilities, but that does not mean they are exempt from all responsibility, Right? I could be wrong, i dunno.\n\nHave you thought about putting your business on hold and getting some government assistance. It sounds like you about to loose your mind.  What good would that be for all of the people you are taking care of?\n\n\nI'm really sorry you have such a massive amount of stress.", "controversiality": 0, "created_utc": 1384788844, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh61z8", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610526, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Caitir", "author_flair_css_class": null, "author_flair_text": null, "body": "To parrot everyone else here, you definitely need some help!  Do you have a family member (MIL, mom, sister, brother, etc etc etc) that could come in and possibly stay with you/near you for at least a little while until, say, your roommate has healed?  Are you involved with a church group that you could reach out to?  (If you're not religious, I would recommend looking for a local Unitarian/Universalist group...my experience has been that they are an amazing group of people and you might be able to find help through them.)  As far as managing things within your home, I've found that my four year LOVES helping when he gets to use the machinery - put the tablet in the dishwasher &amp; turn it on, sort the clothes to be washed, put the detergent in the washing machine and turn it on, take the clothes out of the dryer, etc.  If your older kids could do the \"main\" parts (ie, rinsing/prewashing the dishes, putting the clothes in the washer, etc.), your smaller ones could get engaged with the button pressing, etc., and it might help give you a break/get caught up.  Also, I know you don't want to put too much on your 10 year old, but, maybe she could start cooking basic meals?  With supervision, obviously, but you could maybe put your feet up for a few minutes while you instruct her on what to do?  \n\nI'm so sorry that you have it so rough.  I wish I were close enough to help.  :(", "controversiality": 0, "created_utc": 1384789319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh67z1", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610377, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "where the hell is your roommate's family? surely he has someone besides his grandma... he has parents, and probably friends. i can't believe you managed to respond with anything other than \"man that is balls, i'd help if i didn't have my hands so full already. better make some phone calls, bro.\"\n\nare you acquainted with any of your neighbors? maybe one or more of them could bring some meals over or take the kids off your hands for a few hours or even help with the roommate. honestly i don't know how you haven't already taken off running down the street half-naked and screaming.", "controversiality": 0, "created_utc": 1384789349, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh68e6", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610372, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaett", "author_flair_css_class": "purple", "author_flair_text": "a 4 year old boogie boy", "body": "this will sound weird/bad, but... are you at all religious?  can you talk to a clergy member or some kind of women's group that can help?\n\nafter i had my son i had some massive complications (i died on the table, but got better).  the relief society of the LDS ward we live in swooped in and completely cleaned my house, did all our laundry, and even offered to cook a meal because i was completely incapacitated.  maybe they can add you to some kind of rotation schedule to give you a break, or at least bring in some home-cooked meals.", "controversiality": 0, "created_utc": 1384789740, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6dku", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610305, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Aa_is_for_Aardvark", "author_flair_css_class": null, "author_flair_text": null, "body": "Someone get this lady a freaking cape!", "controversiality": 0, "created_utc": 1384790272, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6ks4", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610211, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll look into it. I am religious, but not deeply, and haven't bothered to join a church. (Add that to the list of things I am currently kicking myself for.) There is a MOMS group that I'm a part of, and I admit I haven't really asked them for as much help as I could. I did call the lead MOM this morning and left her a pretty much incoherent sobbing message begging for help. I hope she calls me back...", "controversiality": 0, "created_utc": 1384790335, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6lmn", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6dku", "retrieved_on": 1428610200, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Nope, Gramma is it. He has a half sister that lives in another state. His parents are dead. His friends are useless. Great to hang out on a weekend, just not down to help with anything else. (Assholes.) I know the neighbors, but I'm not the closest with most of them. The only two that would be willing to help are disabled themselves. ", "controversiality": 0, "created_utc": 1384790651, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6pwx", "link_id": "t3_1qwapd", "parent_id": "t1_cdh68e6", "retrieved_on": 1428610145, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sort of having the kids do what they can within their capacity. My daughter is doing as much as she can, including sorting laundry, sweeping mopping, you name it. The other kids are trying, but there are some days where I just lose my seven year old entirely to what's going on inside his head, and he's my other big helper, so those days are awfully tough. ", "controversiality": 0, "created_utc": 1384790822, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6s6g", "link_id": "t3_1qwapd", "parent_id": "t1_cdh67z1", "retrieved_on": 1428610116, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "And a Jack and Coke...hold the Coke. ", "controversiality": 0, "created_utc": 1384790859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6so3", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6ks4", "retrieved_on": 1428610109, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Aa_is_for_Aardvark", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha yes!", "controversiality": 0, "created_utc": 1384791005, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6ula", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6so3", "retrieved_on": 1428610084, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll look into the crockpot thing. (I try to use it somewhat sparingly, I think my 6 year old has a grudge against the crockpot, he won't eat anything that comes out of it, but he's just going to have to suck it up.) \n\nUnfortunately, no. He was in the hospital for nearly a week, and we called every person that he knows..not a damn one of them is willing to do more than stop by to visit...which in the end, means that I actually have more work to do when they leave. \n\nThe kids are helping as much as they can, but sadly, there are days that my 7 year old is pretty much out of it, and days that my 6 year old can't do much but sit on his nebulizer and try to breathe. \n\nI've considered putting the business on hold, but if I did, I'd never get it back. Half of it is based on contracts, and if I lose those, I won't get them back. I'm trying to get my roommate onto Medicaid, because he has no income right now, and if I can get him on a better insurance plan, they will provide all the transport for his doctor's appointments and that will take a lot off of me, right there. ", "controversiality": 0, "created_utc": 1384791200, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6x97", "link_id": "t3_1qwapd", "parent_id": "t1_cdh61z8", "retrieved_on": 1428610050, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you, I will look over there. ", "controversiality": 0, "created_utc": 1384791213, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6xgr", "link_id": "t3_1qwapd", "parent_id": "t1_cdh5tpl", "retrieved_on": 1428610047, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "purple", "author_flair_text": "1 Girl age 9, #2 on the way", "body": "I have one 10 year old daughter, and she is incredibly capable. Your oldest 2 probably 3 kids are old enough to do many things around the house. They might not do it perfectly, or as good as you do, but right now, anything is better than nothing. \n\nThey can do their own laundry, yes you might have to write instructions, but you can do that once, teach the oldest, and let the oldest supervise the other two. You can probably get them to wash the younger kids clothes too. My daughter does her laundry all on her own with no supervision now, it makes her feel responsible, and it's one less load of laundry I need to do! \n\nThey can help with sweeping and dusting and cleaning windows and mirrors. Like I said, it won't be perfect but something is better than nothing. \n\nFood: cook it a week at a time. Or half a week at a time. Don't cook every day. Let your kids help you by having them assemble the ingredients for a simple soup (chopped carrots, onions, celery, some kind of broth, chopped up meat, maybe some noodles), prepare a giant casserole dish like enchiladas ( can give you a simplified recipe), lasagna or crock pot goodies like chili, pot roast, or stews. Make lots of simple, hearty food that will last a few days. Reheat on the stove, or in the microwave as needed. Bonus? Have a hot mug of soup at lunch! \n\nAsk your friends, directly, for help. Tell them. All you need is for them to come help wash towels, run the vacuum, or referee bath time for the kids.\n\nIt's school time, can the kids visit with friends during the week? Ask other parents for help, I think there will be some generous souls out there. \n\nFamily nearby? \n", "controversiality": 0, "created_utc": 1384791284, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6yg8", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610034, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MonsieurGuyGadbois", "author_flair_css_class": null, "author_flair_text": null, "body": "Jesus H Christ.  I'm afraid to ask how many bedrooms you have.\n\n\nHow about and aupair or two?\n\n\nThis injured man needs to get out of your space.  I don't care how broken I was. I would not let a mother of 6 take care of me to the point of wiping my butt, oh and look after my mom too WTF!  ", "controversiality": 0, "created_utc": 1384791354, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh6zdb", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428610022, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "There's no way I can afford a maid (Although I've thought of kidnapping one...not really...okay, really, but not for long.) I'm trying to get him on Medicaid, which might cover a home health nurse, but even with them pushing the paperwork as hard as they can, it's still going to take over a week to get any kind of approval or denial on that. If I could get a nurse, just once a day, for an hour, that would be all I need to tip the scales back in my favor, and at least get on top of some of the day to day stuff. \n\nAnd I know I'm bitching, but it just never stops. The minute the kids are settled, he needs something. And I know it's not his fault. I don't blame him. What happened was a freak accident, that no one could have planned for or prevented, and I know he is under stress too, but, damn, for 13 hours out of the day, I am the only functional adult even in the house. Shit, this is so much harder than I planned on it being.", "controversiality": 0, "created_utc": 1384791445, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh70m1", "link_id": "t3_1qwapd", "parent_id": "t1_cdh5qvg", "retrieved_on": 1428610006, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Unfortunately, there just isn't anyone else to help him. Period. The only other option is to let him lay there in his room and starve to death. Not something that I could live with. Gramma isn't really that much work, she is in assisted living, so all I really have to do is go to the store for her once a week, and calm her down over the phone when she gets panicky and forgets where she is. ", "controversiality": 0, "created_utc": 1384791917, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7764", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6zdb", "retrieved_on": 1428609921, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clurrrrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow you are the definition of super mom. Here I am over here with a 4 month old (who is a pretty good baby) and a husband who works all 40 hours in 3 days so he's home a lot. My family also lives in my town. I will NEVER complain again. If I lived in your town I would totally come help clean your house. I think the ladies on here have given some great advice!! Don't be afraid to ask for help. YOU are the type if person that deserves it. Please take 10 minutes to yourself today and just go look in the mirror and tell yourself how awesome you are. Because you are fucking awesome. ", "controversiality": 0, "created_utc": 1384792144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7acw", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609880, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Clurrrrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree, this man is dead weight. Try to get him in a nursing home. He is eating up at precious time with your children. ", "controversiality": 0, "created_utc": 1384792222, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7bg6", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6zdb", "retrieved_on": 1428609866, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I think the next time my only helper does come over, I'm going to set her about cutting, chopping, portioning and cooking, so that's done for a few days. I have never in my life wished more for a deep freezer and a dishwasher. \n\nSadly, I have asked for help....that did nothing. I know, they all have lives, and kids of their own. But, yes, there is a little resentment building, since none of them can be bothered for 60 minutes. An hour, really? How hard is that? \n\nI've been trying to set up playdates for the kids, but then I have the problems of getting them there, since I can't really leave my roommate alone, especially if he's going to be needing his meds soon. \n\nI have family around. He doesn't. My brother is really the only one that would help, and he is so busy right now himself, and he only has one working hand, after getting one crushed.", "controversiality": 0, "created_utc": 1384792267, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7c4u", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6yg8", "retrieved_on": 1428609857, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anniebob", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm saying this as sincerely as possible, but can't help but notice you're spending a lot of time on Reddit. If I had that much on my plate, there is no way I could write out a post, and continue to comment back and forth. I barely have enough time with one child! \n\n", "controversiality": 0, "created_utc": 1384792387, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7drp", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609836, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MonsieurGuyGadbois", "author_flair_css_class": null, "author_flair_text": null, "body": "I hear you and you are a good person.  I'm guessing you don't value yourself as much as you should.\n\n\nAt the very least hubby needs to take a sick day and give you a day off.", "controversiality": 0, "created_utc": 1384792421, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7e8b", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7764", "retrieved_on": 1428609830, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384792891, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7l1u", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609741, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I thought the same thing for a second. Then I realized that I have 4 kids and a husband.  Lots of housework, homework and diapers.  But  I still need to find some adult time somewhere. So, I maybe spend nap time on reddit. It's better than cleaning the kitchen floor thats gonna be dirty again the next time someone walks through the door.  Everyone needs some down time... ", "controversiality": 0, "created_utc": 1384792953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7lyf", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7drp", "retrieved_on": 1428609730, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, 6 year old \"suck it up\"  and I mean that in the most lovingly way.  Mommy doesn't have time to make sure everyone LOVES whats on the table.  Microwaving dinner is not a good habit to get into. \n\nI understand if you put your business on hold, you might not get it back.  But if you raise your kids in a dirty, stressful environment where no one has time for quality time to teach them and raise them properly, what do you think is going to happen.  Would your business be worth it?  I'm sure the money was nice when it was a successful business.  But I think I would rather have a successful family. I know you didn't come here for advice on what to do with your life, but it sounds like something has to give...I don't think you want it to be your kids, or your husband, or even your roommate.  \n\n\nMaybe try craigslist in your area.  Put out an ad for a volunteer.(you would be surprised)  Call a local church in your neighborhood.  or two.  \n\nOh, and also, you all need to reconsider your friends if you are going through all of this and no one wants to help. I don't even know you and i would have been there last week to help.   Sorry i live so far away :(", "controversiality": 0, "created_utc": 1384793839, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh7yya", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6x97", "retrieved_on": 1428609561, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dementedpixie", "author_flair_css_class": null, "author_flair_text": null, "body": "What part of MI?", "controversiality": 0, "created_utc": 1384793968, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh80wc", "link_id": "t3_1qwapd", "parent_id": "t1_cdh61qv", "retrieved_on": 1428609536, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "This is all I do to destress. I also have a habit of starting a post, not finishing it, and coming back and finishing it a few minutes later. I really don't have anything else in my life to distract me, and if I were to stop Redditing, I lose the only contact I have with other humans that don't need me to do something for them. Not a good idea right now, ", "controversiality": 0, "created_utc": 1384794084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh82lh", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7drp", "retrieved_on": 1428609514, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't have a successful family without the business though. Our savings were wiped out by my two year old's birth. WIthout both me and my hubby working, there's no way we can even stay afloat. We have three vehicles (family van, work truck and a custom car), and next week, we are selling the custom...don't want to do it, but just with the few hours a week that I have cut back, it's necessary. \n\nI will try CL, hadn't thought of that, but I'm going to have carefully screen anyone that I find by that route, (duh). \n\nAnd, yes, I need better friends. I admit it. This has proven that. I have the one lady that comes over and helps a couple times a week and she is a godsend, but that's about it. My bestie went to Texas to visit her sister the day my roommate got home, and her ticket for return isn't for another week almost. She has been trying to get it switched, so she can fly back up here and help me out, but they want to charge her almost a thousand dollars extra to switch her return date, which is just way too much for me to ask her to do, and I don't think she even could. ", "controversiality": 0, "created_utc": 1384794473, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh88a8", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7yya", "retrieved_on": 1428609440, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Flint. (Yeah, I know, but at least my neighborhood is pretty safe.)", "controversiality": 0, "created_utc": 1384794532, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh895t", "link_id": "t3_1qwapd", "parent_id": "t1_cdh80wc", "retrieved_on": 1428609429, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Napalmenator", "author_flair_css_class": null, "author_flair_text": null, "body": "No real advise more than what others have already said (crock pots for the win) but...\n\nYou must have an AMAZING amount of patience. I have one 9mo old and barely make it through the day. I hope you pat yourself on the back every night and say \"I made it through another day.\" Because you must be awesome everyday to deal with all that. \n\nAs an aside, can your 10 year old help with laundry? I was doing mine at that age and only shrunk my pants once. ", "controversiality": 0, "created_utc": 1384795440, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh8n60", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609247, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bambithemouse", "author_flair_css_class": "green", "author_flair_text": "Student/SAHM 8yr, 3yr, and a baby", "body": "Good gracious Momma! I got overwhelmed just reading this. I agree with a lot of the ideas about asking church, friends, family and on those Reddit subforums. I would push to get the Medicaid stuff for your friend, I know you said it would take a week, but, at least that will give you a little bit of light at the end of the tunnel. \n\nHave you tried making a priority list of house chores? I am a horrible housewife. If I don't have a list (I make appts in my phone for some stuff) of what I need to get done that day, it won't get done.  Having the list will make things feel so much more manageable. Make the items specific. Like, one day, you vacuum X room, or what ever. I like the cooking for the week idea too. \n\nCasseroles, crock pot, stuff like that. I saw the mention that your 6yr old doesn't like food from the crock pot, but maybe if you dish their plate, and put it in the microwave, so that when you give them their food, it isn't coming 'from the crockpot'? It might help to get them over that hump. \n\nJust please try and get some time to yourself. You are getting so burnt out, it's crazy. You are amazing for doing what you do, and I wish I was half as able as you seem. I wish I lived up closer to you, I'd come over and help as much as I could!! ", "controversiality": 0, "created_utc": 1384796025, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh8w9d", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609129, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "purple", "author_flair_text": "1 Girl age 9, #2 on the way", "body": "Well the good news is that your roommate won't be laid up forever. Get your kids to help, tell them that you need them to be your big helpers. Hopefully even your special needs children can be given tasks. \n\nPreparing food ahead of time is a very good idea! It helps a lot to be able to just toss things together to make food. Maybe you can find a deep freezer on the cheap on CL or your local recycler? I have been trying to do as much as possible 2nd hand, and that's the kind of stuff that's great to get! ", "controversiality": 0, "created_utc": 1384796218, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh8zaz", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7c4u", "retrieved_on": 1428609090, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Butrfly9", "author_flair_css_class": null, "author_flair_text": null, "body": "I always leave the dishes on the sink and the toys on the floor when I am too busy to do everything.\n\nFirst thing, take care of your business. Order pizza until it's done. That brings in income and could potentially put your family in a worse situation. The 10 year old can do the laundry and pick out clothes for everyone until your work is caught up. Bribes are ok right now. I know you don't want to, but the alternative may be worse.\n\nAfter work is caught up, then slowly start crisis management on the other things. Kids and husband first. Then roommate. Then roommate's grandmother. ", "controversiality": 0, "created_utc": 1384796372, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh91rs", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609058, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Damn! I have no idea what I'd do with six kids.\n\nWith the two that we have, my SO and I basically rotate, so no one person gets the brunt. Every morning, I take both kids out for a walk to the park for an hour. You could probably do this with six kids without too much hassle? Especially if the 10 year old and 7 year old could help with the other ones. \n\nThis gives my husband an hour to make their lunches, put in and take out a load of laundry, and read the paper. \n\nWhen we get home from work and I pick up the bambinos from daycare/school, he takes them out for a walk for an hour. This gives me time to make dinner and do some cleaning. \n\nOn the weekends, we do the same thing: I take the kids out on Saturday morning so he can sleep in, and he takes the kids out on Sunday morning so I can sleep in and get stuff done.\n\nTry rotating with your husband. Also: you need some help. 6 kids? You need more than 2 adults on that. You can't be a sole caregiver on top of all of this--that's crazy. Lean on people. Tell that friend that you need her to do 4 hours a week, that things are crazy right now and you need help. I know that your SO works 13 hours per day, but he is going to have to do more too (maybe he could take them all out for one full morning or day on the weekend so you can get everything done at home). \n\nNo friends or family? Medicaid can help, and think about the community organizations around you that can help too. Churches, local centres for women. Is there a community centre near you? Find some free activities where you can drop the kids (all of them) for a few hours each week or weekend. \n\nEdit to add: on the weekends, my 5 year old does all the laundry. He freaking loves it, thinks its a game. Set up competitions for the kids on one day per week (\"game day! Cleaning fun day! Whatever\") and give them prizes for whoever cleans the most the quickest without breaking anything. These rewards can be cheap toys or whatever. Put them in teams. ", "controversiality": 0, "created_utc": 1384796397, "distinguished": null, "downs": 0, "edited": 1384796589, "gilded": 0, "id": "cdh926x", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428609053, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly, I'd be a bit harsher with those friends. Why would they step up when they know that you'll just do everything? Stop doing everything for everyone, and you may actually get some help.\n\nI'd call them up and say that in XYZ time (at the end of the month, week, whatever), if you don't get some daily help with him, that he will not have a place to stay at your home any more. Because you can't handle it (you can't). If they know for sure that you won't do everything anymore, maybe these friends of his will actually step up. You have to be firm, and make it sound like the threat of him being out on the street by X date is real. ", "controversiality": 0, "created_utc": 1384796500, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh93vh", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6x97", "retrieved_on": 1428609031, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "blueharpy", "author_flair_css_class": null, "author_flair_text": null, "body": "These are all just ideas. I hope something from the following is helpful. I do NOT want to offend, so if anything doesn't work for you, it's just brainstorming, OK?\n\nEven if you are not religious, consider appealing for help to your local religious groups. IE churches but also Kiwanis, Lion's Club, Rotary. Also Scouts or Guides. Write a short letter and send it/email it to them with your contact info on it. Any of these groups might be able to visit you once, do one task, or send someone a few times, or whatever, but at your level it is all of great benefit to you.\n\nDo you qualify for some kind of meal assistance program? Are there public health workers who can do temporary respite? Do you have some kind of government services office you can do your falling down on the floor of, generating some sympathy votes? ;) I kid, but if there is such an office visiting might be worthwhile.\n\nEverything you don't have to remember, don't. Use charts to track meds. Use timers to remind you to do things. Set alarms to tell you to get ready to go out. If you have a smartphone, use the hell out of the reminders. Use a checklist to make sure everyone gets their teeth and hair brushed, a school lunch and so on.\n\nCrockpot and Once a Month freezer cooking when your helpful friend is around.\n\nBe 110% strict about bedtimes. You all need sleep in this amount of stress. DON'T GET YOURSELF KILLED DRIVING WITHOUT ENOUGH SLEEP.\n\nLaundry: Everyone changes into their PJ's where the laundry baskets are. They sort the laundry into baskets by colour (label it). It may allow you to train the 10 year old to do laundry. Yeah it may be more than you'd like to ask of the 10 year old, but it's well within her abilities. Crisis mode.\n\nMore Laundry: Unless you require it for business purposes, call the dry clean only, and requires ironing stuff \"off limits\" for now. Pick out a week of clothes at a time and make sure everything's there and ready to go, or do the same in advance nightly, to streamline your mornings. Use a laundromat's wash service to get caught up if you can afford it. Try doing one load of laundry per day (in when you get home maybe, or immediately when you wake up?). \n\nI don't know anything about special needs kids and can only say I wish things were easier for everyone. But do they have morning and night time routines? Can/do they brush their own teeth? You have to stop doing for them anything they could do themselves. Re kids and chores... My mom would have us kids working on chores we didn't necessarily enjoy to do but needed to get done (chipping mortar off bricks we were going to reuse, as an example), but everyone was doing what they could, at their pace, AND in one place to supervise.\n\nCleaning: Fly Lady or Unfuck your Habitat. Try doing 15 minutes a day of cleaning as your maximum. With a timer.\n\nThose Who Won't \"DO\" anything: See if you can get them to pick things up on the way over. Or when they do their own grocery runs, or pharmacy runs if trustworthy. Tell them to bring a meal when they visit. These are \"easy\" and don't involve any cleaning or bodily fluids, so you can sometimes get the lazy or germaphobes to do these.\n\nAmazon Prime for diapers and such.\n\nAutomate your banking.\n\nNo idea if this works for you (work at home? work at office?), but consider setting aside say a 2 hour block of the work day, without incoming phone calls or checking emails, just for focusing on backlog. Do it in some order. (Urgency? Age?) Then move on to the needs of the day. \n\nAgain I hope none of it offends and something can help. I wish you well and I hope when your bestie gets home she kicks some ass for you. Hang in there.", "controversiality": 0, "created_utc": 1384796935, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh9axu", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428608939, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "Look into [this website](http://onceamonthmeals.com/). It has many special diet meal plans to look at, if that's a need of yours. More importantly, the entire premise is cooking for a month in a single day and freezing it. Sometimes you have to adapt, but if you marinade a bunch of meat in advance and carefully flash-freeze into bricks, you can easily have three meals a day in an apartment-sized freezer. You're nine, so it might be more like two weeks, but that's still gotta help. \n\nAlso, do what others have suggested and contact your local churches. My father travels constantly for work, a couple weeks here, a few months there. For years he's called ahead to the local churches, regardless of denomination, and found room and board. We've housed people from abusive situations in the middle of the night. There's almost certainly volunteers who help out with the older members of the congregation, so they can just drop by to help you as part of their rotation. Don't feel bad about asking for help when you need it. You can always do what you can later, when you're back on your feet, if you feel you have a debt. ", "controversiality": 0, "created_utc": 1384797147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh9ebb", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7c4u", "retrieved_on": 1428608896, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smartache", "author_flair_css_class": null, "author_flair_text": null, "body": "Roommate needs to figure out something for himself... hire a nurse, or even just a friend or coworker to 'babysit' for himself who can help him out. You have too much on your plate to do everything for him, and I'm upset for you that he expects you to do it.  Put him on speaker phone with a charity group or something and get them to help him out. ", "controversiality": 0, "created_utc": 1384797302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh9gtt", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428608863, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "finnerpeace", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you accidentally got on the shortcut to sainthood. Most of us avoid that road, but sometimes people just get shoved onto it...\n\nYou've gotten lots of good advice, especially 1) find help, especially from religious organizations, humanitarian organizations, reddit helpers, Craigslist, etc  2) IMMEDIATELY get that Medicare application in  3) enlist the kiddos   4)crock-pot/easy meals.\n\nI'll add: YOU CAN DO THIS. Keep up the business; glad you're selling the custom car. Anything \"valuable\" like that, now is the time to grab the value from it via selling it, and use that value to help keep you all sane and afloat. There will always be time and money later to replace those things: not so your sanity! :D You really can do this. Think of all the tsunami moms, widows/wives of absentee husbands, moms in developing countries struggling with all their crap... You guys are the true heroes of the world. No one should be in your shoes, but sometimes it *does* fall to one person to do so much, and you *will* be able to find the strength. It will really pass: just get through it, especially with help! Get that help!\n\nSince you're religious, do pray! With anything that works for you. Here is my favorite prayer I use in times of difficulty:\n\n&gt;O God!  Refresh and gladden my spirit.  Purify my heart.  Illumine my powers.  I lay all my affairs in Thy hand.  Thou art my Guide and my Refuge.  I will no longer be sorrowful and grieved; I will be a happy and joyful being.  O God!  I will no longer be full of anxiety, nor will I let trouble harass me.  I will not dwell on the unpleasant things of life.\n\n&gt;O God!  Thou art more friend to me than I am to myself.  I dedicate myself to Thee, O Lord.  (from the Writings of the Baha'i Faith)\n", "controversiality": 0, "created_utc": 1384798019, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdh9sd2", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428608713, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ktonicd", "author_flair_css_class": null, "author_flair_text": null, "body": "Does he not have any family able to help him so he isn't so dependent on you? How long is he expected to be out of commission? ", "controversiality": 0, "created_utc": 1384799991, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhanrd", "link_id": "t3_1qwapd", "parent_id": "t1_cdh70m1", "retrieved_on": 1428608307, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "scoutycat", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there a church or community group such as the salvation army near by that can help?  There must be some kind of supports in your area, if not the gov't.   Reach out, you need it.  ", "controversiality": 0, "created_utc": 1384800343, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhatg0", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428608233, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Nobody at all. The cast on the right arm will come off next Thursday, but he has to keep it wrapped until the surgical incisions totally heal. His weight limit will be really low, but he'll be able to use that arm again starting then. His other arm will get the cast off the following week, but the mechanical brace that he has on will have to stay for a couple of months, so that arm won't be useable. Once the casts come off, he can feed himself and use the bathroom by himself. He won't be able to do much more until he starts building some strength back up.\n\nFor anyone wondering, he fell off the back of his truck, dislocated both shoulders, shattered both elbows, dislocated both elbows, broke the radius on both sides, and the ulna on the left. He had to have surgery on his right arm to put screws in the bone to hold it together, as well as set the breaks. He had to have surgery on the left  to replace part of the elbow joint, stabilize the bone, and decompress the radius so they could set it properly. Oh, and an additional surgery on the left to repair the ligament which was torn almost completely in half. ", "controversiality": 0, "created_utc": 1384800519, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhaw9j", "link_id": "t3_1qwapd", "parent_id": "t1_cdhanrd", "retrieved_on": 1428608196, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gingerfied", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! LDS churches are great for that. As a social worker I always loved it when clients connected with that church. They really take care of people. And there are probably missionaries in your area that would help you. Service is part of their mission. ", "controversiality": 0, "created_utc": 1384801259, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhb89d", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6lmn", "retrieved_on": 1428608041, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gingerfied", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you tried enrolling your special needs kids in services like SSI? And maybe DDD if they have developmental disabilities.  One if those programs might be able to provide some case aid hours as well as some funding.", "controversiality": 0, "created_utc": 1384801415, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhbas3", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428608008, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I never thought I would say this, but you should read about how the Duggars run their family. All the kids help, have their chores, cook, help with the littler ones. Everyone needs to do their part, it's not fair for it to all be on you. Agreed on the crockpot- $10 pork shoulder will make a fantastic pulled pork that can be put on sandwiches and tacos. ", "controversiality": 0, "created_utc": 1384802144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhbmr8", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428607853, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dementedpixie", "author_flair_css_class": null, "author_flair_text": null, "body": "You're too far for me to help directly, but I did a little google searching for you re: the laundry situation.  ProClean has 8 Flint locations and does coin laundry for $1.40/lb.  Clio Road Coin said they don't weight, but they evaluate by bag and depending on how many bags you have, they tend to charge $20-$25. Both locations are open late, so either roommate can take a nap for an hour while the older kids are in school for you to run and drop off, or your husband can watch him for a few minutes.  It's not a permanent fix, but at least it's something.", "controversiality": 0, "created_utc": 1384803040, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhc1lt", "link_id": "t3_1qwapd", "parent_id": "t1_cdh895t", "retrieved_on": 1428607661, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384804039, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhcilx", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428607440, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "racooney", "author_flair_css_class": "orange", "author_flair_text": "Mom to a 5 y/o girl, 2 y/0 boy", "body": "Absolutely this, my church does lots of work with the neighborhood even if the people aren't members, and I would gladly volunteer to help someone like you if my church brought the matter to the congregation asking for help.", "controversiality": 0, "created_utc": 1384804455, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhcpl0", "link_id": "t3_1qwapd", "parent_id": "t1_cdhcilx", "retrieved_on": 1428607350, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "Was going to say church groups for sure! Even if it's a one time deal it will help out a lot!", "controversiality": 0, "created_utc": 1384805225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhd2jj", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6dku", "retrieved_on": 1428607185, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "coffeeshopgirl7", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm going to try to answer the question you asked and not give you a bunch of random advice like you haven't already thought of it. \n\nThings you can let slide:\n\nMost of the house cleaning. As long as it's not dangerous or going to make someone sick, let it be. Leave the floors, dusting, windows, stove top, microwave, bed-making, whatever. You'll get to it when you can. For now just make sure you have clothes to wear and a functionally clean kitchen. Period. \n\nSorting laundry. \nNearly all colors can be washed together on cold with no adverse effects. Don't worry about microsorting every color/delicate/water temp. Just throw it in and wash. Also, if it ain't dirty don't clean it. Jeans can be worn for awhile before they are worthy of washing. Towels and washcloths can be hung up and reused a few times. Don't make more work for yourself. \n\n3 squares a day. \nI'm not saying don't feed your kids! Just don't prepare more than one meal per day. Stock fruit, yogurt, cheese, nuts, crackers, pepperoni, anything that can be eaten with little to no preparation, and let them graze. Try to keep it healthy if possible, but don't beat yourself up over poptarts and bologna sandwiches. You'll get their nutrition under control when you can. For now, they need you to be sane, not June Cleaver. When you cook, make sure it's fast and easy and don't you fret over paper plates. Let someone else save the planet, you are in crisis management mode! \n\nIf it's not necessary, don't do it. One day things will be better and you can get back on track, but for now you have to survive. These might not be mom of the year tips, but if you can get through this you deserve that trophy anyway. Just know that you can do this and the bad times can't last forever. \n\nOn a side note, your 10 year old can handle much more than you realize. No daughter grows up wishing she had helped her mom LESS. Just let her know she's your right hand woman, and don't come down on her if she drops the ball. She will rise to the occasion and be your greatest ally. The sense of responsibility and independence she gains from helping you during this time will carry her through life. Don't sell her short, she's a little woman. \n\nI'll pray for you. You are truly a survivor. ", "controversiality": 0, "created_utc": 1384806146, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhdhws", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428606983, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LordMomoYourMomoness", "author_flair_css_class": null, "author_flair_text": null, "body": "Great great idea. Awesome thing for crock pot cooking is they make really great, cheap plastic liners for them, which means no dishes to clean if you're using paper plates etc. They're a godsend.\n\nAlso, OP,  you are superwoman. Wish I knew of a way to help, and I mean that. ", "controversiality": 0, "created_utc": 1384809529, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhf3vk", "link_id": "t3_1qwapd", "parent_id": "t1_cdh61z8", "retrieved_on": 1428606136, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My house cleaning suffers , ill b damned if I don't take a quiet bath after my daughter goes to bed . The house cAn wait ", "controversiality": 0, "created_utc": 1384809785, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhf8co", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428606078, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaett", "author_flair_css_class": "purple", "author_flair_text": "a 4 year old boogie boy", "body": "i think the one in our neighborhood got a little disgruntled when they realized we weren't going to be joining... ever.  but still, having the house clean for a little while was so refreshing.", "controversiality": 0, "created_utc": 1384810883, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfriv", "link_id": "t3_1qwapd", "parent_id": "t1_cdhb89d", "retrieved_on": 1428605831, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "redditerrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "I would contact churches/community groups in your area.  Let them know your situation and your needs.  People will help with time or money.  Perhaps groups dedicated to causes that impact your family directly.\n\nLaundry - maybe general guidelines to make sure that what ends up in the laundry is actually in need of laundering.\n\nMeals - cook in bulk.  I'm sure you do to some extent with that many people, but whatever you make, triple it, quadruple it, and freeze it.  Stew, chili, lasagna, etc.  /r/EatCheapAndHealthy is good for ideas.\n\nCleaning - strict rules on cleaning up.  There are too many people in your house to let things be put wherever someone wants them.  When you come into the house, immediately put things away, the opposite of when you get ready to leave and gather stuff up.  This one is more for the kids than you, less clutter makes it easier to keep the house clean.", "controversiality": 0, "created_utc": 1384811492, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhg22x", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428605693, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "caitlinriley", "author_flair_css_class": "orange", "author_flair_text": "Hockey Mom", "body": "You have your plate full.  Ask friends/family/church/coworkers/neighbors for a hand.  They won't judge you if they know what you're dealing with.", "controversiality": 0, "created_utc": 1384820408, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhk2i0", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6xgr", "retrieved_on": 1428603631, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "supcaci", "author_flair_css_class": "green", "author_flair_text": "mom since 6/4/13", "body": "Seconded!", "controversiality": 0, "created_utc": 1384824943, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhm1v8", "link_id": "t3_1qwapd", "parent_id": "t1_cdh7acw", "retrieved_on": 1428602707, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "othersomethings", "author_flair_css_class": "brown", "author_flair_text": "Girl Boy Girl", "body": "I'm so sorry you're in this position. My best recommendations are just parroting what others have already said, really.\nI wish I had a shortcut for you on the dishes or laundry - I really don't. \n\nThe only thing I DO know that MIGHT help...big might because I just don't know what your schedule looks like, is using the flylady \"5 minutes\" rule. \n\nSet a timer for 5 minutes, and do a task. It can be just moving a load of laundry, it can be wiping down all the surfaces in the bathroom, it can be doing a whirlwind \"pickup\" of a specific room or maybe the kitchen table or your desk...But the principle is basically \"you can do anything in 5 minutes.\"  When the timer goes off, stop and move on with your day. \n\nOk, [I just read the website](http://www.flylady.net/d/getting-started/) and it's actually the \"15 minute\" rule but I think we can do babysteps of 5 minutes in your case, lol! I have done 5, 10, 15 minute whirlwind tasks, and it really is amazing when you view those things in smaller time increments instead of \"I'm never going to get all this laundry done!!!\" as well as feeling the freedom to stop when the timer goes off. Maybe it didn't ALL get done. But SOMETHING got done, and that something was worth it.\n\nWith all that being said...a church \"family\" can be more helpful than a blood family sometimes. It might be a worthy investment, if you can swing 2 hours on a sunday morning (yes, with kids in tow! find a church with a good and safe childrens ministry) and an hour or two for a midweek (wednesday, 7pm type of thing) meeting or gathering, to get to know people and such, a good church will be happy to step in and help. (I speak from experience.) Not that you have all this free time, but if you all go it might be feasible.  \n\nAlso, I took a peek at the /r/flint group and it doesn't look super busy but maybe talking to some folks in there and seeing if they can either volunteer or know of resources for volunteering...? \n\nMaybe with your business you could \"hire\" an intern for a lot of your grunt work a few hours a week? \n\nCrockpot meals are the way I'd go. http://allrecipes.com/recipes/everyday-cooking/slow-cooker/ I'd also look in the freezer section at walmart, sometimes you can pick up family sized bags of \"ready to throw in the crockpot\" meals. Set it on low, and forget it til dinner time. \n ", "controversiality": 0, "created_utc": 1384824949, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhm1yd", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428602705, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "minifrancais", "author_flair_css_class": null, "author_flair_text": null, "body": "Someone else may have asked this, but if he was injured at work, is he not entitled to workman's comp? I used to be a social worker at a hospital and used to set up home care for workman's comp cases all the time. If that is so, then he may be entitled to get some help, since he is not able to do what is called \"activities of daily living\". Workmans comp should cover that shit.", "controversiality": 0, "created_utc": 1384827795, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnda6", "link_id": "t3_1qwapd", "parent_id": "t1_cdhaw9j", "retrieved_on": 1428602092, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "_jillybean", "author_flair_css_class": null, "author_flair_text": null, "body": "Gotta love the RS sisters!\nI seriously don't know what I would do without the support system of the Church.", "controversiality": 0, "created_utc": 1384828070, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnhsz", "link_id": "t3_1qwapd", "parent_id": "t1_cdh6dku", "retrieved_on": 1428602033, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MetaMomma", "author_flair_css_class": null, "author_flair_text": null, "body": "Jesus Christ, where do you live? If it's anywhere within two hours of me I will seriously come and help you out with cleaning and such.", "controversiality": 0, "created_utc": 1384830067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhoekw", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428601610, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MetaMomma", "author_flair_css_class": null, "author_flair_text": null, "body": "Damn it, never mind. I see now that you live in Michigan. I was crossing my fingers that you would say IL or MO. \n\nI second what everyone else says about calling up some churches and seeing what they can do to give you some help. You'd be surprised what they are willing to do to give you a leg up. Although in Flint, their resources may be a bit more tapped out than churches in my area would. ", "controversiality": 0, "created_utc": 1384830501, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdholib", "link_id": "t3_1qwapd", "parent_id": "t1_cdhoekw", "retrieved_on": 1428601520, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "liatris", "author_flair_css_class": null, "author_flair_text": null, "body": "You might get the book [Once a Month Cooking](http://search.half.ebay.com/once-a-month-cooking_W0QQ_trksidZp3030Q2em1446Q2el2686QQmZbooks) it's about 75 cents on half.com. This cooking method allows you to prepare either a month or two weeks worth of main dishes at once and freeze them. The copy I have includes to choices of one month cycle of meals and three choices of two week cycles of food. Each menu cycle gives you a menu calender that shows the month's entrees at a glance, a shopping list, a list of staples the menu assumes you have, and a list of containers you ill need for freezing. There is also step by step instructions for preparing the recipes in sequence to maximum efficiency. For example some of the steps you prepare all at once like chopping up the vegetables needed. The recipes are arranged in the order you prepare them. \n\n", "controversiality": 0, "created_utc": 1384858437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhvr1d", "link_id": "t3_1qwapd", "parent_id": "t1_cdh88a8", "retrieved_on": 1428598086, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "You could use a social worker to help you identify resources. I can see two routes to access here. One is your husband and roommate - their medical providers may be able to refer you to a sw. The other is 2 kids under 3yo - you call can call early intervention to do an assessment if either is delayed in any area, and once they are involved, they can hook you up with resources. ", "controversiality": 0, "created_utc": 1384871301, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhy9ni", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428596886, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "We are already so surrounded by social workers that it's ridiculous. We have EarlyOn (basically home based Early Intervention) that comes in twice a week. My older son has a crisis counselor that comes in usually three days a week to see him at home. There really isn't much that any of them can offer, as they put it, everyone in the area that offers free or reduced cost help of any kind is already spread so thin that we wouldn't get much from them. ", "controversiality": 0, "created_utc": 1384872087, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhyic6", "link_id": "t3_1qwapd", "parent_id": "t1_cdhy9ni", "retrieved_on": 1428596773, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "WigglyBaby", "author_flair_css_class": "green", "author_flair_text": "Mom to 2.5 year old girl", "body": "Girl scouts? the older groups?  Some one (or a troup) might be super willing to volunteer some evenings or weekends.  We totally would have done that for someone in your situation.  The short term goal is to get through the major healing phase of your roomie.", "controversiality": 0, "created_utc": 1384900619, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdibcxe", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428590686, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomanyees", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh. Sorry to hear that. :(", "controversiality": 0, "created_utc": 1384910389, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdifm9g", "link_id": "t3_1qwapd", "parent_id": "t1_cdhyic6", "retrieved_on": 1428588627, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "farmererin", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there a council on aging in your area? Call them and see if they have a shuttle, both to get roommate to his appointments, and if she's functional enough, the grandmother to the store.  \nFor most of your meals, you could probably enlist the 6&amp;7 year olds, even with their medical issues. Even the 4 year old in a pinch could probably put one slice of deli meat and one slice of cheese on a piece of bread- especially if the roommate stands there and coaches. Hard boil up a ton of eggs, and they can grab them out of the fridge and pass them out while the oldest girl makes some PB&amp;Js and you've got breakfast covered. It might not be the most balanced meals, but a week or 2 of improvised cooking won't kill them. Something like veggie burgers can be microwaved en masse and slapped on a bun in less than 5 minutes (maybe 10 for that many).  \nTell your husband that it sucks, but he has to do X,Y or Z. Even after a long day, he can probably muster up the energy to throw a load of wash in and start the machine, and flip it into the dryer in the morning before he heads out the door. He could probably also make a half dozen cold cut sandwiches in relatively little time in the morning or something easy like that.", "controversiality": 0, "created_utc": 1385000174, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdjb9hl", "link_id": "t3_1qwapd", "parent_id": "t3_1qwapd", "retrieved_on": 1428573483, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}