{"submission": {"author": "Lablonderouge", "author_created_utc": 1378181953, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_czptj", "created_utc": 1384801913, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1qwxxn/tired_of_the_stigma_around_formula/", "gilded": 0, "id": "1qwxxn", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 148, "over_18": false, "permalink": "/r/Mommit/comments/1qwxxn/tired_of_the_stigma_around_formula/", "retrieved_on": 1411578369, "score": 40, "secure_media_embed": {}, "selftext": "I had a very hard labor (30+ hours) which ended in me and the baby getting sepsis, me getting a c-section and him in the NICU for a few days.  As a result, my breast milk never fully came in.  The first month I was able to give him some milk but had to supplement with formula from the beginning.  I tried everything-lactation specialists (2!), industrial-grade pump, hand-expressing and herbal supplements.  It was just impossible…..now I keep hearing from other moms about how \"breast milk is the ONLY way to go\" and how \"formula is poison\" and it makes me SO angry……I had no choice and feel bad enough!!!  What do you other mommies think about this….?", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Tired of the stigma around formula...", "url": "http://www.reddit.com/r/Mommit/comments/1qwxxn/tired_of_the_stigma_around_formula/", "user_reports": []}, "comments": [{"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry people are giving you a hard time about this. My milk came in fine, but it didn't come out fast enough for my son. He latched just fine, but would unlatch after a minute or two and scream until we gave him a bottle. It was just a taste of what was to come; despite the fact that I pumped religiously, I could not keep up with him and had to use formula by the time he was 6 weeks old. By 3 months, he was drinking literally over twice what the 'average' baby his size was drinking. (We couldn't go by age; by 3 months he was in 6-9 month clothes. So we went by size.) We'd been giving him vitamins since he was born (you know, the vitamin D stuff), and added more - other - vitamins on the recommendation of our pediatrician at two months. To no avail! The only thing left to do was introduce solid foods early and hope that helped him, because drinking over 100 ounces of formula/breast milk a day at 3 months is really not what's supposed to be happening. I gave up pumping entirely shortly after.\n\nTo sum up, my son will be three in January. He is currently in 4T, and that size just barely fits him. He can lift an entire gallon of liquid with one hand. His speech was slightly delayed, but it's taken off at light speed recently and his comprehension of language has always been a little ahead, despite the fact that he wasn't vocal. He's never been seriously sick in his life; he's had three or four colds and gotten a stomach bug that lasted all of 6 hours twice. In his entire life. He has no food allergies, no weak stomach, is not a picky eater, and does not require glasses.\n\nI couldn't tell you a single thing formula did to my son that was negative, unless you want to blame the slight asthma he seems to get when he gets colds on formula. (Which would be silly; my husband has asthma, and so does his mother.) In fact, formula probably saved us, since without it all I would have had the option of giving him at *6 weeks* would have been solid foods. Besides that, going straight to bottles allowed my husband to create a closer bond with our son immediately.\n\nBreast milk has its benefits; I can't deny that. But formula isn't going to hurt your son. Anyone giving you a hard time, with all you went through, is more concerned about being superior from their standards than the health of your child. Ignore them... or come up with some really stinging comebacks and use them all the time. (Not being someone who takes the high road all the time, I vote for option number two.)", "controversiality": 0, "created_utc": 1384803160, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhc3oe", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607634, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "Formula has a great purpose and your story is why. Without it some babies would starve and in other cases moms couldn't be good moms. Ppl don't think about the benefits of formula In some situations.\n\nIf it help s I have gotten the exact opposite for bfing past 6mo. Including that I'm damaging my babies emotional health etc.\n\nPpl seem to have a special skill for making us feel like we're wrong regardless. It sounds like you are really committed to your kid (not sure I would have tried all that) and that will do more than any amount of bfing ever could.", "controversiality": 0, "created_utc": 1384803537, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhca06", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607552, "score": 42, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alekanakalea", "author_flair_css_class": "blue", "author_flair_text": "12 month old little cuddle butt", "body": "I totally understand. I was in labor for 26 hours and I was so totally wiped out that I didn't immediately try to get my son to breastfeed. It might have been a few hours before we tried and when when we did, he just did *not* want to latch. I began supplementing formula there in the hospital because the poor little guy was just so hungry. I pumped breastmilk for maybe two weeks before going straight to formula. He's been sick once in his 9 months with a little viral thing like a cold. He started crawling at six months and he's showing signs of wanting to walk now. Long story short, feed your baby! I love the idea behind breastfeeding. I think it's beautiful and all of that, but formula is great too. There have been a lot of improvements in formula over the years with addition of vitamin D and DHA. You're a great mama feeding her baby!", "controversiality": 0, "created_utc": 1384803957, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhch6z", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607459, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I would just say \"well would you like to donate some? It's either that or the baby starve, right? Got any other amazing suggestions?!\"  \nI had terrible terrible guilt for a year when I had to come to terms with not being able to breastfeed. Anxiety, depression, the first year of her life was filled with so many dark moments for me already and then knowing I couldn't give her the one thing I was supposed to! I still hate myself. But she is so happy, very much thriving and ahead in almost all areas of development. So when the awkward questions come, I just say \"we do what is best for our family\". If they want the long horrible story, they're welcome to listen and feel like shit after. ", "controversiality": 0, "created_utc": 1384804178, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhckxl", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607410, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Are people actually judging you, or are you hearing these things out in the ether and feeling judged, even though no one actually thinks less of you?  Everything we do as parents is \"wrong\" to someone else - formula/breastmilk is just the first big one a lot of us encounter. An important lesson I've learned is that a lot of the things that make me *feel* judged or like I'm not doing things right are more about how *I* feel than how others feel.  In the end, the most important things: is your child happy and healthy? growing?  do you love her? \n\nPeople aren't trying to make you feel bad.  They're not even judging you.  A lot of times, these things are often about self motivation and psyching people up (a point to consider: breastfeeding is really fucking hard.  Sometimes, you need to reinforce your decision to do it with stuff that may come across to others as judgemental - because you need any shred of justification to keep going).  And on the flip side of the coin are all those women breastfeeding who catch hell from society about breastfeeding in public, or why are they still doing it after 6 months, or omg it's so gross that people actually breastfeed kids *who can ask for it!*  My point? For any stupid \"message\" you hear about how formula is wrong, there is some poor BFing woman feeling equally harrassed and judged over her decision to breastfeed.  \n\nI'm sorry it makes you feel bad. I really hope it doesn't continue to make you feel bad, because right now, from what I gather, you have a happy healthy baby who you are showering with love and care.  All this other stuff is just mommy wars shit (seriously, if not formula, it's \"crying it out\" vs bedsharing, and elimination communication vs late toilet training, and rice cereal vs baby led solids, and a million other things)\n\n", "controversiality": 0, "created_utc": 1384804792, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhcvb7", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607276, "score": 41, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DarthLeia2", "author_flair_css_class": "purple", "author_flair_text": "Ashelia (5yrs), Emrys (2yrs), and Roman (newborn)", "body": "I think it's ridiculous what moms do to each other. I chose not to breastfeed. I have no interest in it whatsoever. You better believe I've been judged for that (by about everyone except my kids' doctor. Go figure). Both my kids are happy and healthy and that's all that matters. The longer you're a mom, the easier it will be to let these things roll off your back. ", "controversiality": 0, "created_utc": 1384805706, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhdaoz", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607076, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "4everInYogaPants", "author_flair_css_class": null, "author_flair_text": null, "body": "Just ignore them, haters gonna hate. ", "controversiality": 0, "created_utc": 1384805868, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhddcf", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428607042, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Knitkit", "author_flair_css_class": null, "author_flair_text": null, "body": "Its tough to formula feed in this day and age.  With both my children,  I BF'd through about 6 weeks and then switched to formula for my own sanity - my first was a collicky monster until I gave in and tried formula, and with my second I couldn't keep up with pumping and returning to work.  Both of my children are bright and healthy, with no allergies or health issues.  \n\nDon't sweat it.  The most beneficial time for breast milk is in the first few weeks.  You did what you could.  Now go on and enjoy the benefits of formula feeding.  \n\nIn the US the majority of us who are parents now were formula fed, and our parents before us were too.  Breast feeding was not the norm.  We survived.  Maybe we all would have been hyper intelligent super healthy geniuses, but more likely we'd have all turned out just the way we did. \n\nBreast milk IS NOT the only way to go. \n", "controversiality": 0, "created_utc": 1384806144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhdhw8", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606983, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Even if you HAD a choice and chose formula - it's a legitimate choice that has health benefits as well.  There's a lot of myth and prejudice around breastfeeding, and there's a lot of pressure to keep women barefoot and breastfeeding in the home.  Just rock on with your good childcare and get that baby fed!", "controversiality": 0, "created_utc": 1384806731, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhdrsi", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606855, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Gillybilly", "author_flair_css_class": "lightcoral", "author_flair_text": "Mum of two! ", "body": "You are hanging around with the wrong people! You need to surround yourself with people who are supportive and encouraging. \n\nSounds to me like you've been through a lot and you are doing the best for your baby! ", "controversiality": 0, "created_utc": 1384807543, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhe5qf", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606641, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I had to supplement with formula too. I got sass about it but hey, my little girl is healthy and beautiful so they can just shut up.", "controversiality": 0, "created_utc": 1384807587, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhe6k6", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606630, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kater_tot", "author_flair_css_class": null, "author_flair_text": null, "body": "The thing is, you didn't have a choice; you're in the situation formula was created for. Don't sweat it- in a few years it won't even matter.\nMy thoughts, since you asked: breastfeeding vs formula makes me super angry as well! I may be more on the breastfeeding side, but closing your eyes to the benefits of formula for those who need it is just stupid. one reason people don't like formula is because these companies really have done some evil stuff in the past- supplying it to people who don't need it, including women in developing countries who don't even have a safe source of drinking water to mix it with. On top of that there is a huge generational gap of ignorance when it comes to breastfeeding, including doctors and pediatricians. Had I listened to the ped when he said 'a tongue tie is no big deal' I definitely wouldn't have made it past the first month. Hang around a breastfeeding forum and you'll see countless stories of moms who were sabotaged by ignorance, unnecessarily told to pump and dump, or badgered by well meaning family members who only know formula, and yes, it's easy to jump to conclusions when someone says they just couldn't do it. And nowadays (especially online!) people are quick to give their two cents without considering the feelings of who they're talking to. The people saying formula is poison are just as ignorant as anyone else on the internet.", "controversiality": 0, "created_utc": 1384808482, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhelzn", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606369, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaiserverbalbyrnes", "author_flair_css_class": null, "author_flair_text": null, "body": "Get used to it, parents love judging other parents' parenting choices. You will never be able to do anything that will please everyone. To make you feel better about everything, check out this article, [The Case Against Breast-Feeding](http://www.theatlantic.com/magazine/archive/2009/04/the-case-against-breast-feeding/307311/)", "controversiality": 0, "created_utc": 1384809152, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhexep", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606220, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bear_sheriff", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm due with our first in less than two months, and it's going to be a planned c-section (figured I could get some insight on what's to come in /r/Mommit ), and this is my biggest fear. I'm trying to set myself up for failure so I'm emotionally ready for it, but I'm more worried about the judgement of others than of actually having to use formula if I can't produce enough. But what /u/forwardseat said is true, there are so many debates in this mom gig, if they don't judge me for whatever way I feed my child, they'll find something else. I'm already exhausted over it :/", "controversiality": 0, "created_utc": 1384809483, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhf31p", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428606147, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; People aren't trying to make you feel bad. They're not even judging you.\n\nWhen it comes to most things, I agree with you, but there is a big \"breast is best\" campaign out there that overtly says formula is sub-par nutrition and parents who [formula feed are lazy](http://www.thealphaparent.com/2013/01/how-to-spot-defensive-formula-feeder.html).  Not all of that directly impugns women who formula feed (whether by choice or necessity), but there is a significant undercurrent of that, [down](http://www.healthpolicysolutions.org/2012/09/19/hospital-support-limits-on-formula-key-to-breastfeeding-success/) to [deliberately](http://www.nytimes.com/2012/10/16/health/hospitals-ditch-formula-samples-to-promote-breast-feeding.html?_r=0) making formula harder to access for new mothers.\n\nAnd they will justify it by saying they are just trying to support breastfeeding.  If BF'ing is so great, you don't need to put me down to get others to do it.  (Not \"you\" personally.)", "controversiality": 0, "created_utc": 1384809961, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfbgd", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhcvb7", "retrieved_on": 1428606039, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I say fuck the boobie bullies.\n\nI didn't breastfeed either..I had several issues as well and at first, I felt tremedous guilt because I couldn't breastfeed. I didn't have a lot of friends back then so I relied on a parenting msg board for support. But t hey turned around and attacked me for not breastfeeding. One even told me that she was going to use my ISP# to find out where I lived so she could come to my place of work and stage a nurse-in with her army of militant breastfeeders. Another person told me her son would be \"chillin wid his millins\" while mine flipped burgers at McDonald's--because I didn't breastfeed and she did.\n\nIF you can breastfeed and you want to do so, I say more power to you. If you can't, then don't let the boobie bullies get you down. :)", "controversiality": 0, "created_utc": 1384810233, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfg9n", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428605977, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I think I would have breast fed had it been easier , I had a long labour as well I bled like three liters my milk never full came in due to anemia , my daughter was top lip tied and could not get a good latch plus my booms were huge compared to her little mouth , I had a hard time with it . But honestly I tell\nOther moms who judge me to STFU ! Every mom\nDoes what they think is best for their family , heck my mom had a masters in nursing in labour and delivery and has her Lactation course , and I still managed to formula feed . If your daughter is happy and healthy you should not ever feel ashamed fir doing what is best .", "controversiality": 0, "created_utc": 1384810402, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfj8a", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428605938, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Holy crap what is wrong with those women?! I'm so sorry you had to go through that, the self imposed guilt is enough why are people so vicious! ", "controversiality": 0, "created_utc": 1384810617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfmvp", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfg9n", "retrieved_on": 1428605891, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "redditerrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "I get it from the other side.  I breastfeed and have been very luck that, in our 10.5 months, we have never had any issues with it.  But, I have had some people be so pro-BF and supportive that it was a little weird.  I think of this issue like any other parenting decision.  To some you are right, to some you are wrong, but none really know your life.  \n\nHave you ever looked at an adult and thought, \"that guy was obviously breastfed\"?  Nope, just one of the many, many, many variables that make up the first few years.  You tried, you got some milk into your baby, and you fed your baby.  You didn't fail at anything.  Sometimes our bodies don't cooperate with our plans (all c-section moms know that).  ", "controversiality": 0, "created_utc": 1384810828, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfqk8", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428605842, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MojoBlue", "author_flair_css_class": null, "author_flair_text": null, "body": "This is very big now because *still* a lot of women choose to straight formula feed without even considering breast feeding. Mainly because they view it as something poor people do. I've seen this a lot in certain cultures. And with more evidence that BF'ing is best, things are now strongly swinging that way, in hopes of reaching as many people in all different cultures etc etc. ", "controversiality": 0, "created_utc": 1384810854, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfr09", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfbgd", "retrieved_on": 1428605838, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "I don't know..it was really weird. It was like they went from being supportive and friendly to all backstabby and jumping on me for not being crunchy enough.\n\n", "controversiality": 0, "created_utc": 1384810856, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfr1e", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfmvp", "retrieved_on": 1428605836, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "redditerrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that is the key.  People don't stop saying stupid things, you just get used to ignoring it.", "controversiality": 0, "created_utc": 1384810912, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfs2e", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhdaoz", "retrieved_on": 1428605823, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Mainly because they view it as something poor people do\n\nThanks for being a great example of the judgment.  Women - including me - couldn't POSSIBLY be likely to have valid reasons to choose formula, they just think nursing is something poor people do, amirite?  Clearly they just don't know or care what would be best for their child.  Stupid, are they?  Because they didn't do what you feel is clearly best (but may not actually be best for their family).\n\nYou are the problem that is being complained about.  ", "controversiality": 0, "created_utc": 1384811082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfv23", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfr09", "retrieved_on": 1428605784, "score": -14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Aa_is_for_Aardvark", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you elaborate on how breast feeding past 6 months would damage your child's emotional health? I'm having a crap day and could sure use the laugh.", "controversiality": 0, "created_utc": 1384811095, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhfvad", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhca06", "retrieved_on": 1428605782, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "Lol the person was grasping at straws. When I asked how the answer was \"well it's creepy if they can ask for it\". I personally don't know any 6mo old's that talk. But I assume the actual answer was that it creeped the adult out and he was projecting that onto the baby.", "controversiality": 0, "created_utc": 1384811833, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhg7sj", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfvad", "retrieved_on": 1428605619, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah but how many people do you know like that in actual real life?  \n\nI've noticed in a lot of conversations about this, when it's pointed out that *maybe* a woman had inadequate support in the beginning or was the \"victim\" of bad hospital policies (nurses saying you need to use formula because you're not making milk yet, even though it's only day 1, that sort of thing), people can take that as some kind of attack on their experience or being judged, when it's meant to just be a point of conversation.  For breastfeeding proponents, this can be a hard line to walk - because educating about things like \"cluster feeding doesn't mean you have a supply problem\" also risks upsetting women who ran into that and started supplementing.  And people can get defensive about stuff that isn't directed at them - largely because an insane amount of pressure is put onto women to do everything exactly right or they're going to screw up their kids forever.  \n\nThe two links you posted about limiting formula access in the hospital, though, are not about judging mothers - it's about very real, measurable benefits to public health when it comes to breastfeeding, and trying to get hospitals to have policies that support that rather than undermining. I know for a stressed parent that wants formula for whatever reason, it sucks and feels judgey, but so many women who wanted to breastfeed have been undermined in our culture by nurses pushing formula (\"oh but your milk isn't in yet!\" or whatever).  I think our culture really has a way to go to find the proper balance between encouraging and supporting breastfeeding (making sure hospital practices aren't sabotaging new mothers), and not making formula moms feel awful about themselves.  It's true that in a lot of cases that balance hasn't been struck.  But I really and truly think most of it is not personal, and that to some extent we allow ourselves to take things personally and feel judged when we shouldn't.\n\nFor a long time here, the cultural norm has not been breastfeeding. As a result, most of us who do face real lack of support problems: mothers and grandmothers who question our supply and freak us out, close family acting like you're crazy for BFing past three weeks or whatever arbitrary number they have in mind, random strangers giving us dirty looks while we fumble with a nursing cover, friends who ask when we're starting formula if we dare rant about pumping 6 times a day because of a supply flux, aunties asking why we don't buy baby milk from the store because \"he's so small,\" etc.  All that is still really, really, really pervasive.  I think there's some lactivist types, and public health types, who may be too gung ho to try and swing the pendulum the other way.  But there's a point at which, in any parenting debate, you can either allow yourself to feel bad about stuff beyond your control, or you can flip the bird to it and go on your merry way, you know?\n\n\n", "controversiality": 0, "created_utc": 1384811867, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhg8de", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfbgd", "retrieved_on": 1428605613, "score": 30, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Aa_is_for_Aardvark", "author_flair_css_class": null, "author_flair_text": null, "body": "I think I'd run out of my house if a 6mo spoke to me. ", "controversiality": 0, "created_utc": 1384811940, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhg9lq", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhg7sj", "retrieved_on": 1428605597, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I know a few, and some of them have popped up in just this thread.  What happens to me, what people say to me, whether on the internet or on the street, is my real life and things I really hear.  Whether you excuse it or not.  \n\nTaking away resources doesn't count as judgment to you?\n\nI think people should probably not take you as a sound commenter on this question.  You seem inclined to make excuses and to redirect back to what's hard for you.  [Edit, and to the shamey \"breast is best\" meme].  That's not helpful to OP.", "controversiality": 0, "created_utc": 1384812033, "distinguished": null, "downs": 0, "edited": 1384812225, "gilded": 0, "id": "cdhgb4q", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhg8de", "retrieved_on": 1428605576, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not trying to excuse it - I just think that sometimes it's easy to take things personally when it's not meant that way, or it's coming from someone who doesn't know the situation details.  And I also think that this goes on in every single facet of parenting - so there's a point at which we have to decide how upset we want to get about stuff.  \n\nThere's a list of things a mile long of things some people think I'm doing wrong.  For a while that would make me anxious or defensive, till I realized that it seriously doesn't matter.  The only way to get rid of it (whether it's about formula or any of the other things people get het up about) is to call off the mommy wars completely.  And in a world driven by DATA! and RESEARCH! and YOUR KID WILL NOT GET INTO COLLEGE AND WILL BE A FAILURE IF YOU DON'T FEED HIM BROCCOLI BEFORE HE'S A YEAR OLD! I don't think it's going to happen.  \n\nEither way - take heart, you're doing great :)  Once you get off of formula, someone somewhere will flare their nostrils at you for giving the kids ice cream before they're five or planting them in front of the tv long enough to do dishes.  It's all OK, despite whatever crazy you hear :)", "controversiality": 0, "created_utc": 1384812397, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhggz9", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgb4q", "retrieved_on": 1428605500, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FrancisScottMcFuller", "author_flair_css_class": null, "author_flair_text": null, "body": "I never undrstood why moms who formula feed always have a long story on how breastfeeding didnt work out. Ladies, you don't need to explain yourself to anyone, even if you just simply didn't want to breastfeed cuz its a pain in the ass that's your decision and no one else's business. ", "controversiality": 0, "created_utc": 1384812479, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhgiak", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428605483, "score": 24, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds to me like you haven't walked this road, so no offense - I think you should do more listening and less telling us poor, stupid formula feeding families what to think or feel about what people say to us.\n\n:)", "controversiality": 0, "created_utc": 1384812500, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhgim7", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhggz9", "retrieved_on": 1428605480, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "This is strong evidence that the internet needs to die, I think.", "controversiality": 0, "created_utc": 1384812504, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhgioi", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfg9n", "retrieved_on": 1428605478, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "OK.  That's fair.  \n\nI get you can't tell people how to feel or what to think.  Just pointing out that *everybody* gets shit from somewhere, even the breastfeeders.  And that we all have choices in how to react to it.  I never called anybody poor or stupid, so not sure why you're directing that at me. :)", "controversiality": 0, "created_utc": 1384812678, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhgli1", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgim7", "retrieved_on": 1428605441, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "If you want to start another thread about the criticisms BF'ers face, go for it, but to redirect this conversation to that is a little bit rude in my opinion.  \n\nYou misunderstood my \"poor, stupid\" comment in your haste to talk about your feelings about BF'ing instead of support OP in her need for support.\n\nI mean, essentially your comment boils down to \"It's all in your head, you are making it up.\"  Not helpful, and I am surprised you are so upvoted for it.", "controversiality": 0, "created_utc": 1384812839, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhgo5h", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgli1", "retrieved_on": 1428605408, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "C-section mums have their milk come in an average of a day later, but OP's story is not at all a typical C-section case because she had sepsis and her baby was in the NICU.\n\nI had an emergency C-section after a 50 hour labor, and IV antibiotics, but no sepsis and baby went straight to the room with me. My milk came in at a normal time and we breastfed for 16 months. So don't think the C-section will automatically make things harder :).", "controversiality": 0, "created_utc": 1384813254, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhguzs", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhf31p", "retrieved_on": 1428605320, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kanooka", "author_flair_css_class": null, "author_flair_text": null, "body": "regarding the tongue tie, the reason you hear that it's no big deal is that over the decades, the viewpoint on tongue ties and whether to clip them has flip flopped a few times.  30 years ago, when I was born, you absolutely did not clip tongue ties - and i was a breast fed baby until i was 3.  i have a severe tongue tie to the point that i have a slight speech impediment.  now, i have my own baby, and i take him to the same pediatrician that my mother took me, and he clipped my son's tongue tie in a heartbeat.  ", "controversiality": 0, "created_utc": 1384813392, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhgxau", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhelzn", "retrieved_on": 1428605289, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sageberrytree", "author_flair_css_class": null, "author_flair_text": null, "body": "I was lucky enough to be able to bf for 18 months after the first. I'm 3 weeks from number 2's arrival, and if I can bf, I will, but I wouldn't judge anyone who doesn't. It was hard! Especially for the first few months. I only made it as long as I did because the little princess would NOT give it up. Believe me, I would have stopped much sooner if she would have let me. So... I am sorry that you are hearing negative comments from other moms. They suck. I would probably give them a funny look and ask them if they would let their baby starve to death, instead. ", "controversiality": 0, "created_utc": 1384813655, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhh1i8", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428605235, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Taco_flavoredkisses", "author_flair_css_class": "orange", "author_flair_text": "4, 3 &amp; 2 month old", "body": "I tried breast feeding for 2 weeks til we switched. That is with both my children. I NEVER produced enough milk. They lost a unhealthy amount of weight. With the first one I felt like a failure, I cried about it. Husband helped me through it. With the second I thought it be different but it wasn't.  I tried &amp; tried leading to the same problem. Except this time I didn't take it to heart. I will try when the 3rd one is born. \n\nThere will ALWAYS be something someone thinks you are doing wrong.  You learn to ignore it &amp; continue on with your bad self ;D\n\nFor people making you feel directly guilty they suck. If you just hear it around then it may just be guilt you are feeling from within. You are the mother &amp; you know what is best. A happy mom is a better mom than one who is stressed out &amp; beating there self up. ", "controversiality": 0, "created_utc": 1384814893, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhhlyp", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428604970, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "I was in the same boat as you. My milk never came in the first round. I had a c-section the 2nd time around. My milk came in, but dried up slowly by the time he was 3 months old. I get a lot of shitty looks when I make a bottle in public, I've also had a couple of \"Mommies\" stop me to tell me that I \"really should breast feed, even in public, it's nothing to be ashamed of.\" \n\nDon't let them get you down. I find thinking about the perks of formula help a little. You can drink whenever you want, and not have to worry about breast feeding later. Your tops don't get soaked through with milk. No uncomfortable nursing pads. No smelly nursing pads, and it's much easier for others to feed, so you can go out more often.", "controversiality": 0, "created_utc": 1384816082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhi609", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428604519, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Franticflint", "author_flair_css_class": null, "author_flair_text": null, "body": "I completely understand the anger and frustration. While pregnant I never let myself think I would do anything but breastfeed. Never even researched bottles or anything related to bottle feeding. I planned to stay home and give her the boob whenever she pleased. I was even leaking colostrum prior to her birth. At the hospital I was producing milk within two days, but I had never become engorged. After refusing to give formula for about 2 weeks my already tiny baby had lost quite a bit of weight and I met with an LC who told me that judging by the shape of my breasts I would likely never produce enough milk. I did research and found that I likely don't have adequate tissue in my breasts. I still pump after feedings (and get next to nothing) and take fenugreek and drink Mother's Milk tea, but she has to have formula. After two months I still struggle with extreme guilt and a feeling of shame with not being able to EBF. Most of this is because of me and how I feel I'm perceived when I feed her formula, but I'm learning to remind myself that my baby is healthy and alive because of formula. And whether a mother has to give formula or chooses to they're doing what's best for their baby and helping them grow.", "controversiality": 0, "created_utc": 1384816102, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhi6c5", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428604515, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Goders", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you're feeding your child. If you were feeding your child poison, many of us would not be alive today. Babies have been formula fed for generations now.\n\nIn a year, two years, five years, the topic of how your child was fed for the first year of their life will probably never come up, unless it's someone looking for advice. College applications don't ask if you were fed breast milk or formula.\n\nIf you were able to breastfeed, you'd have other issues, like people judging you if you had to feed your baby in public. People would make comments about how it's disgusting, or wrong to do it in public.\n\nQuite honestly, it doesn't matter if you formula feed or breast feed, someone is going to have something nasty to say about it. Your child is being fed, period, end of story.\n\nYou are in a no win situation right now. And unfortunately, it's just the beginning. Unfortunately, no matter what you do in life when it comes to your child, you'll get those people who think they know best and their way is the only way.\n\nAs long as you do everything in your power to make sure your child is in a loving home, with food in their bellies, and you do the best for them, you're doing the right thing as a parent, despite what anyone may say.", "controversiality": 0, "created_utc": 1384816194, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhi7q5", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428604497, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "_feffers_", "author_flair_css_class": null, "author_flair_text": null, "body": "What you said is so true! \n\nMy son breastfed until 18months old and I was told by everyone from family to random strangers that I was ruining my son. Making him a \"mama's boy\"... Blah blah blah. \n\nWith my twins, they were formula and breastfed... But even that wasn't good enough. I was a terrible mother for taking the \"easy way\" out and using formula to supplement what my body couldn't produce... \n\nJust learn to ignore rude comments. There will always be some idiot who thinks they know better than you do how to care for YOUR baby. To them, You will always make the wrong choice, no matter what you choose.\n\n\n", "controversiality": 0, "created_utc": 1384816208, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhi7yu", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhca06", "retrieved_on": 1428604494, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "Here's a good rule of thumb. Don't bring up breast feeding with a new mother unless she asks. You wouldn't ask a woman if she's pregnant, don't ask a new mom about the state of her milk glands. ", "controversiality": 0, "created_utc": 1384816259, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhi8ps", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhggz9", "retrieved_on": 1428604484, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "I've never asked anyone about her milk glands.  ", "controversiality": 0, "created_utc": 1384816456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhibuo", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhi8ps", "retrieved_on": 1428604443, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "By \"educating\" someone on breastfeeding unsolicited you are putting that person in the situation to explain their choice to you. A complete stranger who needs to learn to mind their own business. ", "controversiality": 0, "created_utc": 1384816937, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhiji4", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhibuo", "retrieved_on": 1428604345, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LindySquirrel", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh man, I tried so hard to breast feed that it was definitely an emotional toll with my first. I can understand feeling judged, because dangit I judged myself for being a horrible person that I couldn't breastfeed. With my second, my milk came in much better, but it just wasn't enough. I learned to love formula because screw it, I did my best.", "controversiality": 0, "created_utc": 1384817259, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhiolj", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428604278, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i do wish people would stop using [this story](http://www.nytimes.com/2012/10/16/health/hospitals-ditch-formula-samples-to-promote-breast-feeding.html?_r=0) to suggest that hospitals are making formula *inaccessible*. the only thing these hospitals are doing is not immediately dumping formula in a mother's lap whether she asked for it or not. they are still giving it out *on request*. you want to formula-feed your newborn? go for it. all you have to do is ask. the only thing this particular campaign is about is not greeting a new mom with \"here's your baby's blanket, here's his nasal aspirator, here's the formula you will certainly need...\"\n\nunless there is someplace where a mom can specifically ask for formula and is told \"no you can't have any,\" you will not convince me that formula is being \"deliberately made harder to access.\"", "controversiality": 0, "created_utc": 1384818119, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhj2ak", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfbgd", "retrieved_on": 1428604101, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i'm genuinely curious as to what the health benefits of formula are.", "controversiality": 0, "created_utc": 1384818439, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhj7he", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhdrsi", "retrieved_on": 1428604034, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Where did I say it was in her head? \n\nApparently I'm failing communication today so I'll try again: no matter what choices we make something we're doing is always going to be wrong to someone else.  My point in bringing up the shit bfers get was not to divert the conversation but say we are all in the same boat.  The judgement and attending anxiety is there no matter what,  so in the end the way past it is to look at our kids and get our validation there.  \n\nThere's so much messing it there about what a perfect mom is,  and so many people seem to do everything right,  it's easy to get caught up in it and feel attacked (whether by actual individuals or the world at large). Ultimately though we perpetuate this stuff by getting caught up in it. The only way past it is to decide how you want to react to it.  We can internalize it,  our decide to move on.  \n\nIf you read that as horrible and ride and unsupportive I apologize. Hope you havea nice might. ", "controversiality": 0, "created_utc": 1384818590, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhja0d", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgo5h", "retrieved_on": 1428604001, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "I've never offered unsolicited education.  I was talking about situations where people haveasked but then get all upset when the response isn't what they expected.  Not this case in particular.  Again not being very clear apparently", "controversiality": 0, "created_utc": 1384818673, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjbaq", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhiji4", "retrieved_on": 1428603985, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i wish the breastfeeding campaign would include more information on the impact of c-sections on milk coming in. i had absolutely no clue a c-section would delay my milk, freaked out for 5 days and supplemented with formula because otherwise my newborn would cry even after 30 minutes of nursing, thought my milk was NEVER gonna come in and i'd never be able to breastfeed... day 6 it was like a water main turned on and we were EBF until 6 months, and still nursing part-time at almost 2 years.", "controversiality": 0, "created_utc": 1384818692, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjblj", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhguzs", "retrieved_on": 1428603980, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "&gt; her son would be \"chillin wid his millins\"\n\nnot with a genius like that for a mother, lol", "controversiality": 0, "created_utc": 1384818754, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjcmh", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfg9n", "retrieved_on": 1428603968, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i am all about the pro-breastfeeding and encourage every new mom to at least give it a shot, but the people who say it's the ONLY way or formula is poison drive me up a goddamn wall. no, obviously it's NOT the only way and the whole aisle full of cans of formula at the store is proof of that much, and obviously it's not poison or probably most of the north american population would have died generations ago. it's like powdered milk... is it the same as the straight-from-the-source real deal? no. but it's still *food*, it's still sustenance with nutritional value that serves it's purpose, to nourish babies. it's doing its job, keeping your baby alive and healthy. and let's be realistic, all research notwithstanding, it is not like a formula-fed baby is going to grow up to be a knuckle-dragging imbecile while the breastfed babies are curing cancer with particle physics or whatever. it's a difference of like 4 IQ points, functionally imperceptible and irrelevant. \n\nthere are self-righteous ignoramuses on all sides of the parenting spectrum, it's just the ones who disagree with you who are more noticeable. it doesn't make them right.", "controversiality": 0, "created_utc": 1384819381, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjmhq", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428603839, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "In my child's case and many children's case - having calorie intake at all.\n\nIn other children's case - lack of drug/alcohol content.  Higher B12 or iron content.  \n\nTo start on the obvious side, since apparently you need that.", "controversiality": 0, "created_utc": 1384819472, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjnw1", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhj7he", "retrieved_on": 1428603821, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish people wouldn't suggest that making a thing harder to access for those who need it - and for example, might have a communication barrier  - isn't making it harder to access.   But keeping living in your little fantasy world.\n", "controversiality": 0, "created_utc": 1384819582, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjpkv", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhj2ak", "retrieved_on": 1428603799, "score": -7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Where did I say it was in her head?\n\nYou insisted, verbatim, \"they're not even judging you.\"  \n\n", "controversiality": 0, "created_utc": 1384820208, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhjzep", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhja0d", "retrieved_on": 1428603672, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "perhaps i'm the one with a language barrier because i don't see how \"you can have as much as you want if you ask for it\" is making it \"harder to access.\"", "controversiality": 0, "created_utc": 1384820314, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhk11f", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhjpkv", "retrieved_on": 1428603651, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cassieko", "author_flair_css_class": "blue", "author_flair_text": "Two Boys! ", "body": "I am so glad when I formula-fed my older son, I didn't have to put up with any of this.\n\nI was thrilled to be able to breastfeed my new baby and I love every minute of it - but I was just as glad to have formula for my older son. My reasons for formula feeding were part necessity and part selfishness/ignorance, but they were mine and valid at the time and my son is happy and healthy.\n\nI don't understand all the  hand-wringing that people do over other people's choices. It really doesn't affect you how someone else feeds or delivers or diapers or [insert choice here] their baby. \n\nOn the other hand, OP, you shouldn't give an F what someone else is thinking about you. You don't have to make excuses or explain how you tried BF - it's your choice, pure and simple. You don't have to justify anything to anyone. Feel free to vent on here, but for your own sake - stop caring what other people think sooner rather than later. ", "controversiality": 0, "created_utc": 1384820321, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhk153", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428603649, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds plausible.\n\nI assume you gave birth in a hospital in which you were fluent in the nurses' primary language?  Man, I got shamed enough in the hospital with my first (bio) child for not breastfeeding, years before the policy of hiding the formula went into effect, and notwithstanding that I almost died in childbirth and couldn't hold my child.  I can't imagine what a poor, non-white, non-native speaker would deal with.\n\nBut you know, you can't see how that would be a problem so obviously it don't real.  /eyeroll", "controversiality": 0, "created_utc": 1384820504, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhk3zz", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhk11f", "retrieved_on": 1428603612, "score": -12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "There was some context there you missed or I expressed badly (and i never insisted anything,  if that's how you read it,  then. ..).  That said,  sometimes it's easy to take things as attacks and judgement that are not,  or aren't meant that way.  With that I should retire from the interwebs tonight, some I'm doing so badly at it.  ", "controversiality": 0, "created_utc": 1384820682, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhk6qf", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhjzep", "retrieved_on": 1428603577, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Given the number of times you repeated that sentiment, including in this most recent comment, I rather think you did insist it.  What you're saying boils down to a suggestion she's imagining it.", "controversiality": 0, "created_utc": 1384820791, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhk8k1", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhk6qf", "retrieved_on": 1428603553, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "do you feel that any manufacturer that does not provide you with free samples unbidden is \"hiding their product\"?", "controversiality": 0, "created_utc": 1384821264, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhkfz9", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhk3zz", "retrieved_on": 1428603458, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "OK.. I think formula is an amazing thing. It is awesome that we have come up with a substitute for breast milk because without it we would have a much higher infant mortality rate. That said, formula companies are trying to sell a product. They are advertising in hospitals. Those first few days of a babies life are crucial in getting a solid breastfeeding relationship. When formula is just sitting right there at the hospital and people are pushing it on you, it's so easy to just give up and stop breastfeeding. If formula is actually needed, it is available. You'll get samples sent to your house, and it's available at any drug store or grocery store. What isn't available as samples coming to your house and at the stores is breastfeeding support in terms of teaching new mom's latch and holding techniques, and actual support for breastfeeding (I'm not talking \"breast is best\" I'm talking support on how to actually successfully breastfeed because as many of us know it does not come naturally). ", "controversiality": 0, "created_utc": 1384821437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhkimj", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfbgd", "retrieved_on": 1428603422, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Star_of_oryan", "author_flair_css_class": null, "author_flair_text": null, "body": "It can be really irritating. Just ignore them (I know it can be hard) and remember that you are doing what you feel is best for you and your baby. \n\nMaybe you feel guilty and that you failed and that is why the comments bother you so much.  But your baby will be fine. Formula won't hurt him. He'll grow up just the same as if you breast fed. My kids are older now and are perfectly fine. Happy, healthy and ridiculously smart. Formula never hurt them.", "controversiality": 0, "created_utc": 1384821903, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhkq03", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428603328, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cal9687", "author_flair_css_class": null, "author_flair_text": null, "body": "I went through the same thing and did everything you mentioned and I still made almost no milk. I felt horrible enough and all the bad talking about formula just made me feel like I had failed her and she wouldn't be as healthy or smart as she could have been. I think it's horrible the way formula feeding is  portrayed. Honestly I still hate the fact that I couldn't breast feed and I stress about being out longer than expected if I don't have a bottle with me when I could just whip out a boob but it is what it is and you work around it. My daughter is perfectly happy, healthy, and there's no way anyone can tell me we'd\nbe more bonded if I had breast.", "controversiality": 0, "created_utc": 1384822812, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhl462", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428603143, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I dont know what it is, but I do feel like in an informal survey of friends, those of us who had a c section had a harder time nursing, for a myriad of reasons. I had a hell of a time, but we finally did it for 10 months. I had to supplement the whole time", "controversiality": 0, "created_utc": 1384822859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhl4va", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhguzs", "retrieved_on": 1428603134, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bear_sheriff", "author_flair_css_class": null, "author_flair_text": null, "body": "That's good to know :) I figured since it'd be planned instead of after labor, the hormones might not kick in in time. ", "controversiality": 0, "created_utc": 1384822896, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhl5h2", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhguzs", "retrieved_on": 1428603127, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384823296, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhlbq2", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428603045, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "daisyprincess", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so tired of the mommy wars.  I bought into \"this is the only RIGHT way\"...then I had another child.  Who not only refused to nurse, but was different from my first in almost every way imaginable.  I've learned very quickly to not judge others, but to give myself some grace, too.  As long as you CARE, you can't make a bad choice.  ", "controversiality": 0, "created_utc": 1384823539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhlfim", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428602997, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Often women feel judged or pushed by the nurses at the hospital. Its their job to give you information on the subject and often in giving information a new mother will feel like they are being pressured into it or feel as though they dont have the option to opt out of breastfeeding (and there in comes the feeling of shame and judgement) when really all these LCs and nurses are doing are giving information. I read a lengthy post on here once from a lactation consultant who felt very damned if I do damned if I dont by most new mothers she helped. Often if she didn't ask questions women wouldn't ask out of embarrassment or simply not knowing but then she risked looking like she was passing breastfeeding and making them feel judged. ", "controversiality": 0, "created_utc": 1384824133, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhlovf", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhi8ps", "retrieved_on": 1428602875, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "if only the \"diaper bag\" my hospital sent me home with came with a free sample lactation consultant along with the free sample formula tin!", "controversiality": 0, "created_utc": 1384824614, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhlwmx", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhkimj", "retrieved_on": 1428602774, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Your point was very clear to me, you are doing a great job. I ff the first and bf 6 months then ff feed the second so I have experience with both. I often felt judged but when really thought about it not a single live human being had walked up to me and said \"you are a horrible mom for formula feeding your child\". My guilt was my own from reading blogs and posts about breast is best. It was from my own expectations of wanting to breast feed and not being able to and feeling like a failure and a bad mom. It was going to the doctor and when they asked if I was giving breast milk and having to reply no I could swear they were judging me. We're they? Maybe. I doubt it. But to me, everything I pulled out the formula can someone was looking at me like a bad mom.\n   I caught more flack from real life people when breast feeding because I exclusively pumped and everyone said it wasn't worth the hassle. You are right. By the second time around I learned not to give a shit about other people. It doesn't matter what~ people have opinions on how to raise your child from sleep techniques to what they should eat. People have opinions and I have a happy healthy kid. ", "controversiality": 0, "created_utc": 1384824945, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhm1wb", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhk6qf", "retrieved_on": 1428602706, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "Its frustrating that there is so much hype about \"breast is best\" without telling people *how to breastfeed*. I feel like most people are aware that breastfeeding is considered to be superior (not that formula is bad) but then they either aren't aware about \"how\" to breastfeed nor are they aware of potential problems they may run into or how and how to get past them. ", "controversiality": 0, "created_utc": 1384825152, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhm59j", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhlwmx", "retrieved_on": 1428602664, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "&gt; like I had failed her and she wouldn't be as healthy or smart as she could have been\n\ni feel this way about other things besides breastfeeding, like how much TV my kid watches. at the end of the day, i'm doing the best i can, and she'll be as healthy &amp; as smart as i can reasonably influence her to be, and when she grows up she'll do the best she can in her own life and that's all we can really ask for as parents, right?", "controversiality": 0, "created_utc": 1384825260, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhm70n", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhl462", "retrieved_on": 1428602640, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "niccamarie", "author_flair_css_class": null, "author_flair_text": null, "body": "As one of those formula feeding moms who has at times felt compelled to tell my long story, I think I can offer some insight.  For those of us who wanted to breastfeed and couldn't, it's often a big deal.  That \"breast is best\" campaign has worked for a lot of us.  We want to do what's best for our babies, we learn and prepare to do what's best, and then our bodies don't cooperate and we feel like we failed.  Then, on top of that, how many times have you heard/read someone say something along the lines of, \"Almost all women can exclusively breastfeed.  REAL supply problems are very rare.  Most women who struggle with supply do so because of poor support/unnecessary c-sections/lack of education/doctors pushing supplementation too early/etc, and if they'd just had the proper support and kept trying it would have been fine.\"?  When you read that dozens of times over the course of your pregnancy, and then your baby is hungry and your breasts aren't producing and you end up using formula, you have this nagging doubt in the back of your head.  We all have a tendency to assume rare things won't happen to us, and that comes into play here: you end up going back over your birth and early postpartum period, thinking \"what if?\"  What could I have done differently?  Which choice did I make that ruined that breastfeeding relationship?  Was it the epidural, the emergency c-section, listening to the pediatrician who recommended supplementing, not asking for a different lactation consultant?  At least for me, telling my long story is my way of coming to terms with my unsuccessful attempt at EBF.  I think it's very similar to the need many of us feel to tell our birth stories: storytelling is how we process it.\n\nEdit:  I'm tempted, but I will refrain from getting up on my soapbox at this point and complaining about how damagingly overboard the \"breast is best\" campaign is (it's written on the formula cans for god's sake), but suffice it to say, as I process, I'm feeling less of a need to tell my story and more of a need to work to change how we support all mothers.  ", "controversiality": 0, "created_utc": 1384825469, "distinguished": null, "downs": 0, "edited": 1384825799, "gilded": 0, "id": "cdhmafv", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgiak", "retrieved_on": 1428602595, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "krshelton", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha, I love this!", "controversiality": 0, "created_utc": 1384825513, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhmb5l", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgiak", "retrieved_on": 1428602586, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TheMotherHen", "author_flair_css_class": null, "author_flair_text": null, "body": "She was saying in previous years, if you breastfed, you were considered poor because you couldn't afford formula. In current years some women still believe this to be true, therefore they don't even consider BF. You need to take a step back and realize no one here is attacking you. You're the one being hostile towards other women. What she said had nothing to do with women who formula feed being poor.\n\nLike the one poster said, you perceive that you're being judged when in reality you're not even remotely being judged. You need to chillax. ", "controversiality": 0, "created_utc": 1384825804, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhmfw6", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfv23", "retrieved_on": 1428602526, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cal9687", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly. I also started to think it's stupid of them to even make those claims because how do they really know? It's not like they can take identical twins and feed one of then breast milk and one formula to see if one turns out smarter and that study would still have flaws. ", "controversiality": 0, "created_utc": 1384826512, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhmro3", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhm70n", "retrieved_on": 1428602372, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cal9687", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly. I also started to think it's stupid of them to even make those claims because how do they really know? It's not like they can take identical twins and feed one of then breast milk and one formula to see if one turns out smarter and that study would still have flaws. ", "controversiality": 0, "created_utc": 1384826660, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhmuap", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhm70n", "retrieved_on": 1428602338, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "niccamarie", "author_flair_css_class": null, "author_flair_text": null, "body": "THANK YOU for that article.", "controversiality": 0, "created_utc": 1384827084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhn1b5", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhexep", "retrieved_on": 1428602247, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "niccamarie", "author_flair_css_class": null, "author_flair_text": null, "body": "I've found reading this blog: www.fearlessformulafeeder.com very helpful.  (And I swear I'm not the author of the blog or affiliated with it in any way, in case anybody notices that this is the second time today I've recommended it!  There was a similar post over on beyondthebump earlier today.)", "controversiality": 0, "created_utc": 1384827488, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhn82f", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428602160, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lablonderouge", "author_flair_css_class": null, "author_flair_text": null, "body": "SO TRUE!  I felt like (and still feel) like a failure because I can't breastfeed my baby and all these new moms are posting things on their FB page like \"I love breast-feeding my baby\" and \"anything else is horrible for my baby.\"  Also, one woman posted a link between breast-feeding and preventing autism which REALLY freaked me out.  Now I have to worry about autism because I didn't breastfeed?????!", "controversiality": 0, "created_utc": 1384827550, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhn93u", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhmafv", "retrieved_on": 1428602146, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lablonderouge", "author_flair_css_class": null, "author_flair_text": null, "body": "people have definitely judged me until they hear my whole story and even strangers have asked me (upon seeing that i have a new baby) if I'm breast-feeding.  It's just getting exhausting and humiliating….", "controversiality": 0, "created_utc": 1384827610, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhna40", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhcvb7", "retrieved_on": 1428602133, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "My ideal birth and parenting plans were thrown out the window when I discovered I was having twins. So I tasked myself with EBF. \n\nWhen I wasn't* able to, I was heartbroken. It killed me. It took a long time to get over the resentment and anger I felt. And it didn't help that people made comments or gave dirty looks.\n\nBut guess what? My twins are 2.5 and are stupidly healthy. Only one has had an ear infection once and they've had bronchitis once (and my husband and I had it worse). I've had a couple of nasty colds that they've never got. They are also not overweight. And they're very smart (know and recognize every letter of the Alphabet) and count to 15 (recognize 1-10). They frequently say 3-4 syllable words and string together 4-5 word sentences with near-perfect grammar. All of the horror stories that I read about breast being best (obese, stupid, and sick) have been the exact opposite. And even if they were, what matters is that they're loved! As long as you love you child, you're a good parent.\n\nTry to focus on the positives of formula. It's so easy on-the-go! Some powder and water and you're golden! It's also great for other people who want to hold and feed the baby. It's also great in terms of keeping track of intake. You know exactly how much the baby got and when.", "controversiality": 0, "created_utc": 1384827818, "distinguished": null, "downs": 0, "edited": 1384828675, "gilded": 0, "id": "cdhndow", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428602087, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lablonderouge", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm definitely not making up the stigma that I feel for feeding my baby formula.  Sometimes when people ask if I'm breast feeding and I don't feel like pouring out my whole story, I get dirty looks for \"giving in and not breast-feeding.\"  Then most say, \"well why aren't you breast-feeding, it's best for the baby\"……siiiiiigh", "controversiality": 0, "created_utc": 1384828007, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhngrt", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhgo5h", "retrieved_on": 1428602048, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lablonderouge", "author_flair_css_class": null, "author_flair_text": null, "body": "LOVE this!!!!  TY!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "controversiality": 0, "created_utc": 1384828092, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhni5u", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhi8ps", "retrieved_on": 1428602029, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hissxywife", "author_flair_css_class": "green", "author_flair_text": "SAHM to 8 yo boy", "body": "I think every mom wants to feel good about their personal choices. Unfortunately some feel better about their choices if they put others down for choosing differently. I had issues nursing as well and even heard from my own husband \"good mothers can breastfeed\" which almost got him punched in the face.\n\nOverall, as long as a baby is being fed an age-appropriate meal, I'm happy.", "controversiality": 0, "created_utc": 1384828230, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnkga", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428601999, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "emmatini", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that there is a defensive mechanism in place with formula feeding mothers in some circles. Which is understandable - in many cases they have beaten themselves up about feeding their child and so have more than enough guilt about it, and so when they hear another piece of (however well-intended) Breast is Best stuff it hits a raw spot.\n\nAnother commenter mentioned the socio-economic preferences attached, and I think this is true. Beyond the privileged of us who can sit on reddit and shoot the shit, there are millions of mothers out there, who are culturally conditioned to go for the formula and not the breast. \n\nThere is undeniably a large group of women who don't even consider breastfeeding as an option. Maybe physical reasons, maybe psychological, maybe socio-economic. Providing information to them is a good thing (yay empowerment). \n\ni also think that the commenters who are recommending a thicker skin are on to something - there is ALWAYS something someone will have an issue with when you are a parent. Immunisation. Feeding. Circumcision. Co-sleeping. When to introduce solids. Ear piercing. Cry It Out. Daycare.\n\nThe list goes on as your child grows: choice of school. Screen time. Diet. Sleep schedules. Playdate etiquette. Hair and clothing choices.\n\nNo matter what you do, someone, somewhere, will have a really strong opinion about how wrong you are. The trick is to try and make as informed a decision as you can, and cross your fingers.", "controversiality": 0, "created_utc": 1384828371, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnmpf", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428601971, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "It doesn't have anything to do with the people you choose to associate with. Complete strangers will ask you about the contents of your child's bottle.", "controversiality": 0, "created_utc": 1384828374, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnmr3", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhe5qf", "retrieved_on": 1428601969, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Even knowing now that supplementing wasn't strictly necessary those first few days, the night after my son was born, he sucked on my bleeding, empty breasts or cried the entire night. It was awful. Why wouldn't I want to supplement after the prospect of that every night for a week?", "controversiality": 0, "created_utc": 1384828682, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnrsm", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhjblj", "retrieved_on": 1428601904, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "What I've found is if you answer with detail our try to explain,   people will opine. For me it was sleep questions,  but \"fine\" is a great answer to everything that shuts down further opinionating most of the time.\n\n\"Are you breastfeeding?\"\n\"Oh feeding is going great.\"\n\n\"Is he sleeping through the night yet? \"\n\"Oh he sleeps great.\"\n\nAmbiguous, yet people hear what they want to and usually stop after that.  Doesn't always work but can really help.  When you're more confident you can have fun with people by making really horrible things up and making them wish they hadn't asked,  but that's for when you're solid in the gig.  ", "controversiality": 0, "created_utc": 1384828762, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnt4z", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhna40", "retrieved_on": 1428601887, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarafionna", "author_flair_css_class": null, "author_flair_text": null, "body": "It IS sub- par. Fact. ", "controversiality": 0, "created_utc": 1384828780, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhntgi", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhfbgd", "retrieved_on": 1428601882, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "Random question, do you have PCOS?", "controversiality": 0, "created_utc": 1384828922, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhnvs1", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhi6c5", "retrieved_on": 1428601853, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Axora", "author_flair_css_class": null, "author_flair_text": null, "body": "This was so great to read. When my son was first born I felt I was always judged too. \n\nTaking a long hard look at myself for the past two years helps me realize that it wasn't other people judging me, it was me judging me. My perception was skewed. \n\nEdit: Holy shit you really got attacked for this viewpoint now that I'm reading some of the responses you got!! \n\nWell I liked what you said. Now I'm going to back out of this thread slowly. Because holy shit. The immaturity.  ", "controversiality": 0, "created_utc": 1384829331, "distinguished": null, "downs": 0, "edited": 1384829659, "gilded": 0, "id": "cdho2iq", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhcvb7", "retrieved_on": 1428601765, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lost_in_GreenHills", "author_flair_css_class": null, "author_flair_text": null, "body": "In some circumstances, less risk of disease spread.  I have Chronic Fatigue Syndrome, and some moms with it avoid breastfeeding because they fear it may be caused by some infectious agent and they don't want to pass it to their baby.", "controversiality": 0, "created_utc": 1384829478, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdho4x2", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhj7he", "retrieved_on": 1428601734, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Iwasraisedonthedairy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is a great rule.\n\nI can't tell you how many people asked me flat out if I was breast feeding (and I'm not talking about health professionals and family-I'm talking about random strangers and acquaintances).\n\nI felt like I always had to explain myself or I would be harshly judged. And let's be honest, it also made me uncomfortable that people were so focused on my breastmilk and how I was feeding *my* daughter.\n\nI have never asked someone if they are breast feeding or formula feeding. To me it's, \"Oh. You feed your child. That's awesome.\"", "controversiality": 0, "created_utc": 1384829839, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhoay3", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhi8ps", "retrieved_on": 1428601656, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MojoBlue", "author_flair_css_class": null, "author_flair_text": null, "body": "Can I get an amen! Lol Thank you for clarifying that for me:) I realize now I probably should have been a bit more descriptive. Thanks for picking up my slack!  ", "controversiality": 0, "created_utc": 1384829989, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhodd2", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhmfw6", "retrieved_on": 1428601624, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TheMotherHen", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem. :) ", "controversiality": 0, "created_utc": 1384830233, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhoh9c", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhodd2", "retrieved_on": 1428601574, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384830773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhoq1b", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428601460, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "Are people saying these things *to you* or are you just feeling self-conscious? I supplement with formula for the same reason as you, and I am definitely self-conscious and feel like crap about it (I was *so* looking forward to nursing my baby), but no one has ever questioned me about why I'm bottle-feeding my baby. When people ask me perfectly innocent questions about it though, I admit I'm totally irked just because of my own issues around it though.", "controversiality": 0, "created_utc": 1384831437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhp10z", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428601318, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "superluminal_girl", "author_flair_css_class": null, "author_flair_text": null, "body": "I ended up reading almost that entire article out loud to my husband, and it made me feel so much better. Then I read the comments. NEVER READ THE COMMENTS.", "controversiality": 0, "created_utc": 1384831700, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhp5me", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhexep", "retrieved_on": 1428601259, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "There are tons of comments already and I haven't read through all of them. I'm sure there is a lot of great and supportive feedback. I just wanted to throw in my two cents which is this: The subculture that exists among moms is extremely disappointing sometimes. I honestly believe that it is rooted in the insecurity and fear that mothers have that they are making mistakes and messing up their own children. In turn, they stick to ideas that makes themselves feel better, at the expense of putting others down. \n\nThere is one thing and one thing only that a baby needs from his mother: LOVE. If you love the crap out of him, he really won't matter how you feed him or where he sleeps or whether you work out of the house or stay at home. I know it can feel extremely frustrating to hear all the negative comments, but just trust that as long as you're doing your best, he will be wonderful. ", "controversiality": 0, "created_utc": 1384832042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpb8v", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428601186, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "A resident and a baby at home! Props to you!! That can't be easy. Thanks for this post, your perspective as a medical professional and a mom is invaluable to the parenting community. ", "controversiality": 0, "created_utc": 1384832187, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpdoe", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhoq1b", "retrieved_on": 1428601156, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lablonderouge", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much!", "controversiality": 0, "created_utc": 1384832277, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpf55", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhch6z", "retrieved_on": 1428601135, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TheMotherHen", "author_flair_css_class": null, "author_flair_text": null, "body": "So that means it's okay to make someone feel inferior for using formula? I don't understand what your intent was with this comment... ", "controversiality": 0, "created_utc": 1384832313, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpfp9", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhntgi", "retrieved_on": 1428601128, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lablonderouge", "author_flair_css_class": null, "author_flair_text": null, "body": "I love him so much, words will never express it and it just increases every day :)", "controversiality": 0, "created_utc": 1384832319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpft9", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhpb8v", "retrieved_on": 1428601126, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Precisely. Which is why the formula vs breast milk conversation is irrelevant. :)", "controversiality": 0, "created_utc": 1384832445, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhphtr", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhpft9", "retrieved_on": 1428601100, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Megan_Dawn", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think you need to be so rude. ", "controversiality": 0, "created_utc": 1384832459, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpi32", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhjnw1", "retrieved_on": 1428601097, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384832889, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhpp72", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428601006, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lindini", "author_flair_css_class": null, "author_flair_text": null, "body": "Listen, not one woman in my entire family has ever breast fed in the last 60+ years. Not one sister, cousin, aunt, no one. Additionally we are all a happy healthy well adjusted bunch, not one drop of autism in the lot. To be honest I told my mom I was thinking about breastfeeding and she was horrified. There are no right or wrong answers, just what is right for you. Formula isn't poison, and breast milk isn't a magic elixir. People just take things too far. ", "controversiality": 0, "created_utc": 1384834241, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhqap9", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhn93u", "retrieved_on": 1428600701, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "maegadeath", "author_flair_css_class": null, "author_flair_text": null, "body": "I breastfeed and I support you. Don't let them bring you down. Everyone has their opinions and everyone has limitations. You're doing the best for you and baby and that is ENOUGH. Just wanted to give you a cyber pat on the back and tell you to stay strong! ", "controversiality": 0, "created_utc": 1384834260, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhqayc", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428600699, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384834930, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhqlzg", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhpdoe", "retrieved_on": 1428600484, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry that happens, and I am sorry you can't even talk about it here without people accusing you of making it up, or reiterating that they think it's a bad choice.  Such is life when you're up against emotion with logic.", "controversiality": 0, "created_utc": 1384837220, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhrffn", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhngrt", "retrieved_on": 1428600102, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think you need to tell me what I need or don't.", "controversiality": 0, "created_utc": 1384837242, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhrfrd", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhpi32", "retrieved_on": 1428600098, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "You really have no fucking clue what you are talking about do you?  This is about hospital policies making a decision to impede access to a life-sustaining product.  ", "controversiality": 0, "created_utc": 1384837296, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhrgjq", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhkfz9", "retrieved_on": 1428600087, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384837336, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhrh56", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhntgi", "retrieved_on": 1428600080, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "There's lots of free support for breastfeeding - even if you don't want it.  Even if you beg them to leave you alone.  Not all parents can or choose to breastfeed, no matter how much a \"lactation consultant\" lectures them, and their decision how to feed their child should be every bit as legitimized.  ", "controversiality": 0, "created_utc": 1384837487, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhrjai", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhkimj", "retrieved_on": 1428600053, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "koh522", "author_flair_css_class": "green", "author_flair_text": "Mom of two!", "body": "&gt;strangers have asked me (upon seeing that i have a new baby) if I'm breast-feeding.\n\nI do breastfeed, but this question irks me beyond belief. None of your fucking business, what's it to you, and why does it matter? Sheesh. Talk about crossing boundaries!", "controversiality": 0, "created_utc": 1384838053, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhrr8b", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhna40", "retrieved_on": 1428599949, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyCharadey", "author_flair_css_class": null, "author_flair_text": null, "body": "It makes me angry that even on my formula tins there is the \"breast is best\" message.\nIt always astounds me that people seem to think that I just didn't try hard enough or I'm lazy because I formula feed. I tried BF'ing for the first 2 months of my sons life and it was a daily struggle. He didn't gain back his birth weight until after I started formula. It was 2 months of bloody nipples, a sleepless, sickly baby and me looking and feeling depressed and like the worst mother ever. \n\nDo they really think we would choose the more expensive, time consuming option lightly? It also meant that his dad could feed him and I could get the occasional full night sleep, but even then I miss the special bonding time and it being the ONLY thing that I alone could do for himAND even if my reasons were that I wanted to be able to enjoy alcohol again or whatever. Who are you to judge me?\n\nSorry for the rant. I guess it's just a sore point that I have to bite my tongue over in \"polite company\"", "controversiality": 0, "created_utc": 1384841510, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhsm94", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428599548, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nopethatshit", "author_flair_css_class": null, "author_flair_text": null, "body": "I was told my milk would come in a day or so after my c-section, and basically starved my baby for a few days until I dropped the advice I was being given to \"not give up\" and got some formula. I had droplets of colostrum for weeks, my milk never fully came in, and all the crunchy moms in the breastfeeding support groups would have been up my ass so I quit asking for help. Being a first time mom, I was sure I was doing something wrong. I just wish I had more encouragement to not beat myself up for doing what I knew needed to be done. I still worked at nursing and pumping for two months, and it just wasn't happening.\n\n\"Breast is Best\" is a nice idea, but I think \"Just Fucking Feed the Baby\" is better. No sense in starting off in such confusing and scary territory feeling like a failure. Follow your instincts, if your baby needs food you'll know.\n\n", "controversiality": 0, "created_utc": 1384841910, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhsq9j", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhf31p", "retrieved_on": 1428599496, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nopethatshit", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a planned C-section scheduled, but went into labor a couple weeks early, and labored for 20 hours before I was able to get into the OR. I still had the same issues many others say they had with scheduled c/s not done while laboring. Natural birth obviously puts a lot of stress on the body, but I imagine having your abdomen cut open and being rummaged through puts your body through a different kind of shock that may inhibit the body's natural course of lactation. Labor probably helps it along, but stopping that process for surgical removal has to get in the way. (none of this is fact checked, just what makes sense to me from the experiences I've had/heard of.)", "controversiality": 0, "created_utc": 1384842288, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhstz4", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhl5h2", "retrieved_on": 1428599451, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Franticflint", "author_flair_css_class": null, "author_flair_text": null, "body": "Nope. ", "controversiality": 0, "created_utc": 1384844853, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhthu7", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhnvs1", "retrieved_on": 1428599139, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384846674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhtwij", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428598948, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "My son has \"asked for it\" since day one. That's what crying is. Eventually it just develops into words. ", "controversiality": 0, "created_utc": 1384850909, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhupar", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhg7sj", "retrieved_on": 1428598575, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RachelSoma", "author_flair_css_class": null, "author_flair_text": null, "body": "Friend: I don't know how you've managed to breastfeed for so long! I need to be able to let SO feed him sometimes.\nMe: I don't know how you manage to keep all your bottle clean! I'm the worst housewife in the world and I'm too lazy do extra washing.\nThen we both laughed and move on.\n\nMe to pregnant friend: Are you planning to breast or bottle feed? \nFriend: Ummmm... Both? I guess, maybe... I mean I'm... I don't know...\nMe interrupting: okay, I'll add the boppy pillow and the bottle steriliser to the pile of stuff for you.\nFriend: Oh, okay. I thought there was a lecture coming...\nMe: What? No! I just don't want to fill your house with things you won't use.", "controversiality": 0, "created_utc": 1384861049, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhw3pr", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428597922, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MamaD_Cooks", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so Sorry you are going through this. Though I do consider myself a breastfeeding advocate, I'm more of an advocate of feeding your baby...whichever way is best for your family. That's what I don't understand about the hardcore Bfing mom's...they shouldn't shame anyone! We all have different circumstances and factors that determine what way is going to work for us. It's OK to not breastfeed. Do not feel like you are any less of a parent. You are still feeding, clothing, and providing a loving home to your little one. that is all that matters! ", "controversiality": 0, "created_utc": 1384861692, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhw6yw", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428597880, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i'm contesting your notion that this policy impedes access.", "controversiality": 0, "created_utc": 1384872748, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhyq2r", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhrgjq", "retrieved_on": 1428596673, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "yeah, my intentions with this one are to try and avoid supplementing from the get-go, but knowing what i know now (and recent research has suggested that supplementation in the first week can actually improve breastfeeding outcomes), i will feel a lot less guilty/panicky about supplementing this time.", "controversiality": 0, "created_utc": 1384872915, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhys5i", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhnrsm", "retrieved_on": 1428596646, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ktonicd", "author_flair_css_class": null, "author_flair_text": null, "body": "There's always going to be someone that disagrees with what or how you take care of your child(ren). It's up to you to research what you give your children and how to take care of the both of you. Then, follow your instincts and do what you feel is best for your child. You need to be confident in what you decide and the more confident you are, the more people will leave you allow because they see they can't get to you. \n\nIf you had to use formula, then you did what you had to do to make sure your baby was fed. Don't let other people get to you since you really couldn't help it. You weren't going to let your baby starve, right? Right :)", "controversiality": 0, "created_utc": 1384875130, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhzkd4", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428596281, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I have lupus and am on medications that make my breast milk unfit for consumption. I formula feed my son and I'm totally fine with it. Actually, he's better off, because I am able to give him a formula with lower lactose content and so he's less gassy, the poor thing. Otherwise he spits up and it comes right out his nose. My mom said that happened with my brother and I all the time (both of us were breastfed).\n\nJust ignore the ignorant people, such morons aren't worth your time.", "controversiality": 0, "created_utc": 1384875145, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhzkl4", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428596278, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shadowuser", "author_flair_css_class": null, "author_flair_text": null, "body": "I also couldn't breast feed due to health issues.  I tried everything and I felt like a failure.   It took some time, but I came to realize that I was doing the best I could given the realities of the situation and that I wasn't a failure as a mother.   A real mother makes sure her child is fed,  loved,  and taken care of - and that is exactly what you are doing using formula.   I think the bottle feeding also gave my husband a chance to participate and bond with our kids.   He really enjoyed being a part of the feeding.   Sure there are tradeoffs,  but your child will be happy and healthy and that is the important part.  And for those crusading busy bodies -  I got very good at the disdainful look and  saying \"My child would not be alive if not for the formula.   Thank goodness mothers have options.\"", "controversiality": 0, "created_utc": 1384884224, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3hc1", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428594433, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarafionna", "author_flair_css_class": null, "author_flair_text": null, "body": "My intent was to make sure that there is no \"formula is just as good\" bullshit going on. It's not as good. We all know it. But this fact angers a lot of women who haven't been able to breastfeed, because it makes them feel less-than. But this doesn't mean we should gloss over all the glaring deficiencies that formula has and how much the industry has destroyed breastfeeding wisdom in nearly every country in the world. ", "controversiality": 0, "created_utc": 1384887843, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi55yb", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhpfp9", "retrieved_on": 1428593647, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TheMotherHen", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd say formula is, in fact, just as good as breastmilk when it comes to providing nourishment for an infant. I've never met someone and thought \"huh, that guy was totally formula fed.\" What \"glaring deficiencies\" does formula present, exactly?  \n\nAlso, all the studies that show breastfeeding is somehow exponentially better are not controlled enough to conclusively state formula feeding is far worse than breastmilk. When you take into account genetics, socioeconomic status and IQ of the mother, the differences between a breastfed and formula fed baby become minute. \n\nRegardless, there is never a reason to judge someone for the choices they make about their children unless they're explicitly neglecting or abusing them. ", "controversiality": 0, "created_utc": 1384888411, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5fir", "link_id": "t3_1qwxxn", "parent_id": "t1_cdi55yb", "retrieved_on": 1428593523, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Formula is for mothers who cannot breastfeed. If you did all that you could, and baby still needed more, then you are doing what you need to keep your baby alive. I do wish doner milk was more easily available, and if you lived near me I would totally give you some. But if you truly can't breastfeed, then you need an alternate source of nutrition for your child. Keep on keeping your baby alive ok!", "controversiality": 0, "created_utc": 1384904987, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdidand", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428589783, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Unfortunatly, a lot of moms do choose formula lightly. Becuase they just don't feel like it anymore. That makes me a little sad, as I wish that formula was available only out of necessity. That way when people saw bottle feeding moms, they would know that the mother was doing her best and that the child was getting formula for health reasons. I hate it when friends said to me that it was hard and so they quit, then months later say that they just dried up, or that they can't breastfeed. No, they chose not to. They should own their decision. ", "controversiality": 0, "created_utc": 1384905404, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdidh77", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhsm94", "retrieved_on": 1428589698, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "another thing is the idea that it is all or nothing. A lot of moms can do some combination feeding. So if you can't supply everything, you may be able to supply something.", "controversiality": 0, "created_utc": 1384905635, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdidkrb", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhoq1b", "retrieved_on": 1428589652, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Good mothers try to do the best for their children. ", "controversiality": 0, "created_utc": 1384905752, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdidmkt", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhnkga", "retrieved_on": 1428589628, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I will not ask a stranger if they are breastfeeding or formula feeding. They are not close to me, I have no right to their personal information. I have asked friends because I want to compare experiences. I don't believe that formula should be used if breastfeeding can work. But I also don't believe in being rude.", "controversiality": 0, "created_utc": 1384906725, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdie1m4", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhna40", "retrieved_on": 1428589433, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "People do need to be more proactive! Friend not breastfeeding? Bam, here's a ton of breastmilk for you! That's a way to be part of the solution. That's what I did anyway. Saved her a good deal of money too.", "controversiality": 0, "created_utc": 1384907264, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdie9x6", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhckxl", "retrieved_on": 1428589325, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My friend across the country would have helped in a second but the distance made it impossible. I'm so glad you were able to help another mom, I hope I can do that one day as well. ", "controversiality": 0, "created_utc": 1384907817, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdieifs", "link_id": "t3_1qwxxn", "parent_id": "t1_cdie9x6", "retrieved_on": 1428589215, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "myawardsfromarmy", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm planning on trying to combo feed with breast during the day and bottle at night. For me, it's for my mental health. I don't want to be attached to my son or a pump 24/7 and I want my husband and family to be able to help me feed him. I'm going to be a much happier person in general if we pull it off. I think people forget (not you, just in general) that \"giving your best\" for some people means making self care a very high priority, and in that endeavor, formula is very useful!", "controversiality": 0, "created_utc": 1384928472, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdimwix", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhj7he", "retrieved_on": 1428585228, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "myawardsfromarmy", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm incredibly pro choice in all things related to bodily autonomy. I don't think that just because a woman gives birth she loses the inherent right to self-determine how her breasts are used. Formula is there and perfectly fine for women who want or need it, end of story. Their reason is their own business alone and it strikes me as incredibly controlling and anti-woman when people get militant about breastfeeding. If they don't want to be judged for breastfeeding or told not to, then who the fuck made them queen to turn around and judge and tell women not to use formula? Honestly I see aspects of the \"breast is best\" campaign as yet another way society tries to dictate to women how they must use their bodies. We have two perfectly good options and deserve every bit to choose which we want to go with.", "controversiality": 0, "created_utc": 1384928946, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdin1gx", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428585098, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyCharadey", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry, but what business is it of yours to judge them and their reasons? **No one should have to justify their parenting choices beyond \"It was right for me, for my baby and our family\".**\n\n\nThe judgement that they just didn't try hard enough is offensive. Every one has a differing opinion of what \"hard enough\" is. I ended up in hospital with a baby failing to thrive and that STILL wasn't hard enough for some people, despite my dr, my midwife, my partner and myself deciding as an informed group that it was best. Frankly, how DARE people like you make others feel bad when it is no business of yours. \n\nSome mothers choose from the outset that they don't want to breast feed, that is their decision and again it is none of your business. Again. No-one should have to justify their decision to anyone but themselves and their Doctor/ midwife.", "controversiality": 0, "created_utc": 1384947010, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdiqcpu", "link_id": "t3_1qwxxn", "parent_id": "t1_cdidh77", "retrieved_on": 1428583483, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Arimarietits", "author_flair_css_class": null, "author_flair_text": null, "body": "Feeding your baby no matter what is important.. I formula fed my son by choice the day he was born and I will formula feed my daughter who will be here in about 4 weeks.   Don't let anyone make you feel bad for feeding your child.   You don't need to have something wrong with you or had some complication to make it OK to formula feed.  My son is almost four years old and is super smart, healthy, happy, and active so it's BS that formula is \"bad\" for your child.   The reason I decided not to breast feed is because I felt really weird/gross about having a baby suck on my nipple... Ehhh it makes me cringe just typing it, But I am in no way against breast feeding it's just not for me.   I vote for feeding your baby whatever way you want! ", "controversiality": 0, "created_utc": 1384962773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdiubj3", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428581631, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Martinaco", "author_flair_css_class": null, "author_flair_text": null, "body": "You will be judged for everything you do as a parent.  This is usually the first lesson in thickening of the skin. The proof is out there - healthy people everywhere, breastfed and bottle fed. Try to pick out of a crowd who got which. Don't let the busy bodies get you down. You have better things to spend your time on - like a newborn. :)", "controversiality": 0, "created_utc": 1384970055, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdixkhr", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428580086, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "4everInYogaPants", "author_flair_css_class": null, "author_flair_text": null, "body": "Amen. ", "controversiality": 0, "created_utc": 1384990823, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdj7b1y", "link_id": "t3_1qwxxn", "parent_id": "t1_cdiqcpu", "retrieved_on": 1428575401, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarafionna", "author_flair_css_class": null, "author_flair_text": null, "body": "And I disagree. Something made in a factory out of the cheapest available protein powder from another animal, missing hundreds or complex nutrients just doesn't measure up. I'm not talking about IQ. I'm talking about that it's fucked up that formula is \"normal\" whereas breastfeeding is \"best\". But this angle serves to further the formula companies' agendas. I'm not judging anyone for their decisions. But you can't say that a man-made substance is just as good. Look at the ingredients of what's in breastmilk vs. formula. Saying it's the same does nothing to help to support moms who really want to breastfeed. ", "controversiality": 0, "created_utc": 1384992621, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdj82qo", "link_id": "t3_1qwxxn", "parent_id": "t1_cdi5fir", "retrieved_on": 1428575042, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TheMotherHen", "author_flair_css_class": null, "author_flair_text": null, "body": "Saying it's the same supports mothers who were unable to breastfeed. When I had to spend a week away from my son before he was even a month old, and had to be put on drugs and antibiotics that made me unable to BF, I was crushed. I felt like a failure and that giving my son formula would fuck him up for life. Women need to know that it's best to breastfeed but if they are unable to they aren't feeding their child garbage. Also, some women might not want to breastfeed and it's there prerogative if they don't. Like I said, when it comes to providing nourishment to an infant, it contains all vital nutrients to sustain a healthy baby. ", "controversiality": 0, "created_utc": 1385006587, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdje1j2", "link_id": "t3_1qwxxn", "parent_id": "t1_cdj82qo", "retrieved_on": 1428572187, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nurshable", "author_flair_css_class": null, "author_flair_text": null, "body": "I used to be one of those moms back when I had  only my own experience to go by.\n\nIt wasn't about other moms that formula fed. It was about my own insecurities and feeling so much negative energy surrounding breastfeeding.\n\nRejecting formula felt like the only way I could keep going.\n\nI have since then realized I was a jerk.There are a lot of reasons that women formula feed. And none of them are any of anyone's business other than the mother, the baby, the father and maybe the baby's pediatrician. \n\nI apologize on behalf of the current generation of jerks. \n\nNot everyone has learned that we can talk about the good of our personal experiences without badmouthing the experiences of others. \n\nFormula is not perfect but that is on the shoulders of formula manufacturers not on the shoulders of mothers who need to use formula.\n\nThey're not talking about you. They're talking about themselves, the things they're repeating, and the irritation that they have with having formula pushed on them. They're talking about being made to feel bad abour breastfeeding, and the aunt that keeps nagging them.\n\nAnd they're dragging you and your baby into it unfairly. \n\nYou did what you could. In fact it sounds like you tried harder than most. Don't let jerks hand you guilt to carry. It's not yours. \n\nGo kiss your baby. Recognize the complete and utter lunacy that any of those women could possibly believe that they want something for your baby more than you do. They don't. They're ridiculous. They're talking about a cause not your relationship with your child.  ", "controversiality": 0, "created_utc": 1385088193, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdk62zm", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428558871, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nurshable", "author_flair_css_class": null, "author_flair_text": null, "body": "Breastfeeding doesn't prevent autism and formula doesn't cause it. Breastfed babies can be autistic. They can be obese. They can have poor health. \n\nFocus on the choices that you can make. If you're not able to breastfeed you're not able to. (And feeding your baby vs starving your baby's a bit of an obvious good choice right there.) What good choices are still ahead of you that you are able to make? You'll fill up your child's life with all the awesome choices that help your child be awesome. \n\nBreastfeeding doesn't eliminate problems, it lowers the overall risk. So do other things. \n\nTry to read those and view them as checklists of things that a parent can do. Can't do that one? Ok. Look at the other ones? Bet you can find a bunch of things you can do to reduce risks and increase your baby's health. Not smoking.. Organic food.. being careful about chemical exposure? I don't know. Build your own list and try to see the studies as just being studies that confirm that yes, breastfeeding is a good choice. Just like all the good choices that are still within your control and that you will make.\n\nIt's not a \"do this one thing perfectly and get a prize\" thing. Anyone who decides to breastfeed perfectly and then not do any of the other things? They won't have a healthy or happy child. \n\nIt's good. But it's not the be-all/end-all of motherhood. It's just a thing that they are passionate about right now. \n\nYou didn't fail. Failing takes quite a few years or some really terrible parenting. Formula does NOT qualify as failure. \n\nBe gentle with yourself. You deserve it. ", "controversiality": 0, "created_utc": 1385088979, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdk6f93", "link_id": "t3_1qwxxn", "parent_id": "t1_cdhn93u", "retrieved_on": 1428558713, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm going to have to disagree with you. I'm not going to win any nice awards. But I don't agree with choosing formula simply because it is easy. I feel that it is a selfish move to choose to have your body back over your child's health. But the thing that bothers me is that I do not believe that so many women are dysfunctional. I don't believe that most women dry up. I do believe that being stubborn is the biggest predictor when it comes to successfully nursing your baby. \n\nThere are circumstances where nursing your little one isn't possible. And that is what alternative milks are for. I am pretty certian that the friends I have did give up, not that they had to choose formula. It was pretty aparent that they chose it while they were doing the choosing. I guess that the thing that bugs me the most is that people do not own their decisions. It always has to be the fault of something else. \n\nI admit that I'm a bit idealistic. It is hard for me to wrap my brain around the fact that people choose to formula feed. It is hard for me to understand why a lot of women do not give it their all. We know that formula is not as good as breastmilk. I think of Formula as a medicine, not as an alternate choice. It it were used as medicine then a lot of babies would get sick a lot less. ", "controversiality": 0, "created_utc": 1385147298, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdkmvih", "link_id": "t3_1qwxxn", "parent_id": "t1_cdiqcpu", "retrieved_on": 1428550918, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "I read the case against breast feeding article and some of the comments as well as all the comments here. I am first time mother expecting my son in April. I will not be breast feeding, no I am not going to try, and no one will change my mind. I have two reasons for this, the first was apparent to me a long time ago, the second has becomean issue recently. I have always wanted to be a mother and have nothing but excitement about my pregnancy.the first reason I will not be bfing our because I was systemically abused from birth to the age of seventeen, physically, mentally, and sexually. This led me to the decision a long time ago that I am not comfortable with that kind of contract between myself and my child and I think it is much more important that my demeanor with my child be relaxed and loving than he get possible benefits from breast feeding. The second reason is due to a cyst in my brain I have an over abundance of spinal fluid and its lactated frequently, that has been an issue for multiple years, therefore my milk is useless anyway. That being said I have always heard shit from people when it comes to the first reason and I see it in the comments on that article, if you can't breast feed don't have kids. So, because of what was done to me as a child I have noright to have children? That's stupid. How ever you feed your baby as long as that child is happy healthy and loved, they are getting what they should. No one should ever let you feel otherwise, its a personal matter and should be kept that way.I'm sorry you had to deal with that.", "controversiality": 0, "created_utc": 1385371773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdmi5wm", "link_id": "t3_1qwxxn", "parent_id": "t3_1qwxxn", "retrieved_on": 1428516819, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}