{"submission": {"author": "CryogenicLimbo", "author_created_utc": 1314281299, "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "author_fullname": "t2_5q7zz", "created_utc": 1384875914, "domain": "self.Mommit", "edited": 1384876304, "full_link": "https://www.reddit.com/r/Mommit/comments/1qzd4m/husband_constantly_calling_me_when_he_cant_cope/", "gilded": 0, "id": "1qzd4m", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 88, "over_18": false, "permalink": "/r/Mommit/comments/1qzd4m/husband_constantly_calling_me_when_he_cant_cope/", "retrieved_on": 1411574911, "score": 40, "secure_media_embed": {}, "selftext": "I'm back to work full time, but my husband is working only 3 days a week right now at his job that he just started. Lucky for me, I can take the baby to work so when my husband is working, I take the baby, but I can't get very much done. On days (like today) that my husband is off, I leave the baby at home with him in the hopes of getting a lot done.\n\nBut every time my husband has the baby, I will get at least one, usually two or three phone calls of, \"I can't take this, I can't!\" with background noise of our son screaming his head off.\n\nThe last time this happened, my husband guilt-tripped me into driving home and comforting the baby (which took like, 2 minutes) while he did some paperwork for his new job. I felt like this was wholly unacceptable.\n\nMy husband gets so out of sorts that he'll yell on the phone at me about the baby not shutting up, which of course hurts the baby's ears and makes him cry louder. Wtf is wrong with my husband that he doesn't understand that this is going to be the case?\n\nMy husband took care of his twin nieces when they were infants, he knows what he's doing... or he should. I'm the one who never even touched a baby before holding my own, I don't know how I am able to do this parent thing better than he can.\n\nI don't know what to do, I can't take the baby EVERY day because some days I just need to get work done. He should be able to handle the baby, there's no reason the baby should be wailing so much! And he acts so put-upon when he has to do simple things like feed and change him, and hold him.\n\nHe just called me again, \"he wants to be fed AND held at the same time, what the fuck, this is annoying!\" Holy shit. I don't even know what to say anymore.\n\nEdit: Oh, and the baby sleeps well at night! All night! We get a lot of sleep, so we're not sleep-deprived and at each other's throats for that reason, at all.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Husband constantly calling me when he can't cope with baby crying at home [kind of a rant with question attached, I'm sorry]", "url": "http://www.reddit.com/r/Mommit/comments/1qzd4m/husband_constantly_calling_me_when_he_cant_cope/", "user_reports": []}, "comments": [{"archived": true, "author": "ReckonerA", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you considered that maybe he wasn't all on board for having this baby? Did you really truly discuss this important decision before going forward? \nPerhaps hiring a nanny or full time babysitter for these difficult months or first year could help reduce the pressure and help prevent a marital meltdown. ", "controversiality": 0, "created_utc": 1384876226, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdhzzol", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428596082, "score": -7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "He was more on board for the baby than I was. He still really wants to have another one, but I am not doing all that again. \n\nWe can't afford a babysitter, unfortunately. He doesn't work enough for that. His lack of work ate through all of our savings while I was pregnant and working full-time, and I worked up until the day I went in for induction.", "controversiality": 0, "created_utc": 1384876545, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi04aj", "link_id": "t3_1qzd4m", "parent_id": "t1_cdhzzol", "retrieved_on": 1428596001, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nuclayer", "author_flair_css_class": null, "author_flair_text": null, "body": "Part of the issue, might just stem from no one listening to your husband about his frustrations.  Remember that the culture of a man is to not talk about feelings and often not have anyone to listen. \n\nIf you get frustrated and need to vent, you speak to your family, husband, and friends about it. \n\nMen cannot talk to other Men about this. Men only talk about sports and other manly stuff. Many men have no real women friends they can talk with. This only leaves you to be his source of venting and with you experiencing the same thing are most likely unsympathetic.\n\nHe probably needs someone to talk too. \n\n\n", "controversiality": 0, "created_utc": 1384878159, "distinguished": null, "downs": 0, "edited": 1384878752, "gilded": 0, "id": "cdi0s20", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428595693, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I can totally understand that. He really doesn't talk to anyone about the stress of dealing with the baby, except me. He does talk to me about it, and I am sympathetic but I am also problem-solving and try to help him figure out why the baby is crying so the baby will stop. Sympathy is only good once the problem is solved I think.\n\nI think the only person he might talk to is my brother, but my brother is still kind of \"I don't know about this\" about being an uncle, so I don't know how that would go.", "controversiality": 0, "created_utc": 1384878327, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi0uou", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi0s20", "retrieved_on": 1428595659, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know, but this makes me sad.\n\nYes, of course a baby that young wants to be held while being fed. How else would he feed him?\n\nYour baby is probably picking up on your husbands frustrations and stress.  \n\nI'm sorry, I hope it gets better :(", "controversiality": 0, "created_utc": 1384878606, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi0yzq", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428595603, "score": 24, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nuclayer", "author_flair_css_class": null, "author_flair_text": null, "body": "Just remember that all animals( including humans) have evolved to be really bothered by crying. The US Military uses a baby's crying as a form of torture when training pilots - not kidding. \n\nBased on your tag, you are nightmare portion of baby raising. It get so much easier in a little while. Good Luck to you two.", "controversiality": 0, "created_utc": 1384878673, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi0zzu", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi0uou", "retrieved_on": 1428595590, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Yeah, and it's really hard for me when I have to listen to the baby cry through the phone and I cant' do anything about it. It's horrible that my husband calls me just to make me listen to that!\n\nI'm glad it'll get better soon, thank you for that ray of hope.", "controversiality": 0, "created_utc": 1384878866, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi12y3", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi0zzu", "retrieved_on": 1428595552, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I know, I don't understand why on earth the baby wouldn't be held while being fed. I'm really concerned about what happens while I'm not home. But then I get home and the baby is not only happy and asleep but bathed and in clean clothes. It confuses me. \n\nThe worst is that my husband will yell at the baby, or me, and then the baby cries more. And my husband understands that. But he yells anyway. We have had this conversation so many times. :/\n\nThanks, I hope it does, too. ", "controversiality": 0, "created_utc": 1384879380, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi1axa", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi0yzq", "retrieved_on": 1428595449, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PreposterousMurmur", "author_flair_css_class": "green", "author_flair_text": "1 1/2 year old boy/girl twins", "body": "I have no advice, anytime I try to run out and take care of something alone and leave my husband at home with our twins he calls and texts me with constant questions and them screaming in the background. I can say this though. When a woman gives birth to a child she becomes a mother, when a child is born to a man, he begins his journey to fatherhood. It takes time for some men to put the child first and get in tune with their needs. ", "controversiality": 0, "created_utc": 1384879497, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi1cqy", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428595425, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Well, my little guy was in the NICU for a month and it took the nurses that entire month to teach me how to feed and diaper and bathe my son. I really had no clue what I was doing. My husband seemed to have it all together. But now that we're home, he's the one who is falling apart. I just don't get it.\n\nTwins, though! That must be beyond frustration.", "controversiality": 0, "created_utc": 1384879802, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi1hje", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1cqy", "retrieved_on": 1428595363, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PreposterousMurmur", "author_flair_css_class": "green", "author_flair_text": "1 1/2 year old boy/girl twins", "body": "My twins were in the NICU for 10 days too. For the last 4 days or so we were allowed to help do diapers and feedings. My poor husband couldn't figure out what as going on haha. He's great at doing diapers, but that's where it stops. I have to cook and clean up every night, if I try to get him to do it he ends up freaking out and giving up because the kids are walking around or playing. He can't tune them out, just the same as he can't get in tune with them when left alone with them for any length of time. The worst part is, I don't even think having one child instead of two would of made a difference. I mean he's a great dad, he just can't figure out what's going on sometimes. He gets better the older they get. I think it has a lot to do with them communicating their needs more clearly. I hope things get better. ", "controversiality": 0, "created_utc": 1384880338, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi1q6x", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1hje", "retrieved_on": 1428595251, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Toadette", "author_flair_css_class": null, "author_flair_text": null, "body": "How is the baby when your husband isn't watching him? I imagine that the baby picks up on his stress and it affects him too. It sounds like your husband is having a really hard time coping with the new stress levels. Does he have a history with anxiety at all? It would be worth it to explore this with a doctor if you feel that this is beyond your average stress. If this isn't the case, I would explore some ways for him to cope with the stress BEFORE he gets to the point where he is yelling.\n\nI'm a SAHM, so I can kind of relate to your husband a bit. The newborn stage is pretty stressful IMO because you get so little feedback from your baby when he is happy. Once they start smiling and interacting with you guys, it will be SO much easier. \n\nAnyway, I'll just compile a small list of things that I personally would do on days where nothing soothes the baby. \n\n* First thing, try to solve the problem - Is baby fed, wet/soiled, comfortable, etc. I swear by the [5 S's](http://www.babycenter.com/0_harvey-karps-happiest-baby-method-for-baby-sleep-and-soothin_10373838.bc) \n* NAPS NAPS NAPS. seriously. That baby should only be awake for about an hour at a time before another nap. If the baby sleeps best in a swing (like mine) or a baby carrier, or the damn carseat after a short drive, then do it. An overtired baby is cry cry cry city! Overtired babies don't sleep because they are now too stressed out to sleep. Even now, a year and half later, I am STILL all about naps and keeping my baby from reaching critical overtired levels. \n* Once he's ascertained that the baby is fine (clean, fed, etc) and yet the baby is STILL crying, put the baby in a safe place and go outside for a few minutes to catch your breath. I can't even count the number of times I've done this. Probably the most effective thing really.\n* Try to be sympathetic when he calls. Sometimes during my fresh air breaks id call my husband almost crying and he'd just say \"I know its hard and you are doing your best. Everything will be ok\" I didn't need advice from him, just comfort. Noise levels affect us all differently, and I suspect that the constant crying gets to him on a level that you can't relate to. \n* Naps. OMG naps. I just want to reiterate that if the baby's crying due to overtiredness, you're too late. Ideally you should try to get the baby to nap at the first sign of tiredness, like big yawns and eye rubs. \n\nHopefully you guys can work out some kind of stress relief system for him. Good luck!", "controversiality": 0, "created_utc": 1384880354, "distinguished": null, "downs": 0, "edited": 1384881054, "gilded": 0, "id": "cdi1qex", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428595248, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Well, in contrast, I had him at work yesterday. He was just a bit fussy and wouldn't eat more than one ounce at a time, but slept a bunch and was pretty adorable. However, I do hold him while at my desk and let him sleep on my shoulder while I do some one-handed work, so he's being held. I'm not in a rush to put him down because quiet-time while he's being held is still quiet time. If he's happy, I'm happy.\n\nThe baby does smile and interact a bit. Not too much, but a bit. \n\nI find that while I have an easy time going through that mental checklist of what the baby could need (hungry? tired? dirty? hot? cold? nose clogged?) my husband has a more difficult time figuring out what the baby might need. Sometimes the baby fusses in the middle of the night and it's just because he needs a layer taken off, and then he passes out again just fine, whereas my husband would be stressed out, totally unsure of what's going on.\n\nWe also have a gas problem, even with the reduced-lactose formula... simethicone is helping but not all the time. Once in a while the gas becomes problematic but it's rare.\n\nAnd then, to make things gloriously terrible, tomorrow are our two-month shots!\n\nI hope we can work things out, too. Thank you so much. I hope things get better for you, too!", "controversiality": 0, "created_utc": 1384881043, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi21ks", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1qex", "retrieved_on": 1428595103, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Mostly_me", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe next time he calls you, or talks to you, just ask him \"do you want me to just listen to you (because I know how much it can suck sometimes) or do you want my help to figure out how you can solve this?\"", "controversiality": 0, "created_utc": 1384881372, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi26wj", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi0uou", "retrieved_on": 1428595034, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ilavayou", "author_flair_css_class": "green", "author_flair_text": "Mommy to Molly (3) and Max (3months)", "body": "I don't really have any advice, I can just relate. My husband would stress like crazy with our kids with they were babies. So much that I felt I could never leave. He would call for me to come home while I was grocery shopping to put our son back to bed, then go finish shopping. Frustrating. Once our kids got older he is amazing!  Our son is a year now and he is so great and comfortable. A huge problem he had was he couldn't juggle things. Making himself food, going to the bathroom, getting a shower. He literally could do nothing but care for the baby. This caused him to feel very stressed/uncomfortable/tired. He had to figure out how to multitask more. Also, when I would leave I would tell him the schedule and exactly how to do things. Well, our kids react differently in different situations. My husband couldn't do things how I did them, it would end in chaos. I hope this difficult time passes soon!", "controversiality": 0, "created_utc": 1384881489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi28uz", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428595009, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I've asked that in the past, but not in a nice way (ugh I was so frustrated). Next time I'll say it a bit more kindly.", "controversiality": 0, "created_utc": 1384881584, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2ack", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi26wj", "retrieved_on": 1428594990, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I can barely leave to work in the mornings, like this morning, because my husband can't get it together with the baby. I hope he gets better once my kid gets older! I sure hope so. Thanks!", "controversiality": 0, "created_utc": 1384881663, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2bmi", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi28uz", "retrieved_on": 1428594976, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ilavayou", "author_flair_css_class": "green", "author_flair_text": "Mommy to Molly (3) and Max (3months)", "body": "Everything gets easier as they get older!  ", "controversiality": 0, "created_utc": 1384882018, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2hb0", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi2bmi", "retrieved_on": 1428594900, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ReckonerA", "author_flair_css_class": null, "author_flair_text": null, "body": "Eek. Doesn't sound good. Maybe tell him that if he wants you to work while he's a stay at home dad, then he's gotta suck it up and do his part. That means taking care of the kid/s while you are at working to bring home the bacon. If he's not up to it, better to know that now and do something about it. It'll only get worse if left to fester. Kids don't even start to get easier for a long long long time. If you can't afford outside help, can you draw on the resources of relatives? Or perhaps move into less expensive living arrangements that will enable you to get help?", "controversiality": 0, "created_utc": 1384882320, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2mbt", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi04aj", "retrieved_on": 1428594834, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "Does he leave the house with the baby at all? Maybe he needs more \"activities\" to do throughout the day. Maybe you could help him look for a daddy/baby group in your area and he could go there every once in a while. Maybe he also needs to know that when he is frustrated that it's OK to put the baby down and walk away for 5 minutes to cool down. If he feels like he isn't getting enough done during the day, maybe he can start wearing your son in a moby or ergo? ", "controversiality": 0, "created_utc": 1384882783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2to8", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428594739, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Toadette", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, I meant that list more for him if he is looking for advice. It sounds like you have a pretty good handle on things! I can only guess that perhaps he isn't as good at picking up when the baby's getting tired. I found overtiredness to be what leads to lots of crying.\n\nOh yeah and things did get better from there! I didn't mean to make it sound like things were bad :-P My baby has always been in pretty good spirits, its just those first few months can be stressful and hard. There are LOTS of people who struggle with this time period. Your husband is not alone, but he needs to work on not getting so stressed out. \n\nGood luck with the shots. He'll probably sleep most of the day!", "controversiality": 0, "created_utc": 1384883077, "distinguished": null, "downs": 0, "edited": 1384883257, "gilded": 0, "id": "cdi2yf1", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi21ks", "retrieved_on": 1428594678, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you have a carrier for dad? Maybe if he had hands free he wouldn't be so stressed out. Just tell him every time he wants to yell, to put his hand over his mouth, it's unacceptable that he would yell at a baby. ", "controversiality": 0, "created_utc": 1384883109, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2yy2", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428594671, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "He doesn't leave the house, he's too lazy for that. He just makes a list of all the crap we need and makes me do it. It's fine, I don't need him being more frustrated for having to leave the house with the baby. :/  I've told him to leave the baby and let him cry, but he hates doing it, and yells at me when I do it. He just hates to hear the baby cry; it makes him all flustered. I can understand that, but it doesn't do anyone any good to be worked up. Calmness is the only thing that'll help, not being riled up.\n\nThe baby hates being in the carriers, unfortunately :( :( :( I think we might be doing them wrong. I have a friend who is coming over next week to help us out with them (she loaned us a bunch of them, but we're total dunces, I don't know what we did wrong...)", "controversiality": 0, "created_utc": 1384883118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi2z3p", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi2to8", "retrieved_on": 1428594669, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "He does have one, a friend of mine loaned us a ton of different ones so we could see what works well for us (she's such a peach). The baby really doesn't like carriers, it seems, but it might just be because we're inept. :(\n\nI really need to get him to stop yelling at the baby, it's ridiculous that he does that!", "controversiality": 0, "created_utc": 1384883838, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3b0u", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi2yy2", "retrieved_on": 1428594514, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Well, he doesn't even heed my advice when he calls me, I don't know if he's going to heed a stranger's advice... he called me earlier, threatening to stick his head in the oven (I had to keep from laughing... it's an ELECTRIC oven...) if the baby wouldn't stop crying. After some sighing on my end and complaining on his, I told him to swaddle the baby snugly and pop him in the stroller, and that seemed to help. It's such a pity, because the baby is so friggin cute when he's not bawling.\n\nThanks :)  I hope he does sleep. I have some baby Tylenol on hand just in case!", "controversiality": 0, "created_utc": 1384884031, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3e7l", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi2yf1", "retrieved_on": 1428594473, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Some babies prefer different kinds, especially if they are still very small. If it's too loose they might not feel secure. http://www.amazon.com/Boba-Wrap-Classic-Baby-Carrier/dp/B005U2RB50/ref=sr_1_1?ie=UTF8&amp;qid=1384884115&amp;sr=8-1&amp;keywords=baby+wrap\n\nThis one looks complicated but there are so many ways to wrap it and when my kid was in there, she was super snug and went right to sleep. The baby might be crying because he's putting him/her down too much. Explain how bad their eyesight is, they don't know where daddy is if he's even just a couple of feet away. They need constant cuddles, and crying is their only way of communicating. He'll get a groove soon (I hope!) ", "controversiality": 0, "created_utc": 1384884322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3ixe", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi3b0u", "retrieved_on": 1428594412, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieMuffysticks", "author_flair_css_class": null, "author_flair_text": null, "body": "Have him invite one of his unemployed friends over.  Or two of them.  Leave a copy of \"Three Men and a Baby\" in a prominent place.", "controversiality": 0, "created_utc": 1384884622, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3nt6", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428594349, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "&gt; Explain how bad their eyesight is, they don't know where daddy is if he's even just a couple of feet away.\n\nI think this is truly the crux of the problem. My husband just doesn't get it. \n\nWe have a wrap thing but no idea how to wrap it. I'll try and work on that tonight. Thanks!\n\n", "controversiality": 0, "created_utc": 1384884765, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3q2l", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi3ixe", "retrieved_on": 1428594319, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "If you know the brand they should have some guides on the website. Hope you're able to find a solution for everyone! ", "controversiality": 0, "created_utc": 1384885267, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi3yfp", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi3q2l", "retrieved_on": 1428594211, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "I was thinking maybe he wasn't sure what to do with babies, particularly the \"held AND fed, wtf!\" part, but you said he dealt with twins before... well, how long at a time? His nieces went home every day, right? Maybe he's stressed and feeling trapped because this one doesn't go home, he IS home. He doesn't have the safety net of the nurses anymore. I was actually scared shitless to go home from the hospital with our daughter, because my husband and I would be the only ones to take care of her now.\n\nMen also get post-partum depression, which can manifest as frustration and a feeling of being an inadequate parent. Does he get any time to himself, out of the house and/or with other adults, away from the baby, besides working? Could you get him into therapy, or maybe a parenting class? ", "controversiality": 0, "created_utc": 1384885927, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi49e9", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1hje", "retrieved_on": 1428594069, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "You're not kidding about critical overtired levels. My 20 month old started hitting and scratching me the other night, seemingly out of nowhere. I'd lost track of time and it was past her bedtime, so we had to cut short the routine and tuck her right in bed. She was out in a minute. Heck, I'm still a gigantic grouch when I've been up too long.", "controversiality": 0, "created_utc": 1384886082, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi4bz1", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1qex", "retrieved_on": 1428594035, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "That definitely sounds like post-partum. Even if he's never had a history of anxiety or depression, becoming a parent is one of the biggest permanent life changes someone can ever go through. Please consider getting him to a doctor. Threatening self-harm (or harm to the baby!) even out of frustration eventually makes the option look more attractive. I've been there.", "controversiality": 0, "created_utc": 1384886304, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi4fro", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi3e7l", "retrieved_on": 1428593986, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I didn't even know it was possible for men. I am going to talk to someone for him asap, thanks.", "controversiality": 0, "created_utc": 1384887395, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi4yf5", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi4fro", "retrieved_on": 1428593745, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "He lived with his sister from when the girls were I think 4 months old until they were about 3 and a half. His sister kind of dumped them off on him (he had just gotten discharged from the Marine Corps, so he was home all the time) and he had to deal with everything, he couldn't escape anything at any time. He even said that this is easy compared to them, so I don't know what the problem is.\n\nHe will get tomorrow to himself because I have to take the baby for his shots and then to work with me for the rest of the day. :/  But I don't get an ounce of credit for any of that kind of thing from him. I think it makes me less sympathetic. \n\nHe does get time to himself, I just think he wants more of it and is grumpy because he can't have it. Or he wants to nap. I don't know...", "controversiality": 0, "created_utc": 1384887664, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi52x7", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi49e9", "retrieved_on": 1428593686, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nyemenya", "author_flair_css_class": null, "author_flair_text": null, "body": "I would agree with you except for the part where he does something else when she comes home to take care of the baby.  \nI didn't have this problem with my ex, we were both wtf do we do (heck we got into trouble in the hospital after having her because she slept through her first night). My 2nd husband with out baby was this way.  I knew what to do and he was out of depth like I was the first time.", "controversiality": 0, "created_utc": 1384887825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi55n2", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi0s20", "retrieved_on": 1428593651, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "crazyfordisney", "author_flair_css_class": "lightcoral", "author_flair_text": "Working Divorced w/ 17m.o. girl", "body": "I remember doing this to my husband while I was on maternity leave.  I had a meltdown every day at around 3pm.  I would call and vent and he would tell me it was ok and to calm down etc etc and then I would hang up and all would be well.  \n\nMy guess is that he doesn't really have anyone else to call that won't judge him or give him useless info.  \n\nI would suggest trying to find some things to get him out of the house with the baby.  I always found that the days I had an appointment or plans that got us out of the house went better than the days when we could lounge around in our PJs all day.  ", "controversiality": 0, "created_utc": 1384887968, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi583j", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428593619, "score": 25, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hopewings", "author_flair_css_class": null, "author_flair_text": null, "body": "Ask him to text you instead, so you don't have to listen to the baby at the same time?\n\nDo you have a sling or carrier for the baby? Do you have a swing or bouncer?  The swing was a lifesaver for me in the early months.\n\nAsk him to take ten deep breaths in and out whenever he feels like yelling.  I've been there myself... the emotions can be hard to deal with.  It was really painful to listen to a screaming baby, especially because I was sleep deprived (baby woke up every 1-2.5 hours all day and night, so I got NO sleep).\n\nAlso remember the order of operations when baby is screaming. Soothing steps:\n\n1. check diaper\n\n2. offer milk/food\n\n3. burp for gas, put pressure on tummy\n\n4. check temperature/cold/hot\n\n5. check for discomfort-inducing things like ties around baby's skin, clothing tags sticking out, etc.\n\n6. hold/bounce/rock\n\n7. if baby is still crying, baby probably needs sleep, so put down for nap in swing, lots of shhhing sounds, or white noise, etc.\n", "controversiality": 0, "created_utc": 1384888212, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5c9r", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi12y3", "retrieved_on": 1428593565, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "well yeah, he's not yelling because he thinks it will help, he's yelling because his emotional pot is boiling over and he needs to let off steam so he doesn't flat-out explode. it makes the baby cry more, sure, but from his POV the baby's already crying anyway and he doesn't know how to make the baby stop, so at least yelling makes *him* feel better while he has to listen to all that crying.", "controversiality": 0, "created_utc": 1384888532, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5hn5", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1axa", "retrieved_on": 1428593495, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BatFace", "author_flair_css_class": "orange", "author_flair_text": "R 02/2012", "body": "I haven't read all the replies, so sorry if these have already been suggested. \n\nI'd never held or cared for a baby before our son was born, while my husband helped take care of his little sister, they have a huge age gap. I assumed he would be a better parent than me. I was wrong. IT just didn't come as easy to him. The best things I've found is to tell him exactly what to do.\n\nSo maybe make a list that have things for him to check. And then be sure to add that sometimes babies just cry. But that did confuse my husband as sometimes he would assume the baby was just crying, and not try to fix it. \n\nBe sure to tell him that he is allowed, and encouraged, to put the baby down in a safe place and step out of the room/house when he gets overwhelmed. Sometime just a few minutes of quiet, fresh air, can help a lot.\n\nBe sure to tell him he is allowed to try to do things differently from the way you do them or tell him to do them, as long as it's safe. Some things that work for mom wont work for dad and some things that work for dad wont work for mom. Though feeding the baby without holding him is one of those things that is not allowed because it's simply not safe.\n\nBe sure to split things 50/50 when you are both home. Staying home with a baby is work. Neither one of you have the right(unless this was agreed upon before the baby came along) to claim they worked harder and so the other parent must do everything else. A few minuets of down time is acceptible for both you. My husband usually gets 30-40 mins of down time when he gets home from work, then he takes the baby and I go for a walk or take a bath or just read somewhere else in the house for 30-40 mins. After that, we take turns with diapers, and we help each other with chores and dinner, or one of volunteers to do dinner while the other baby wrangles.\n\nThat last one is still the hardest for us and out son is almost 2. Its so tempting for both of us to claim we had a harder day, or I changed 5 poopy diapers you get all other diaper changes for the day. But we agreed before the baby came along that when we are both home we are both parents and we split things 50/50 no matter how bad of a day we think we had.\n\nThis is what has worked for us. Of corse we dont stick to it 100%, there are days where one or the other of us is just exhausted and basically takes the day off, but the other one has to be agreeable with that too.\nGood luck.", "controversiality": 0, "created_utc": 1384888556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5i0n", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428593491, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "My ex was discharged from the Army just before our son was born, and he had many of the same issues. Transition can be really hard on some guys, even months or years later. Military guys can totally break when they don't have control over their surroundings, and nothing makes you feel powerless like a crying baby.\n\nMy ex also had depression, but being an egotistical soldier, he refused to admit it to himself or get help for it.", "controversiality": 0, "created_utc": 1384888574, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5ial", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi52x7", "retrieved_on": 1428593487, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "&gt; I have an easy time going through that mental checklist of what the baby could need (hungry? tired? dirty? hot? cold? nose clogged?)\n\nsee, my kid's almost 2 and the idea that she might be/have been upset because her nose was clogged has *never* occurred to me. stuff like that makes me feel not cut out for this mommy gig, heh.", "controversiality": 0, "created_utc": 1384888864, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5n3p", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi21ks", "retrieved_on": 1428593425, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I think I add it because before we made the switch to reduced-lactose formula, the baby used to shoot spit-up out his nose and need to get suctioned, at least a few times a day. Even now, when he goes on his crying jags, he needs to get the mucus suctioned or else the \"I can't breathe through my nose!\" will keep him crying and he'll never calm down.", "controversiality": 0, "created_utc": 1384889061, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi5qi3", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi5n3p", "retrieved_on": 1428593381, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "charlie6969", "author_flair_css_class": "green", "author_flair_text": "Tabby's Mom", "body": "Does your hospital offer baby care classes?\n\nHe won't stress so hard if he has actual steps to take to improve the situation.\n\nIf he is embarrassed, take the class with him. The more you know the more comfortable you are. The more comfortable you are the less stressed you are.\n\n\nI understand frustration, I have anger problems so I totally do understand, but yelling at a baby every day is abusive.\nAs a baby, parents are GODS to them. How is a baby going to feel/act  if it's being yelled at by GOD on a daily basis? Possibly for years?\n\nYour husband needs a therapist or a parenting teacher. Each would probably help.\n\nI'm not suggesting that your husband is abusive, but the only thing that keeps it from being abusive is in how often it takes place.\n\nTalking about his stresses might help him cope. Not with you, with someone neutral.\n\n\nThat said, my daughter had colic. I feel your pain and frustration.\n\nGood luck, OP. I know you both will figure out what's best for your little family.\n\nTL;DR\nI'm a woman but I was your husband, at one time. Acted just like him. It's curable. ", "controversiality": 0, "created_utc": 1384889559, "distinguished": null, "downs": 0, "edited": 1384890280, "gilded": 0, "id": "cdi5z2p", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi2z3p", "retrieved_on": 1428593270, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ashley0427", "author_flair_css_class": null, "author_flair_text": null, "body": "Tell him to suck it up and get over it. Its his kid too and unless he wants to work full time and let you stay at home then he needs to figure stuff out. My husband stay at home with all four of our kids, our youngest being 8 months and completely breastfed at the time. He learned his own coping mechanisms. If all else fails have him call someone else instead of you, because all he is doing is driving a wedge between the two of you. \nSecondly, on a day when you both have time off, tell him how you feel and how this effects you. Tell him that if needs help he needs to text or email that phone calls aren't allowed. Tell him that if the kid is screaming too much, and he needs a break to put the kid in his crib grab the baby monitor and go sit out side for a few minutes. It never hurt a kid to cry and it won't hurt dad to get fresh air. \nBut honestly if it were me I would tell him to man the hell up and get over himself. ", "controversiality": 0, "created_utc": 1384889979, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6667", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428593178, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "We even took the baby care class, and my husband was so snotty about it, saying, \"I know all this, there's nothing here I don't know.\" Meanwhile, it was all new to me. I'm glad we took it.\n\nThanks! I know we'll figure it out in the end.", "controversiality": 0, "created_utc": 1384890329, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6c4n", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi5z2p", "retrieved_on": 1428593100, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "You, I like you.\n\nI'll tell him to call his mother. She'll take my side and tell him to get over it anyway.\n\nI can't wait until next week, speaking of which. Mother-in-law, the savior, will be with the baby...!", "controversiality": 0, "created_utc": 1384890420, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6dng", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6667", "retrieved_on": 1428593081, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "charlie6969", "author_flair_css_class": "green", "author_flair_text": "Tabby's Mom", "body": "I'm glad you took it and it helped you.\n\nGood luck with your man. It's hard to teach someone who already knows everything, isn't it?\n\nHang in there. You sound like a great Mama.", "controversiality": 0, "created_utc": 1384890687, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6i9b", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6c4n", "retrieved_on": 1428593022, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FranniPants", "author_flair_css_class": "red", "author_flair_text": "Aiden 10-11-10", "body": "I can totally relate to you. My son's father (who is no longer in the picture at all) would pull this on me all the time when I was at work. My phone would not stop ringing, and I'd constantly get texts like \"this fucking kid doesn't ever shut up.\" Or \"God why isn't he sleeping for 18 hours straight?\" Well, because he's not an inanimate object, that's why.  I had to leave work early all the time because I couldn't deal with knowing my infant was screaming and he'd literally be doing nothing to help him. He'd just sit there next to him while he was crying so hard that he was gasping for breath. And the same with doing baby-related chores. \"Hey, help me. Either do his laundry or wash the bottles.\" *What???* *Me* *do* *work*? Ooooh the shit I'd get for asking for anything.\n\n\n\nMy son was an exceptional baby with anyone *other* than his father. He barely ever cried or fussed. But with him...even from day one...he'd cry when he was holding him or anything.\n\n\n\nAnyways, I don't have advice. I think he may still be getting used to the whole life adjustment and doesn't know how to vent his frustrations about it though. I hope it makes you feel better that you are certainly not alone in what you're experiencing!", "controversiality": 0, "created_utc": 1384890779, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6js7", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428593001, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "It is, indeed. Sometimes I just mentally facepalm and try not to let myself get too annoyed, because I don't need the added stress.\n\nAww, thanks. I don't know, I'm trying to be. We'll see how the little man turns out.", "controversiality": 0, "created_utc": 1384890849, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6l04", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6i9b", "retrieved_on": 1428592985, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jerry_sizzler", "author_flair_css_class": "purple", "author_flair_text": "One girl, 3 years", "body": "Maybe you could try showing him this website: http://purplecrying.info/ My daughter's father and I were both really clueless about crying when she was a baby, and I had no idea that it was common and normal. So maybe he just doesn't understand like I didn't. I'm less sympathetic about him being pissed that the baby wants to be held and fed at the same time. FFS, your baby is 2 months old. Can he even hold the bottle himself?\n\nI hope it gets better. Hang in there.", "controversiality": 0, "created_utc": 1384891229, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6rr2", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428592898, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Oh my gosh. I'm so sorry that you had to deal with that, and that your son had to!\n\nMy husband definitely tries to be helpful. His frustration totally is stemming from \"I don't know why he's crying, and I hate that I can't figure it out!\" He also wants to cook dinner and clean up in the apartment so that I don't have to do it when I get home. \n\nBut he needs to curtail his yelling. The yelling is terrible. I think I could deal with the phone calls, maybe, if they didn't come with yelling at me and the baby :(", "controversiality": 0, "created_utc": 1384891519, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6wud", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6js7", "retrieved_on": 1428592832, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "travelingmama", "author_flair_css_class": "purple", "author_flair_text": "Nate 5 Audrey 3 and Due 3/21", "body": "The reason he calms so easily with you is because you're calm. If he would calm down, the baby would a LOT faster too. ", "controversiality": 0, "created_utc": 1384891636, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6yws", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1axa", "retrieved_on": 1428592805, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Oh! What a great site!!!  Thank you so much! I'm going to email this to him so he'll always have it when he needs it.\n\nI'm totally unsympathetic about the held AND fed thing, myself. Pick the baby up, geez. The poor thing. :(  He's such a sweet baby, too, I can't imagine why his father wouldn't want to snuggle him all day anyway, he takes him away from me enough while we're together at home!\n\nThank you!", "controversiality": 0, "created_utc": 1384891656, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6z9y", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6rr2", "retrieved_on": 1428592800, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I thought so! I've tried to tell him this as well :(  Thank you for validating me.", "controversiality": 0, "created_utc": 1384891697, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi6zzm", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6yws", "retrieved_on": 1428592791, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FranniPants", "author_flair_css_class": "red", "author_flair_text": "Aiden 10-11-10", "body": "Well at least he's trying! Your flair tells me your baby is only 2 months old, so in time I'm sure he'll learn which cries mean what :)\n\n\n\nMaybe you can buy him a stress ball so he can squish it, instead of yelling. Just keep reminding him to keep calm and that it will get a little easier each day", "controversiality": 0, "created_utc": 1384891954, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi74n7", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6wud", "retrieved_on": 1428592731, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "I sure hope so. I love my son and my husband and I want everything to be okay!\n\nPerhaps. I will try to get one! Maybe that will work. I think, though, this will be the last day of daddy-alone-with-baby for the next couple weeks &gt;&lt;", "controversiality": 0, "created_utc": 1384892117, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi77hc", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi74n7", "retrieved_on": 1428592694, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FranniPants", "author_flair_css_class": "red", "author_flair_text": "Aiden 10-11-10", "body": "I'm sure that it will all end up just fine!\n\n\n\nI wish you the best of luck. I can't imagine trying to do work with a little one around!", "controversiality": 0, "created_utc": 1384892290, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi7am5", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi77hc", "retrieved_on": 1428592653, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smartache", "author_flair_css_class": null, "author_flair_text": null, "body": "If he has experience with babies, and is reasonably well rested, there must be something else going on. Maybe he is resentful of you going back to work? Or maybe he is experiencing major stress with his new job? ", "controversiality": 0, "created_utc": 1384894260, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi891p", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428592136, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "5 yr old boy &amp; 1.5 yr old girl", "body": "Your husband is in a job role that he's new at and sucks in. He will get better in time. Understand him, comfort him, reflect his feelings back at him, but absolutely don't come relieve him of his responsibility unless he's going to cause harm to himself or the baby.", "controversiality": 0, "created_utc": 1384896629, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi9fkt", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428591585, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "5 yr old boy &amp; 1.5 yr old girl", "body": "Do assume nothing common sense is actually common sense right now. Guy's in an emotional tizzy. Answer that with \"The baby needs to be held every time the baby's fed.\" It's then up to him if he can manage to follow your directions or figure out another way.", "controversiality": 0, "created_utc": 1384896777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi9ibw", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1axa", "retrieved_on": 1428591549, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "finnerpeace", "author_flair_css_class": null, "author_flair_text": null, "body": "You can also \"companion\" him through the stress. (We do this in the Virtues Program.)\n\nYou can \"echo\" what he's expressing, and acknowledge his feelings. It'll help him relieve stress and then be more ready to listen to ideas. You must be sincere, or else it won't work. For example:\n\nYou: \"Oh, baby's crying a lot. That must be so frustrating!\"\n\nHe: \"Yes, I swear I'm gonna stick my head in the oven!\" \n\nYou: \"You're really frustrated! I'm so sorry, Honey. [pause] Gosh, do you have a plan to regain some peace for yourself?\"\n\nHim: \"I'll stick the baby in the oven.\"\n\nYou: \"Haha! Love your sense of humor. Listen, did you check if baby _(is wet, nose blocked, etc)_?\"\n\nand then the conversation will go from there, but really just showing you understand his feelings can really help tremendously. And you can offer to give him a massage, etc when you're home. \n\n*I* was the one stuck at home with truly psychotically-crying baby, and boy do I wish hubbie could have handled it this way, instead of just being silent on the phone, or reminding me \"well, you *wanted* to be a mother\", etc.", "controversiality": 0, "created_utc": 1384897067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi9nlt", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi2ack", "retrieved_on": 1428591481, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "WigglyBaby", "author_flair_css_class": "green", "author_flair_text": "Mom to 2.5 year old girl", "body": "My husband cannot handle hearing baby cry.  It is really strange -- it stresses him out and it takes him a couple hours to recover.  He never yells at the baby though, and somehow he manages, but he will grumble at me afterwards.  It has gotten easier for him now that she's older and more interactive.\n\nCan you guys get a sitter and go for a date night and have a baby-free, non-stress, adult conversation about this.  Things that should be addressed are what to do about the crying, that crying or no crying, yelling at baby, or yelling at you in front of baby is not the role model he probably wants to be for the little one, and that his life needs to adjust to include the baby (holding him while feeding, while using the washroom, while showering, while making lunch, etc.).  If those twins were 4 months old already, he was past the hard \"fourth trimester\" phase.\n\nIt's also possible to have PPD in men, and he could just be unable to cope and need some external help or support.\n\nYou could try posting to r/daddit to get some male perspective on this.  I bet some of those guys have been in his position and might be able to give you advice on what to do.\n", "controversiality": 0, "created_utc": 1384897266, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi9r4t", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428591435, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LinkFixerBotSnr", "author_flair_css_class": null, "author_flair_text": null, "body": "/r/daddit \n\n*****\n^This ^is ^an [^automated ^bot](http://github.com/WinneonSword/LinkFixerBotSnr)^. ^For ^reporting ^problems, ^contact ^/u/WinneonSword. ^If ^this ^bot ^fixes ^a ^link ^that ^is ^the ^same ^as ^the ^subreddit, ^ignore ^it. ^/u/WinneonSword ^is ^working ^on ^this.", "controversiality": 0, "created_utc": 1384897295, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdi9rol", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi9r4t", "retrieved_on": 1428591428, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dontcountmeout", "author_flair_css_class": null, "author_flair_text": null, "body": "Lots of good advice here. I have one little 'emergency trick', if he'd be open to it. I have a lot of kids. One went through a particularly difficult crying phase and when  he did, I discovered that the sound of the vacuum was very soothing to him. If he were to put the baby in his baby seat and then vacuum, it might help them both. Some babies really like the sound and it is a monotonous ritual requiring no real thought so it calms down the 'vacuumer'. As a bonus, the sound of the motor seems to take the edge off of the baby's cry for the caregiver. As a double bonus, the floor gets really clean. :)", "controversiality": 0, "created_utc": 1384897871, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdia21x", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428591294, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "That baby can sense his awkwardness.  They're perceptive like that.  I'd recommend telling him to just chill out.  Mine is more fussy and ill tempered when my husband watches him as well, because I suppose there's no touch like mother's... but he's gotta buckle down.\n\n1.  Check if it's poopy\n2.  If it's not poopy he may be hungry\n3.  If he's not hungry he may have gas (burp or fart)\n4.  If it's not burp or fart he may just be overly tired, put him down for a nap.\n\nThese are my 4 that I rotate and they always work for me.  Maybe he's forgotten them since he watched his nieces, but he's obviously not responsive to his own baby in a gentle way, and the baby will notice that and react accordingly.  Daycare may have to be an option if he can't get it together because someone has to watch him and he deserves tender care and not a pissed off dad.  A pissed off strung out parent can lead to unmentionable things like shaken baby syndrome, and that is a horror story we don't want to come true.", "controversiality": 0, "created_utc": 1384900183, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdib5ra", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428590779, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "I can imagine how this must upset you.  I would not let my husband even near our baby if I caught him yelling even once.  Maybe I'm just a little overprotective but I think even the most level headed and kind hearted person can snap and shake a baby.  \"This could never happen to me\" are famous last words.\n\nBabies are sweet innocent little things who need to be held, need to be cradled and cuddled, need to be comforted, need to feel the love come off of us.  Your baby must not feel any of these things coming from his dad right now, and he probably cries from fear and uncomfortableness.  ", "controversiality": 0, "created_utc": 1384900502, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdibayn", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1axa", "retrieved_on": 1428590712, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "And I called to check on them a little while ago, to find my husband cheerful. They had just woken up from a nap, with the baby sleeping on daddy on the couch, and my husband was feeding him. No crying for the rest of the day. I think they both needed a nap and a snack. Sigh. I think they have the same \"I'm irritable right now!\" timing.", "controversiality": 0, "created_utc": 1384900784, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdibfn8", "link_id": "t3_1qzd4m", "parent_id": "t1_cdibayn", "retrieved_on": 1428590651, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "Perhaps he is his father's son! Remind your hubby that that is his baby to love and protect and cherish.  He's passed on part of himself in that little person and he should always be glad to take care of him!  He will never be this little again so he should remember it and enjoy it as best he can.", "controversiality": 0, "created_utc": 1384901085, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdibkmt", "link_id": "t3_1qzd4m", "parent_id": "t1_cdibfn8", "retrieved_on": 1428590586, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrspuff", "author_flair_css_class": null, "author_flair_text": null, "body": "Or he could get a full-time job and hire a nanny.", "controversiality": 0, "created_utc": 1384901617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdibtjf", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi6667", "retrieved_on": 1428590471, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yeuxsee", "author_flair_css_class": "green", "author_flair_text": "O, 1/14/13", "body": "The first couple of months I was back at work were really hard for my Babydaddy - he would watch O from 8:45a-6:15p and then when I got home he would be very irritated and shove the baby in my arms before I could even put my purse down. Around 5p or so was Babydaddy's breaking point and O's usually irritated time, so by 6p both were a perfect storm of pissed off. Also, Babydaddy had a hell of a time getting O to sleep until about three months ago. It was really hard on them BOTH (and that's the rub, these types of dudes don't seem to understand that there are two people involved in this stressful situation, them and the baby). Babydaddy seems to be a similar temperament to your husband (he's got a hell of temper) and he used to just text me all day, really similar stuff. It's gotten a whole lot easier and will continue to, for both of our families. Before I went back to work, I laid down some laws and his mom backed me up and he basically sticks to them. The rules are this: you hold the baby while you feed him (there's a great article on kellymom about why this is important that you may want to send your husband), you pick the baby up when he is upset NO MATTER WHAT (also good articles about this all over the internet), and if all else fails, go on a car ride (cus the baby will sleep in the car and then the father can decompress for a bit). \n\nPretty much until O was 6 months old, he and Babydaddy would go on car rides every day I was at work, sometimes multiple times a day. Then we had to upgrade our car seat and that didn't work as well but also O was easier for Babydaddy to take care of. Something shifted in O and he would go to sleep for his dad and they'd have nice days. Babydaddy still gets irritated and needs to be 'off the clock' as soon as I get home but he's getting a better handle on it. I understand - he doesn't have handy dandy boobs to calm the baby down with. \n\nI think you and your husband need to have a serious talk about how he treats your son. Figure out some coping strategies and open up the lines of communication. Make sure both of you are on the same parenting philosophy bandwagon - that's easy for us because Babydaddy defers to my wishes cus I'm Mom and I do all the research. Present him with what you'd like for him to do and see what he thinks. And maybe he should call his mom/sister/aunt/bff/neighbor/college friend/whatever next time the baby is freaking out and he needs to vent about it - it will only stress you out and erode your trust in him if he calls you about it all the time. Cus I think that's the key - you need to be able to trust him to take care of the kid while you're not there so that in the future he has the confidence in his parenting abilities to take care of the kid so you don't have to all the time. \n\nHope that helps. It gets better, I promise! Remember, this is just a stage and it'll pass. Even the nice ones like sleeping through the night!", "controversiality": 0, "created_utc": 1384903521, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdicnnh", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428590081, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "He does a lot of complaining that our son looks like me and not him (pale and dark blonde hair instead of Hispanic!) so it's nice that he takes after him in some respects :)\n\nI know, it's so sad that he'll never be this little again. I need to go home and cuddle him, excuse me!", "controversiality": 0, "created_utc": 1384903664, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdicpv8", "link_id": "t3_1qzd4m", "parent_id": "t1_cdibkmt", "retrieved_on": 1428590052, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yeuxsee", "author_flair_css_class": "green", "author_flair_text": "O, 1/14/13", "body": "Maybe your husband could use a list of possible problems like u/Toadette posted on the fridge or something? ", "controversiality": 0, "created_utc": 1384903681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdicq4w", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi21ks", "retrieved_on": 1428590048, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "We've had talks about it in the past, and we had one after the baby had calmed earlier today as well (after I'd written this post so I felt a lot less angry, too).\n\nYou're right, I don't trust him to take proper care of him. It makes me nervous that something will happen if I'm not around. But when I called to check on them earlier, they had just woken up from a nap (baby slept on daddy's chest, on the couch) and baby was being fed. Daddy was in very good spirits. I felt a lot better after that. I've felt much better for the rest of the day, in fact.\n\nI hope the sleeping through the night stage NEVER passes! :( :( :( ;)", "controversiality": 0, "created_utc": 1384903848, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdicst9", "link_id": "t3_1qzd4m", "parent_id": "t1_cdicnnh", "retrieved_on": 1428590014, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "Someone thoughtfully posted a site about babies crying at this age, and I sent it along to my husband. He said he read it and gave it a lot of thought. I hope it helps him the next time this happens (which won't be for a while, if I have my way).", "controversiality": 0, "created_utc": 1384903897, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdictj2", "link_id": "t3_1qzd4m", "parent_id": "t1_cdicq4w", "retrieved_on": 1428590004, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yeuxsee", "author_flair_css_class": "green", "author_flair_text": "O, 1/14/13", "body": "&gt;You're right, I don't trust him to take proper care of him. \n\nGive yourself a little slack! You're only two months our and the mommy hormones are still running thick. You've known that little person for a long long long time and it's hard to be away from him (I don't think that ever goes away, though). And you're both still learning a lot. It's take a lot of conscious self control and reframing of my thoughts to be ok with how Babydaddy is taking care of O. I'm still working on it too- O went to the babysitter's for the first time on Monday (so nerve wracking) and Babydaddy asked me a question, I suggested something, he said \"nah, I'll do this\" (which wasn't what I would do at all) and I just had to trust him. It was so hard. But in the end, he's smart and he loves O and he's doing the best he can so it's ok. And it was! \n\nInternet stranger hug. I'm glad you're feeling better. Maybe your husband would like r/daddit :P", "controversiality": 0, "created_utc": 1384904605, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdid4n5", "link_id": "t3_1qzd4m", "parent_id": "t1_cdicst9", "retrieved_on": 1428589860, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ideaprone", "author_flair_css_class": null, "author_flair_text": null, "body": "I know it's the nature of the subreddit, but I see that all of your responses are from women. As a stay at home Dad of a 2 year old boy and a 3 month old girl I thought I might have some insight.\n\nA unique aspect of being a Dad is that basically everyone thinks you are incompetent (at least until you prove yourself otherwise.) This can be really hard to deal with. I suspect that he feels like the baby crying is a sign to others that he has failed or is incompetent. Are you or other women in his life quick to judge or correct him? Maybe he simply feels like strangers at the store are judging him (I know I did at first), or maybe he is judging himself.\n\nEvery baby cries. The truth is that the kid is fine and he's a good dad. That should be his mantra.  \"The kid is fine and I'm a good dad.\"  The rest follows from that. \n\nA baby's cry simply means \"Large Person, change this situation!\" And as parents we get the pleasure of being somebody's Large Person.  ", "controversiality": 0, "created_utc": 1384905147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdidd4j", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428589751, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CryogenicLimbo", "author_flair_css_class": "blue", "author_flair_text": "Theodore ♥ Sept 19, 2013", "body": "As the baby was perfectly happy and sleeping when I returned home, I feel like my husband did a good job, in the end. I just wish the journey wouldn't stress him out so much.", "controversiality": 0, "created_utc": 1384911036, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdifwdp", "link_id": "t3_1qzd4m", "parent_id": "t1_cdidd4j", "retrieved_on": 1428588496, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kiln", "author_flair_css_class": null, "author_flair_text": null, "body": "This!  ", "controversiality": 0, "created_utc": 1384912718, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdigmmv", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi583j", "retrieved_on": 1428588156, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kiln", "author_flair_css_class": null, "author_flair_text": null, "body": "Is he really calling you to \"make you listen\" to it? It seems to me that he is crying out for help.  I remember this so clearly during the first months of babyhood.  I had to call my husband at work because I needed that lifeline.  \n\n2 things that really really helped all three of us - the DVD \"The Happiest Baby on the Block.\" It gave my husband so many ways of soothing our daughter.  He would be frustrated because he couldn't soothe her by nursing like I could.  Even a bottle of pumped milk wouldn't have the same effect.  I have given this DVD as baby gifts many many times because it is so helpful.\n\nAnd the other thing was a swing.  Importantly - it had to swing side to side and have a plug instead of batteries so it wouldn't run out mid-soothe.  This is how I showered, how I ate, how I took a moment to breathe.  Best piece of baby \"equipment\" that we bought.", "controversiality": 0, "created_utc": 1384913252, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdigv32", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi12y3", "retrieved_on": 1428588046, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384913302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdigvv5", "link_id": "t3_1qzd4m", "parent_id": "t1_cdibayn", "retrieved_on": 1428588036, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "juhesihcaaa", "author_flair_css_class": "purple", "author_flair_text": "Twin girls; 3/14/11", "body": "My husband used to do the same thing. Turns out, it was just the age. As they (twins) got older, he got better with them.", "controversiality": 0, "created_utc": 1384913633, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdih16o", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428587967, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ideaprone", "author_flair_css_class": null, "author_flair_text": null, "body": "Right on :) Sorry, just trying to help.", "controversiality": 0, "created_utc": 1384914448, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdihe74", "link_id": "t3_1qzd4m", "parent_id": "t1_cdifwdp", "retrieved_on": 1428587798, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1384914725, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdihijq", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428587742, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NinjaGinny", "author_flair_css_class": null, "author_flair_text": null, "body": "I did the same thing.  It was just about having someone to talk to when I was stressed out. ", "controversiality": 0, "created_utc": 1384917865, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdiiw1d", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi583j", "retrieved_on": 1428587101, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Surely_Jackson", "author_flair_css_class": null, "author_flair_text": null, "body": "He yells at the baby? That needs to get shut down immediately. If he can't control his yelling, he needs therapy.", "controversiality": 0, "created_utc": 1384918088, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdiizdz", "link_id": "t3_1qzd4m", "parent_id": "t1_cdi1axa", "retrieved_on": 1428587057, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "Well good for your blonde haired blue eyed genes for being one of the very few of their kind to beat out the darker genetics! I read somewhere that dark always trumps light in the genetic pool so you must be a badass.  :D  My boy is 9 weeks old and looks nothing like me.  He looks just like my husband but I'm very proud of that fact, so I can't say that I understand where he's coming from.  A lot of the nurses at the hospital were baffled by how proud I was that my baby looked like my hubby... apparently nobody is that way, and one parent is always initially butthurt about it.  Personally, I fell in love with my husband and find him very handsome so to have a baby that looks like him makes me quite proud!", "controversiality": 0, "created_utc": 1384918522, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdij60e", "link_id": "t3_1qzd4m", "parent_id": "t1_cdicpv8", "retrieved_on": 1428586971, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh goodness PPD is no joke and is terrifying.  I was on the alert for that for the first two months for myself because while I don't suffer from any psychiatric disorders, I did suffer from anxiety a few years back, and my father's mother had depression and was totally crazy.  You just never know!", "controversiality": 0, "created_utc": 1384918580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdij6wc", "link_id": "t3_1qzd4m", "parent_id": "t1_cdigvv5", "retrieved_on": 1428586960, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I think the best thing you can do for yourself and your husband in this situation (when he calls you at work) is be his cheerleader. If he's calling you frustrated and you get frustrated in return, the situation will escalate. It may feel entirely counter-intuitive, but when he calls you, try telling him how great a father he is. Remind him that he doesn't need your help because he is equal part parent and he can do this. \n\nSometimes the hardest part of parenting - for mothers and fathers - is the crippling self-doubt. Every time you give in and go home and help him out, it reinforces to him that he isn't the right person for the job. So, even though that is what he is asking you to do, it probably isn't helping your cause.  He is the father and fully capable of taking care of your son. You know that, so try and help him know it too. It will help him be more competent (and confident) which ultimately means he'll stop calling you so much - so it's good for everyone! \n\nI don't mean to oversimplify, I recognize these situations with spouses and new babies are complex and it will likely take a little while to get into a good routine. Just offering one suggestion. Good luck!", "controversiality": 0, "created_utc": 1384955454, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdiruws", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428582780, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "glowworm2k", "author_flair_css_class": null, "author_flair_text": null, "body": "Can your husband take the baby out to a play group or something similar?  Sure, the kid is too small to play, but those groups are just as much about getting parents out of the house as they are about the kids.  Some time to chill with adults - even if most of them are women which might be a bit awkward for him - could help. \n\nI regularly go to a playgroup where I hang out with a dad who is also a regular.  He doesn't identify with most of the moms who go (especially the ones who only talk about their babies), but we both like motorcycling and have similar tastes in TV shows, etc., so we have non-kid stuff to talk about while our kids do their thing.  It's nice for both of us and sure helps to make sure the walls don't close in! ", "controversiality": 0, "created_utc": 1384961191, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cditou5", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428581925, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "blangdon", "author_flair_css_class": null, "author_flair_text": null, "body": "2 thoughts:\n\n1. Can you get a sitter? Maybe if he only had to do it one day a week it would be easier for him to handle. Don't get hung up on what you can handle versus what you think he should be able to handle. If he can't, he can't. He'll probably adjust over time, but maybe a little extra help now would make a big difference.\n\n2. Maybe he just needs a bit more confidence. Can you affirm him more that he's a good dad? Let him know he's doing great, and it's okay if things don't go perfectly? My husband is great with our kids, but he just doesn't enjoy being home alone with both of them. I think part of the reason is he puts a lot of pressure on himself to be a \"good dad.\" So he makes things (in my opinion) a lot harder than they need to be--giving the kids continual high-energy attention instead of just letting them be. A different issue than yours, of course, but I think it comes out of the pressure he puts on himself to be a good dad. Maybe your husband is feeling the same pressure?", "controversiality": 0, "created_utc": 1385080965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cdk334c", "link_id": "t3_1qzd4m", "parent_id": "t3_1qzd4m", "retrieved_on": 1428560269, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}