{"submission": {"author": "yumcrackers", "author_created_utc": 1376098650, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_cp55s", "created_utc": 1387090056, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1sx5ec/is_it_normal_for_grandparents_to_not_want_to/", "gilded": 0, "id": "1sx5ec", "is_self": true, "media_embed": {}, "mod_reports": [], "num_comments": 66, "over_18": false, "permalink": "/r/Mommit/comments/1sx5ec/is_it_normal_for_grandparents_to_not_want_to/", "retrieved_on": 1411469961, "score": 18, "secure_media_embed": {}, "selftext": "I don't want to sound like a jerk. I really hope I'm not being one....but my folks (particularly my father) have a serious aversion to helping out with the occasional babysitting, or even spending time with their grandson (2 yrs.) if I need a bit of help while working. Ever. For example, I needed help with 2 evenings (for most of which the dude will be asleep) and 2 Sundays this month....and that was it....and I get shit for it. Am I the only Mother with parents who don't like hanging out with their grandkid for a few hours? ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Is it normal for grandparents to not want to minimally help out with babysitting?", "url": "http://www.reddit.com/r/Mommit/comments/1sx5ec/is_it_normal_for_grandparents_to_not_want_to/", "user_reports": []}, "comments": [{"archived": true, "author": "BubblegumAndEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "You're not alone- when I had my son, I had anticipated being able to have a \"date weekend\" with my husband once a month.  My family lives too far away, but my husband's parents are divorced and remarried, making for two sets of grandparents nearby.  I had thought between the two sets, they would only have to do an overnight/weekend every other month- that doesn't seem too bad, does it?  They get to see grandbaby, we get a sanity check, everyone's happy.  \n\nBut my FIL/stepMIL kept (keep) flaking out on it, so the only one who takes my son for the weekend consistently is my MIL/stepFIL; and for a long time my MIL wasn't listening to us about how we'd prefer his care to be, so we weren't trusting her often with the responsibility- busting our once a month down to practically nothing.\n\nMIL has gotten better, and we're back to, if not monthly, at least bi-monthly weekend sleepovers.  At least it's not like my mom- she came for a visit once, and I had an important OB/GYN visit to go to, so I asked if she wanted to spend a few hours one-on-one with her grandson.  The response?  \"That would interfere with my sightseeing.\"  Oooooooookay.\n\nSo, I feel your pain!", "controversiality": 0, "created_utc": 1387091373, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce23tvo", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428127318, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, this isn't even for leisure...this is for work purposes. I'm between them making me feel like shit for even asking, and being angered by their lack of wanting to hang out with their grandson. Then what? I tell them I will look into a secondary sitter instead and they give me shit for that, too. Infuriating.", "controversiality": 0, "created_utc": 1387091801, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce23xog", "link_id": "t3_1sx5ec", "parent_id": "t1_ce23tvo", "retrieved_on": 1428127269, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Aa_is_for_Aardvark", "author_flair_css_class": null, "author_flair_text": null, "body": "Out of all the grandparents, my dad is the only one who doesn't seem too interested in watching my boy. In the past 21 months, I think I've only asked him maybe 3 times to hang out with my son and each time, he's all huffy puffy and starts calling a hour after the drop off to ask when we will be back. I just assumed it's because he's old and tired and can't keep up. The rest of the grandparents would probably sell their soul for an opportunity to babysit. My dad lives 2 miles away, the rest live 60 miles away. It kind of blows. \n\nThis is probably slightly mean of me to find pleasure in this, but recently my sister wanted to do a sleepover with my son that happened to be during *very* difficult bottle weaning. Sure, crazy lady, take the kid. More sleep for me. It took her til 4am to get him to sleep and she had him the entire next day and he wasn't feeling nap time either. Just so happens my sister lives with my dad. ", "controversiality": 0, "created_utc": 1387092589, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce244eb", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428127181, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "trinityw2", "author_flair_css_class": null, "author_flair_text": null, "body": "The longer I'm a parent the more I don't think its not normal. Some \"parents\" just don't want to be parents again. They want to spoil their grandkids, show off the pictures, and not be in the least bit responsible for them. \r\rI know a woman who works from home that tried to recruit Grammy's help... Know what Grammy did? Looked her square in the eye and said I love \"baby Johnny\" but I'm not that kind of Grammy. She then proceeded to fund a Nanny as her way to contribute. I thought A. now that's honest, B. must be nice to have a Nanny your Mom is paying for so you can work from home. Don't get me wrong, I know its hard working from home. Its quite the managing act. I just found it interesting that Grammy took care of it.\r\rMy MIL works and has limited mobility, but she will do as much as she can to have quality time with our kids. The other Grandparents live too far away to pitch in. ", "controversiality": 0, "created_utc": 1387100771, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce25min", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428126407, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm having the opposite-ish problem--my dad lives three hours away in a terrible desert town and keeps trying to get me to bring the baby over to his filthy house so he can babysit while my husband and I go to one of the shitty restaurants in town. At least I have distance as an excuse though so I don't have to tell him I don't trust him to babysit.", "controversiality": 0, "created_utc": 1387102425, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce25v4o", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428126295, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "its NOT normal\n\nyour dad is being a grade 'A' jerk\n\nhe seems to lack the maturity to understand what it means to *be* a grandparent. it's so selffish and selfabsorbed that it's nearly unbelievable", "controversiality": 0, "created_utc": 1387103789, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce261nf", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428126211, "score": -11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RachelSoma", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL has offered to pay for daycare 2 days a week at the university's hubby attends (and MIL works at) since I'll be very pregnant with #2 by the time semester starts again. \n\nI enthusiastically agreed since she's the only family less than an hour away and I know she wants to help more but loves her full time job.", "controversiality": 0, "created_utc": 1387110143, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce26ue6", "link_id": "t3_1sx5ec", "parent_id": "t1_ce25min", "retrieved_on": 1428125838, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "aweebitevil", "author_flair_css_class": null, "author_flair_text": null, "body": "I am so sorry. Can't say it's \"normal\" but it is the way it is for us too. \nWhen my husband and I found out I was pregnant, we packed up and moved from Newport Beach ca to Carmel Indiana to be closer to my husbands family because I have none. \nMy oldest is 7 as of yesterday, and my inlaws have never spent a moment alone with our kids. They've come to visit is (about an hour away) 3 times, and we go to them on Christmas. It's fucking devastating. My youngest (2.5) calls older people grandma, and the kid doesn't even have one (practically). \n\nI am so sorry for you, op. I don't believe it to be normal, but it sure as hell seems to be for a lot of people I know. Can't help but wonder if the generation has simply quit. They raised their babies and now they're off to vacations and we'll see ya at Christmas. ", "controversiality": 0, "created_utc": 1387110262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce26uyd", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125831, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Nerdy_mama", "author_flair_css_class": "green", "author_flair_text": "#1 born 5/26", "body": "I think it's normal; some people just aren't \"baby people\" or \"kid people.\" I haven't had a problem yet (still gestating), but I *know* my mom is not an infant person. I am not expecting much help from her or her husband (my step dad; never wanted kids, but likes my sister and me!) during baby's younger childhood, but my mom does enjoy kids that talk! So I am counting on babysitting when baby is 3+. I'm sure if I had an emergency she'd take the infant for a while, but she's stated it's not her favorite.", "controversiality": 0, "created_utc": 1387113452, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce27axa", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125624, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "eet", "author_flair_css_class": null, "author_flair_text": null, "body": "Eh my parents are like that. Mum especially. But it's always been clear shes not a child friendly person. Loves her career though. I never felt myself to be as important as her job and personal life so I wasn't too suprised. A little disappointed yes, but oh well. She did uproot herself to move our family overseas so that us kids could grow up in a less pressured environment. So even though she's quite career focused, I know she does also think of us...just, she's really not kid friendly. \n\nDad is better but he's got his job too so yah..\n\nMy in laws though :D love kids and are always hankering to play with little one. Or if kiddo needs mum, they'll offer to help out with chores etc. Every time they go home, baby and I are all, \"NOOO!\" :(", "controversiality": 0, "created_utc": 1387114578, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce27ha7", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125543, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "withoutamistress", "author_flair_css_class": null, "author_flair_text": null, "body": "You want a weekend off once a month?", "controversiality": 0, "created_utc": 1387115383, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce27m9u", "link_id": "t3_1sx5ec", "parent_id": "t1_ce23tvo", "retrieved_on": 1428125477, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "My mom acts like a huge baby when i ask her to babysit. We live over 2 hours away from her, so it's not an issue very often, but the few times I've asked i get the huge dramatic sigh, followed by,\"i suppose......\", finished with some comment about my horrible timing. She doesn't work outside the home, and i only go home for visits a few times a year, so it's not like I'm asking a lot. If i ask my MIL she always immediately says yes, then bails at the last minute or calls to have me come get the kids sooner then we had discussed. She only does it if she's watching the kids for me specifically. if my husband and i are going out or something it's never an issue. I feel like she just fucks with me. so i've just stopped going home for visits. There's no point if no one wants to help out. Now my mom is complaining because i'm not bringing the kids in for Christmas day. Yes, because i should find a dog sitter, pack up 3 kids (including a baby) and drive 3 hours right after we open our presents. That's how i want to spend my christmas. They are all more then welcome to come here and they know that. Plus we're driving in for new years day instead. Sometimes i just want to shake them and yell at them to grow up!", "controversiality": 0, "created_utc": 1387115965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce27pzz", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125429, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "prettyinpunk", "author_flair_css_class": "purple", "author_flair_text": "3 yrs", "body": "my husbands parents. I love them very much but the only time they agree to babysit our son is if he's already asleep. My parents live too far away and to be honest I wouldn't trust them to keep him longer than 3 hrs but luckily bio moms parents have stepped up since bio mom isn't in picture. So because of them I get usually 24 hrs a month of time without him. Sometimes I feel like I'm gonna break", "controversiality": 0, "created_utc": 1387117681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce281tt", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125276, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "iminatub", "author_flair_css_class": null, "author_flair_text": null, "body": "That is infuriating. At that point I think I would just get the sitter and stop asking and stop talking about it with them. Not worth your aggravation!", "controversiality": 0, "created_utc": 1387117784, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce282lt", "link_id": "t3_1sx5ec", "parent_id": "t1_ce23xog", "retrieved_on": 1428125265, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "prettyinpunk", "author_flair_css_class": "purple", "author_flair_text": "3 yrs", "body": "I always find that strange because I was ALWAYS pushed off to my grandparents as a kid so when I hear about some being forced to pay attention to grand kids it's odd to me", "controversiality": 0, "created_utc": 1387117801, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce282qs", "link_id": "t3_1sx5ec", "parent_id": "t1_ce25min", "retrieved_on": 1428125264, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsAnthropy", "author_flair_css_class": "green", "author_flair_text": "Two girls, 1.5 and 5.5", "body": "I don't know. My dad is my parent first and has no obligation to be involved with the children I chose to have (which is fine with me). Just because someone is biologically a grandparent doesn't mean he or she is required to help their kids, nor does it mean he or she is capable of providing quality care. It would certainly be nice for most people to have that and it seems to be a sort of general rule in the US, but I would never trust my own parents alone with either of my children, so I have no expectations that either of them would babysit for me.", "controversiality": 0, "created_utc": 1387118323, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce286ne", "link_id": "t3_1sx5ec", "parent_id": "t1_ce261nf", "retrieved_on": 1428125214, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL is like that.  Until recently, she's had zero interest in ever initiating contact with her only grandchild.  It was like pulling teeth to get any babysitting help, and she'd only ever do it on her own terms (at her house, within certain hours, etc.) which often made it unhelpful or even eliminated her as a babysitting possibility.  \n\nRecently we discovered that our daughter has become deathly allergic to cats (it's bad enough she needs an epi-pen -- she's gone into anaphylaxis because of it), and grandma has three of them.  That means our kid can't set foot in my MIL's house ever again, because she's not about to get rid of them.  *Now* my MIL calls constantly and moans about how she never gets to see the kid anymore, but is *still* almost completely unwilling to come to our house -- she's done it twice in the 9 months since the diagnosis, and she only lives 15 minutes across town.", "controversiality": 0, "created_utc": 1387118728, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce289wp", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125171, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "No, I'm sorry, but no. Your parents had an obligation to provide you with food, shelter, love and support until you were 18 years old. Everything else after that is a bonus. Some people are lucky and have parents who love being grandparents, others don't. You just have to live with whatever you have. ", "controversiality": 0, "created_utc": 1387119047, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28chl", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428125137, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AnyelevNokova", "author_flair_css_class": null, "author_flair_text": null, "body": "That's how I felt as well. We were *told* that they would help out as much as they could, that they remembered what it was like and wanted to babysit so we could still feel like adults and a couple.\n\nYeahno. They actually *watch* him maybe once every other month? Rarely for more than a couple hours. We make plans, they offer, but then it turns into them flaking out or inviting themselves along to whatever we were planning to do on our own. We've heard every excuse in the book, to the point that I think my MIL has a recurring case of 12 Hour Flu that magically crops up whenever she wants to get out of an arrangement. I'll figure out through facebook that she went out to breakfast and shopping with her family, but then magically \"feels sick\" when it comes time to babysit as arranged.\n\nNow, mind you; they love to see him. They come over to gawk at him and go out with us all the time. Near as I can tell, my family members *love* my son. They just don't want any of the dirty work. I hear, \"I know it's hard and it sucks, *but, welcome to being a parent!*\" Thanks. That's real helpful.\n\nSo we don't ask anymore. If they offer, we take them up on it. But we've learned at this point that, nine times out of ten, if we ask, we're going to get flaked out on later.", "controversiality": 0, "created_utc": 1387119774, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28idr", "link_id": "t3_1sx5ec", "parent_id": "t1_ce23tvo", "retrieved_on": 1428125061, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "briannakaye", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Caitlyn Sith", "body": "Why would you come back to Indiana from California? I practically had to be drug back on family vacations. On the bright side Carmel isn't too bad of an area....", "controversiality": 0, "created_utc": 1387120043, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28kl9", "link_id": "t3_1sx5ec", "parent_id": "t1_ce26uyd", "retrieved_on": 1428125032, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "You know what? I'm not saying or asking that anyone owes me anything. I am quite well aware of all that, but thank you so much for reaffirming it. I was asking what's normal, as the rest of the grandparents I know jump at the chance of one-on-one time with their grandchildren. How sad for those that don't....furthermore, it'll be so sad when he's of age/mind to catch on to it. \n\nI've lived with \"whatever I've had\", which wasn't much in the parental love department, my whole life. Bare minimum responsibility....which was made known at an early age. That hurts. It hurts even more knowing that my son will also get minimal love from them. \n\nI guess all I can do is the best I can to not be a parent/grandparent like that! Thanks again for reminding me!", "controversiality": 0, "created_utc": 1387120098, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28l2t", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28chl", "retrieved_on": 1428125026, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "aweebitevil", "author_flair_css_class": null, "author_flair_text": null, "body": "I was young and pregnant and the draw of \"family\" was too strong. My husband grew up in Indiana. We *thought* being here would be best for our kids. Little did I know I'd be surrounded by people completely different than me, and have to stay inside most of the year! I'd go back in a heartbeat. But, sadly, my husbands company is moving us to Minnesota in two weeks! My life did not turn out as expected ;-)", "controversiality": 0, "created_utc": 1387120483, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28okc", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28kl9", "retrieved_on": 1428124981, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "briannakaye", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Caitlyn Sith", "body": "I hear Minnesota is worse than here weather wise so I am sorry for that :(  On the bright side it is a new adventure. :)", "controversiality": 0, "created_utc": 1387120916, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28sl3", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28okc", "retrieved_on": 1428124929, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieMuffysticks", "author_flair_css_class": null, "author_flair_text": null, "body": "Rather than let it continue to be an issue, stop asking parents to kidsit, to the point of taking the kids to a sitter even if there are grandparents sitting right there in your house.  Even better if you have a sitter come to your house.  Instead of allowing friction to happen about holidays, make your house the best place to be for the holidays.  Take the money you'd have spent on gas, road-food, extra this and that, and spend it on decorating your own house, hiring a cleaner and/or a sitter to ease your holidays, and send out pretty invitations to all the parents to come to your house for the feast.  Do your cooking, the family opens gifts when you say, and the kids have their own rooms to go to when they feel stressed.  All the grandparents will eventually realize that this is the best deal for everybody, but they will bitch about it for a couple years.  In my house, the number one rule for holidays is that nobody is allowed to ruin my holiday.  I even had to tell my mother one time to be nice or leave.  After that, no problems!", "controversiality": 0, "created_utc": 1387121568, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce28yp7", "link_id": "t3_1sx5ec", "parent_id": "t1_ce27pzz", "retrieved_on": 1428124850, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RosieMuffysticks", "author_flair_css_class": null, "author_flair_text": null, "body": "It is hard for old people to deal with a two-year-old.  Hell, it is hard for anybody to deal with a two-year-old!  \n\nHowever, if you want things to change, you have to make them WANT to be around him.  Stop asking them to kidsit.  Stop sending pictures.  Stop calling them on the phone.  And don't sit around feeling hurt about it.  Be pro-active in your life.  Get a sitter you can trust, close to home, who treats your kid well, and is reliable.  Yes, you'll have to pay the sitter, but the peace of mind you will get will make it worth it.  \n\nAfter a while, probably not too long, your parents will start calling.  Don't talk about what you're doing, or why, just breezily give them updates on your little guy's milestones, and any fun things that have happened, then say that you've got to get back to work (or whatever), and hang up.\n\nI reckon it won't take but a few months for them to start feeling left out, then up to a few months more for them to start wanting time with him.  Keep on as you've been, and they'll start showing up, offering to kidsit, and doing other grandparenty things.\n\nThe moral:  Some people don't appreciate what they have until they don't have it anymore.", "controversiality": 0, "created_utc": 1387122066, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce293i5", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124787, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sweetcheeksberry", "author_flair_css_class": null, "author_flair_text": null, "body": "I fear this will be me in the future. Sometimes I long for the days my kids move out. I hope deep down inside (I tell no one) that they will skip right through school, graduate when they're like 15 at the oldest. Be fiercely independent and want to go to university on the other side of the country. \n\nThen I think, they might have babies. And then I think about how my parents watch them all day long two to three times a week. We probably normalized that behavior, so I'm going to think I'm done, be relieved, then have new babies plopped in my arms. Maybe I'll die first.\n\nThis sounds horrible. I love them very much, but they are way more work than I ever anticipated and cause me a lot of stress. I grew up in a house with a home daycare and never witnessed any of those kids acting like this. \n\nI'm just saying maybe you were a handful and your parents are just done.", "controversiality": 0, "created_utc": 1387122386, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce296oi", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124746, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mandamarie7878", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't even believe they are like that maybe your father is worried he'll mess something up because it's been so long since caring for a little one. just an idea.", "controversiality": 0, "created_utc": 1387123323, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce29gga", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124619, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Personsanon", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it is for some people. My mother in law complains and won't watch get longer than three hours. We were working on a short film for my husband and we ended up having to cut out several scenes because she needed us to get our baby \"right away.\" I felt bad for my husband because filming is his passion and it was his first attempt to film something in ten years. \n\nThen my stepdad insisted on moving my mom an hour away. Luckily my mom had it out with him and she will watch the baby but at an hour drive away, she's only watched the baby twice. My baby just turned a year old. \n\nMy brother in law has watched our baby more than anyone. I think it's a bit annoying that a 21 boy is more helpful than either of our parents. At least we have him. \n\nMaybe you have some closer friends or siblings/cousins to help out? Good luck!", "controversiality": 0, "created_utc": 1387123499, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce29ic2", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124595, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wasgij107", "author_flair_css_class": "green", "author_flair_text": "Zackary ", "body": "My mother talks a big game about helping out and gets offended if I ask someone else to watch my son, however she continuously complains about being the babysitter for my nephew(3). My sister has a part time job only 10 minutes away from my parents house. She usually works 4-6 hours a day and my mom watches him. And i catch her complaining about not having enough time to do other things, or not being about to keep the house clean, or just having to be awake when she doesn't want to. But when it comes to me(stay at home mom who doesn't ask her to babysit EVER) she gets offended and really upset that I don't have her babysit my son. I know, this doesn't exactly help in any way, just wanted to share my experience. \n", "controversiality": 0, "created_utc": 1387124793, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce29xc7", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124401, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know what is really normal but this is not my experience. My mom tells me my baby is actually her baby that she is letting me borrow. Lol. She is loving 1200 miles away soon and I'm gonna miss the help. But she claims she will come back for months at a time to live with me and slobber on my son. This also goes for my Aunt who is moms sister/best friend.  She considers him HER grandchild as well. \n\nMIL wishes she could be here but she still works and can't afford the gas to drive here all the time, but her sister comes to watch him when my mom can't and her sister may as well be my second MIL. Sometimes my mom and MIL or MILs sister will both watch the baby. \n\nI dunno I think it is weird when grandparents don't want to help out because that's not been my experience on either side husbands or mine. Even siblings of our parents consider our baby their grandchild and want to babysit and cuddle him and shoo us away. ", "controversiality": 0, "created_utc": 1387126303, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2agag", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124155, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sae1", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL would babysit if I ever needed it, but I don't want her to because I think she's pretty immature.  My mother will not babysit because she can't move around that well and when she had to watch my nephews, they would sit in their playpen all day and eat Burger King.  So I'm glad she doesn't ask to watch my kid.\n\nI think every grandparent is different.  I don't think either way is abnormal.  Some just maybe super shitty and selfish, while others may want to help out, but physically can't, or may just feel like they've already raised there children and don't wish to be responsible.  \n\nI'd just drop it and get a sitter.  ", "controversiality": 0, "created_utc": 1387127036, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2apvi", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428124031, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry if I came off sounding harsh, I wasn't meaning to be. My philosophy in relationships is to adjust my expectations to match what people are willing to give me, and I give advice along those lines. I'm really sorry your relationship with your dad is less than awesome. ", "controversiality": 0, "created_utc": 1387127287, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2at33", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28l2t", "retrieved_on": 1428123989, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "celtlass", "author_flair_css_class": null, "author_flair_text": null, "body": "Would he come to your house to sit? I'm sure they'd be alright for an hour or two.", "controversiality": 0, "created_utc": 1387128576, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2baff", "link_id": "t3_1sx5ec", "parent_id": "t1_ce25v4o", "retrieved_on": 1428123764, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "celtlass", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe she just wants to vent and feels safe doing it with you?", "controversiality": 0, "created_utc": 1387129435, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2bmke", "link_id": "t3_1sx5ec", "parent_id": "t1_ce29xc7", "retrieved_on": 1428123607, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "aweebitevil", "author_flair_css_class": null, "author_flair_text": null, "body": "The weather is awful! And no, no bright sides ;-)", "controversiality": 0, "created_utc": 1387132916, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2d41t", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28sl3", "retrieved_on": 1428122879, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "poikilocyte", "author_flair_css_class": null, "author_flair_text": null, "body": "Seconded. God knows I love to complain, and will happily blather on about all of the ways my toddler has inconvenienced or frustrated me that day, but trust me, I think my 2 yr old is the coolest person I've ever hung out with. ", "controversiality": 0, "created_utc": 1387133361, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2db8f", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2bmke", "retrieved_on": 1428122786, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "poikilocyte", "author_flair_css_class": null, "author_flair_text": null, "body": "Sucks, man. You're not the only one. My Mom will drop everything and babysit for me whenever I want, but has told me \"Its not because I love (grand child) but because I love you.\" Which makes me a bit uneasy. Plus she's 70 and has mobility issues. My MIL wants to see my kid, but not play with her/take care of her, etc. And reminds us with every visit about how she is not &amp; never was a \"Mommy-type-mom.\" My stepMIL would babysit 24-7 if she could, and genuinely loves my kid &amp; taking care of her, etc. Everyone is different. ", "controversiality": 0, "created_utc": 1387133773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2di2s", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428122662, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kiln", "author_flair_css_class": null, "author_flair_text": null, "body": "Speaking as a current Minnesotan (who grew up in New Hampshire and lived in Chicago for 10 yrs), Minnesotan's don't let winter stop them the way that much of the northern half of the US seem to.  In January there is a winter kite festival on Lake Harriet.  There is an awesome Art Sled Rally in Powderhorn park in January too. Everyone ice skates or plays hockey.  We're heading to a sledding party this afternoon.  And if you want to stay warm, but go out, there is a reason why the first mall was built here (Southdale) and why the Mall of America is here.  Not to mention the skyways!  ", "controversiality": 0, "created_utc": 1387134521, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2dv79", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2d41t", "retrieved_on": 1428121840, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Houdat", "author_flair_css_class": null, "author_flair_text": null, "body": "My parents don't spend any time with their grandson. I kinda understand because they have an antique business and an estate sale company on the side and they are always busy. They live at least an hour away but their shop is 5 minutes from our house and they never visit. I understood it but it still hurts.", "controversiality": 0, "created_utc": 1387136673, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2esvf", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428120627, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MetaMomma", "author_flair_css_class": null, "author_flair_text": null, "body": "Eh, I dunno. It's a personality thing. My parents don't watch my kids, I wouldn't ask them to or expect them to. I'm sure they would watch the kids for an hour or two if an emergency came about...but it's never happened and I've never felt like it was needed. It's just not done in my family. I don't recall my grandparents babysitting me even once, and my parents had me when they were 16. \n\nMy husband family is different. They are constantly begging to babysit, and they live in a different state! My MIL has driven to our state, picked up the kids then driven BACK to her state to babysit for a long weekend. It's unreal to me, the SIL's do it too. I trust them all completely, and I have no problem with it. It just never occurred to me that someone would volunteer to babysit. It's the weirdest shit I've ever heard of. \n\nIf/When my kids have kids, I probably won't volunteer to babysit. It's not that I don't like kids, I love kids! But once I'm past this season of life, I really want to be done with it. The idea of kids hanging off my neck when i'm seventy with achy joints and shit? Forget it. If an emergency pops up, I'll help out. But I'm not offering, lol. ", "controversiality": 0, "created_utc": 1387141617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2h2ty", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428119564, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wasgij107", "author_flair_css_class": "green", "author_flair_text": "Zackary ", "body": "I understand this, everybody needs to vent every once in a while. I am not exempt from that. I would just hate to have her watch our son and have the same thing happen. I wouldn't want to hear through the grapevine that doing me a favor is a huge inconvenience to her. And my family is a giant grapevine. ", "controversiality": 0, "created_utc": 1387141784, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2h5sd", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2bmke", "retrieved_on": 1428119526, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BOSTONDANIELLE", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL would probably watch my son everyday if she could, my mother in the other hand claims she wants to but I don't believe her or trust her. ", "controversiality": 0, "created_utc": 1387142557, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2hjet", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428119350, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tippytoez", "author_flair_css_class": null, "author_flair_text": null, "body": "I never waste an opportunity to complain about my in-laws on here. They have never watched my daughter once in 19 months. They live 30 minutes away. \n\nMy parents, however, live in Alaska. My husband and I live in Colorado. Every time my parents come to visit (4 times in 19 months) they buy us tickets to a hockey game or buy us dinner and take the baby for an evening. I wish my parents lived closer.\n\nSome grandparents just aren't interested in babysitting. I wish my in-laws cared more but I'm not going to beg them to take an interest. We see them twice a year at most.\n\n", "controversiality": 0, "created_utc": 1387143989, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2i810", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428119031, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NotCleverEnufToRedit", "author_flair_css_class": null, "author_flair_text": null, "body": "So if you grew up with bare minimum responsibility and little love from your parents toward you, why would you think they'd feel differently toward your offspring? I don't understand why you're so surprised they act the way they do.\n\nAlso, your kid is 2. 2 is a lot of work to take care of. Your parents may still surprise you and be very interested in spending time with him when he's old enough that he doesn't require as much work.", "controversiality": 0, "created_utc": 1387153808, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2mkjm", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28l2t", "retrieved_on": 1428116903, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't say I was surprised either, however, some people change under different circumstances. Perhaps I was hoping that they would. \n\n\nThere is never a point in childhood where it requires \"less work\". Different stages require different \"work\". Even certain adults require \"work\".\n\n\nI'm really not interested in having a debate with you. I get your point, but I'm not going to sit here and try to explain mine to you further. Apparently we come from different schools of thought. ", "controversiality": 0, "created_utc": 1387154910, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2n2ku", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2mkjm", "retrieved_on": 1428116668, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish it was seen solely as valuable time spent with their grandchild, is all. (shit in one hand, wish in the other, right?)", "controversiality": 0, "created_utc": 1387155084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2n5hi", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2i810", "retrieved_on": 1428116632, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NotCleverEnufToRedit", "author_flair_css_class": null, "author_flair_text": null, "body": "We must. My school of thought is, \"These are my kids and my responsibility. I'll ask grandparents if they'd like to watch the kids, but if they'd prefer not to, that's *totally OK* and I'll hire a sitter.\" Yours seems to be, \"My parents are supposed to do what I want when I want regardless of how they feel about it or how they've always acted in the past to show me that they wouldn't be interested.\"", "controversiality": 0, "created_utc": 1387155169, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2n6v4", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2n2ku", "retrieved_on": 1428116613, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "My grandparents watched me all the time :/ .... and my situation involved a few days when the sitter became unavailable. So it was an emergency. My take on it would be spending time with the little guy, not glorified babysitting. I guess family values are diminishing with time. ", "controversiality": 0, "created_utc": 1387155257, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2n8as", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2h2ty", "retrieved_on": 1428116594, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "Dude, I don't need to play games. That's not my thing.", "controversiality": 0, "created_utc": 1387156258, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2nnoz", "link_id": "t3_1sx5ec", "parent_id": "t1_ce293i5", "retrieved_on": 1428116395, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "trinityw2", "author_flair_css_class": null, "author_flair_text": null, "body": "That's awesome! Sounds like you have a wonderful supporting family. ", "controversiality": 0, "created_utc": 1387160489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2ph6x", "link_id": "t3_1sx5ec", "parent_id": "t1_ce26ue6", "retrieved_on": 1428115546, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RachelSoma", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh I do! My dad used to live around the corner and he would take my daughter to the park twice a week (after I negotiated him down from 3 days because I wanted to go to Playgroup and Storytime!). Lolly spends one weekend a month with him (Sat morning til Sun arvo) and he recently said that he'd like a second weekend a month because he misses her.\n\nMy mum lives about 4hrs drive away but when I had some worrying results from my anatomy scan she took my toddler home with her for 5 days so I would have less stress and could get to all my emergency appointments and scans.", "controversiality": 0, "created_utc": 1387163646, "distinguished": null, "downs": 0, "edited": 1387163948, "gilded": 0, "id": "ce2queh", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2ph6x", "retrieved_on": 1428114908, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "You are misinterpreting and/or not comprehending the subject matter correctly, and needlessly flaming. Your trolling is out of line in this thread.\n\nHave a nice night. ", "controversiality": 0, "created_utc": 1387167617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2shq0", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2n6v4", "retrieved_on": 1428114068, "score": -4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "burn7xt340st", "author_flair_css_class": null, "author_flair_text": null, "body": "My mother in law is awesome and baby sits my son when I am at work and keeps him for the occasional date night. She always jumps at an opportunity to baby sit. She is only 50 though and still has a lot of energy.  She cares for my son so much and I love her for it. In the 13 months my son has been alive she has watched him countless times while I have been working and has kept him over night twice. \n\nMy mother on the other hand wants to see my son with me but does not want to watch him alone. She has seen my son once a month on average for a few hours at a time. She's kind of awkward around him and its like she forgot how to interact with a toddler. \n\nBoth sets of grandparents live two minutes away. ", "controversiality": 0, "created_utc": 1387169289, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2t4ud", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428113769, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BubblegumAndEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup!  As I said, it's a sanity check.  Husband and I get a \"date night\", and especially when our son was young and we were sleep deprived, it would have been especially nice to be able to sleep once a month without it being broken into 2 hour breaks.  In theory, the grandparents should have been happy to see their grandbaby every two months, we'd get some rest, and our son should have been well cared for by his grandparents.\n\nI realize not everyone has the opportunity to do so (we didn't end up having the opportunity, either, with the way things ended up), but a lot of advice out there states to make time for your marriage when you have kids.  And a lot of times, when people don't take that time for themselves or their marriage, things break down because of stress and frustration.  \n\nMaybe it was the way you phrased it, but I get the impression you don't agree with this theory.  Care to elaborate?", "controversiality": 0, "created_utc": 1387169789, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2tbcm", "link_id": "t3_1sx5ec", "parent_id": "t1_ce27m9u", "retrieved_on": 1428113684, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BubblegumAndEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "That's what we were told, too, which is why I figured they'd be happy with the arrangement.  No such luck!", "controversiality": 0, "created_utc": 1387170010, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2teb1", "link_id": "t3_1sx5ec", "parent_id": "t1_ce28idr", "retrieved_on": 1428113646, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NotCleverEnufToRedit", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not trolling, I'm disagreeing with you. I am truly baffled that you say your parents paid little attention to you growing up and gave you little affection, yet you think they'd feel differently about your son. Why would they care more for your child than they did for their own? Also, you seem more upset they won't watch your kid when you want them to and less disturbed about them not wanting to spend time with him in general.\n\nI also point out that it's hard to take care of a 2-year-old, especially when you're the age of grandparents. Two-year-olds don't follow directions or entertain themselves quietly like 7-year-old or 12-year-olds. There is *definitely* a time in childhood that requires less work -- not for the parents necessarily, but definitely for the babysitter. It takes a lot more work to care for a toddler than it does to care for an 8-year-old who can entertain himself, go to the bathroom without help, go to bed and stay there, and follow directions when you tell him no.", "controversiality": 0, "created_utc": 1387170250, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2the6", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2shq0", "retrieved_on": 1428113606, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BubblegumAndEvil", "author_flair_css_class": null, "author_flair_text": null, "body": "Which is why I understand your frustration all the more- here you are, in real need, and you can't get your folks on board to help.  As a counterpoint, I'm asking for less time from my inlaws (even if it is for leisure), and they still flake out on us.  They've helped a base minimum during emergencies, at least.  \n\nIt just sucks all around when the people who say they're going to help, don't.  I'm sorry for your frustration :(", "controversiality": 0, "created_utc": 1387171062, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2trxm", "link_id": "t3_1sx5ec", "parent_id": "t1_ce23xog", "retrieved_on": 1428113465, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "Eh, it's less frustration for a lack of help and more a feeling of foreboding. I don't want to see my son sad about his grandparents inability to display love, when he gets old enough to notice. It was more of a principle based question in intention.", "controversiality": 0, "created_utc": 1387174336, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2uuq6", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2trxm", "retrieved_on": 1428112963, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm truly baffled as to why you feel the need to continue. You are misconstruing the nature of my intention to question. \n\nYou seem determined to arouse some sort of a reaction in your assumptive misunderstanding, and are coming off as a troll in the process. \n\nI'm not interested in your lack of comprehension. If you can't find it within your grasp to even try to understand the nature of my intent in questioning, kindly find something somewhere else to set fire. \n\nThanks so much, and again, have a nice night.\n\n", "controversiality": 0, "created_utc": 1387174852, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2v09n", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2the6", "retrieved_on": 1428112891, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beckolyn", "author_flair_css_class": "green", "author_flair_text": "Sabina (2/2012)", "body": "Well, my parents luckily love spending time with their grandchildren. However, I also know that my maternal grandmother got burnt out on watching kids because my mom's older sister (15 years old than my mom) expected my grandmother to watch her kids all the time, so that when my mom finally had kids, Grandma didn't really want to babysit, so she didn't. She would have me over one-on-one on her own terms (she was also almost 70 when I was born), though. Because of that, I created an open dialogue with my mom that if they ever felt put-upon or couldn't babysit (or didn't want to!) to just be honest about it and it would totally be fine. My daughter is almost 2, but 2 is a handful and I know that there are some things that my mom has a hard time doing (floor time is especially hard with her arthritis). \n\n\nAnyway, do you have other siblings or have they had to watch other kids (other than raising you)? Have you had an open and candid conversation with them about what their comfort level as far as spending alone time with your son or what their expectations are of themselves as grandparents? I might approach it with \"I feel\" language associated with behavior not so much with, \"Why aren't you willing to help me?\" (not that you've said that or would, paraphrasing). ", "controversiality": 0, "created_utc": 1387181642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce2wnnv", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428112121, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "It wouldn't work, anyway.  If your parents are that disconnected from you when you are contacting them regularly, they will become that much more distant when you stop doing the contacting legwork.  \n\nCase in point: Shortly after my second son was born, we moved to my hometown after my parents convinced me that they would be devastated if we moved out of state (which we had really NEEDED to do).  They never visited me when I lived only an hour away and never visit me now that I'm living 5 minutes away.  I wouldn't even get upset over the fact that they never try to contact us or visit if they wouldn't GUILT TRIP me about how they \"never get to see the kids\"... \n\nI know it hurts to get so little love from the people who are supposed to love/be there the most, I feel ya.  Surround your family with people who want to be a part of your lives, and don't put any mental energy into people who can't be bothered to expend any on you (I'm still trying to fully get a handle on this!).  \n", "controversiality": 0, "created_utc": 1387203326, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce30ff6", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2nnoz", "retrieved_on": 1428110222, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "4everInYogaPants", "author_flair_css_class": null, "author_flair_text": null, "body": "This breaks my heart! Newport Beach is heaven on earth, so you made some serious sacrifices to be near your in-laws and this is how the treat you?! I would be so pissed! Anyways, it's 80 degrees down here in Irvine today, so how about you just come home? :)", "controversiality": 0, "created_utc": 1387236207, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce3e8fq", "link_id": "t3_1sx5ec", "parent_id": "t1_ce26uyd", "retrieved_on": 1428103650, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "aicesangel", "author_flair_css_class": null, "author_flair_text": null, "body": "We used to completely support my MIL and we still have issues with her wanting to spend any time with our children. Let alone babysitting. Slowly getting better since she moved out but still not good. It could be the age also. You know terrible 2s and what not. So people just don't like certain stages. Good luck to you. ", "controversiality": 0, "created_utc": 1387239849, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce3fs90", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428102927, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1387344501, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce4hty3", "link_id": "t3_1sx5ec", "parent_id": "t3_1sx5ec", "retrieved_on": 1428084939, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yumcrackers", "author_flair_css_class": null, "author_flair_text": null, "body": "No one said anything in regards to obligation. ", "controversiality": 0, "created_utc": 1387368381, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce4mqeq", "link_id": "t3_1sx5ec", "parent_id": "t1_ce4hty3", "retrieved_on": 1428082581, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "My mothers grandmother took care of my mom more than her own mother did.  However, my maternal grandmother was very willing to take us for a week or more at a time.  Grandkids change things and it isn't wrong for her to have been hopeful that he parents might take more interest in her children.  \n\nShe doesn't seem surprised, but that doesn't mean she can't feel some disappointment.  I think she is just trying to see what it is like for other people and to maybe not feel so alone in her disappointment.  It doesn't sound like she is asking for a lot from them either.", "controversiality": 0, "created_utc": 1387831060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ce8pc0s", "link_id": "t3_1sx5ec", "parent_id": "t1_ce2mkjm", "retrieved_on": 1428012439, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}