{"submission": {"author": "mrsamazing12", "author_created_utc": 1377562068, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_cwmb5", "created_utc": 1389721165, "domain": "self.Mommit", "edited": 1389764194, "full_link": "https://www.reddit.com/r/Mommit/comments/1v7cz7/does_anyone_else_feel_like_their_so_doesnt_help/", "gilded": 0, "id": "1v7cz7", "is_self": true, "media_embed": {}, "num_comments": 62, "over_18": false, "permalink": "/r/Mommit/comments/1v7cz7/does_anyone_else_feel_like_their_so_doesnt_help/", "retrieved_on": 1441959694, "score": 50, "secure_media_embed": {}, "selftext": "So my husband works and I stay at home and do everything. And I mean everything. So I don't ask for much because I feel like its a burden to him. Example if I ask for  him to make a bottle I get sighs and he always has to come back with \" can I get a please?\" Well I don't get a please. Anyways I haven't slept in a month and I sleep in the living room with the baby on an air mattress so we don't disturb him. I ask him last night will you sleep with the baby tonight and let me sleep for one night? He laughed and said I was funny and went to our room and fell asleep. I texted him and told him it hurt my feelings and that I feel like I can't ask him for anything if I need it. And he texts back sorry I love you goodnight. And that was it. And asks me today why I'm in such a pissy mood. What do I do? I'm to the point where I'm about to just kill this man.\n\nOK y'all I'm not divorcing my husband Lol I am happy with us just wish for more help.\n\nThanks for all your help. Its all worked out. We had a like looong  talk and came to an air understanding. ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Does anyone else feel like their SO doesn't help?", "url": "http://www.reddit.com/r/Mommit/comments/1v7cz7/does_anyone_else_feel_like_their_so_doesnt_help/"}, "comments": [{"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; \" can I get a please?\"\n\nHis participation, especially at such a minimal level, in the raising of his child is not a favor to you.  It is a duty of his.  Sure, be civil to each other, but if he feels he needs a gilded invitation, a submissively worded request and then a congratulatory cookie to mix up a bottle, then I am surprised he wipes his own ass.", "controversiality": 0, "created_utc": 1389722900, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepf7be", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431939817, "score": 103, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CaptainPatton", "author_flair_css_class": null, "author_flair_text": null, "body": "You two need to sit down and have a serious chat.  Texting will not solve your problems - it's not an effective means of communication.  You need to do this face-to-face.  Working full time and then coming home to hear request after request from your spouse is frustrating, just as being a SAHP feels frustrated after not getting help after your spouse walks in the door.  BOTH of you have a job, and both of you will need to discuss how to handle things. Sharing duties will be key - maybe you can alternate sleeping with the baby on the weekends.  Talk about what you do during the day (but don't present it as a list of \"look at all that I do and it's really stressful\") and just tell him that you need some time to yourself and that he needs bonding time with the kid. \n\nWhy do you sleep on an air mattress in the other room? You should sleep in your own bed. If your baby is young enough, get a rock 'n' play sleeper and put it next to your bed. Or move the baby crib/pack&amp;play into your room and put the baby there. Alternate night feedings/diaper changes with your husband. Take turns. That's what being a parent is about.\n\nAnd a thought from the opposite side of the fence - maybe he had a bad day? I work full time and only see my spouse after work, and coming home just seems like going to another job.  There's work to do and sometimes I need to defrag a bit before taking on family duties. When I have a bad day at work, it seems to spill over when I get home.  Perhaps taking a grain of salt with his attitude may help clear up a few things.*\n\n*Edit - I'm not saying his behavior is right or that you're nagging. I'm just using the old \"walk a mile in his shoes\" routine.  Being a new parent is tough for Moms and Dads; you are both in uncharted territory. It may take some time for you to adjust, but both of you need to be patient with each other.  Communication is absolutely key in the first few months of being a parent.  Be honest with each other and talk.  Listen to what the other parent is saying, and take a step back if you begin to feel frustrated.  The first three months are the hardest when you are a parent.", "controversiality": 0, "created_utc": 1389723335, "distinguished": null, "downs": 0, "edited": 1389723551, "gilded": 0, "id": "cepfere", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431939915, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Wesa", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd sit down with him while the baby is napping at some point and say you'd like his help with a few things because you're so exhausted.  Ask for a few minimal things to get started:  one night a week in bed while he tends to baby or at least one morning to sleep in.  Maybe he can do baby bath time while you put your feet up for 20 minutes.  \n\nEdit:  It took me forever to ask my husband for help.  When he came home from work he would take a nap with baby on the couch while I cooked dinner, but I did everything else.  We're at 18 months now, expecting #2, and he's been picking up more of the responsibilities.  Bath time is his time every night (I usually clean the kitchen and the living room).  He tends the toddler during early evening wake-ups and a few nights a week, he'll sleep in her room with her so I can get some continuous rest.  Things like that.  I still do a large portion of the work but every little bit has helped.", "controversiality": 0, "created_utc": 1389723685, "distinguished": null, "downs": 0, "edited": 1389723867, "gilded": 0, "id": "cepfla2", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431939999, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Bright_as_yellow", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with what you are saying.  Communication is key.  \n\n...Going off your idea \"walk a mile in his shoes\"\n\n I think you are on to something but lets flip it.  How about he walks a mile in her shoes.  \n\nCan you leave him to be in charge on his day off and go do something?  So he can see what it is like all day?  ", "controversiality": 0, "created_utc": 1389723742, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepfmbe", "link_id": "t3_1v7cz7", "parent_id": "t1_cepfere", "removal_reason": null, "retrieved_on": 1431940015, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CaptainPatton", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with your idea to flip.  When I was on maternity leave, I had minor postpartum depression and barely got anything done around the house.  One day I got the old \"you're home all day, so why is the house a mess\" comment.  I told him he was in charge of the kid and left for an afternoon.  When I got home - NOTHING was done, and he finally understood what it was like taking care of a newborn.\n\nmrsamazing, you need a break. Get out of the house and leave him in charge for an afternoon.  Go see a movie. Go to the spa.  Hell, go to McDonalds and people watch or read a book.  Get out and let him view the world through your eyes.", "controversiality": 0, "created_utc": 1389724780, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepg4ag", "link_id": "t3_1v7cz7", "parent_id": "t1_cepfmbe", "removal_reason": null, "retrieved_on": 1431940256, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "niobe127", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband was like for the first 8 months of our sons life. Then one day he told me he didn't want to be a family man anymore. He told me we wasted his time and he wanted more time to do his own thing. And he left. We had been married for 10 years. \n\nStart thinking like you are a single parent on your own. Mentally prepare yourself and realize that you can't rely on him. Because clearly you can't. Do what you can to make it work for yourself and your child. When you realize you don't need him anymore you will be much better off. \n\nHarsh, but that is how it is sometimes. ", "controversiality": 0, "created_utc": 1389725524, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepggs2", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431940425, "score": 25, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "ask him when he's planning on being a father to his child.", "controversiality": 0, "created_utc": 1389726173, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepgrrw", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431940558, "score": 53, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "At least one night a week schedule some \"out of the house\" time. When he gets home you hand him the baby and walk out the door for a few hours. Go do whatever you want!", "controversiality": 0, "created_utc": 1389727245, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepha0u", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431940798, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "renaejade", "author_flair_css_class": "green", "author_flair_text": "4y boy", "body": "I wnet through the same thing when my son was born. He wouldn't even touch him. I eventually moved In with my parents to get help. I do not recommend that but I was in a desperate place. ", "controversiality": 0, "created_utc": 1389728278, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cephs1f", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431941031, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "colesmomma", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think that she is to this point yet. My husband had a hard time in the beginning and it turned out he just didn't know what to do because I wanted everything done my way. I started asking for help with the house and with the baby. ", "controversiality": 0, "created_utc": 1389728782, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepi0wl", "link_id": "t3_1v7cz7", "parent_id": "t1_cepggs2", "removal_reason": null, "retrieved_on": 1431941148, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "crazyfordisney", "author_flair_css_class": "lightcoral", "author_flair_text": "Working Divorced w/ 17m.o. girl", "body": "I did.\n\nWhen our daughter was born last January things were good for a few weeks.  He helped me with anxiety &amp; post-partum depression issues.  He wanted to give her bottles so that I could get a break.  \n\nSomewhere around 2 1/2 months things changed.  Now, in my case, he is bipolar so I did a lot of using that as an excuse.  I felt like I was a single parent just with a roommate called my husband a lot of the time.  I think even the first lady had a slip up last year and said something about being a single mom.  I imagine a lot of women feel that way.  \n\nHe would help occasionally but not enough.  When I went back to work it got worse.  He became part zombie.  And his version of helping often meant holding her so I could poop or shower, but standing in the bathroom over me with her in hand.  \n\nOnce or twice a week he would choose to sleep on the couch so I could co-sleep with the baby b/c he refused to.  Then that became more frequent. \n\nWhen she was 6 months old after walking on eggshells for months I finally lost it and asked if he was going to leave me.  And the answer was yes.  Well it was more \"don't you see that this isn't working and how unhealthy it is for all of us.\"  \n\nI was a wreck.  But at the same time I was OK.  I knew that I now had to just take care of my baby and it would be me and her against the world now, not me and him.  Besides, I already felt like a single parent.  \n\nIt took a few months to get an apartment setup and get us moved out but from the first night in the new place, I could breathe a little better.  It sucks.  I hate that he left us.  I didn't ask for this.  But, I'm OK.  And she is doing great.  \n\nAnd he is a better father now.  He sees her a couple times a week and it is quality time.  He isn't a zombie staring at the computer while she cries in the seat next to him, he is in her playroom playing with her and her toys.  \nMaybe this is b/c she is a little bigger and more interactive. \nMaybe this is b/c he comes to my house so he doesn't have his usual distractions.  \nDoesn't matter, he is doing the best that he can.  \n\nIn some ways he helps me more too.  I don't have to worry about his bills, by which I mean he was expensive to live with.  I don't have to worry about his moods.  I get to relatively do what I want, when I want, how I want, with the baby.  In some ways being a single parent is easier.  I don't have a 40 year old child to take care of anymore.    When I need help (e.g. I need a little break to get things done around the house) I ask him to come over and watch her and as long as he is available he does.  \n\nI am not saying to leave your husband, however you may want to mentally prepare yourself in case you think that is a possibility.  You need to take stock of your feelings and your daily tasks and you need to talk to him.  \n\n- You make me feel x when you do y. \n- I really need help with our LO, here are all of the tasks I do, please take x% of them to help with.  \n\n\nGood luck and you can always PM me if you need to vent.  ", "controversiality": 0, "created_utc": 1389728897, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepi2xu", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431941174, "score": 22, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Beersyummy", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's really important to talk when you're both calm and can be attentive. So, perhaps after putting the baby down for bed, or while the baby is napping, approach the topic. Tell him that you don't think he understands the amount of work that you're doing around the house, and it feels unfair. And then, listen to him as well. While I was on maternity leave, I was so jealous of my husband getting to leave the house each day while I was home with a very clingy, fussy baby. I didn't realize that he was very stressed at work as well, and felt jealous of me being home all day. So, we both needed to work to see the other person's challenges and feelings.\nI would also have an idea of some specific things or \"buckets of work\" that you could use help with. So, can he be in charge of dinner two days per week, or in charge of grocery shopping, or walking the dogs, or bathtime during the week, or whatever it is. If he refuses to commit to anything, I think he needs to spend some understanding how difficult it is to be the primary caretaker and manager of the home. Tell him you want him to watch the baby for one full day while you are out. Hopefully that will give him an appreciation of how hard you are working and how it's only fair that you get some help.\nThe sleep thing is tough. Honestly, I just don't think men are as tough as women when it comes to sleep deprivation. They're convinced they are entitled to a solid night's sleep and us women know that just is not happening with a young baby in the house. What my husband and I did is that I would sleep with the baby downstairs most nights and then he would come down at 5:30am and be in charge of baby for 2 hours while I slept. Sometimes baby slept during that time, sometimes not. Either way, I got to start the day with a solid nap. And then, he would also take over occassional nights on the weekend. But, we would discuss that in advance. So, during your calm talk about needing more help around the house, ask if he could commit to one night per week of being in charge of the baby (or whatever arrangement you come up with). \n", "controversiality": 0, "created_utc": 1389729118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepi6oz", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431941223, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "I only texted he m because i was feeding the baby and its quiet Lol a text can't wake her. And she sleeps in a swing next to me not on the bed with me she prefers the living room also for some reason she doesn't like our room she doesn't sleep well. I don't ask for much trust me I know what its like to work a full time job and come home and have to do stuff I did it before the baby laundry dishes dinner dog. Then pick up after him. It was just the fact that he didn't care. We will talk about it but I know what he's going to say. He works I don't. \n", "controversiality": 0, "created_utc": 1389730858, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepj0ff", "link_id": "t3_1v7cz7", "parent_id": "t1_cepfere", "removal_reason": null, "retrieved_on": 1431941681, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "JustaLittleDuckie", "author_flair_css_class": null, "author_flair_text": null, "body": "I was in this exact scenario, married for 5 years and two kids. I did everything.... EVERYTHING. I divorced him, happened upon an amazing man who is a phenomenal father and we are ecstatic together. Fix this problem as soon as possible, it will only get worse. You are a stay at home mom while he is at work. Once he comes home, you both are mom &amp; dad. Everything should be shared. It is a drastic difference to have a man that cleans, does laundry, plays with the kids. I thought it was \"normal\" for dad to be completely uninvolved. It's not normal.", "controversiality": 0, "created_utc": 1389730904, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepj18t", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431941689, "score": 17, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "I have left them alone a few times but I don't like being away from her I miss her Lol and last time I think it was 2 hours and he complained. So I felt bad", "controversiality": 1, "created_utc": 1389730950, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepj21y", "link_id": "t3_1v7cz7", "parent_id": "t1_cepfmbe", "removal_reason": null, "retrieved_on": 1431941699, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "I've asked :(", "controversiality": 0, "created_utc": 1389731064, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepj42s", "link_id": "t3_1v7cz7", "parent_id": "t1_cepfla2", "removal_reason": null, "retrieved_on": 1431941727, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "Its not like that I'm sorry to hear that though he loves his daughter. ", "controversiality": 1, "created_utc": 1389731144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepj5hg", "link_id": "t3_1v7cz7", "parent_id": "t1_cepggs2", "removal_reason": null, "retrieved_on": 1431941744, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "niobe127", "author_flair_css_class": null, "author_flair_text": null, "body": "Then he doesn't love you. Or he would respect you and step up. ", "controversiality": 0, "created_utc": 1389731456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepjbbs", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj5hg", "removal_reason": null, "retrieved_on": 1431941821, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "catoco", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband of 5 years is exactly the same. I do everything. Clean, pay the bills, grocery shop, solely take care of the 2 kids(2 and 4 and pregnant), etc. Even to the point that he'll take off only the days I'm in the hospital having a baby and go back to work the second we're home and back to single parenthood I go. I've tried having calm level-headed conversations with him a thousand times but \"he works full time and what are you doing?!\" is all I get back.\n\nNo one yell at me to leave him cause I won't. Divorce isn't an option and I'm happy with our relationship just not the help I get around the house..", "controversiality": 1, "created_utc": 1389731555, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepjd4u", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431941844, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "You said it perfect I love my husband he loves me I'm not getting a divorce I just want to sleep 1 night ya know just 1.", "controversiality": 1, "created_utc": 1389731846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepjihh", "link_id": "t3_1v7cz7", "parent_id": "t1_cepjd4u", "removal_reason": null, "retrieved_on": 1431941914, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CaptainPatton", "author_flair_css_class": null, "author_flair_text": null, "body": "I wouldn't say that you don't work.  Stay-at-home parents work, just not outside the home.  Taking care of a newborn and a dog and a house is a lot of work.  What you do during the day is work, and he needs to understand that.  Believe me - comparing my 9-5 to what I did during maternity leave is like comparing apples and oranges, but both were definitely work, just in different ways.  The problem is that you don't get a break.  He can come home at night and leave work behind.  You LIVE at work.  He needs to understand that you don't stay home and eat bonbons.  It's a tough job taking care of a newborn and balancing that with a dog and a house and your emotions/hormones.   \n\nI'm glad that you will talk about it.  Don't belittle or let him make light of you staying home.  It really is a lot of physical and mental energy to be a stay-at-home parent.  He does need to understand and to help out more.  Having a kid is a lot more work than having a dog, but it's harder for men to understand because they kind of take a backseat for the pregnancy/birth.  So suddenly they come into a lot of responsibilities rather quickly, and it takes time to adjust.  But let me reiterate - communication! Be honest with each other.  It will get better in time! :-)", "controversiality": 0, "created_utc": 1389735195, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepl6ne", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj0ff", "removal_reason": null, "retrieved_on": 1431942703, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dalaim0mma", "author_flair_css_class": "purple", "author_flair_text": "SAHM; 3 gremlins", "body": "My husband was/is the same way. He works 6 days per week, 10-16 hours per day, and I'm the one left doing everything. When he gets his Sundays off, I often wonder, \"When is MY DAY OFF??\" Lol. When he gets home from work, I ask him to make a bottle and change a diaper, and I get the same response as your husband. It drove me crazy until I finally realized that he needed rest. After I let him rest, he was much more receptive when I asked him for a break (to go to the gym, take a nap, whatever.) Couples in love naturally like to please their partner, but over time we build up resentments. One of you will go first, and the other will reciprocate. Why not go first??", "controversiality": 0, "created_utc": 1389735239, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepl7d1", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431942721, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CaptainPatton", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't feel bad!  You deserve a break. ", "controversiality": 0, "created_utc": 1389735264, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepl7t6", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj21y", "removal_reason": null, "retrieved_on": 1431942724, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "endlesscurry", "author_flair_css_class": "green", "author_flair_text": "Henry 8/29/12", "body": "Maybe it's time to start demanding. He sounds like he's going to keep ignoring any responsibility for his child as long as you let him. Some guys just don't like the baby stage, and while that's okay, ignoring parenting duties isn't. You two need to sit down and talk about each of your expectations when it comes to the care of your child.\n", "controversiality": 0, "created_utc": 1389735278, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepl81i", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj42s", "removal_reason": null, "retrieved_on": 1431942722, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't understand why people think being a SAHP isn't really work and therefore do nothing all day, but can't be arsed to do any of it themselves because it is too much work.", "controversiality": 0, "created_utc": 1389736899, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepm1fb", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431943105, "score": 29, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "secondstar79", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel your frustration. I am struggling with a similar situation, too. My husband is wonderful and works very hard to support us though helps around the house very little (if at all). Personally, I don't mind doing most of the housework and caring for our daughter but I feel that on the weekends things can be a little more even. We've had several conversations and he is supportive of that. We just need to figure out a routine, I think, because we're still struggling with it. That said, it sounds like you're dealing with a husband who is not willing to help and also a husband who, and please don't take this the wrong way, is a little disrespectful of you from what you described (laughing at your requests, etc.). Those are issues that I'm not personally dealing with but I can share what I have done and maybe it'll help. I definitely think a conversation needs to happen. Wait for a time when both of you are relatively calm or else it could be doomed from the start. What I have done is to tell my husband that I appreciate everything he does for our family (recognize the work that he *does* do) and then explain what my days involve and ask him if there is anything that he feels that he can help with. I have told him that I don't mind doing the majority of the housework during the work week but feel that it is appropriate and realistic to get a break, too, which means things need to be a little more shared on the weekends. As much as he needs a break, so do I and so do you. Have a dialogue about what you both feel are realistic expectations of each other and go from there. Good luck!", "controversiality": 0, "created_utc": 1389742868, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepovvq", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431944447, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hennypen", "author_flair_css_class": null, "author_flair_text": null, "body": "My ex left while I was pregnant, after five + years forever.  I would like to give you a hug and a high five.", "controversiality": 0, "created_utc": 1389744403, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceppl15", "link_id": "t3_1v7cz7", "parent_id": "t1_cepggs2", "removal_reason": null, "retrieved_on": 1431944776, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Goders", "author_flair_css_class": null, "author_flair_text": null, "body": "I had issues with my husband with our daughter when she was a baby. I made a similar post that he saw (I used a throw away) but he knew it was me. It opened up a new line of communication. We talked about how I was overwhelmed and he was able to dispute what I was saying and showed me what I wasn't noticing him doing.\n\nUltimately, it turned out that I'm not cut out to be a stay at home parent. I ended up getting a part time job on a different shift then him so responsibility had to be shared.\n\nAfter she started crawling then walking, I noticed how much more involved he was. Babies, as adorable as they are, are boring to some people. And now that she's three, she straight up demands his attention. She forces him to be and stay involved. She demands his help.\n\nYou can't be accusing when you talk to someone about something like this. If you are, it immediately puts them on the defense. I don't know you or your husband, so I can't tell you how to approach things. I can only hope for the best for you guys.", "controversiality": 0, "created_utc": 1389746235, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepqfhi", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj5hg", "removal_reason": null, "retrieved_on": 1431945245, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "happyeggeater", "author_flair_css_class": null, "author_flair_text": null, "body": "This is similar to what we did. I had a few little meltdowns and we talked a bit. I mean, we're new to this whole baby thing and we're both figuring out our roles as parents. I started asking him to do things, like \"can you feed the baby breakfast?\" \"Can you dress him?\" and we're now to the point where we've established a routine where we each have certain baby tasks. He's our child so he's equally our responsibility. Like, I do the bathing, he does the post-bath dressing. I read the bedtime stories, he does the putting to bed. We mix it up on occasion, but it helps to talk and remember that he's learning too. ", "controversiality": 0, "created_utc": 1389746384, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepqhz4", "link_id": "t3_1v7cz7", "parent_id": "t1_cepovvq", "removal_reason": null, "retrieved_on": 1431945277, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "apdrzmom", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah my husband didn't do shit unless I bitched about it. Being forced to be a bitch was not fun for anyone. He didn't like it because he thought i was a bitch and I didn't like it because I didn't want to be a bitch. But I would refuse to watch him sit there and not take care of any aspect of our children's lives so I had to do it. We are divorcing soon. And the s.o.b. is worse now than ever, not surprised.", "controversiality": 0, "created_utc": 1389746396, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepqi71", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431945280, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "i fully respect the \"divorce is not an option\" mindset and it bugs me to hear it bandied about on reddit so often, but if that's how he operates then what part of the relationship is there to be happy about? marriage is a *partnership* and your husband isn't being a partner. if his defense is \"i work full time, what are *you* doing?\" how does he respond when you tell him \"i'm cleaning, cooking, paying bills, raising our children...\"? maybe when it's time to have kid #3, tell him not to bother taking the time off while you're in the hospital because that's not when you need his help. if he's not going to help you at home, he may as well get paid for working those days when you have the help of doctors and nurses, right? if he doesn't like that suggestion, he is welcome to join you for some marriage counseling to negotiate a more egalitarian division of labor.", "controversiality": 0, "created_utc": 1389746743, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepqnxr", "link_id": "t3_1v7cz7", "parent_id": "t1_cepjd4u", "removal_reason": null, "retrieved_on": 1431945355, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyEmbora", "author_flair_css_class": null, "author_flair_text": null, "body": "This. Father of my child decided when I was about 30 weeks pregnant that this isn't what he wanted out of life. I, too, knew him for a decade.", "controversiality": 0, "created_utc": 1389749096, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceprq0c", "link_id": "t3_1v7cz7", "parent_id": "t1_cepggs2", "removal_reason": null, "retrieved_on": 1431945855, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pattymayonnaise", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes yes yes.  I honestly feel like a single mum 90% of the time  Video games have priority over helping me out.  He has depression though,  but that's another story. \n\nSorry no advice but you're doing an amazing job. ", "controversiality": 0, "created_utc": 1389749171, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceprr7u", "link_id": "t3_1v7cz7", "parent_id": "t1_cepqnxr", "removal_reason": null, "retrieved_on": 1431945870, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kittysue804", "author_flair_css_class": "purple", "author_flair_text": "Aubrey Anne 12/04/12", "body": "Just going to play a bit of devils advocate, because I just like too, I think jumping to conclusions about how much he loves you or your child based on the small amount of info you've given is a bit harsh. This being your first kid, and being that you are still pretty early in, I think maybe he just doesn't realize the amount of work you do or understand how it can be so draining. It isn't that he necessarily doesn't appreciate or respect you, but perhaps he literally doesn't realize the amount of work you do. Quite frankly before I was a SAHM I never would have realized how hard of a job it is , and how mentally draining it can be, so maybe he just isn't fully aware. He doesn't seem particularly mean or rude, his response to you asking him to stay with the baby seemed mostly playful, he probably didn't actually think you were serious. There isn't a rule book for husbands to know what their responsibilities are when this dramatic shift happens, he likely just assumes home and baby stuff is on you and providing financial support is on him and that's where the line is drawn, he probably thinks it is equal and fair because he doesn't realize how hard it can be because its hard in a completely different way. \n\nI make these assumptions only because you keep mentioning you have no intention or desire to divorce him, which leads me to believe there is good there. Just continue to try to clear and honest discussions, leave nothing off the table, and never assume anything is implied, cover everything. No one should be a mind reader, not either of you. \n\nI am at the first year mark of being a SAHM, so I feel your pain, the work we do often goes unnoticed, but that isn't because our SO's are bad are wrong, at least in my case it seems to be when I do my jobs right no one notices anything has been done.\n\nI truly hope you guys work everything out, and I hope at least some of my assumptions are right. Honestly, if discussions continue to lead no where consider showing him this thread, it may lead to a fight but brutal honesty may be the only thing that gets your situation moving.", "controversiality": 0, "created_utc": 1389749739, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceps0fj", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431945990, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alicabeth", "author_flair_css_class": null, "author_flair_text": null, "body": "Very well put. I think I need to go kiss my husband. ", "controversiality": 0, "created_utc": 1389752624, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceptb67", "link_id": "t3_1v7cz7", "parent_id": "t1_cepf7be", "removal_reason": null, "retrieved_on": 1431946630, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Prisoner-655321", "author_flair_css_class": null, "author_flair_text": null, "body": "Hvhgdffuêrerzerwttrwsrfrrrerwertedrxrrdtrdeqzdyfrwsytdzyfyyfmwqwduzgguvnsderddyd", "controversiality": 0, "created_utc": 1389754147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceptzbb", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj5hg", "removal_reason": null, "retrieved_on": 1431946918, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "I know what you mean", "controversiality": 0, "created_utc": 1389754709, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepu8ap", "link_id": "t3_1v7cz7", "parent_id": "t1_ceptzbb", "removal_reason": null, "retrieved_on": 1431947035, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsamazing12", "author_flair_css_class": null, "author_flair_text": null, "body": "This is pretty much spot on. ", "controversiality": 0, "created_utc": 1389754880, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepuayk", "link_id": "t3_1v7cz7", "parent_id": "t1_ceps0fj", "removal_reason": null, "retrieved_on": 1431947076, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kimmers87", "author_flair_css_class": null, "author_flair_text": null, "body": "I totally sympathize with the difficulty, I'm national guard I'm gone for a whole weekend.  It took a few trips before my SO \"got it\" that I don't just lay in bed all day.  Really take some time plan a trip to dinner and the movies with a girl friend or by yourself.  The busier I am when I'm away the easier it is.  It's rough when they don't understand being mom 24/7 is really taxing.  Also look into a gym membership with available child care, I work out and get 2 hours of child care!!!  I can swim use the hot tub sauna group exercise or do my own thing long as I stay in the building, 2 WHOLE HOURS every day:-) it's helped me so much.  I don't always take the full 2 hours but just knowing I can go pick my daughter up when I'm ready is pretty fantastic.  I use the YMCA but lots of gyms offer child care and it's great interaction and stimulation for babies\n\nEdit to add, I don't pick up after my SO anymore, laundry didn't make the basket? It didn't get washed sorry about you luck.  Our daughter broke some headphones of his recently sorry about your luck gotta keep breakables out of reach.  It's some tough love but he's learning to think where he puts stuff and what she can reach and that she's learning to climb now.  Some men learn much better from cause and effect ", "controversiality": 0, "created_utc": 1389756420, "distinguished": null, "downs": 0, "edited": 1389756640, "gilded": 0, "id": "cepuyup", "link_id": "t3_1v7cz7", "parent_id": "t1_cepj21y", "removal_reason": null, "retrieved_on": 1431947386, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "victoriasaurusrex", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like he doesn't care about your needs. What is more important than that?", "controversiality": 0, "created_utc": 1389758042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepvnsv", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431947715, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't view it as help, that's the thing. We're partners. It's half the work... I wouldn't be able to get by with half the work not getting done. My health would go into the shitter.\n\n... Why do you keep asking him? He's being an asshole. Who would make you sleep on an air mattress with your baby? I've never heard of a man treating his new child so badly, aside from outright abuse. ", "controversiality": 0, "created_utc": 1389759472, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepw9cc", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431948005, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I vote for this one. I honestly get angry at women who allow their partners to be such terrible fathers because they're \"too scared\" or whatever of saying or expecting equal help... it's not just them it's hurting, it's the child. Those first few months of bonding are key for the kid's happiness.", "controversiality": 0, "created_utc": 1389759564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepwar9", "link_id": "t3_1v7cz7", "parent_id": "t1_cepgrrw", "removal_reason": null, "retrieved_on": 1431948026, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lindini", "author_flair_css_class": null, "author_flair_text": null, "body": "If your husband can't make this happen for you you are in a bad marriage. Even if he can't watch the baby I don't see why he can't help you find child care or a family member who can help you get rest. He isn't trying and even though you love him and he loves you he is treating you terribly. ", "controversiality": 0, "created_utc": 1389761164, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cepwy25", "link_id": "t3_1v7cz7", "parent_id": "t1_cepjihh", "removal_reason": null, "retrieved_on": 1431948353, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1389775565, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq0y54", "link_id": "t3_1v7cz7", "parent_id": "t1_cepqfhi", "removal_reason": null, "retrieved_on": 1431950312, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lilpeapod", "author_flair_css_class": null, "author_flair_text": null, "body": "I think I need to give mine a bj.. Lol", "controversiality": 0, "created_utc": 1389776825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq1637", "link_id": "t3_1v7cz7", "parent_id": "t1_ceptb67", "removal_reason": null, "retrieved_on": 1431950426, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mogokara", "author_flair_css_class": null, "author_flair_text": null, "body": "This really resonates with me and I'm afraid that it's the direction that my husband and I are heading. ", "controversiality": 0, "created_utc": 1389779951, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq1nnk", "link_id": "t3_1v7cz7", "parent_id": "t1_cepi2xu", "removal_reason": null, "retrieved_on": 1431950659, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Kappa_the_imp", "author_flair_css_class": null, "author_flair_text": null, "body": "Ladies, can we stop the \"Grab your pitchfork, divorce your husband!\" nonsense? It shows up in every damn post, and it's not really ok. OP obviously loves this man, she married him, and you know literally nothing about her situation aside from her anonymous post venting on the internet about how hard it is to raise a baby. Are we not all aware that this shit is HARD? All OP needed was to have a long talk with her husband, which she now has, and everything is good. ", "controversiality": 0, "created_utc": 1389786542, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq2l4k", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431951116, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "clumsyotter", "author_flair_css_class": "black", "author_flair_text": "Boy 04/06, Girl 05/13", "body": "My ex husband was the same way.  Thankfully, I ditched him and got someone who helps out.  My husband now is wonderful.  I am not trying to rub it in, promise, but some are just completely clueless and you have to tell him exactly what to do.  Or, just get ready to be a single mom living without him, b/c it sounds like you already are a single mom.", "controversiality": 0, "created_utc": 1389791859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq3kk6", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431951555, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dstam", "author_flair_css_class": null, "author_flair_text": null, "body": "This! I mean, I try to be understanding and all... but with posts like this I just can't understand why there are women out there who let it even get to this point. There is no way in hell I would put up with that crap.\n\nBut the strange thing is, I don't *have* to force or coerce my husband to be involved fully in our children's lives. He just does it, just like me. Because he is a parent. ", "controversiality": 0, "created_utc": 1389794086, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq44n6", "link_id": "t3_1v7cz7", "parent_id": "t1_cepwar9", "removal_reason": null, "retrieved_on": 1431951817, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "Time for a \"come to Jesus\" meeting. I stay at home with our 2 kids and my husband works. I can tell you, he does NOT treat me like that. You need to sit down and give him \"chores.\" When I had my first, before my husband learned about being Dad, we divided up some of the work. \n\n\n\nOn Monday, Wednesday, and Fridays he put the baby to bed. I don't know how old your baby is, but it is time to stop sleeping on an air mattress in the floor. Even if the baby's bed is in your room, no more sleeping on the floor. \n\n\nOn Friday and Saturday nights he got up for all feedings until 7am. That way I knew that 2 nights a week I was getting a full night of uninterrupted sleep. \n\n\nWe alternated when we went out who was taking care of the baby, he always carried the carrier, but we'd switch off who would be responsible for the feeding, changing, and such. \n\nNow we have 2, and some of the stuff as changed. Now, instead of alternating nights for bedtime, we alternate kids. I take one to bed, and he takes the other. When we go out, he takes care of 1, and I take care of the other. You get the idea. But most of the \"your day to do xyz\" is out the window. He knows what needs to be done now and what he can do to help. \n\n\nWhat worries me isn't the lack of equity in what you're saying, its his attitude when you asked for help. You're sleeping on the fucking floor and he doesn't seem to care about it. I'd be pissed too. \n ", "controversiality": 0, "created_utc": 1389794217, "distinguished": null, "downs": 0, "edited": 1389794561, "gilded": 0, "id": "ceq45wb", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431951827, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dstam", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't get this argument that I see constantly, that babies are \"boring\" to some people. So, what? Its ok for dad to not be involved if he finds babies boring?? \n\nIf you aren't involved in creating said baby then you have the luxury of abstaining from being involved, but if that is YOUR baby (mother or father) then its your duty to parent that baby!!\n\nI find newbies really effing boring, my own included. My second child is 6 months old and I am only just recently having \"fun\" with him. But I can't just say \"Oh he's boring, someone else take care of him\" when he is young and unable to do much. My husband, his father, doesn't get that perk either. We just have to suck it up and take care of him.", "controversiality": 0, "created_utc": 1389794417, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq47vd", "link_id": "t3_1v7cz7", "parent_id": "t1_cepqfhi", "removal_reason": null, "retrieved_on": 1431951852, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "monstercandy_94", "author_flair_css_class": null, "author_flair_text": null, "body": "Some of the comments on here How ignorant to blame her for letting her SO be a douche. Obviously the problem is not you honey it's your husband tell him to step it up for crying out load giving birth and being a parent is work you deserve some bloody time to sleep ", "controversiality": 0, "created_utc": 1389795224, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq4fyo", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431951968, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "monstercandy_94", "author_flair_css_class": null, "author_flair_text": null, "body": "These husbands are going to need to pay for hired help! Lol but seriously ", "controversiality": 0, "created_utc": 1389795339, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq4h9h", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431951975, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "crazyfordisney", "author_flair_css_class": "lightcoral", "author_flair_text": "Working Divorced w/ 17m.o. girl", "body": "Your emotions just sound all too familiar.  \n\nA lot of it is up to how open to working on things you and your husband are though.  My ex made the decision on his own, he didn't want to work on things at least not together.  But I do think in our case a lot of it has to do with his bipolar, like he thinks he is being some kind of martyr sacrificing because it is healthier for the baby and I in the long run to not have to put up with his crap.  ", "controversiality": 0, "created_utc": 1389795543, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceq4jhu", "link_id": "t3_1v7cz7", "parent_id": "t1_ceq1nnk", "removal_reason": null, "retrieved_on": 1431952010, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "colesmomma", "author_flair_css_class": null, "author_flair_text": null, "body": "Not true. Maybe he doesn't know what to do, or is nervous to mess up. Marriages/relationships are two way streets and if he doesn't feel like he is appreciated when he does anything, he may just shut down. I am not saying that she should baby him -- but at least talk to him and ask him for exactly what she needs.", "controversiality": 0, "created_utc": 1389813423, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqcc49", "link_id": "t3_1v7cz7", "parent_id": "t1_cepjbbs", "removal_reason": null, "retrieved_on": 1431955716, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "colesmomma", "author_flair_css_class": null, "author_flair_text": null, "body": "This.!!!!!!", "controversiality": 0, "created_utc": 1389813666, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqcgf9", "link_id": "t3_1v7cz7", "parent_id": "t1_ceq2l4k", "removal_reason": null, "retrieved_on": 1431955772, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Goders", "author_flair_css_class": null, "author_flair_text": null, "body": "I never said finding babies boring is an excuse to not be involved. I said I noticed he found it easier to be more involved. He never ignored her needs as a baby. But he formed a bond with her he previously didn't have as she got older. He started going above and beyond for her. And it was less stress on all of us", "controversiality": 0, "created_utc": 1389818605, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqexf5", "link_id": "t3_1v7cz7", "parent_id": "t1_ceq47vd", "removal_reason": null, "retrieved_on": 1431957046, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alicabeth", "author_flair_css_class": null, "author_flair_text": null, "body": "Lol!!! That's some appreciation right there.", "controversiality": 0, "created_utc": 1389832777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqm2cb", "link_id": "t3_1v7cz7", "parent_id": "t1_ceq1637", "removal_reason": null, "retrieved_on": 1431960435, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "emmathehamster", "author_flair_css_class": null, "author_flair_text": null, "body": "Well if he doesn't know what to do he can help with the home/cooking etc to take the load off. She said she's doing EVERYTHING. My SO felt super awkward with our baby when he was first born so he cooked all the time, did the dishes etc so I could focus on the baby. There are a million things you can do to help a mother that don't involve the baby. \n", "controversiality": 0, "created_utc": 1389833843, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqmkf5", "link_id": "t3_1v7cz7", "parent_id": "t1_ceqcc49", "removal_reason": null, "retrieved_on": 1431960681, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Razathorn", "author_flair_css_class": null, "author_flair_text": null, "body": "Father of 2 in a 13 year successful marriage here.  First off, the situation as it is currently is obviously unacceptable.  I have to ask you a serious question though:  Do you consider / treat your husband as an equal (a 2nd parent,) or an assistant to you.  Is he involved in the decisions that go into the child's upbringing (i.e. the methods used in parenting, sleep training, etc...,) or do you decide and dictate and then expect him to fall in line?  \n  \nI see that you are sleeping with the child every night.  Is this attachment parenting?  Is this a decision that your husband was a part of or had a say in?  \n  \nI'm being serious.  I recognize his attitude.  It's the attitude of \"oh, now you want something from me?\" and \"Seriously?  You've got to be kidding.\"  \n  \nThe bottle thing seems unreasonable on his part, so I have to assume he's just checked out as a parent, or he never wanted to be one.  Hopefully it is the former and a situation that can be fixed.  There's not much of a fix if he never wanted kids.  \n  \nHow does he feel about the situation of the child sleeping with mom every night?  Was he for it?  Why is this the case?  How did it develop?  Was this your doing and did he have any say in it (this form of sleep training?)   Is it possible you're asking him to take a night dealing with the situation you created outside of his control / input that he never wanted to exist in the first place?  \n  \nI work full time and my wife stays home, and the way it worked for us is that for the week I took off with the birth, I did basically everything except whip out my moob as she recovered.  After that time period, when I went back to work, I get up during the night with the kids on the weekends.  That is what works for us.  \n  \nWe are both parents.  If I decide that something needs to happen, she backs me up.  Same with the other direction.  There are times, for example, when I tell her \"we need to let him cry it out a bit before we go reset/comfort him\" and we agree on a time and then move forward as a team.  We are very determined at sleep training and ensuring that the kids could self sooth and deal with being in the crib.  I would never agree to a nightly routine that involved her sleeping with the baby, and my wife would never go against my wishes in that department.  If she did, I have to say, I would be very \"yeah right\" if I was then asked to sleep with the child on my nights.\n\nNow, I may be barking up the wrong tree here—partially, or completely, but the fact remains that he either is checked out as a parent for some reason, or never wanted to be one.  I hope he wanted to be a parent, and that you figure out whatever is causing this behavior.\n\n", "controversiality": 0, "created_utc": 1389836519, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqnrih", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431961254, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dstam", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, sorry I wasn't really talking about you in particular. But people (fathers) I know in person will say they \"don't do\" watching the baby because babies are boring/I don't know what to do with them/they just sit there.", "controversiality": 0, "created_utc": 1389839588, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqp5h3", "link_id": "t3_1v7cz7", "parent_id": "t1_ceqexf5", "removal_reason": null, "retrieved_on": 1431961946, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "teapotshenanigans", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; congratulatory cookie\n\nMy husband has this attitude like I need to praise him constantly or I don't appreciate what he does.  Pisses me right off sometimes.  Of course I fucking appreciate the help do I need to do a song and dance number for you in thanks because you did the dishes?\n\n(He does help as much as he can.  He just can sometimes get rather infantile about it.  Also, when he gets like that I can tell he's overdue for a BJ or something ahaha)", "controversiality": 0, "created_utc": 1389839954, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceqpbg1", "link_id": "t3_1v7cz7", "parent_id": "t1_cepf7be", "removal_reason": null, "retrieved_on": 1431962021, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "residualdays", "author_flair_css_class": null, "author_flair_text": null, "body": "I am a teenager, 19, and i have a beautiful baby boy named Anthony. My SO and I recently moved in together with his MIL and I feel like I'm going crazy. I feel like my SO would rather go out with his friends than spend time at home. MIL works, is never home and I haven't slept in 3 days. Ppd or?", "controversiality": 0, "created_utc": 1389914190, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cerfh3m", "link_id": "t3_1v7cz7", "parent_id": "t3_1v7cz7", "removal_reason": null, "retrieved_on": 1431974785, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}