{"submission": {"author": "Hostile_Crayon", "author_created_utc": 1345259490, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_8pfku", "created_utc": 1390021362, "domain": "self.Mommit", "edited": 1390025312, "full_link": "https://www.reddit.com/r/Mommit/comments/1vi6mv/i_resent_my_child/", "gilded": 0, "id": "1vi6mv", "is_self": true, "media_embed": {}, "num_comments": 110, "over_18": false, "permalink": "/r/Mommit/comments/1vi6mv/i_resent_my_child/", "retrieved_on": 1441954521, "score": 59, "secure_media_embed": {}, "selftext": "Apologies in advance for the length of this, but I think backstory and examples are necessary here. \n\nMy son just turned three. He is extremely intelligent. The psychiatrist we've been seeing for his issues suggested development testing and he scored highly gifted. He may be a smart boy, but he also has the worst behavior of any three-year-old child I have ever seen.\n\nSome backstory. He has been a difficult child since birth. He was up 5-6 times per night until he was 14 months old. At the age of 3, he still doesn’t sleep through the night most nights. He also had colic, and screamed close to 8 hours a day for months on end. He is sick all the time. He will go maybe a week without cold symptoms and then be sick for months on end (we’ve investigated allergies but he has tested negative for everything so far). He also has gastrointestinal problems. He’s had borderline diarrhea since starting on solid food (we’ve tried various elimination diets but nothing has made a difference). He also has never been able to play happily on his own, always requiring someone to be with him, entertaining him. On a great day, he’ll play on his own happily for five minutes. Tops. \n\nHe has an incredible impulse control problem. He is violent with me, his father, and the other kids at his daycare. The violence is very typically unprovoked. For example, last week he got out of his cot during nap at daycare, picked up a shoe and hit another sleeping child in the head. According to the staff, she and my son hadn't even played together that day.  He will walk up to me while I’m cooking dinner and hit me with his toys. When I react in pain, he often laughs.\n\nHe has no attention span. He cannot even maintain eye contact with you when you are trying to talk to him, always looking around for other things he can focus on. He has no patience and no fuse. If something doesn’t go his way, he erupts in anger immediately, screaming, crying, throwing things, or hitting whoever happens to be nearby.  \n\nHe is also hyperactive. He never walks anywhere, even in the house. He runs and jumps. He cannot sit still for more than 10 seconds (unless we are reading to him). And he never shuts his mouth. He literally must be talking ever second of every day. We never get a break.\n\nHe is also not yet potty trained. He knows how to use the potty, but chooses not to. He'd rather go in his pull-ups, and then laughs when we have to change them. We have tried putting him in underwear, but he pees and poops in that too. \n\nEveryday when I pick him up from daycare, I get the “damage report”: how many other children he hurt, how many naps he disrupted etc. Between the potty training, the refusal to nap and the violent behavior with other children, the daycare is threatening to kick him out. And I can’t blame them. I’d kick him out too.\n\nI want to be clear: I do not have unrealistic expectations for my child. He's three. I expect a certain amount of violence, tantrums, impulse control problems, hyperactivity etc. My issue is that he is off the chart on all these things when compared to his peers. And we have tried EVERYTHING to improve his behavior: rewards, praise, negative reinforcement, punishment (i.e. taking toys away), timeouts, counting… everything. We have done exhaustive investigations of his health issues, spanning allergy testing, dietary changes, family doctors, specialists, psychiatrists, counselors… nothing has helped.\n\nBottom line is, because of all these issues, I have never felt attachment to this child, and grow more distant from him after every battle, every violent outburst. My resentment for him grows. I resent him because we always wanted to have two kids, but there is no way we will have a second one after him. I resent him because he has therefore robbed me of my opportunity to parent a normal, loving child.  I resent him because he loves his father more than he loves me, even when he is the disciplinarian and I am not.  I resent him because I go to bed each and every day exhausted, angry and broken, on the verge of an anxiety attack.  I resent him because instead of enjoying time playing with my child, I dread it because I know it will only end in one of us screaming, and me with some kind of physical injury.\n\nSo, r/mommit… where do I go from here? I am desperate. I have tried parental counseling, as well as child psychiatry with no help.  We cannot ask for more childcare from my family, and cannot afford to hire outside babysitting right now.  I need to get these feelings of distance and resentment under control, so that I can be a better parent. I need to fix his behaviours so that I don’t have a mental breakdown. \n\nThanks to everyone who made it through this monster post. I’ll take any and all advice/criticism/suggestion.\n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I resent my child", "url": "http://www.reddit.com/r/Mommit/comments/1vi6mv/i_resent_my_child/"}, "comments": [{"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "::hugs::\n\nHas he been tested for Asperger's or Oppositonal Defiant Disorder or Pervasive Developmental disorder-not otherwise specified (PDD-NOS)? ", "controversiality": 0, "created_utc": 1390025345, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesj6sr", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994169, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "I have this kid too. A couple of notes:\n\nBehavior and sleep may improve with age. At 5, my guy still sleeps like shit, but at least he is sleeping. \n\nI still cry sometimes, but is down to every couple of weeks. \n\nHave you had him evaluated by an occupational therapist? A large part of my son's issues are because of sensory processing problems. Getting through a normal day of sights, smells, and sounds can be agonizing for him. \n\nYou can also have the school district evaluate him for services. They may be able to help with a diagnosis. I recommend this. \n\nCan you get a $10/hour high school student to babysit a couple of hours a week? Can you find a support group for special needs parents? Try care.com and meetup.com. \n\nYou are not a bad mom or bad person for resenting him. It is psychological torture to endlessly give with nothing in return. \n\nBut also try to remember he is not being a jerk on purpose. He is just doing what he can with what he has. And it sounds like you need to do a little more detective work. EDIT: That sounded unsympathetic when I reread it. I know you've been to a million specislists. I have too. But keep trying. There is help out there. \n\nAlso: We had a second kid against my better judgment, and he is an easy, cuddly lovebug. No regrets. \n\nI'll type more later if I remember; I'm on my phone right now. ", "controversiality": 0, "created_utc": 1390025606, "distinguished": null, "downs": 0, "edited": 1390026207, "gilded": 0, "id": "cesj9fv", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994209, "score": 46, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for the hugs and suggestions. The psychiatrist we've been seeing stopped short of \"labelling\" (her word) him with anything. We have an appointment with another psychiatrist this week to see if a second opinion will help. In the meantime, I will do some research on ODD. I don't think he has PDD-NOS because his language skills are off the charts. He has the vocabulary of a middle school child easily. His speech patterns don't seem to fit with Asperger's either. Nonetheless, thank you again for the suggestions. I do appreciate it.", "controversiality": 0, "created_utc": 1390025755, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjavh", "link_id": "t3_1vi6mv", "parent_id": "t1_cesj6sr", "removal_reason": null, "retrieved_on": 1431994222, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Paticakes72", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I had a solution for you, but I don't. My boys are both profoundly gifted and both have ADHD, and while they can and do routinely test and redefine the limits of my patience, my struggles haven't been the same as yours. In my estimation, weathering all of what you've described and still being capable if composing a coherent sentence should qualify you for at least two Olympic medals. Not helpful, I know. \n\nYou'll no doubt catch hell for what you've said in your post. I want very much to be wrong, but I've seen otherwise too often to expect that even half of the folks who reply will be supportive. Let it roll off. Think about flying in an airplane, and how the flight attendants always do the preflight safety speech where they tell you to don your own oxygen mask before trying to help any children traveling with you. Know why? Because if you keel over because can't breathe, you won't be any help to the wee ones. What you've done in posting here is a clear demonstration that you grasp that concept very well. Your son is incredibly fortunate to have a mother who takes good care of herself so that she can properly care for him. \n\nI wish you and your family the absolute best. ", "controversiality": 0, "created_utc": 1390025829, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjbla", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994242, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1390025964, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjcvm", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994258, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, I also highly recommend getting your anxiety/depression treated as well. It has mafe a world of difference in my ability to cope with the little scamp. ", "controversiality": 0, "created_utc": 1390025997, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjd7i", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994261, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "We haven't seen an OT or considered a sensory processing issue. I will add this to my list of things to check. Thank you. With regard to babysitting, funds are very tight, as is time. My husband and I are both in graduate school (nearly finished, thank god) and both work almost full time. Once the kiddo is in bed, our evenings are spent catching up on school work.  That said, it's getting to the point where we are going to have to put the dissertations aside for a while, lest we go completely bonkers.", "controversiality": 0, "created_utc": 1390026060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjdtk", "link_id": "t3_1vi6mv", "parent_id": "t1_cesj9fv", "removal_reason": null, "retrieved_on": 1431994266, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "You're welcome. My son has Asperger's, so I get the not making eye contact thing. He does that a LOT. I'm also friends with quite a few parents of other special needs children, because they seem to be the only ones who really 'get' me and what we go through with our son because they've been there too.\n\nKeep in mind that a label is just a word. It doesn't have to define you or your child. It's simply a word that lets other people--doctors, school staff, etc--know how best to help you and your kiddo. :) It can't hurt you if you don't let it.\n\nPDD-NOS, at least the way I understand it (and somebody will surely correct me if I'm wrong, which hey..if I am, go right ahead) basically means that there is SOMETHING going on that's not quite right developmentally--whether that is speech/motor skills wise or behavior wise--but they can't put a definite finger on what exactly it is. \n\nYou say he has the vocabulary of a middle school kid? Yeah..that sounds familiar. My son (who is 9) talks like he's a middle aged man half the time.\n\nAnd I understand the constant talking, talking, talking. Oh god, do I get that. Mine's the same way, only he has the tendency to repeat the same word/phrase over and over and over until I want to scream. Or he'll watch the same 30 second clip on Youtube or from a show on Netflix like 15 times in a row until I want to snatch the remote out of his hand.\n\n::hugs::\n\nYou'll get through this..somebody somewhere will be able to put a name to what the fuck is going on with your kid and help you figure out how to deal with this shit. I've been there..I know how frustrating it is when you KNOW something's wrong but you're not entirely sure what it is.", "controversiality": 0, "created_utc": 1390026192, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjf3b", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjavh", "removal_reason": null, "retrieved_on": 1431994293, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, early intervention services is what I meant when I said school district. ", "controversiality": 0, "created_utc": 1390026280, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjfy0", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjcvm", "removal_reason": null, "retrieved_on": 1431994301, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lmswebnet", "author_flair_css_class": null, "author_flair_text": null, "body": "I can only imagine how hard this must be for you. I can't think of any useful advice, but I wanted to write and let you know I feel for you. I hope things work out as he gets a little older.  ((HUGS))\n", "controversiality": 0, "created_utc": 1390026376, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjgum", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1435527179, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine didn't talk at all until he was four and a half, then suddenly started busting out with paragraphs and five-syllable words. ", "controversiality": 0, "created_utc": 1390026431, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjhe0", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjf3b", "removal_reason": null, "retrieved_on": 1431994326, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you very much for you kind words and for the warning. I will try not to let the negativity get to me. Honestly I do really wish that I had addressed my feelings in a more direct way earlier. I have seen a parenting counsellor and a psychologist but they were unhelpful and I gave up. I also find self care to be incredibly challenging because my husband is going through exactly the same thing. It's hard to take much needed breaks when your partner is facing the same battles you are!", "controversiality": 0, "created_utc": 1390026708, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjk0t", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjbla", "removal_reason": null, "retrieved_on": 1431994362, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much.", "controversiality": 0, "created_utc": 1390026875, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjllg", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjgum", "removal_reason": null, "retrieved_on": 1431994380, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the advice. I tried several session with a psychologist (CBT) and didn't find it very helpful. I think I should try a different person, perhaps. ", "controversiality": 0, "created_utc": 1390026920, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjm0f", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjd7i", "removal_reason": null, "retrieved_on": 1431994386, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the suggestion. I'm Canadian actually. I will look at what we have in my province. ", "controversiality": 0, "created_utc": 1390027262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjp5y", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjcvm", "removal_reason": null, "retrieved_on": 1431994429, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks again. It is immensely frustrating to know that something is wrong, to have no clue what it is, and further, to not know how to make things any better!\n\nYea, the constant talking, especially after a bad day, makes me want to rip out my hair. I have to bite my tongue to keep from yelling at him to just be quiet for five minutes!", "controversiality": 0, "created_utc": 1390027681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjt03", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjf3b", "removal_reason": null, "retrieved_on": 1431994482, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Any objection to trying medication? It can bring relief from anxiety/despair pretty quickly. It can be a short-term thing if your anxiety is not a chronic problem. You don't necessarily even need a psychiatrist. Your GP can help. ", "controversiality": 0, "created_utc": 1390027750, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjtmc", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjm0f", "removal_reason": null, "retrieved_on": 1431994488, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Isn't the psychiatrist's job to \"label\"? Maybe her hesitation is because he is so young. I think a second opinion is a great idea. ", "controversiality": 0, "created_utc": 1390027853, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjuie", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjavh", "removal_reason": null, "retrieved_on": 1431994499, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "Hey, I've been down that road. When you finally figure out what the hell is going on, it'll be a huge relief. Because then you'll know what you need to do to help make things better.\n\nAlso, keep in mind that your kid is not 'broken'. His brain may not be wired like a normal kid's and he may not act like a normal kid but that's perfectly alright. He's not broken, he doesn't need to be 'fixed', despite what people like Jenny McCarthy will tell you. You didn't do this to him..it was complete luck of the draw (IMO). You just have to learn to work around his issues, help him learn to deal with them and go on with life. Because chances are, these things are NOT going to just go away as he gets older. This is probably something he'll have to learn to deal with his entire life.", "controversiality": 0, "created_utc": 1390027890, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjuty", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjt03", "removal_reason": null, "retrieved_on": 1431994504, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Taco_flavoredkisses", "author_flair_css_class": "orange", "author_flair_text": "4, 3 &amp; 2 month old", "body": "It seems like you have already gotten some great advice. \nJust wanted to say good luck &amp; I truly hope things get better! ", "controversiality": 0, "created_utc": 1390027977, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjvnh", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994511, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "There is no shame in temporarily lightening your load. In the meantime, try googling sensory gyms in your area. You don't need a diagnosis to spend some time playing at one of those. A sensory gym was extremely helpful in managing my son's behavior. ", "controversiality": 0, "created_utc": 1390028004, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjvw7", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjdtk", "removal_reason": null, "retrieved_on": 1431994512, "score": 22, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I did have one. I wanted to try non-pharmacological interventions first. I've been getting more exercise, going to bed earlier and have vastly improved my diet. All those things apparently have a positive impact on mental health... but have done nothing for me thus far. I think I should go back to my family doc to give her an update. Maybe it is time to consider medication...", "controversiality": 0, "created_utc": 1390028167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjxb4", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjtmc", "removal_reason": null, "retrieved_on": 1431994523, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "That was exactly my thought! :) The only thing I could think was that he was either too young, or that she felt that his behaviour just wasn't severe enough to fit within the diagnostic criteria of something like ADHD. In her defence, I think he has gotten much worse since the last time we've been in. We will see what the second psychiatrist says.\n", "controversiality": 0, "created_utc": 1390028271, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjy8l", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjuie", "removal_reason": null, "retrieved_on": 1431994531, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for this. It is a constant battle for me not to paint him as broken. I don't blame myself for how he is, but I feel like I have to do better at dealing with his challenges, and maybe if I was better, the challenges would lessen. ", "controversiality": 0, "created_utc": 1390028420, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjzid", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjuty", "removal_reason": null, "retrieved_on": 1431994540, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "miparasito", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you done much reading on highly gifted children? ", "controversiality": 0, "created_utc": 1390028435, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjzng", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994540, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you very much.", "controversiality": 0, "created_utc": 1390028447, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesjzr9", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjvnh", "removal_reason": null, "retrieved_on": 1431994541, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I have never heard of sensory gyms, and it turns out there is one 10 minutes from my home. I'm going to try to get him in there. The descriptions on the website about determining whether or not your child might benefit from OT fit my son to a T! Thank you very much!", "controversiality": 0, "created_utc": 1390028776, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesk2lj", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjvw7", "removal_reason": null, "retrieved_on": 1431994563, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Around here, they won't diagnose ADHD until 7. Autism is 3. We have never gotten an official diagnosis for my kid. We've cobbled together a theory and treatment plan for sensory processing disorder, a language disorder, and clinical anxiety. \n\nOh, speaking of diagnosis, have you looked into seeing a developmental pediatrician? That would be a logical next step. ", "controversiality": 0, "created_utc": 1390028927, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesk3uc", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjy8l", "removal_reason": null, "retrieved_on": 1431994569, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I have. I'm an academic, so all I do is read really. I know that many gifted kids have behavioural challenges similar to my son's. There is a decent chance that there isn't any other diagnosis for him, but I want to rule things out. Also, even when compared to other gifted kids, I feel like his challenges are extreme. \n\nOne thing we have been struggling with is educational outlets for him, either for now or in future. The public school system has basically no resources for gifted kids until grade 4 (obviously many years off), and we cannot afford private school or the privately offered enrichment programs (the latter of which run several hundred dollars a month).\n\nIs there anything in particular you'd recommend reading? I am always looking for more resources.  ", "controversiality": 0, "created_utc": 1390028999, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesk4g3", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjzng", "removal_reason": null, "retrieved_on": 1431994571, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the suggestion. We have an appointment with our paediatrician on Monday and I will ask about seeing someone with a developmental specialty. Where I am, I'm not aware of any age limits for diagnoses like ADHD or Autism, but I suppose that could be the case. I'll look into it...", "controversiality": 0, "created_utc": 1390029094, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesk59e", "link_id": "t3_1vi6mv", "parent_id": "t1_cesk3uc", "removal_reason": null, "retrieved_on": 1431994576, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "A sensory processing issue was my immediate thought too. This is all great advice, and I hope it's able to get OP some help.  \n  \nOP, it sounds like you're so on top of things and are doing an amazing job! I just know you'll get this figured out and these first few years will be a distant, exhausting memory!\n\n", "controversiality": 0, "created_utc": 1390029324, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesk78v", "link_id": "t3_1vi6mv", "parent_id": "t1_cesj9fv", "removal_reason": null, "retrieved_on": 1431994604, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "You are welcome! I really feel for you. I am still scared and sad sometimes, but things are MUCH better than they used to be. Hope they get better for you too. ", "controversiality": 0, "created_utc": 1390029376, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesk7oy", "link_id": "t3_1vi6mv", "parent_id": "t1_cesk2lj", "removal_reason": null, "retrieved_on": 1431994610, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the kind words. I hope things get better soon, and that I can look past these years of misery...", "controversiality": 0, "created_utc": 1390029707, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceskaei", "link_id": "t3_1vi6mv", "parent_id": "t1_cesk78v", "removal_reason": null, "retrieved_on": 1431994651, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "miparasito", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm almost asleep so I'll dig up some resources tomorrow. The only thing I can think to mention is that the difference between gifted and profoundly gifted can be just as big as the difference between average and gifted. A three year old with 125 IQ compared to 105 will present a different set of parenting challenged compared to a kid with iq 125. Well 145 is a whole other game, and 165 is a whole other game on a whole other *planet*.\n\nIs homeschool an option once you both finish school? Are there any private schools in your area that specifically work with gifted kids? Sudbury might work well for him? I mention it because there are schools that offer generous tuition breaks... Worth looking into anyway. \n\nMore tomorrow. ", "controversiality": 0, "created_utc": 1390030947, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceskk63", "link_id": "t3_1vi6mv", "parent_id": "t1_cesk4g3", "removal_reason": null, "retrieved_on": 1431994791, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MommaDerp", "author_flair_css_class": "green", "author_flair_text": "3 yo DD and son born May 27", "body": "I had anxiety depression both pre and post pardum. I didn't want to take anything but it came to the point where I couldn't function. OB put me on Cipralex. Takes a few weeks to notice any change (low dose and low impact) but it made a WORLD of difference slowly. I'm the last person to take medication for something, but I'd highly recommend speaking to your OB or GP about it!", "controversiality": 0, "created_utc": 1390032077, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesksla", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjxb4", "removal_reason": null, "retrieved_on": 1431994907, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CraftyWilby", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't comment to much of what you posted but I did want to ask if you're sharing your feelings with his father? Are you two teamed up? I know it's normal for kids to have a 'favorite' parent at different stages of development. Especially now that he's 3 and a feeling more like a 'big boy' (despite the potty training issues) that could explain why he's gravitating toward his father. ", "controversiality": 0, "created_utc": 1390032085, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesksmw", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431994902, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DinosaurSprinkles", "author_flair_css_class": "purple", "author_flair_text": "1/9/09 + 10/12/13", "body": "My daughter has ODD, and she is your child... only 5. I would say it gets better, but it kinda doesn't. It gets different and more manageable. Caffeine helps my daughter because she also has ADHD, you could try it. Worst case scenario is it doesn't work - best case, it helps. If you ever need to vent PM me. I'm there, too. ", "controversiality": 0, "created_utc": 1390033044, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceskz70", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjavh", "removal_reason": null, "retrieved_on": 1431994997, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I am so sorry for you.\n\nThe only advice I have for you, if you haven't already tried it, is to try and increase his exercise levels.  After daycare, if you can take him to a large park, and just let him run around like crazy to tire himself out physically, *maybe* he'll be slightly easier to manage back home.\n\nHe clearly does need professional help - keep pestering your GP and social services for that - and you need some respite care as well, in my opinion.", "controversiality": 0, "created_utc": 1390037060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceslnm0", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431995330, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brbcat", "author_flair_css_class": null, "author_flair_text": null, "body": "An approach which can be helpful is to use medication to help in the short term, while going to a psychologist/counselor to build strategies/habits to help long term, and then gradually stopping the medication.\n\nAlso you may find that therapies other than CBT suit you better. Acceptance and commitment (ACT) may be an approach you get more from, for example. I'm on my phone so can't get into a long description, but Google can tell you more if you're interested.\n\nGood luck. And as others have said, you're not a bad mom!", "controversiality": 0, "created_utc": 1390042342, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesmegm", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjxb4", "removal_reason": null, "retrieved_on": 1431995640, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AnnieBelly", "author_flair_css_class": null, "author_flair_text": null, "body": "sounds like Junior needs some good old fashion discipline.", "controversiality": 0, "created_utc": 1390045647, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesmtzm", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431995852, "score": -19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ReadingMom", "author_flair_css_class": null, "author_flair_text": null, "body": "I read an article not long ago where a mom was talking about her daughter. She sounded like your child, violent and hard to control. She found out that her child had issues with gluten. Not celiac or anything, just like an allergy. When she was off if she was like a normal little one, but just a couple bites and in a but she would have to restrain her to protect the other children. I know it sounds odd, but I have read that before too. Not trying to jump on that \"no wheat\" bandwagon :) best of luck with it all. I don't know what I would do!", "controversiality": 0, "created_utc": 1390049185, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesnb4b", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996080, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lost_in_GreenHills", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a friend who's a GP who does lots of alternative medicine as well.  He was telling me, last time I saw him, that probiotics can often help colicky babies. Clearly your son is no longer a baby, but perhaps it might be worth trying.  \n\nBeyond that, best wishes to you.  I see you've got lots of suggestions on this thread, and I hope something here works out for you.", "controversiality": 1, "created_utc": 1390049305, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesnbry", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996102, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SeaTurtlesCanFly", "author_flair_css_class": null, "author_flair_text": null, "body": "I just wanted to stop by and say that I don't think you're a bad mom or a bad person for feeling the way you do.\n\nYou are seriously stressed and that level of stress can make it hard to bond and feel connected - especially with the person that is the source of all that stress.  When I get over-stressed, my default is so feel very resentful.  I could easily see myself reacting the way you have, if I was dealing with the same circumstances that you are.  \n\nI really don't have much advice, except for this:  If you have a local YMCA, they may have babysitting services that go along with a family membership.  This is a way for parents to drop off their kids for 2 hours so they can go read in the lounge or go for a swim or workout, etc.  \n\nIf you don't have a YMCA or you already avail yourself of these services, I just want to let you know that you are heard and I don't think you're a bad person.  I think you're just stuck in a very difficult situation.  ", "controversiality": 0, "created_utc": 1390051655, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesnp1q", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996272, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I had this kid, too.  I'd address the sleep first and foremost.  I've had 3 friends with highly-intelligent boys diagnosed with severe ADHD treat their kids' sleep issues and have completely different children once they started sleeping soundly.  \n\nHighly gifted and sleep-deprived 3 year olds are assholes.  Full stop. There were 3 things that turned my kid around (in order of importance):\n\n1. He learned to read.  Part of not being able to sleep and the misbehavior in the day was due to boredom.  My kid needs information flowing into his brain *all the time*.  He was fluently reading 20 books a day at 4 and it made him happier than he'd ever been.  Being allowed to read in bed for 30 minutes with a flashlight became the *one* bedtime routine that actually helped him wind down, (we'd tried everything), and he was suddenly able to fall asleep before 11 PM.\n\n2. Sleeping more than 8 hours at night (reading beat sleeping because it made this possible).\n\n3. Turning 5 and becoming less self-centered and more logical. \n\nHang in there.  Being an asshole at 3 doesn't mean he'll always be a jerk, but you'll need to figure out what's causing the behavior first.  Please research the effects of sleep deficits on preschoolers and see if they're describing your kid.  I think there's a definite link between intelligence and and trouble sleeping.  \n\nAlso, I really resented my kid, too, but I focused on all his good qualities and stressed them and reminded him and me of them *constantly*, but I really didn't like the kid until he was 5.  Now I can't imagine ever feeling those feelings toward him.  He was nuts, though, and I've mostly forgiven myself for it.  He's my favorite person to hang out with now that he's 6 and is a completely different kid than he was at 3-5.  ", "controversiality": 0, "created_utc": 1390053674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceso2bd", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996537, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "arbormama", "author_flair_css_class": "red", "author_flair_text": "two little boys", "body": "I love this aspect of r/mommit.  I read your post and had no idea how to help, but there was another reader who had a great idea!", "controversiality": 0, "created_utc": 1390053774, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceso30s", "link_id": "t3_1vi6mv", "parent_id": "t1_cesk2lj", "removal_reason": null, "retrieved_on": 1431996552, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "VladTheSoviet", "author_flair_css_class": null, "author_flair_text": null, "body": "I work with behavioural teens who have autism, ODD, ADHD, etc. Yes, generally they try not to label as young as 3 because there is a high chance the child will outgrow certain behaviours or they will be mislabelled. \n\nI really hope you can get some help! It sounds like you are doing the best job you can! ", "controversiality": 0, "created_utc": 1390054120, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceso5e5", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjy8l", "removal_reason": null, "retrieved_on": 1431996597, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "I second having him checked for sensory processing disorder. Check out http://www.sensory-processing-disorder.com/sensory-processing-disorder-checklist.html and http://www.spdfoundation.net/about-sensory-processing-disorder.html \n\n I would consider if you have not already done so elminating all processed foods, any with artificial dyes and added sugar, as well as gluten. Basically just a whole foods diet. Rich in nuts, high fat and protein etc. It can take up to 3 months for the gluten and what not to be completely out of the system so this may not be an instant fix. But it can help if you stick with it, it may be worth it to you. I will also say a probiotic can work wonders. Superstore in the natural aisle refridgerated section (where the soy milks are) has a kids chewable probiotic by renew life it is usually $17 . Seriously it had seemed to help my daughter. She was backed up but would have a bowel movement regularly,  so I was unaware. But that helped sort some digestive issues out and helped her mood. It is also a great idea to take a probiotic if you had diarrhea or been sick to help balance the gut baacteria. Since your son has had bowel issues, he may do well on one. It is not covered by insurance though. \n\nMy daughter has some sensory issues. Not enough to get diagnosed, but I use some of the coping mechanisms to help her through. We also do no dyes or gluten and this has greatly helped with outbursts. She absolutely can not have dyes. She gets this crazed wild eye look and just turns into a gremlin, she is impossible to calm down and it ends in a sensory overload meltdown and everyone frazzled. She was also/is not a sleeper (getting better with age), and was definitely a baby that kept you on your toes. \n\nHow you describe your son was basically my nephew at that age. He was diagnosed with Organic Brain disorder, ADHD, impulse Control, and ODD around age 6.At 16 now he is completely different. Once he started going through puberty as an early teen his behaviour did a 180. He is one of the best behaved, sensitive teenagers I have ever know. My sister said that doctors told her that this happens with some kids when the hormones kick in.\n\nPlease also I know you said parent therapy, but any type of family and individual therapy may be beneficial for everyone in your family. It can be hard, and therapists can give you and your SO coping mechanisms to try and help when the days are tough. ", "controversiality": 0, "created_utc": 1390054267, "distinguished": null, "downs": 0, "edited": 1390055074, "gilded": 0, "id": "ceso6dp", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996603, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "VladTheSoviet", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry for the second comment but yes you should! There are lots of Canadian organizations that can help with early intervention. I am in Ontario and I used to work for an organization that gave help to parents in situations like yours. We would take the child out for several hours a week to give parents a break. \n\nHopefully your son is eligible for early intervention! It can make such a huge difference!", "controversiality": 0, "created_utc": 1390054302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceso6n3", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjp5y", "removal_reason": null, "retrieved_on": 1431996605, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Which province? I am Canadian as well. There is early intervention programs. Here is the catch. The faster the diagnosis you get the more help you qualify for. But many people are hesitant to diagnose someone this young cause it can be hard to shake the label, but also if he gets the wrong diagnosis then he may be getting the wrong treatment. \n\nI have not worked with a lot of children (besides my nephew), but I have worked with a lot of adults within group homes and day programs. Some of their behaviours could be challenging so I feel for your family.", "controversiality": 0, "created_utc": 1390054673, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceso9gm", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjp5y", "removal_reason": null, "retrieved_on": 1431996644, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Beckua", "author_flair_css_class": "purple", "author_flair_text": "4.5, 3, and newborn girls", "body": "I have read lots that sometimes food allergies can turn kids into monsters. (Especially gluten and red and yellow dyes.) You may want to eliminate some things from his diet one at a time and see if that works.\n\nI also have a crazy wild monkey for a daughter (age 4 now). And 3 was RIDICULOUS!  She started out crazy from the amount of hard kicks she was constantly giving me in he womb, but 3 was especially crazy. I have heard that terrible 3's and 4's are worse than terrible 2's. \n\nBut a few things that worked for her: an emotionally calm consequence-based discipline. (You may have already tried this) but whenever I got worn out, annoyed, angry, she would play off of it. So I would stay as calm as possible (better said than done) but make the punishment fit the crime. For instance, she would run from me at parks towards busy streets. So we stopped going. She would ask to go to a park and for a week I would tell her: \"I just cannot handle it when you run from me. So no parks for a while. I have to make sure you are safe.\"  \n\nI think the trick for her was to wait until she was calm. If I warn her of the consequence when she is crazy or energetic, she won't care. But when she calmly asks for something and I refuse it in a calm manner, it really seeps in. \n\nI also feel like most of my consequences are based on taking care of myself and not letting my child abuse me or hold the power in the relationship. Yet, if I am calm, love is still communicated.  \n\nAlso, when I realized her strengths and talents, it becomes easier to like her. (I will always love her, but you know, sometimes you don't LIKE your kids...)  But there are things that she really excels at. Signed her up for dance, she ran around the room like an animal the whole time. Gave her some blocks, she sat for hours working on different designs and constructions. She will sit for hours to learn about science, especially if it is medical. That made me realize that her crazy energy can actually be used for good and not evil!  And sometimes I wonder if she is crazy because she is not mentally and physically challenged enough throughout the day. (We watch a lot of tv...)\n\nSo maybe try out a few things (I hear martial arts is especially good for kids with this kind of energy.) to challenge and satiate your son's intense energy? Then you may be able to appreciate it and not just resent it. \n\nGood luck, though. My blood pressure still rises whenever I think of my daughter's terrible 3's. When we tried time outs, she would destroy things or just scream at us. When we spanked her, she would just laugh at us. And I would feel the same distance and resentment when our relationship was nothing but power plays. But she got better and so did I. And hopefully that will happen for you as well! I just hope you don't feel like a bad mom or anything, because obviously you are trying so hard for your son when it is anything but easy. And that is an amazing example of love that I think your son will someday understand. I think you are amazing!", "controversiality": 0, "created_utc": 1390054700, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceso9nk", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1435527051, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Beckua", "author_flair_css_class": "purple", "author_flair_text": "4.5, 3, and newborn girls", "body": "Oh, and since you mentioned that you like reading, I would suggest Parenting with Love and Logic. That method of parenting/discipline is the one that worked the best on my daughter. It's basically what I was describing, but it's nice to hear/read more examples and ideas.\n\nedit: one more thing, another daughter of mine has a gluten intolerance. It is SUPER hard to diagnose, but it stunts her growth, weakens her immune system, and gives her daily diarrhea. So I know you tried eliminating things, but you may want to look into gluten again just in case. They are still doing research on it, so some new things are discovered all the time.", "controversiality": 0, "created_utc": 1390054958, "distinguished": null, "downs": 0, "edited": 1390055882, "gilded": 0, "id": "cesoblt", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso9nk", "removal_reason": null, "retrieved_on": 1431996686, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "melissa491", "author_flair_css_class": null, "author_flair_text": null, "body": "It's a weird one, but when I was little, I was pretty bad. Problems didn't start popping up until preschool, but I was difficult...I would climb up the swing while others tried to go down, when kids took off shoes for merri-go-rounds, I would throw them off the playground, I was emotional, hyper...\n\nAnyway, my parents got me tested for depression. As soon as I was in treatment for that (and I was super young), everything sort of cleared up. Maybe that's a problem for him, though he is younger than I was.\n\nBut more importantly, don't be too hard on yourself. I think you are feeling perfectly natural things. Reading your story, I think I would react in much the same way. Just try to live day to day, and hope that he grows out of it. If not, I know many moms who had one child, then ten or fifteen years later, had another one. That's always something to try!", "controversiality": 0, "created_utc": 1390055087, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesocm4", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996692, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "derva", "author_flair_css_class": null, "author_flair_text": null, "body": "oh hang in there!  you are so clearly a caring, involved, very committed mom. you can get through this!!   My son is 4 and while he has not had so many of the struggles you are describing, I am betting you are looking for any and all ideas, so here's a few that came to mind for me.\n\n- take care of yourself.  it's important and it's so urgent.  you cannot be your best and feel good if you aren't.  consider it a health emergency, tell your DH that, and find a way.  you are worth it!  step one - get more sleep. \n\n- is it possible to fine even one thing a day you guys can do that is just fun? that won't end badly? something that you can enjoy that can be a nice memory .. more of those will push some of the negative ones out of the way?    \n\n- Maybe just take a break from him.  can you?  can your husband take some vacation time?  Maybe you just need to be around each other less for a while.  that is totally ok.  you didn't say if you work, or if hubs does, or both.. but at my house, my husband works, I don't... and he gets greeted like a hero every night.  lucky him.  he didn't have to 'do battle' all day.  It would be great if Daddy can take a turn.  frankly, it seems like you are at 'emergency' level - maybe you just have to tell him he has to find a way.\n\n- my son has been sick 14 times in the last 12 months or so - I FEEL YOU on the constant illnesses.  DS's are fevers and nausea.  for a WEEK.  hot, lethargic and won't eat.  he is in the bottom 5% weight category - officially underweight!!  the sicknesses are killing me, but I have had three docs say that it's just his age, and some kids get runny noses, others have fevers.  I don't have a solution on this one, but I feel your pain - it is wearing me down and really putting a strain on me and husband b/c we can't always agree on what to do!  \n\n- I have a really strong memory of tucking my son in bed one night at the end of a tough day that involved time outs, and having to 'fix' a mistake he made (erasing pencil on walls).  the strangest thing happened - I asked him about his day and he smiled and said he had a really good day.  and I told him I was proud he fixed his mistake.  and he smiled such a contented smile.  and I honestly think he felt safe and content b/c he had seen so much evidence of the rules around him, and he had met the challenge.   when you commented about your son loving daddy even though he's the disciplinarian, this just came to mind - the old saying that kids need discipline, and consistent discipline - and when they have it, they feel safe and happier.  Not to imply that I think you aren't doing it (sounds like you have tried everything!), but I'm just wondering if a VERY smart child needs an even MORE hardlined approach, for a longer time??  Can you go back to some of the discipline techniques and try them again, for even longer?  he sounds VERY VERY smart and like he is testing you at every turn.  every. turn.  you must be so exhausted!  \n\n- what about starting small, with one behaviour, and one discipline technique, and just keep it going ... pick one thing that you are going to have absolutely ZERO tolerance for.  like running in the house.  every time he runs, you pick him up and put him in time out.  no discussion - just 'you are running, it is not allowed, so you must sit in timeout'.  and you just do it every single time.  it will be tiring, but he's going to get so tired of having his playing interrupted, he's got to give up.  and he will respect you and get it that you are not going to budge and not going to ever make an exception. Once you conquer that one, then pick the next one - hitting with toys maybe.  our rule is, if you hit with a toy, or throw a toy, the toy is taken away immediately, no discussion, and put at the top of the tall bookshelf.  And there have been many tears, but that's the rule.  What I like about this is I don't have to get mad. I just enforce the rule and go back to what I am doing.  \n\n- with the discipline, since he's so smart, maybe pick techniques that get him to do something because HE wants to.  E.g. he doesn't want to lose the toy.  or, he doesn't want to have his play interrupted.  those are nice things he loses.  maybe that would work more than things that are bad.  My 2 yr old has already shown me that she is willing to get spanked, just so she can kick me one more time.  The minute I saw the look in her eye that said 'yeah, it wasn't so bad', I just stopped spanking.  she'll take the pain in order to do what she wants.  \n\n- look really hard for things he is doing well, and praise him for them - just a bit more positive energy may be a good thing? \n\n- I would also make it clear you respect yourself, and he must respect you too.  If he is trying to hurt or anger you, you can step away.    And say to him, 'I cannot help you if you are being disrespectful (or, hurting me, or whatever).  And just remove yourself from the situation - even if it is just stepping back a few feet and stopping what you are doing.\n\nI wish you so much good luck!  and also strength. you are bigger, smarter and in charge!  Believe in yourself :)\n\nedit:  got to seem more of your answers after posting this.  ... having read more of your background and some of these exchanges, I wonder if it would be a useful intellectual exercise to just think - what answers would I look for if I knew for certain that he has no medical 'problems' - either physical physical health or mental health.    Yes he is very smart, but other than that, nothing.  no allergies, no OT problems, no sensory overload, nothing.  Could anything else explain all of this behaviour?    I don't know what conclusion you may come to, but it might be liberating and very helpful.  And, while I completely agree that as a parent you cannot stop looking until you find an answer... it also seems to me, as one small opinion, that you have seen a LOT of specialists.   I am almost afraid to type that b/c I do not want to seem unsupportive.  But as an off the wall type A, I often rely on my husband to tell me when I have gotten too intense and zealous about something.  and since you are looking for any and all ideas, I feel like this one should be in the mix.  \n\nedit #2:  how much is your husband involved in the search for answers?  what does he think?  I have also had some humbling experiences when I was convinced I was the only one who could fix it, and I was basically beating a dead horse working on the wrong problem and solution (in my case, breast feeding was not working and my son was underweight), and ignoring what my husband thought... and was even mad at my husband for his wrong, offensive opinion... but somehow I managed to step back and get a second opinion... and my husband was right.  100%, totally right.  but I was so convinced I was going to solve it, and I could figure it out, and I was not wrong... well.  yeah.  I was wrong.  wrong, wrong, wrong.  ", "controversiality": 0, "created_utc": 1390055087, "distinguished": null, "downs": 0, "edited": 1390056175, "gilded": 0, "id": "cesocme", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996692, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brindey", "author_flair_css_class": null, "author_flair_text": null, "body": "I have no advice to offer but I do want to send you many hugs. You are a great mom and he is very, very lucky. ", "controversiality": 0, "created_utc": 1390056922, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesortc", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996857, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "I haven't read the comments yet, so I won't make my own reply if I find a similar enough post below, but I just wanted to comment and give you **A BIG BIG BIG BIG BIG BIG HUG** because I have/had this child, too, and it's *very exhausting*.  **BIG HUG**.  ", "controversiality": 0, "created_utc": 1390057346, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesovlb", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431996906, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "tiffy68", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for sharing your story.  It took courage to do that.  As a special education teacher and mother of a child on the autism spectrum, I have some idea of what you're going through.  Many therapists will resist labeling a kid that young.  Keep pushing and advocating for your child.  Your local public school system has many free resources.  Request testing from the special education department at your local school district.  They will do a free multi-disciplinary evaluation--OT, PT, speech/language, and IQ.  (This is federal law by the way and applicable in all 50 states.)  If you are in Texas, there's a great resource called Any Baby Can.  \n", "controversiality": 0, "created_utc": 1390058517, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesp6x1", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431997054, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyGrizabella", "author_flair_css_class": "purple", "author_flair_text": "IAMA mom to an Aspie AMA!", "body": "Sent you a PM.", "controversiality": 0, "created_utc": 1390058645, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesp880", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjzid", "removal_reason": null, "retrieved_on": 1431997071, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bittercow", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have any advice but my heart goes out to you. ", "controversiality": 0, "created_utc": 1390059210, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cespe56", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431997149, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ashley0427", "author_flair_css_class": null, "author_flair_text": null, "body": "The being raised by my great grandparents tells me to tell you beat his ass a couple of times, set boundaries and make him do certain things. At three if he isn't potty trained, and he shits on himself, he either cleans himself or he sits in it. Sometimes, you have to do things that go against what you think or want to do. \n\nNow I know that an ass whooping isn't for every child. I have four of my own and when a pop on the butt worked for one, a time out worked for the other. You have to explore ways of discipline. And the way it sounds there isn't any in the house, you let him run amuck because you can't handle (not being mean here, there are days I can't handle mine). But you are burning the candle at both ends and its going to bite you in the butt eventually. \nHe needs to be tested for everything RAD, ODD, PDD-NOS, ADD, ADHD, etc. If his behaviors are to the extreme that you say they are, he needs to be medicated. I don't believe in medicating children, but sometimes it is necessary in order to figure out how to handle things, then take the child off of them, when he is in better control of his actions. \nDon't resent him, it will only hurt you and him in the end, embrace him for who he is and help him help himself. ", "controversiality": 0, "created_utc": 1390061777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesq73k", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431997530, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Karissa36", "author_flair_css_class": null, "author_flair_text": null, "body": "There are many good suggestions here to follow up on.  I'll just add this one even though it will be down voted.  Spank.  Every time he hurts you or is violent at home, spank him.  He is strong willed.  You need to be stronger.  Do it now because he is only going to get bigger and harder to control.  Children NEED their parents to be in charge.  Sometimes spanking is the only way to do that.  Spanking might initially make him behave worse because he will be outraged.  Keep it up.  He needs to learn his place in the family, just like wolves do in a pack.  Not all children respond to sweet reasoning, time outs and loss of privileges.  ", "controversiality": 1, "created_utc": 1390063494, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesqrwa", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1431997852, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you.", "controversiality": 0, "created_utc": 1390064924, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesr9si", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso5e5", "removal_reason": null, "retrieved_on": 1431998126, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks very much. Good luck with your daughter. Hope things get easier for you too.", "controversiality": 0, "created_utc": 1390064964, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrabz", "link_id": "t3_1vi6mv", "parent_id": "t1_ceskz70", "removal_reason": null, "retrieved_on": 1431998129, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not familiar with ACT. I will read up on that today. Thanks!", "controversiality": 0, "created_utc": 1390064999, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrasg", "link_id": "t3_1vi6mv", "parent_id": "t1_cesmegm", "removal_reason": null, "retrieved_on": 1431998131, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in BC. I've done some looking and I can't quite figure out how early intervention services work here, or how we would qualify. I will continue to research. Thanks.", "controversiality": 0, "created_utc": 1390065060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrbjt", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso9gm", "removal_reason": null, "retrieved_on": 1431998135, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the suggestion. Interestingly we had him tested for celiacs because of the GI issues and because it runs in my family. Test was negative. Is there a way to test for intolerance other than an elimination diet? Definitely willing to give anything a try at this point!", "controversiality": 0, "created_utc": 1390065159, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrctz", "link_id": "t3_1vi6mv", "parent_id": "t1_cesnb4b", "removal_reason": null, "retrieved_on": 1431998142, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Is there a public health office where they have some nurses on hand. Maybe where they did baby weigh and sees after being born or where they give vaccines. Usually there is a dental hygienist on hand offering free teeth checks as well. Those places usually have some sort of early intervention thing or professionals that deal with kids regularly. ", "controversiality": 0, "created_utc": 1390065348, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrf9u", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrbjt", "removal_reason": null, "retrieved_on": 1431998158, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you very much for this comment. You are 100% on the mark about needing to remain calm because he does feed of me when I'm angry or agitated. The problem is that I royally SUCK at it. Like, I'm terrible. It's something I am working on. I am a very emotionally open person; it's really easy to see when I'm upset, even when I'm trying to do my very best to hide it. And my son is very very perceptive. After a hard day, he will sometimes ask me, \"mommy, why are you using your quiet voice\". It's near impossible to hide feelings from him. We are otherwise using the consequence based punishment. For example, he kept ripping his potty chart off the fridge and it was getting destroyed. Yesterday he did it again and it came right off. No more potty chart. MAJOR meltdown. Anyway, I really hope his 2s were the worst and his 3s are a bit easier. I don't know if I can handle worse. ", "controversiality": 0, "created_utc": 1390065478, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrgxt", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso9nk", "removal_reason": null, "retrieved_on": 1431998166, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the book suggestion. I'll add it to my list.", "controversiality": 0, "created_utc": 1390065509, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrhcn", "link_id": "t3_1vi6mv", "parent_id": "t1_cesoblt", "removal_reason": null, "retrieved_on": 1431998167, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the kind words. I'm in Canada so I don't know about whether the special ed departments do that kind of testing. I will certainly ask though. And he hasn't yet seen an OT, so we are going to try that next, thanks to the awesome suggestions of some other folks here.", "controversiality": 0, "created_utc": 1390065667, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrjeg", "link_id": "t3_1vi6mv", "parent_id": "t1_cesp6x1", "removal_reason": null, "retrieved_on": 1431998175, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for asking. Yes, we are very open with each other. Sadly we both have the same feelings and struggles, though mine are a bit more extreme I think. Regardless, we always parent as a team. ", "controversiality": 0, "created_utc": 1390065730, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrk7u", "link_id": "t3_1vi6mv", "parent_id": "t1_cesksmw", "removal_reason": null, "retrieved_on": 1431998180, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Good suggestion. I think I'm going to have to make all my meals in the slow cooker to make time! :)", "controversiality": 0, "created_utc": 1390065775, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrksf", "link_id": "t3_1vi6mv", "parent_id": "t1_ceslnm0", "removal_reason": null, "retrieved_on": 1431998182, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for taking the time to write this and for your great suggestions. I think we are definitely guilty of focusing on too many behaviours and trying too many discipline techniques at once. I think picking something and sticking to it, while continuing to investigate his other health issues, is a very good way forward. \n\nMy husband and I are on the same page in working through this. His suggestions are probably more valuable than mine because he tends to be more calm and level-headed!", "controversiality": 0, "created_utc": 1390066246, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrqvd", "link_id": "t3_1vi6mv", "parent_id": "t1_cesocme", "removal_reason": null, "retrieved_on": 1431998258, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much. We don't have a membership at our YMCA, but I think our local community centre might have super cheap babysitting for a few hours. I will look into it. Even a couple of hours of quiet time would be amazing at this point.", "controversiality": 0, "created_utc": 1390066410, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrszk", "link_id": "t3_1vi6mv", "parent_id": "t1_cesnp1q", "removal_reason": null, "retrieved_on": 1431998306, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "VladTheSoviet", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem. I know how incredibly difficult some children with developmental and psychiatric issues can be. I work with a boy who's parents had to put him in a treatment home (where I work) at the age of 8 as he was so violent. His mom undergoes such guilt and sadness but she knows she did what was best for her child. \n\nI would recommend trying a sensory or snoezelen room. Some things you can do at home are using sensory balls (they have prickles), weighted blankets, deep pressure massage. I am always shocked when working with special needs kids how much this can reduce aggression. \n\nI also really hope you get some community help. The one advantage of having a diagnosis is that you can register for respite, support, in home workers, coverage for babysitting. \n\nWhat province are you in? If you are in Ontario I can send you the names of some wonderful organizations. ", "controversiality": 0, "created_utc": 1390066558, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesruvo", "link_id": "t3_1vi6mv", "parent_id": "t1_cesr9si", "removal_reason": null, "retrieved_on": 1431998324, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for this. We are actually working with him on reading because he loves books so much. He is sounding out lots of words now (and has been since it was about 2.5). I will try to devote more time to this so that he can read on his own sooner. I think I'm also going to start to keep a sleep journal so that we can figure out of if there are some clearer patterns in when he's getting up.", "controversiality": 0, "created_utc": 1390066569, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrv09", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso2bd", "removal_reason": null, "retrieved_on": 1431998325, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for the suggestions. The one area where we seem to have no issues is with diet. He will eat anything and everything. As a result, and because I love cooking, he eats almost no processed food. In fact, I think the extent of his processed food consists of a couple of crackers he has a school snack. I will definitely give the priobioitic a try though. And we may try to give up his few daily crackers too, just in case. \n\nAnd despite the fact that it hasn't been helpful so far, I fully intend to continue with the counselling.", "controversiality": 0, "created_utc": 1390066829, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrye3", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso6dp", "removal_reason": null, "retrieved_on": 1431998374, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing your story. I'll keep depression in mind.", "controversiality": 0, "created_utc": 1390066871, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesryyf", "link_id": "t3_1vi6mv", "parent_id": "t1_cesocm4", "removal_reason": null, "retrieved_on": 1431998380, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. It's very hard to believe that somedays, but thanks.", "controversiality": 0, "created_utc": 1390066913, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrzhf", "link_id": "t3_1vi6mv", "parent_id": "t1_cesortc", "removal_reason": null, "retrieved_on": 1431998384, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. In some ways, it does help knowing that there are others who are suffering through similar situations. Best of luck to you too! Get some rest!", "controversiality": 0, "created_utc": 1390066937, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrzso", "link_id": "t3_1vi6mv", "parent_id": "t1_cesovlb", "removal_reason": null, "retrieved_on": 1431998395, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you.", "controversiality": 0, "created_utc": 1390066947, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesrzx6", "link_id": "t3_1vi6mv", "parent_id": "t1_cespe56", "removal_reason": null, "retrieved_on": 1431998387, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I am going to try him on a probiotic.", "controversiality": 0, "created_utc": 1390067103, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cess1zr", "link_id": "t3_1vi6mv", "parent_id": "t1_cesnbry", "removal_reason": null, "retrieved_on": 1431998421, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for commenting. I am not in favour of spanking but I agree with what you said about parents needing to be in charge... I just think that there are other ways to do this, without resorting to hitting.", "controversiality": 0, "created_utc": 1390067157, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cess2p2", "link_id": "t3_1vi6mv", "parent_id": "t1_cesqrwa", "removal_reason": null, "retrieved_on": 1431998434, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Despite what my post sounds like, he most definitely does not run amuck in our house. He is punished constantly. Lectured constantly. In timeouts constantly. Nothing sticks. I am not in favour of spanking, but thank you for taking the time to comment.", "controversiality": 0, "created_utc": 1390067242, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cess3si", "link_id": "t3_1vi6mv", "parent_id": "t1_cesq73k", "removal_reason": null, "retrieved_on": 1431998443, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in BC. I am going to ask our paediatrician what kinds of organizations I might be able to access. You don't know of any located here, do you?", "controversiality": 0, "created_utc": 1390067437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cess6a7", "link_id": "t3_1vi6mv", "parent_id": "t1_cesruvo", "removal_reason": null, "retrieved_on": 1431998484, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I will.", "controversiality": 0, "created_utc": 1390067599, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cess8cv", "link_id": "t3_1vi6mv", "parent_id": "t1_cesksla", "removal_reason": null, "retrieved_on": 1431998525, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok thanks. I will ask my paediatrician about what we can access when we see her on Monday. ", "controversiality": 0, "created_utc": 1390067646, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cess8za", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrf9u", "removal_reason": null, "retrieved_on": 1431998527, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. Yes, I have done some reading on the differences between highly and profoundly gifted. Homeschooling is not an option because we need dual income (we live in a very expensive city) and because, frankly, I don't have the skills. I'd be a horrible teacher. I don't think I'd be doing him any favours at all! There are some private schools that work with gifted kids but the tuition is &gt;$20,000 per year, which we just can't afford.\n", "controversiality": 0, "created_utc": 1390067783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cessaui", "link_id": "t3_1vi6mv", "parent_id": "t1_ceskk63", "removal_reason": null, "retrieved_on": 1431998545, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "thisismymoniker", "author_flair_css_class": "brown", "author_flair_text": "son 1/13/2010", "body": "&gt;Thanks. In some ways, it does help knowing that there are others who are suffering through similar situations. Best of luck to you too! Get some rest!\n\nI'm a single mom and I ended up giving up and moving in with my parents for some help for awhile. It's made a huge difference for me. ", "controversiality": 0, "created_utc": 1390068068, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesseoo", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrzso", "removal_reason": null, "retrieved_on": 1431998603, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "VladTheSoviet", "author_flair_css_class": null, "author_flair_text": null, "body": "I really don't! I'm sorry! I do have a few friends from BC who are also moms - let me ask them when I see them this week. \n\nOh I just looked and in the Vancouver area there is an organization called Family Services of Greater Vancouver. I worked for an Ontario chapter and that was who I did in home support through. It's run by United Way and is free. Probably worth a call - they do all kinds of family support. \n", "controversiality": 0, "created_utc": 1390068834, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cessouf", "link_id": "t3_1vi6mv", "parent_id": "t1_cess6a7", "removal_reason": null, "retrieved_on": 1431998730, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CraftyWilby", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, sadly yes and sadly no. At least you're still a team, work hard to hang onto that as the situation sounds like it would quickly become untenable otherwise. I sincerely hope things improve for your family and soon. Just because it's the world I come from and not because of any kind of expert opinion, have you explored animal assisted therapy? ", "controversiality": 0, "created_utc": 1390069163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesstav", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrk7u", "removal_reason": null, "retrieved_on": 1431998791, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ashley0427", "author_flair_css_class": null, "author_flair_text": null, "body": "Like I said, I know that spankings don't work for every child. And since you are opposed to it, that's fine. But you need to figure something out. Especially if its getting to the point that you hate your child and feel no connection with him. Then again, it might be you that needs the therapy and the child might be okay, just acting out, because he can feel the way you feel towards him. ", "controversiality": 0, "created_utc": 1390070039, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cest521", "link_id": "t3_1vi6mv", "parent_id": "t1_cess3si", "removal_reason": null, "retrieved_on": 1431998930, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I will look them up. Thanks!!", "controversiality": 0, "created_utc": 1390071611, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cestqn7", "link_id": "t3_1vi6mv", "parent_id": "t1_cessouf", "removal_reason": null, "retrieved_on": 1431999200, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I haven't. Something to look into perhaps... Thanks again!", "controversiality": 0, "created_utc": 1390071708, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cests27", "link_id": "t3_1vi6mv", "parent_id": "t1_cesstav", "removal_reason": null, "retrieved_on": 1431999229, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that's unlikely because his issues are persistent regardless of who is caring for him. And they are not perceptibly worse around me (despite the fact that he prefers his dad). Thanks for the thoughtful response. ", "controversiality": 0, "created_utc": 1390071796, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cestt8r", "link_id": "t3_1vi6mv", "parent_id": "t1_cest521", "removal_reason": null, "retrieved_on": 1431999240, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "Check out the Bob Books if you haven't already. They were the spring board that really got mine reading.  ", "controversiality": 0, "created_utc": 1390077097, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cesvtcc", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrv09", "removal_reason": null, "retrieved_on": 1435526835, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. I will do!", "controversiality": 0, "created_utc": 1390079106, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceswjyr", "link_id": "t3_1vi6mv", "parent_id": "t1_cesvtcc", "removal_reason": null, "retrieved_on": 1432000587, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "derva", "author_flair_css_class": null, "author_flair_text": null, "body": "It's so wonderful that you two are on the same page.  I don't always have that luxury - I can't tell you how much it wears you down when you're not in sync on how to handle an illness or issue.  I deal with that stress a lot.  that's a huge one in the plus column.  good luck with everything!", "controversiality": 0, "created_utc": 1390087767, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceszsrh", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrqvd", "removal_reason": null, "retrieved_on": 1432002132, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "wifeatron3000", "author_flair_css_class": "purple", "author_flair_text": "SAHM to Lilly (3) and Jack (19 months)", "body": "Piggybacking on this comment to second the recommendation for probiotics. They were life-changing for my son. Especially since you mentioned that your son has been ill a lot - has he taken a lot of antibiotics in the past? Those will kill both good and bad bacteria. A high-quality probiotic can make all the difference in the world in getting your son's gut healthy again.\n\nWe have also completely eliminated gluten from my little guy's diet and he has dramatically improved over the last few months. It can be difficult but if you decide to go that route you need to do it 110%. Even a little cheat can undo all the progress that you've made. We had a whoops last month where my son accidentally had some gluten and it took 10 days to get him back to normal - he was right back to his old self, bouncing off the walls, screaming, night wakings, etc. It could take weeks to see an improvement but seriously, it is so worth it. My son is a different person (a REAL person) now.", "controversiality": 0, "created_utc": 1390088931, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet08r2", "link_id": "t3_1vi6mv", "parent_id": "t1_ceso6dp", "removal_reason": null, "retrieved_on": 1432002325, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Just curious.. is soy a part of his diet at all and if so has he been tested for an allergy with it? My boyfriend's 3 year old kept coming home from his mother's sick. Fever, diarrhea, runny nose, asthma like symptoms. It went on for almost a year until he came home with brown liquid in his cup. She had been giving some type of soy milk because she is lactose intolerant. The symptoms to soy allergies matched his and once she stopped giving him the milk he stopped being sick. ", "controversiality": 0, "created_utc": 1390091699, "distinguished": null, "downs": 0, "edited": 1390096732, "gilded": 0, "id": "cet1b2v", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1432002826, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Q-Kat", "author_flair_css_class": null, "author_flair_text": null, "body": "My friend was 28 before she found out she was allergic to soy. They'd put her on an elimination diet to finally find out what was causing a LOT of problems and they made her start with just soy which put her straight into a hospital bed. Many problems solved suddenly after that!\n\nit certainly seems to be an allergy that most people aren't aware can exist. And doctors for that matter since it went unrecognised for so long and found only by chance", "controversiality": 0, "created_utc": 1390094535, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet2ct5", "link_id": "t3_1vi6mv", "parent_id": "t1_cet1b2v", "removal_reason": null, "retrieved_on": 1432003323, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Q-Kat", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree witht he medication, that violent behaviour needs to stop ASAP and if it means drugging your child until you can figure it out then so be it. Some semblance of sanity has to be clung to ", "controversiality": 0, "created_utc": 1390094733, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet2fg5", "link_id": "t3_1vi6mv", "parent_id": "t1_cesq73k", "removal_reason": null, "retrieved_on": 1432003355, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1390096699, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet3558", "link_id": "t3_1vi6mv", "parent_id": "t1_cet2ct5", "removal_reason": null, "retrieved_on": 1432003797, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Good question. :) He doesn't get any soy because we determine earlier that he is allergic. We took him off dairy to test for lactose intolerance, and discovered that soy made his GI problems exponentially worse. Didn't affect his behaviour though. Thanks for the thought!", "controversiality": 0, "created_utc": 1390109540, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet7nrl", "link_id": "t3_1vi6mv", "parent_id": "t1_cet1b2v", "removal_reason": null, "retrieved_on": 1432005960, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry to hear that you aren't on the same page with your partner. That must be really rough. I am very thankful that my husband and I are on the same page. I'm truly grateful for everything he does, for every single time he takes over parenting responsibilities because I just can't take it anymore (despite the fact that he's also miserable). He is awesome and I am very lucky. Our communication is really good. ", "controversiality": 0, "created_utc": 1390109672, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet7pdh", "link_id": "t3_1vi6mv", "parent_id": "t1_ceszsrh", "removal_reason": null, "retrieved_on": 1432005977, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "elh1983", "author_flair_css_class": "red", "author_flair_text": "Evan2/6/09 Ellie3/22/10", "body": "First of all, take a deep breath and take sometime for you. \n\nI know you said you tested for allergies, have you tested him for gluten allergies? My friends son had so many of the same symptoms and he ended up with a gluten allergy. Not everything calmed down at once, but things did slowly once diet was controlled. I give you all the credit in the world parenting is a hard task. Keep calm, lean on your husband, and cry when you have to. Hugs to you mom.", "controversiality": 0, "created_utc": 1390117382, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cet9w69", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1432006960, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for your comments. We have had him tested for Celiac but not a gluten allergy. This is one of the first things we are going to ask the paediatrician to do on Monday. ", "controversiality": 0, "created_utc": 1390118036, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceta1e6", "link_id": "t3_1vi6mv", "parent_id": "t1_cet9w69", "removal_reason": null, "retrieved_on": 1432007029, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Thats great to hear!  kids though with a gluten issue will sometimes actually crave the gluten and won't show any outward physical signs of anything wrong is wrong. It may be worth it to try going gluten free for say 4-6months. Keep a food/behaviour/bowel movement journal and if you see no improvement in those 4-6 months then you know its not that. But doesn't hurt to try :) worst case scenario you so no improvement.  Best case you see him calmer and bowel movements resolve", "controversiality": 0, "created_utc": 1390130126, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cetc36c", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrye3", "removal_reason": null, "retrieved_on": 1435526412, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ReadingMom", "author_flair_css_class": null, "author_flair_text": null, "body": "I found this article on a quick search: http://www.celiaccentral.org/non-celiac-gluten-sensitivity/introduction-and-definitions/ You could try with allergy testing for gluten, and see if it is an allergy. But it says if it is just the sensitivity that the only real test is change of diet. In that mother's article (which I will look for again) her doctor told her do do a month off gluten (every speck of it) and then a month on. If there any possible changes, to do it again to make sure it wasn't a fluke. I know it is a huge lifestyle change, my kids are allergic to dairy and eggs, but if it could give you any relief, it is worth a shot!", "controversiality": 0, "created_utc": 1390145598, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cetexyr", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1432009445, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LadyBugJ", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi, I just wanted to drop in and say I really hope everything works out for you, and I appreciate you writing this post because it's invited such great comments!\n\nFrom what I understand, there is no way to \"test\" for non-celiac gluten sensitivity, but I highly recommend you try going gluten free for a few months. My friend's kid's behavioral problems were totally fixed by cutting out gluten. I know yall are super busy, but you love cooking right? Maybe this could be a healthy cooking challenge? I also second the ideas about the OT sensory processing center.\n\nAnother thought- **Maybe this kid is a genius**... If the gluten thing doesn't work out, what if you tried some intense tutoring or something? Or maybe there's something online to get him the educational stimulation he needs without breaking the bank? I know a kid who taught himself piano by watching youtube. Or maybe your son is kinda like [this awesome kid. They called him special-ed, but he's actually just a genius](http://www.nydailynews.com/life-style/health/autistic-boy-genius-iq-higher-einstein-article-1.1340923).\n\nWishing yall the best of luck!", "controversiality": 0, "created_utc": 1390209489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceu3l3o", "link_id": "t3_1vi6mv", "parent_id": "t3_1vi6mv", "removal_reason": null, "retrieved_on": 1432021405, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "body": "I have teens and an infant, so I don't have any advice specific to 3 year olds, but I LOVED the Parenting with Love and Logic for Teens.  There were lots of example conversations.\n\nAlso, I don't think it is important to *hide* your feelings from your son, it is just important not to *act* on them.  When kids figure out that they can make an adult lose it, they do.  Getting mom mad and having her act calmly isn't nearly as fun/exciting/empowering as getting her mad and having her yell and scream.  So, you may not be hiding your feelings, but I think you're doing great.  When he asks \"Why are you using your quiet voice?\" I think it's fine to tell him that you are upset/tired/grouchy/disappointed but you don't like to yell.\n\nAlso, for both your sanity, is there something you guys can all do together where your son will have a hard time getting in trouble?  Can you take him to an empty park?  Can you go hiking in a state park?   When our relationship with our older kids gets tense for a long time, a happy afternoon seems to help re-boot the relationship and remind us why we love each other.", "controversiality": 0, "created_utc": 1390247289, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceuf23w", "link_id": "t3_1vi6mv", "parent_id": "t1_cesrhcn", "removal_reason": null, "retrieved_on": 1432026977, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "I have no advice for you, all I can offer is hang in there.  I was this 3 year old.  I was horrible.  My mother said she used to wish \"I hope you have a child just like you someday\" on me secretly.  We joke about it now, as we are very good friends, but I was not easy to raise.  Not even a little.  I was on every psychiatric drug imaginable, and it did little to curb my behavior issues.  Eventually I just grew the fuck up, so there is a light at the end of the tunnel.\n\nOne thing I must add though, that is so important, is love.  Even though I was a violent, loud, inappropriate, rude, back talking, hyper active, chatty, talented, artistic, smart-as-a-whip kid, my mother loved me.  Even though I made her cry with frustration she was always kind and loved me unconditionally.  I am certain it was her love that made me the kind person I am today.  You can do this.  It's not easy, and I'm sorry you're having to raise a kid like me, but there is hope I promise.  ", "controversiality": 0, "created_utc": 1390263958, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceumry3", "link_id": "t3_1vi6mv", "parent_id": "t1_cesjdtk", "removal_reason": null, "retrieved_on": 1432030706, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Hostile_Crayon", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for this. I truly needed it.", "controversiality": 0, "created_utc": 1390274446, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ceurky8", "link_id": "t3_1vi6mv", "parent_id": "t1_ceumry3", "removal_reason": null, "retrieved_on": 1432033058, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}