{"submission": {"author": "sermolupi", "author_created_utc": 1374425647, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_cgl89", "created_utc": 1393085102, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/1ymo7d/how_do_you_handle_formal_meals_with_a_toddler/", "gilded": 0, "id": "1ymo7d", "is_self": true, "media_embed": {}, "num_comments": 70, "over_18": false, "permalink": "/r/Mommit/comments/1ymo7d/how_do_you_handle_formal_meals_with_a_toddler/", "retrieved_on": 1441901251, "score": 47, "secure_media_embed": {}, "selftext": "My in-laws live rather formally. They refuse to baby proof their home and have low glass tables covered in expensive handblown vases; granite marble chess pieces at hands' reach; uncovered outlets; four staircases without gates ... you get the idea. Yesterday, they had a lower oven (less than a foot from the floor) on around 400 degree with a one-year old toddling around. They just don't care about preventing accidents, but will yell and scream at kids (and parents) when they are over. I have a 3-year-old daughter that I have to bring into the situation. \n\nI'm clearly not going to change them, so I need to figure out how to manage this. Not only is the environment *dangerous* for children (and the only play area an entire floor away), they insist on having \"family\" dinners that are formal. We're talking full china place settings, floral arrangements, crystal glassware and multi-course meals. We sat down for dinner at 6pm yesterday and had only gotten through *soup* by 6:45. Needless to write, it was a disaster. \n\nEvery holiday is an unmitigated hell because they REFUSE to accommodate children, outside of an occasional sippy cup. Is anyone else in this situation? What would you do? ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How do you handle formal meals with a toddler?", "url": "http://www.reddit.com/r/Mommit/comments/1ymo7d/how_do_you_handle_formal_meals_with_a_toddler/"}, "comments": [{"archived": true, "author": "NotCleverEnufToRedit", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't go to their house until your children are safe and accepted there. You always have a choice. ", "controversiality": 0, "created_utc": 1393085176, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflumdw", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432510235, "score": 133, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "What would be a tactful way to discuss this with them? \n\nI really agree with you, but Husband may not. Personally, I'm really tired of being set up for failure. ", "controversiality": 0, "created_utc": 1393085430, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflupoa", "link_id": "t3_1ymo7d", "parent_id": "t1_cflumdw", "removal_reason": null, "retrieved_on": 1432510276, "score": 26, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AK2K12", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! Todlers arent formal. I can barly get my 2 year old to sit for a meal period. If they choice to not acomidate the needs of your child its your choice to not go there. Its a safty issue from what you discribed. There are plenty of other options of places to see the grandparents until the children are developmentally ready to deal with a house like you discribed. ", "controversiality": 0, "created_utc": 1393086489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflv38q", "link_id": "t3_1ymo7d", "parent_id": "t1_cflumdw", "removal_reason": null, "retrieved_on": 1432510455, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "buckette19", "author_flair_css_class": null, "author_flair_text": null, "body": "If they have refused to accommodate children before, I wouldn't even try to discuss it with them. If they invite you over just say no. If they ask for a reason, you can say that the environment isn't safe for a toddler and you don't want you daughter to get hurt or for anything to be broken. ", "controversiality": 0, "created_utc": 1393086980, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflv9nu", "link_id": "t3_1ymo7d", "parent_id": "t1_cflupoa", "removal_reason": null, "retrieved_on": 1432510539, "score": 36, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dalaim0mma", "author_flair_css_class": "purple", "author_flair_text": "SAHM; 3 gremlins", "body": "That sounds rough! Maybe try bringing your own toys or gadgets to entertain the gremlins. I have a LeapPad that I bring wherever I need to distract the kids from certain destruction. \n\nBeside that, I would have your SO have a chat with his folks about how these dinners are not enjoyable for you having to helicopter parent the whole time.", "controversiality": 1, "created_utc": 1393087079, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflvazn", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432510557, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1393087322, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflve5k", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432510599, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "neonroxy", "author_flair_css_class": null, "author_flair_text": null, "body": "I honestly wouldn't bother going over. If they can't see that it's not a kid friendly environment then I would say they don't much care. It's already hard enough to wrangle a 3 year old outside of their typical enviornment but when the homeowners, in this case grandparents, aren't willing to make a few concessions it's near impossible. I would skip a few dinners and see if they feel bad at all or if they are then willing to discuss it. ", "controversiality": 0, "created_utc": 1393087330, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflve93", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432510599, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrskimchi", "author_flair_css_class": null, "author_flair_text": null, "body": "I've been in slightly similar but less strict situations and my solution at both locations was to a) bring my own [portable](http://www.amazon.com/Evenflo-Soft-N-Wide-Gate/dp/B006PB2H40/ref=sr_1_1?ie=UTF8&amp;qid=1393087509&amp;sr=8-1&amp;keywords=portable+baby+gate) baby gate (i didn't let them know in advance, i brought it and asked once I arrived) to keep my child safe and b) my own [travel](http://www.amazon.com/BRICA-Travel-Booster-Black-Green/dp/B004L2JJ6O/ref=sr_1_2?ie=UTF8&amp;qid=1393087242&amp;sr=8-2&amp;keywords=travel+high+chair) high chair that is unobtrusive and will keep my little one where he needs to be during meal times. I also asked if I could move very fragile items up to a higher location while I visited so the items would not be broken.\n\n If the host balks at these VERY simple and temporary solutions, they are not somebody you should be spending time with while your child is a toddler, and certainly someone that you should reconsider spending time with beyond that. They  clearly do not care about the wellbeing of your child and that is paramount. In addition they seem not to want to adjust their lifestyle in any way shape or form to accommodate children, so spending time with them in this environment is of little to no benefit to your kids either. Invite them out instead to child friendly events (i.e. Zoo, Aquarium, Park etc) and see where they stand. If they love you all and want to spend time with you but have a hard time dealing with children in their own space, these places should be \"safe zones\".\n\nIt's important to remember that children are sensitive at this age to emotion and these types of repetitive situations will leave an imprint on them. My grandmother was very old fashioned and stiff when I was growing up and it always made me feel like I couldn't play freely and be myself-we were relegated to a children's table at every event even though there were just 2 of us, and told to be seen and not heard. It will, over time, negatively effect the relationship they have with their grandparents.", "controversiality": 0, "created_utc": 1393087489, "distinguished": null, "downs": 0, "edited": 1393087738, "gilded": 0, "id": "cflvgbb", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432510626, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MonsoonAndStone", "author_flair_css_class": null, "author_flair_text": null, "body": "\"In-laws, I really appreciate all the work you put into these beautiful dinners, and it's so kind of you to invite us all over to share them. Unfortunately baby is at a stage of development where she's a little whirlwind of destruction and I'm worried she's either going to hurt herself or break some of your beautiful things. There are some steps we can take to try and mitigate the problem, or we could just shift family get-together a to our child-proofed house until baby's big enough to be trusted at your house. What do you think?\"\n\nThen if they won't budge just stop going over there. But nicely. Definitely get your husband on board. ", "controversiality": 0, "created_utc": 1393088075, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflvo5i", "link_id": "t3_1ymo7d", "parent_id": "t1_cflupoa", "removal_reason": null, "retrieved_on": 1432510729, "score": 83, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "codmother", "author_flair_css_class": null, "author_flair_text": null, "body": "May I offer a different perspective?  I'm not a grandparent yet, but I do have older teenage children now.  My house is much different now than when I had young children. While I wouldn't put crystal glasses in front of a 2 yr old, I would also not extensively baby proof my house for my grandkids.  Back in the day, nobody had baby proofed houses. This is a relatively new phenomenon to our generation, and while I think it is admirable to keep the kids safe, older people tend to think a lot of gadgets aren't necessary.  No judgement on either generation from me, I'm just trying to get you to see it from another viewpoint.\n\nHear me out: As a grandparent, you are old enough to have worked hard your whole life, and as a result, have many nice things.  Should they have to put everything away because you now have young children?  No, they shouldn't.  Should you have to have your toddler sit through a 2 hour formal dinner?  No, you shouldn't.  \n\nI would suggest shorter visits, and maybe you can get an older cousin/babysitter to watch your child while you can have a nice sit-down dinner with your in-laws. It sounds like it is important to your husband, and I would suggest letting this issue go as it sounds like you aren't going to change your in-laws minds.  While they may not be cuddly grandparents, your child can learn from an early age that not everyone's house rules are the same.  Hang in there my dear! ;-)\n", "controversiality": 0, "created_utc": 1393090108, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflwh4i", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432511108, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "boredstayathomemom", "author_flair_css_class": "green", "author_flair_text": "mom of 2", "body": "i would have to tell the in laws that we will be rejoining them for holidays in about 15 years. \nif they refuse to accommodate their grandchildren, you as a parent have to be the advocate for the kids. its sad bc they raised kids too, was it that long ago that they dont remember? \nI have had to refuse my inlaws holidays and visits. they want to see the kids they come to us. they live a party lifestyle. fancy meals, friends over their house every night drinking, partying till the wee hours. they also have an inground pool, they refused to fence off, and then would get angry when i refused to let my 2 year old play in the yard, while they drank with friends.\nthis sucked, for a long time. husband was less then thrilled, but again, my kids, my job to keep them safe.\ngood luck mama. I really hope you can find a way around this!", "controversiality": 0, "created_utc": 1393091105, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflwvjm", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432511297, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "everyoneisflawed", "author_flair_css_class": "green", "author_flair_text": "2 rad kids!", "body": "I don't blame you! It sounds like, based of course on what limited information I have about you, that the discussion needs to be with your husband, not your in-laws. Your in-laws have already proven to you that they aren't interested in having children at their house. If they were, they would make accommodations for them. The next time you're invited over, just tell them thanks but no thanks. But I would definitely have a talk with your husband so he understands the situation before the next invitation comes.\n\nIf it were me, though, I'm just snarky enough to let my kid break one of their vases so I can have a little \"I told ya so\" moment. Is that totally rude or what? lol", "controversiality": 0, "created_utc": 1393093126, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflxoj6", "link_id": "t3_1ymo7d", "parent_id": "t1_cflupoa", "removal_reason": null, "retrieved_on": 1432511744, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fayedame", "author_flair_css_class": null, "author_flair_text": null, "body": "I have this problem also with all my family that doesn't have kids and my grandmother as well. Don't leave yourself at their mercy. I bring a placemat, dinner from home (in case what is being served is not child friendly), napkins, wipes. Even though at home my son used regular cups, I bring a spill proof cup as my grammas carpet is white in the dining room. I sit him down a few minutes early and get him set up, then when he is finished, we excuse ourselves and I set him up in another room with a quiet activity. I return and finish my meal. My son will return for desert. We have established table manners at home and we expect them at family dinners EXCEPT he is allowed to leave before everyone else is done, but that's just because i cant expect him to sit for over an hour.  \n\nI know my family appreciates this and I always hear how well behaved he is and I enjoy hearing it because I know they would be honest with me. \n\nI think your son will be okay at three to be in a non child proofed house. My husband and I will take turns watching our son while the other socializes until we are sure he will be okay. I've also enlisted teenage cousins to watch him, as I did the same for them when they were little. \n\nAnd I have literally moved breakable valuables myself several times when my son was in the destructible toddler stages. No one will mind since sometimes people who aren't around little kids just don't think about it, and the awkwardness of finding a safe place for something is better then it getting broken. ", "controversiality": 0, "created_utc": 1393093412, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflxsmd", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432511797, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "everyoneisflawed", "author_flair_css_class": "green", "author_flair_text": "2 rad kids!", "body": "I agree that a lot of those babyproofing gadgets are pretty unnecessary, but I don't think that's what she's talking about. She just doesn't want them to leave the door to a low oven hanging open when little ones are around and maybe put dangerous breakables on a high shelf while there over. I don't think that's too much to ask. If they really wanted their grandkids to come over, they would do these simple things, and not yell at the kids for acting like kids.", "controversiality": 0, "created_utc": 1393093459, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflxt9f", "link_id": "t3_1ymo7d", "parent_id": "t1_cflwh4i", "removal_reason": null, "retrieved_on": 1432511806, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Heh. I can't tell you the number of times I've wanted to just grab one of those vases and smash it. *SMASH* Still haven't done it. ", "controversiality": 0, "created_utc": 1393094017, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfly11g", "link_id": "t3_1ymo7d", "parent_id": "t1_cflxoj6", "removal_reason": null, "retrieved_on": 1432511907, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "This is pleasant, thank you. Maybe I can get Husband on board. ", "controversiality": 0, "created_utc": 1393094044, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfly1e9", "link_id": "t3_1ymo7d", "parent_id": "t1_cflvo5i", "removal_reason": null, "retrieved_on": 1432511913, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "boringusername", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it is a generational thing a bit but it isn't fair on you or the children, my grandparents are a bit like this over time they have got better the oldest grandchild is 14 so took a long time to get the idea and they often forget ornaments and put china cups of coffee on low tables and set out crystal ect a latest thing is giveing 2 year old a china plate full of treats to offer round and acting surprised when everything ends up on the floor I bring plates ect and just put anything dangerous out of reach we just have to be hypa vigilant as they have made some effort so I guess all I can say is try to find a middle ground. ", "controversiality": 0, "created_utc": 1393094708, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflyaoy", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432512035, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaett", "author_flair_css_class": "purple", "author_flair_text": "a 4 year old boogie boy", "body": "here's the thing... you are his wife, she is his daughter.  he has to make a decision whether he's going to support you and protect her or cave to his parents.  if he chooses them, it may be indicative of bigger problems in your relationship, but for the moment let's assume he's on board and understands.\n\nyou two will need to present a united front to his parents, which may mean that you gracefully refuse all invitations to come over to their house until your daughter is older, or they only come over to your house.  if that's the case, just make sure that they're greeted warmly and realize that they are still loved and respected members of your family, it's their house that's the problem, not them.\n\nif your husband does insist that you guys go over to his parents' house, then you've got a couple of options.  at 3 years old, your daughter should be able to understand the idea that there are things she does not touch because they are not hers/dangerous/hot/fragile/etc.  you can sit down with her and explain that the pretty things at grandma &amp; grandpa's house are only to look at, not to touch.  if she knows where the play area is, you can help her start to distinguish between what zones are free and what ones aren't.\n\nas a side note, i realized that instead of babyproofing the kitchen, it would be far easier to kitchenproof the baby.  he's been taught from very early on that he does not go into the kitchen without specific permission from mommy or daddy, and he still stops with his toes short of the carpet/wood flooring border.  when he's a little older, i'll start bringing him in to help me cook.  \n\nthe second option is far more vindictive, so it should really only be used with caution.  when you go over to your in-laws house, if your daughter breaks a delicate crystal vase or throws a chess piece through the window in the midst of a tantrum, don't punish her for it.  let them see first hand what happens when they don't take proper precautions to protect their fragile stuff from small hands.  and if they flip out, just calmly tell them that you've asked them repeatedly to move these things out of her reach, so if they're not going to listen to you they can deal with the consequences.  ", "controversiality": 0, "created_utc": 1393094927, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflydok", "link_id": "t3_1ymo7d", "parent_id": "t1_cflupoa", "removal_reason": null, "retrieved_on": 1432512072, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Husband's brother and SIL used to do \"guest appearances\" when their children were young. They'd stop by for 30 minutes or so, then one (typically SIL) would take the kids home for dinner and bed. I didn't understand then, but I'm wondering if this isn't a brilliant plan now. ", "controversiality": 0, "created_utc": 1393095800, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflypww", "link_id": "t3_1ymo7d", "parent_id": "t1_cflv9nu", "removal_reason": null, "retrieved_on": 1432512234, "score": 47, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Good ideas -- thanks for sharing them! \n\n:( You're so right about the negative influences. She was a mess last night (because she kept getting in \"trouble\") and had nightmares all night long. I felt so bad for her and woke up this morning more committed than ever to finding a solution. \n\nWe're also having a second daughter in May, so the problem's about to double!\n", "controversiality": 0, "created_utc": 1393095914, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflyri5", "link_id": "t3_1ymo7d", "parent_id": "t1_cflvgbb", "removal_reason": null, "retrieved_on": 1432512254, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MonsoonAndStone", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh that's a great compromise too. Definitely bring that up as an option when you discuss it with your husband. ", "controversiality": 0, "created_utc": 1393096025, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflyt31", "link_id": "t3_1ymo7d", "parent_id": "t1_cflypww", "removal_reason": null, "retrieved_on": 1432512275, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rosesandpandas", "author_flair_css_class": null, "author_flair_text": null, "body": "My parents baby proofed their house, we go over there maybe a few times a month. But then again my parents love the crap out of my kids, and see the value of family over any possession. Just depends on the Grandparent. My In laws didnt baby proof, granted my kids go there once ever 2-3 months. We normally just meet them at our house or we go out. They equally love my kids, Just depend on the people. ", "controversiality": 0, "created_utc": 1393096078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflytv4", "link_id": "t3_1ymo7d", "parent_id": "t1_cflwh4i", "removal_reason": null, "retrieved_on": 1432512289, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "I appreciate your feedback, and I agree that generational issues are at play. For instance, there is the expectation that *I*, as the woman, will simply chase after our child the entire time we're there. And my in-laws would rather yell than prevent accidents. It's frustrating. \n\nI think there needs to be a happy medium. For instance, let's not put out boiling-hot artichoke dip on a low table that my toddler can reach. (Yes, this has happened.) Let's do a family-style meal when all the food is served at once ... so I can actually *feed* my child, then dismiss her from the table. \n\nWe run a pretty tight ship at home: she eats dinner and is required to sit with us for a few minutes. Our meal times run about 20-30 minutes. She then, at three years, asks \"May I please be excused?\" At that point we will dismiss her to wash her hands and play. If there was a safe space where she could entertain herself, I'd do that at my in-laws. But since they refuse to make even a moderately safe space, I don't have a choice.", "controversiality": 0, "created_utc": 1393096334, "distinguished": null, "downs": 0, "edited": 1393099767, "gilded": 0, "id": "cflyxks", "link_id": "t3_1ymo7d", "parent_id": "t1_cflwh4i", "removal_reason": null, "retrieved_on": 1432512336, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "^Thank you. This. :) ", "controversiality": 0, "created_utc": 1393096358, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflyxxd", "link_id": "t3_1ymo7d", "parent_id": "t1_cflxt9f", "removal_reason": null, "retrieved_on": 1432512338, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Great suggestions. Thanks! \n\n(Sadly, though, I've been screamed at by my Husband's family for moving breakable items. Crazy, right?)", "controversiality": 0, "created_utc": 1393096432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflyz0i", "link_id": "t3_1ymo7d", "parent_id": "t1_cflxsmd", "removal_reason": null, "retrieved_on": 1432512357, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "You don't go over there. \n\nMy inlaws have parrots. Parrots that are mean and territorial and who have, more than once, attacked my husband who grew up with other parrots and knows how to deflect/protect from an attack. He was bitten pretty badly. \n\nMy father in law refuses to put the birds in a locked cage when I bring my 4 year old over. He's afraid of them. I don't expect him to lock them in a room, but just close the cage door. He won't. Their house. Their rules. I don't have to take my kids over. \n\nI told my husband that I was more than happy to take the kids over if the birds were put in a cage, but until then, his parents can visit our house. My husband told his mother (the more reasonable one) and she nags my father in law to do it. Usually, we have to wait outside while he does begrudgingly. \n", "controversiality": 0, "created_utc": 1393096715, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflz2w2", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432512403, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for your comments!", "controversiality": 0, "created_utc": 1393097200, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflz9ml", "link_id": "t3_1ymo7d", "parent_id": "t1_cflve5k", "removal_reason": null, "retrieved_on": 1432512491, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrskimchi", "author_flair_css_class": null, "author_flair_text": null, "body": "I totally disagree. The real issue here is their rigidity and grandparenting style. Nobody is asking them to put up corner protectors or locks on their cabinets, they are being asked simply to move their fragile items to a place of safety and not leave dangerous items accessible to the toddlers. *They* are the invitees,  and should be willing to bend-and it doesn't seem like the type of invitation that is really an open offer. When your MIL sends a standing invitation, they aren't usually optional.\n\n There is a generational divide here-many older folks think we should parent in the same strict fashion they and their parents did with little concern for the emotional wellbeing of our children. In the past, before psychology and behavioral sciences were respected and we were all worried about fostering emotional growth and milestones, people parented in the way that was *easiest* for THEM, without much thought to how those actions would shape their child into adulthood. \n\nThis is the \"seen and not heard\" mindset, children should do as commanded and there is little if any understanding or acceptance of the activity and energy that children need to thrive. These types of parents expect others to govern their children in the same manner, and literally cannot understand a more gentle and child-centric path to child rearing. They believe that you are coddling your child if you make sure your house is childproofed (which I believe is setting them up for success, spending their day in activities that are safe and encourage growth rather than an entire day of \"no, and don't\"). \"Well in my day we didn't....blah blah blah and you turned out fine\". Yes well in *your* day, corporal punishment and denying children the right to opinions were normal occurrences, I certainly don't think that's acceptable. ", "controversiality": 0, "created_utc": 1393098261, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflzolt", "link_id": "t3_1ymo7d", "parent_id": "t1_cflwh4i", "removal_reason": null, "retrieved_on": 1432512686, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "osenic", "author_flair_css_class": "purple", "author_flair_text": "Boy 11-11-11", "body": "If the situation is that stressful to your daughter, do **not** put her in it again!  ", "controversiality": 0, "created_utc": 1393098827, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cflzwj3", "link_id": "t3_1ymo7d", "parent_id": "t1_cflyri5", "removal_reason": null, "retrieved_on": 1432512791, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "As a parent and early childhood educator who performs sit down meals at work.  Kids learn from exposure I do not know the age of your child or the exposure you give them to certain things.  As parents we may take our children to Applebee's and other chain restaurants my children learned how to sit down at meals from home and our opportunities to go out and have a sit down meal.   Parents of my students very often year after year say wow I can't believe that my three year old is drinking from an open cup,  serving themselves (meals are brought to the table in bowls which students serve themselves) , using a soup and spoon,  and cleaning their plate and place mat (they just have to pour what's left into garbage bucket,  place eating utensils in pile on tray,  and use a paper towel, cleaning spray to wipe down their mats.) .  Many times as parents we underestimate our children's ability to understand or learn new tasks.  \n\nIn regards to the breakable items I've had my iPhone broken by a child I taught who had a developmental delay (used apps to communicate and engage her through out the day) when it broke I said to her calmly and gently now we can not play with it because we didn't hold it tight and take care of it.  Next time we used it she wouldn't let go even if she had an outburst that consisted of laying on the floor.  \n\n As far as exposure try taking your child to Bed Bath and beyond and do not keep them in a Carriage if they can walk there is no need for a stroller, it impedes their gross motor development and sense of initiative.\n\n I can go on but try exposing your little one slowly it maybe small lessons as seeing an electrical outlet at a store that is uncovered and saying we do not touch this it burns and causes a bad ouchie that sends you to the hospital.  This is glass when it breaks you can cut yourself like a knife.  This also improves their language and communication skills.   \n\nWish you luck and if you don't want to go to his parents it is OK but you can't impose your parenting style on them. Your husband most likely grew up in the same environment and they believe they do not need to make accommodations because of it.  ", "controversiality": 0, "created_utc": 1393099157, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm016c", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432512851, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for your comments. \n\nOur daughter is three years old and we follow a Montessori method at home (and she's in a Montessori). She drinks from a glass, uses silverware (including knives), helps us set the table, etc. We tidy up together and she will often help Daddy make coffee or other breakfast foods. We also bake with her. \n\nI'm not so much worried that she's going to stick her finger in an outlet; rather I'm frustrated that they want to have a 2 hour long, formal meal with courses, in an environment littered with breakables. For instance, they have an expensive Venetian sculpture that's on an unsturdy and unsecured pedestal. When you walk past it, it shakes. People have had to *catch* the bloody thing when kids have run past it. ", "controversiality": 0, "created_utc": 1393099671, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm08jp", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm016c", "removal_reason": null, "retrieved_on": 1432512948, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Ouch..  I would say let her break it, it is the grandparents turn to learn by exposure.  My mom always said you want nice things make sure you take care of them.  Now she hides her make up and hair styling items away from the girls.  ;] children are always most important than material items.  \n\nAs for 2 hour sit down meals for any child under the age of 8 is too much.  Hopefully this is issue is with all the grandchildren and once they see the decrease of visits of the small ones they will see the value of building a relationship with the grandkids as opposed to their Venetian vase.  Good luck. ", "controversiality": 0, "created_utc": 1393100317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0hlw", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm08jp", "removal_reason": null, "retrieved_on": 1432513067, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Axora", "author_flair_css_class": null, "author_flair_text": null, "body": "I have an extremely energetic toddler who has to touch and grab *everything*. \n\nWhat you just described sounds like a **nightmare**. I would never go. \n\n ", "controversiality": 0, "created_utc": 1393100517, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0kbo", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432513102, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Axora", "author_flair_css_class": null, "author_flair_text": null, "body": "If not attending the dinners is not an option, then this sounds like it might be a great plan. ", "controversiality": 0, "created_utc": 1393100596, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0ler", "link_id": "t3_1ymo7d", "parent_id": "t1_cflypww", "removal_reason": null, "retrieved_on": 1432513119, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bespectacledcurl", "author_flair_css_class": "lightcoral", "author_flair_text": "13 months going on 30", "body": "Are you my SIL? I'm in the same situation and my parents are the exact opposite (parents are kind of country bumpkins). Here's how I do it, let them see my child in all her 2 y/o glory. My daughter had hummus all over her gorgeous 12 person dining table and a few guests. Did I apologize? No. I have no reason to apologize for my daughter learning to eat with a grown up fork (which she also insisted). Stand your ground. I'm here with you", "controversiality": 0, "created_utc": 1393100638, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0m12", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432513126, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Axora", "author_flair_css_class": null, "author_flair_text": null, "body": "That is...so awful your daughter felt that way. \n\nI hope for your sanity and hers that you find a solution before the next dinner!", "controversiality": 0, "created_utc": 1393100658, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0mbz", "link_id": "t3_1ymo7d", "parent_id": "t1_cflyri5", "removal_reason": null, "retrieved_on": 1432513136, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsLabRat", "author_flair_css_class": null, "author_flair_text": null, "body": "Be firm but with a hint of compromise if they've refused in the past. They can proof a smaller area/section of a room (the whole house is alot of work for occasional guests), or you don't come because it's a safety issue. Note that the amount and accessibility of child-proofed space available will impact the demeanor of the child and length of your stay.  ", "controversiality": 0, "created_utc": 1393100721, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0n79", "link_id": "t3_1ymo7d", "parent_id": "t1_cflupoa", "removal_reason": null, "retrieved_on": 1432513141, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Wesa", "author_flair_css_class": null, "author_flair_text": null, "body": "You could also send husband over while you stay home...not ideal but it's a compromise during this stage.  Or find a sitter and go once every other time, as another compromise?  ", "controversiality": 0, "created_utc": 1393101607, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm0zqn", "link_id": "t3_1ymo7d", "parent_id": "t1_cfly1e9", "removal_reason": null, "retrieved_on": 1432513306, "score": 25, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jacinator", "author_flair_css_class": "pink", "author_flair_text": " Mommy to a 3 year old", "body": "You do NOT \"have\" to bring your daughter into this situation, you are choosing to and are doing yourself and your child a disservice by your choices. \n\nSeriously, you are the parents. You make the calls. Choosing not to intentionally put your child in a dangerous situation is generally considered a good call. If they can't be bothered to baby proof (which is within their rights) you can't be bothered to bring your child to them (which is within your rights). End of story. No explanations needed. ", "controversiality": 0, "created_utc": 1393101703, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm110z", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432513321, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jacinator", "author_flair_css_class": "pink", "author_flair_text": " Mommy to a 3 year old", "body": "Why would you continue to go somewhere to see people who have been verbally abusive towards you? ", "controversiality": 0, "created_utc": 1393101799, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm12ft", "link_id": "t3_1ymo7d", "parent_id": "t1_cflyz0i", "removal_reason": null, "retrieved_on": 1432513339, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcgovern1990", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok - for family dinners in general I'd tell them this - Sure we'd love to come for dinner, but [daughter] is really only capable for sitting politely for about a half hour so if you want to do a nice dinner then I'll just get a babysitter. If you want us all there then maybe we could consider something a little more casual?\n\nFor safety - you just have to watch your kid unfortunately. It would be nice if they baby proofed, but ultimely the onus lies on you to make sure that your child isn't going into the kitchen with an open oven. If you see an expensive item that is definitely in danger of being knocked over by your child or another person's child, just move the item. Pick it up and move it into another room. Just laugh it off with something like \"oh believe me, I'm saving you from a lot of broken glass right now.\" Also, going to your in-laws might be a really good time to be lax on the screen-time rules. Ipads, phones, a movie or two? Not going to kill them and will probably make the whole event less stressful for everyone. ", "controversiality": 0, "created_utc": 1393101896, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm13s1", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432513357, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NotCleverEnufToRedit", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, it wouldn't be tactful, but you could knock stuff off their low tables and break it when the toddler is nearby and then blame him and say it's best if he doesn't come over until he's a little older. :)\n\nIf it were me, though, I'd say to them and your husband that it's not safe or fun for the toddler or the grandparents to have the toddler at their home, so they're welcome to come visit at your home until he's older and knows better how to be careful. ", "controversiality": 0, "created_utc": 1393104541, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm25gf", "link_id": "t3_1ymo7d", "parent_id": "t1_cflupoa", "removal_reason": null, "retrieved_on": 1432513850, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dietotaku", "author_flair_css_class": "purple", "author_flair_text": "Tesla (12/14/11), Benjamin (4/5/14)", "body": "my MIL hasn't gone to any particular effort to baby-proof her house, but it's still relatively baby-*friendly*. delicate objects are on shelves out of reach, low cabinets are filled with age-appropriate toys that kiddo can help herself to, and she has things like a high chair and pack-n-play tucked into various hidden corners. she picks up things like booster seats or baby swings from thrift stores. it's not like she's totally rearranged her life or made it so her house isn't nice when there aren't kids there, but she's still accommodating to her grandkid so everyone can enjoy themselves when they're visiting. :)", "controversiality": 0, "created_utc": 1393104597, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm2683", "link_id": "t3_1ymo7d", "parent_id": "t1_cflwh4i", "removal_reason": null, "retrieved_on": 1432513860, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "patchgrrl", "author_flair_css_class": null, "author_flair_text": null, "body": "Perhaps it is worth explaining that there is too much risk of injury to your child (&amp; their property) and too much stress for you to enjoy yourself because of the lack of baby-proofing, and request as a compromise that they allow you to proof one room. You can keep a bag of outlet covers, doorknob covers, etc at their house and set up and remove them with each visit.  Get a box and soft towels for the breakables you cannot move out of reach. If your child gets rambunctious at dinner, excuse yourself and child and take turns with hubby (unless you would rather just get away from them).  \n\nThe only other alternative I see is to opt out from time to time or hire a sitter. Although, it could serve as an opportunity to encourage your child to improve on the necessary behaviors for some big reward. \n\nAdmittedly, I was too lazy to read all the posts, so I apologize if I was repetitive in any ways. ", "controversiality": 0, "created_utc": 1393107185, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm36uz", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432514340, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "napalmkitten", "author_flair_css_class": null, "author_flair_text": null, "body": "FOOD FOR THOUGHT: I'm fully prepared for the hail of potential downvotes, but please give this (wall-of-text sorry/not sorry) alternative perspective a read:\n\nThe idea that any person (regardless of relation) much accommodate your child is ridiculous. I think attitudes \nlike yours, here, is exactly what teaches a child to be selfish, spoiled, and entitled. It sounds like you haven't \nbeen taught/have your own biases on how to \"act.\" Classism. Elsewhere in this thread, you say things like \"I \ncan't tell you the number of times I've wanted to just grab one of those vases and smash it.\" That is both highly \nimmature and disrespectful of not only of your inlaws' home...but of them, and your husband's roots. \n\nYour daughter may learn how to not be a shit-head at dinner, through your \"tightly run ship.\" but she will also \nlearn that \"formal\" attitudes are stupid, outdated, prudish, and not worth respecting- not to mention that she'll \nlearn to not respect people who follow these formal opinions.... a trained bias from you. This will only serve \nto hinder her opportunities. \n\nMy TWO year old is aware that ovens in any state (on, off, open, closed) are not to be touched. Why? Because \nhe is around when I cook (even helps). *It's the social norm in my family.  He's been taught cetain things his \nwhole life. Now I\"m not suggesting you to throw a toddler in the mix when you are cooking, but there are \nwords (and worlds) that are important to teach. Here, I mean the word \"hot.\" This has had amazing crossover \nresults for my son: he does not play with fireplaces, he knows the grill is not a toy, he knows that the flaming \nsushi we order when out is not to be grabbed. More importantly, he takes this lesson to other locations, when \nwe can't always be there to \"buffer.\"\n\nAnother word we've taught him is \"gentle.\" He does not play with the glass vase in our livingroom. He doesn't \nmess with the picture frame, either. This is teaching him to respect the world around him, and his place in it. \nThe crossover? He doesn't pull things down at the grocery (or hot spinich dip off of a table). He doesn't pull animals' tails. He doesn't run where he's not allowed.... a miriad of other things, most important of which is \"self control.\" Does he mess up? Sure, but that's why we are there. We are aware that children have spirit. Napamkitten Jr is no exception. We don't want to beat it out him... but we do want to teach him the appropiate times and places that he can be \"free,\" such as parks and his playroom. It is my responsibility as a mother (and Mr. Napalmkitten's responsibilty as a father) to teach Jr continually (and \"buffer\" just in case, so he doesn't get hurt).\n\nMy son is polite, well mannered, and well behaved, and he is only two years old. He already understands the difference in \"formal\" attitudes at home, versus Mr. Napalmkitten's extended family.  You are underestimating your THREE year old's ability to retain what you teach. \n\nSome places are boring. Some places are dangerous. Some places are somewhere in between totally padded surfaces and open pools. It is your responsibilty to \"run after\" your child until they are taught to know better. \n\"Accident proof your kid,\" not \"kid-proof the world.\" If you aren't up to the task, pay someone else to do it (as suggested by another in this thread) or don't have children at all. \n\nI have two more points here. Bare with me:\n\nYou have stated in this thread that this is important to your husband. Are you willing to be so disrespectful of his desires, and to teach your child the same? Not only will it drive a wedge between him and your daughter, you will also teach her that her desires are more important than a future spouse.\n\nAnd Finally, these are \"grandparents.\" Which means... they've done this before. They know a bit about how to raise a child. Regardless if you agree with their methods or not, whatever they did- raised the man you now adore.\n\nOf course, if you believe your child is a \"special snowflake\" in this vile cruel world, then wrap her in bubble wrap and let her run around like an untrained monkey while you fight to create \"accomodations\" for her. Then by all means, keep her from this deadly wicked stodgy old house- and those evil grandparents that want to \"damage\" her. /rant.", "controversiality": 1, "created_utc": 1393110271, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm4e6y", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432514907, "score": -3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "Even my 87 year old grandma knows that you shouldn't leave breakable things where little hands can reach, but she's had three kids and 6 grand kids and I'm expecting her 4th great grandchild.", "controversiality": 0, "created_utc": 1393111252, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm4r9m", "link_id": "t3_1ymo7d", "parent_id": "t1_cflwh4i", "removal_reason": null, "retrieved_on": 1432515079, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "My MIL refuses to babyproof (out of principal, like they need to learn not to touch) but I don't mind because there's nothing dangerous, it's mostly her collectables, and also because she is so attentive, I would be shocked if my kid ever did break something. She plays with her constantly while she us there.", "controversiality": 0, "created_utc": 1393111455, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm4u17", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm2683", "removal_reason": null, "retrieved_on": 1432515114, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "catnamedbear", "author_flair_css_class": null, "author_flair_text": null, "body": "There's no need for the rude and unsupportive language in your post. There's nothing wrong with offering an alternate perspective, but do so with respect and tact.", "controversiality": 0, "created_utc": 1393111862, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm4zm5", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm4e6y", "removal_reason": null, "retrieved_on": 1432515187, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you bring a play pen for your kids? You won't get very far asking your parents to redecorate their home, but you could try to carve out an environment where your kids will be safe. ", "controversiality": 0, "created_utc": 1393112438, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm572k", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432515349, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dementedpixie", "author_flair_css_class": null, "author_flair_text": null, "body": "I think this is an excellent response, and I find nothing wrong with your language.  It was the same thing with my grandparent's house - my aunt would come over and sweep up everything within toddler reach to the highest shelves, and leave it for my grandmother to replace.  Another aunt used to come over and pull the knobs off the stove because my cousin had recently figured out how to turn them on.  This strange, glass topped coffee table that was made up of three separate round tops (think brass, glass and 1980's) was slowly destroyed over the years from my uncle's kids pulling themselves with it or on it.  With my sister and I, on the other hand, boundaries were very clearly drawn and upheld.\n\nNow, I know that one of the most popular arguments in parenting circles is that the memories you make with your child are more important than possessions.  I agree with this, but also believe that teaching your child to be respectful of the possessions of others is important.  It is just like you said, this is how we teach our children respect.", "controversiality": 0, "created_utc": 1393113342, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm5j09", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm4e6y", "removal_reason": null, "retrieved_on": 1432515505, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, it's hard to get a read on a person's parenting style from one post on the internet ... so there's no expectation that you can really know about me. So, I'm not offended and glad you shared your views. And you certainly lived up to the \"napalm\" portion of your name! :) Part of the situation, I'm sure, is that my family is much more family-friendly. It's just not a concern because the ability to safely have a house full of children is more important than expensive knickknacks. It makes me feel that we, as a young family, aren't really welcome in the in-laws' home.", "controversiality": 0, "created_utc": 1393113825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm5pka", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm4e6y", "removal_reason": null, "retrieved_on": 1432515591, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "My in-laws are verbally abusive to all their children. I do my best to mitigate damage, but unless my husband decides to cut contact, I'll continue to see them. It's tricky, but I don't want to ask him to make that kind of choice. ", "controversiality": 0, "created_utc": 1393114179, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm5ul0", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm12ft", "removal_reason": null, "retrieved_on": 1432515657, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jacinator", "author_flair_css_class": "pink", "author_flair_text": " Mommy to a 3 year old", "body": "You don't want to ask him to make the choice to protect his children from growing up thinking it's okay for them to be abused??! Have you considered asking him to go to therapy ? Why won't you protect your children? ", "controversiality": 1, "created_utc": 1393115681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm6f8j", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm5ul0", "removal_reason": null, "retrieved_on": 1432515927, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, he's been asked to go to therapy. He won't. I'd say his family is awful to the adults, although they will yell at children. \n\nHaving experienced physical and sexual abuse as a child, I take issue with the assertion that I dont protect my children. Unfortunately, family members will yell occasionally. ", "controversiality": 0, "created_utc": 1393116347, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm6o1d", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm6f8j", "removal_reason": null, "retrieved_on": 1432516042, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "I'll add, too, that demanding he ceases contact with his family because they are overbearing and narcissistic is a good way to end our marriage. \n\nI cut off contact with my abuser and my children will never meet him. (Nor has my husband.) If my in-laws ever laid a finger on my child, there would be hell to pay. I just don't see denying them access because they are jerks. My perspective, having been sexually assaulted by a family member, may be different than yours. ", "controversiality": 0, "created_utc": 1393116607, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm6rm4", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm6f8j", "removal_reason": null, "retrieved_on": 1432516090, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jacinator", "author_flair_css_class": "pink", "author_flair_text": " Mommy to a 3 year old", "body": "I mean this to be nothing more than thought provoking: why would you WANT to be married to a person who has such disregard for his childrens well being? For his wife's well being? What kind of person would willingly and purposely subject their children to that kind of environment? If this were your friend, or babysitter and they insisted that it was not only acceptable but EXPECTED that they would  be putting your child in a toxic situation where your children are certain to feel bullied by the people there that are Supposed to LOVE them and treat them BETTER than random strangers, would you keep that individual around?", "controversiality": 0, "created_utc": 1393118623, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm7ig0", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm6rm4", "removal_reason": null, "retrieved_on": 1432516444, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "southwer", "author_flair_css_class": null, "author_flair_text": null, "body": "I would just stop going. That is some bullshit.\n", "controversiality": 0, "created_utc": 1393120973, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm8duy", "link_id": "t3_1ymo7d", "parent_id": "t1_cflyri5", "removal_reason": null, "retrieved_on": 1432516852, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Curi0usgrge", "author_flair_css_class": null, "author_flair_text": null, "body": "Why not use this to teach your daughter how to act in these situations? My daughter can handle this .. Her cousin same age not so much. They are 3 1/2. ", "controversiality": 1, "created_utc": 1393123256, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm97np", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432517241, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LilBeansMom", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha, I had the same thought. Sure, let the three year old used the good china! That'll work out just fine. ", "controversiality": 0, "created_utc": 1393123806, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfm9eqs", "link_id": "t3_1ymo7d", "parent_id": "t1_cflxoj6", "removal_reason": null, "retrieved_on": 1432517334, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jaskix", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't ", "controversiality": 0, "created_utc": 1393126285, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmaa0o", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432517744, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow that was super perfect.  High fives!", "controversiality": 0, "created_utc": 1393126965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmain1", "link_id": "t3_1ymo7d", "parent_id": "t1_cflvo5i", "removal_reason": null, "retrieved_on": 1432517856, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yw1", "author_flair_css_class": null, "author_flair_text": null, "body": "Easy- don't go.  Have them over at your house instead.  If your husband gives you a hard time about it, then HE is in charge of making sure the children don't touch/break anything and make sure they don't hurt themselves.  A lot of times this responsibility falls on the mom, where dad is at his parents' house so he feels like he can kick back and relax.  After HE is on duty, he might agree that it's more work than it's worth and insist that they either childproof within reason, or visits move to your house.  \n\nYour ILs can \"insist\" all they want, but you're the parent, they can't tell you what to do.  They can't force you over there.  And it's not a good thing for your kids to be basically set up for failure.  Screaming at a kid for just being a kid is unacceptable in my opinion.  \n\nMy parents' house is like this.  And guess what- they put away the stuff my daughter can't touch/could hurt herself with when she comes over.  She has \"her\" cabinets that she can open and play in, she has \"her\" basket of toys that can go wherever, she can climb on the furniture, and the outlets have covers on them.  Its not 100% babyproofed, my 20 month old still has limits on what's \"no touch,\" but it gets the job done and it's a reasonable expectation for her age.", "controversiality": 0, "created_utc": 1393129617, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmbh00", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432518307, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "annalatrina", "author_flair_css_class": null, "author_flair_text": null, "body": "Children were never expected attend formal dinners way back when meals like that were the norm. In Victorian/Georgian times the children were completely segregated from adults. They stayed with nanny in the nursery the did not eat with the family.\n\nSensible people do not combine toddlers with fine china and never have. By holding dinners like this your in laws have made it clear that your daughter is not welcome (by actions if not by words). Don't bring your daughter there until she's old enough to be careful. \n\nIf you want your daughter to join in at these dinners sooner rather than later you can look into Montessori. That approach focuses on mealtime manners and encourages using breakable dishes (even with babies).\n\nEdit: I didn't notice that you mentioned earlier in the thread that you already do Montessori with her. Whelp, it's up to your husband to train his parents I think. ", "controversiality": 0, "created_utc": 1393139838, "distinguished": null, "downs": 0, "edited": 1393140543, "gilded": 0, "id": "cfmenjq", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432519872, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for your comments. \n\nSpeaking of Montessori, we had a great moment tonight! She gets a glass of water in her room for bedtime. When she needed more tonight, she walked to the kitchen, refilled the glass from the container in the fridge, walked back to her room and then set everything right before she returned to her bed. I was so proud of her! ", "controversiality": 0, "created_utc": 1393144861, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmfrkv", "link_id": "t3_1ymo7d", "parent_id": "t1_cfmenjq", "removal_reason": null, "retrieved_on": 1432520398, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sermolupi", "author_flair_css_class": null, "author_flair_text": null, "body": "I love the image of a two-year-old in all her hummus-y glory! ", "controversiality": 0, "created_utc": 1393145921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmfyk1", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm0m12", "removal_reason": null, "retrieved_on": 1432520487, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Stupid question; is the wawaha the front or the back because I've never heard that phrase before. It's really fun to say.", "controversiality": 0, "created_utc": 1393161811, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmim4l", "link_id": "t3_1ymo7d", "parent_id": "t1_cflve5k", "removal_reason": null, "retrieved_on": 1432521739, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "slickiedoo", "author_flair_css_class": "green", "author_flair_text": "2 year old girl", "body": "This, all of this.", "controversiality": 0, "created_utc": 1393162494, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmir6q", "link_id": "t3_1ymo7d", "parent_id": "t1_cflvo5i", "removal_reason": null, "retrieved_on": 1432521806, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kiln", "author_flair_css_class": null, "author_flair_text": null, "body": "A 3 yr old in a playpen? I cannot imagine this working out.", "controversiality": 0, "created_utc": 1393162744, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmit50", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm572k", "removal_reason": null, "retrieved_on": 1432521832, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sgejji", "author_flair_css_class": null, "author_flair_text": null, "body": "Here are a few thoughts to make your daughter feel more comfortable and ease the tension a little:\n \n* pick up the Sansbug pop up tent. It has a relatively small footprint, is mesh so she can see if she wants to, and it can be her safe spot/play area while at grandparents (or other unfamiliar places). It is big enough for a really big and tall man to stretch out in, so big enough for three 6year olds to have a teaparty. We got ours on Amazon and use it for our daughter's toddler bed when we travel. She sees it as her space.\n\n* Equip it with a yoga mat, a favorite blanket or two, some plushies,some books, and some favorite toys and she'll be mostly set.\n\n* Make it clear to your in-laws that when your daughter is in the tent, she is not to be spoken/yelled at. Have a bell that can be used by you or your husband to summon your daughter from her lair.\n\n* Either pack a dinner for your daughter so she can eat her meal and then escape, or prepare her plate in the kitchen from all the courses. If the in-laws have staff, ask the staff to do so just like you would ask to not have a sauce or whatever. If the concern is presentation like a turkey to be carved at the table, pieces can easily be taken off the underside.\n\n* Make sure she eats a substantial snack a couple minutes before the formal meal, especially if you were unable to do the all her food together prep.", "controversiality": 0, "created_utc": 1393178867, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfmo79f", "link_id": "t3_1ymo7d", "parent_id": "t3_1ymo7d", "removal_reason": null, "retrieved_on": 1432524439, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RachelSoma", "author_flair_css_class": null, "author_flair_text": null, "body": "My mum is similar. She hasn't \"baby proofed\" (though we did take a baby gate with us for visits when LO was small with no complaints) but there are activities and toys at appropriate heights and my mum is good at redirecting attention away from vases and trinkets and back to toys.", "controversiality": 0, "created_utc": 1393234302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfna8t2", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm4u17", "removal_reason": null, "retrieved_on": 1432535025, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alwsthk", "author_flair_css_class": null, "author_flair_text": null, "body": "Being in a child's life is a privilege and not a right. ", "controversiality": 0, "created_utc": 1393240083, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cfnb5ga", "link_id": "t3_1ymo7d", "parent_id": "t1_cfm7ig0", "removal_reason": null, "retrieved_on": 1432535452, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}