{"submission": {"author": "lizbitz27", "author_created_utc": 1361854568, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_aqi1t", "created_utc": 1398279158, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/23sg16/moms_who_had_very_difficult_babies_and_made_it_to/", "gilded": 0, "id": "23sg16", "is_self": true, "media_embed": {}, "num_comments": 59, "over_18": false, "permalink": "/r/Mommit/comments/23sg16/moms_who_had_very_difficult_babies_and_made_it_to/", "retrieved_on": 1441567377, "score": 45, "secure_media_embed": {}, "selftext": "You name it, I've been through it with my baby. Reflux, pyloric stenosis, milk protein allergy, neediness all day every day. Now he's been inconsolably crying at least once a day almost every day for the last 3 months (because of what I thought was teething, but there's still no sign of a tooth) and every doctor just tells me that some babies are like this and he'll grow out of it. I can't stop worrying that he's in pain or that things will never change... Anybody with an extremely fussy baby, did they grow into a pleasant child? ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Moms who had very difficult babies and made it to the other side, please tell me it gets better... I need some positivity today.", "url": "http://www.reddit.com/r/Mommit/comments/23sg16/moms_who_had_very_difficult_babies_and_made_it_to/"}, "comments": [{"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My son was like this. He cried nonstop for his first year of life, pretty much. He always needed to be held. He had silent reflux and ulcers from it. It was really bad. \n\nWe got him on Zantac and it cut the crying down by like 3/4. It was amazing. Then we got his tongue tie fixed and that helped a little more, too. He would only really cry a ton while teething.\n\nNow, he's 2, and he is a big old whiner... but it isn't like it was before. He plays by himself (I never thought he ever would!), he feeds himself, he spends most of the day without me having to console him. It's HUGE. And it feels good, not only for me, but imagine what it must be like for him. His tummy hurt really bad for a long time and it took me forever to figure it out (I saw the tongue tie myself, and went to like 4 doctors about black poop, aka digested blood, before someone did something about it). I felt like the worst mom ever. But I did what I could.\n\nIf you feel like something is wrong, take him to another doctor. Don't be polite for the sake of being polite... be mean if you have to. If they brush you off, say NO, you need to look into this. I wish I'd have been more strong in the face of doctors when all of them told me he was fine, and it wasn't til he was like 7 months old that a gastroenterologist told me his reflux was extremely severe and damaging his stomach. :(\n\nBut anyway - long story short, he is good now! So it does get better. Just hang in there and get as much help as you can. And another thing to add is that I just had my 2nd, and she hardly cries at all. Hugs! ", "controversiality": 0, "created_utc": 1398282610, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch062xj", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433488730, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RhinoTattoo", "author_flair_css_class": "blue", "author_flair_text": "Mom to twins, 4 years apart", "body": "My firstborn was a preemie, and a nightmare baby.  He was the first grandbaby on one side, only the second on the other (and the first boy in the family), and NO ONE wanted to watch him.  He had horrible colic and stomach problems, screamed all the time, never slept, and was just a puddle of drool while he teethed.\n\nNow he's about to turn five and is one of the most easygoing kids on the planet.  He's the kid you can take to the movies or a restaurant without worrying about how he'll act.  He's an awesome big brother.  He's clever, funny, and sweet.\n\nIt makes me nervous in a way because my second, the 9-month-old, is a ridiculously easy baby.  I'm hoping he won't reverse on me too.  : )", "controversiality": 0, "created_utc": 1398283150, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch06dk7", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433488870, "score": 22, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "someoneinwyoming", "author_flair_css_class": null, "author_flair_text": null, "body": "My son was a pain.  He was 5 weeks early and didn't eat much at a single setting so we had to wake him up every two hours to eat.  At three months he decided colic would be a good idea and cried, endlessly for 6 months.  That was  about the time he got bacaterial pneumonia and was miserable for another month.   Now, he is 11 and a pretty great kid.  He has the typical rolling of the eyes or slamming of the door but over all he is kind and quiet and lets me not only sleep all night but he sleeps in later than I do on the weekends!  It gets so much better!", "controversiality": 0, "created_utc": 1398284739, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch078bc", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433489270, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much for your reply. That's the thing about the reflux... Zantac didn't help at all. I don't know how much the Prilosec has helped with the discomfort, but the spit up has come down a notch since we switched, so I won't mess with it. And about the \"black poop\", I call his ped all the time about poop color and consistency... it's been super dark, forest green since switching formulas to Neocate and he's always either constipated or has liquid stool. No one seems to be concerned even though I've showed them just how close to black colored it is... We've seen maybe 7 different doctors at this practice, and they're part of the best hospital in the country's network, so I'm convinced every time that the problem is in how I'm handling it as the crazy first time mom that I am, and I wouldn't know where else to go for a second opinion...\n\nI switched GI specialists because the last one totally lacked any kind of bedside manners, barely took down our extensive history (I had to remind him of really important clues that he didn't seem to think were important) and sent us on our way with more Zantac even after I told him it wasn't working, then come to find out a week later that there was blood in his stool found at a routine visit at his primary ped's and she diagnosed a milk protein allergy then at 4 months... I was like, \"so my baby has to be bleeding internally for anybody to listen to me?!\" I've not been polite ever since. \n\nSo I can totally relate to feeling like the worst mom on the planet, even though I keep trucking along and calling/crying/demanding to be seen and taken seriously only to be placated and patronized until the shit really hits the fan... Oh I'm sorry I'm rambling...there's just so much to say and no where to start. Just, thanks. :) \n\nQuick question...this is the first I've heard about ulcers!?! How did they test for that? We've had an ultrasound, xrays, and an upper GI, but no one has mentioned to check for ulcers.", "controversiality": 0, "created_utc": 1398285251, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07i2l", "link_id": "t3_23sg16", "parent_id": "t1_ch062xj", "removal_reason": null, "retrieved_on": 1433489398, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "knittybynature", "author_flair_css_class": null, "author_flair_text": null, "body": "I always joke that my son got my personality.  He had colic and milk protein allergy. I literally would spend hours walking around the neighborhood or bouncing on a yoga ball with a screaming baby strapped to my chest. It changed around 4 months.  He is still a difficult child. He is stubborn and strong willed. But once the crying stops your nerves can handle so much more. Although challenging I can appreciate the qualities of his personality that will serve him well later in life.", "controversiality": 0, "created_utc": 1398285428, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07lch", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433489441, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Aww thanks so much! That does make me feel better. Part of me thinks I need to have another baby, because I've barely been able to fully enjoy this one the way I thought I would, I used to love babies, but I'm wondering if it's just my luck and the next one would be even harder... But we shall see. Thanks again!", "controversiality": 0, "created_utc": 1398285503, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07mqw", "link_id": "t3_23sg16", "parent_id": "t1_ch06dk7", "removal_reason": null, "retrieved_on": 1433489459, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "musicalmud", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have as long of a list as you do, but the first few weeks my son was fussy, got fussier as the day went on-it was a problem with dairy in my diet. He later went through a few very attached periods, and it was extremely helpful to find babywearing-otherwise I never would have gotten anything done. I would highly recommend finding a local babywearing group and try it out. \nRight now he is a happy, increasingly independent almost two year old who can entertain himself and rarely cries-even in his rough explorations.\nIt is so hard to have a crying child and not being able to do anything about it. I hope it passes quickly and you have the help you need.  Good luck. ", "controversiality": 0, "created_utc": 1398285635, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07pb9", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433489493, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!! I was afraid of babywearing because he used to spit up/vomit CONSTANTLY...so instead, i've just held him on the couch for the majority of the last 5 months or we would take a walk in his stroller. And yes, it's impossible to get anything done 90% of the day. Now that the spit up has decreased a bit, I've been seriously thinking about splurging on a new carrier. ", "controversiality": 0, "created_utc": 1398286076, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07xqs", "link_id": "t3_23sg16", "parent_id": "t1_ch07pb9", "removal_reason": null, "retrieved_on": 1433489604, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup, it's the crying that pushes me right off the edge. Thank you!!!\n", "controversiality": 0, "created_utc": 1398286143, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07z25", "link_id": "t3_23sg16", "parent_id": "t1_ch07lch", "removal_reason": null, "retrieved_on": 1435495177, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "southwer", "author_flair_css_class": null, "author_flair_text": null, "body": "how old? My twins are 3.5 now, one of them was an easy baby, one had reflux and cried for real, ALL the time. I wore her in an Ergo constantly and just stood up, all the time, swaying back and forth. It was AWFUL. She had a period where she wouldn't eat unless she was half asleep too, that was fun. \n\nProbably around eight months, she grew out of it. Now she is *awesome*. She is the best, calmest, sweetest kid ever, she can entertain herself, she's perfect. Unfortunately the \"easy\" twin baby is a total pain in the ass now, willful, oppositional, whiny, just, a brat. And naturally it's not a problem with anyone but *me*, she behaves well at preschool for the most part.\n\nSo here's hoping your difficult baby grows into an easy toddler!", "controversiality": 0, "created_utc": 1398286165, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch07zhw", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433489633, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!! I'm hoping you're right! :)\nedit: a misspelling", "controversiality": 0, "created_utc": 1398286208, "distinguished": null, "downs": 0, "edited": 1398286531, "gilded": 0, "id": "ch080bh", "link_id": "t3_23sg16", "parent_id": "t1_ch078bc", "removal_reason": null, "retrieved_on": 1433489652, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ZeldaB", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine was a nightmare.  I spent my entire life waiting to be a mom and then Nope!  Nevermind, I made a mistake!  Mine screamed round the clock for a year, and was pretty miserable for two years.  When he was 12 months-ish I found the schedule of night time wake ups and feeding I did every two hours.  I broke down sobbing because a year later NOTHING HAD CHANGED.  I was suicidal for the first and only time in my life.  We tried Zantac around 6 months and thought it didn't work.  It wasn't until 12 months when another doctor suggested we give him the maximum possible dosage - are you doing that?  \nNow, mine is 4.  I adore him.  I want to spend every minute with him.  Every day after 2 got better, and every day after 3 has been awesome.  Plus, I spent so long being so miserable that now little phases of disruption that drive other parents batty seem like nothing to me.\nGood luck.  You will reach that happy place, eventually.  Do everything for yourself you can to help you get there in one piece.", "controversiality": 0, "created_utc": 1398286224, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch080mx", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433489649, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "eatyourslop", "author_flair_css_class": null, "author_flair_text": null, "body": "It gets better! Mine was a dread beast for months (reflux and MSPI) and fought sleep like a champion. I thought it would never end, and indeed it felt like forever until all that stopped. Now I have a happy, smiling, charming (though incredibly bossy) 2.5 year old. And oh man it feels good to not have to deal with that anymore.\n\nGood luck! You can do this, and it WILL end soon.", "controversiality": 0, "created_utc": 1398287760, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch08t5h", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433490015, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup. Mine fights sleep all the time, too. Ugh! Thank you!!!", "controversiality": 0, "created_utc": 1398288163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch090fw", "link_id": "t3_23sg16", "parent_id": "t1_ch08t5h", "removal_reason": null, "retrieved_on": 1433490110, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "This makes me so sad for you (AND me lol) ...but I can totally relate. \nI thought my **pregnancy** was really hard... I was fighting depression before he even got here, but kept telling myself it would all be worth it, but it all just got soooo much harder... I just hope we're that lucky to come out of this with a healthy, happy kid... My biggest fear is that all of this is an indicator for an even bigger problem that he'll have to deal with his whole life. THAT's been the hardest for me to deal with...but regular sleep would be nice, too. :) I'm so happy you're in a better place! Thanks for your story. ", "controversiality": 0, "created_utc": 1398288462, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch095ve", "link_id": "t3_23sg16", "parent_id": "t1_ch080mx", "removal_reason": null, "retrieved_on": 1433490182, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "egwenealvere", "author_flair_css_class": "blue", "author_flair_text": "Mommy to 3 (11,9, and 3)", "body": "My oldest had reflux issues and colic from the get go to about a year. It was awful, and I was completely alone as I had just moved across the country from my family and her dad was deployed most of the time. I'm actually surprised I got through it mostly sane and even managed to agree to another one before she was even 2. My middle child was a breeze. Rarely cried and loved being held. My 3 year old was also a breeze and still is even now. The other two are starting that preteen phase which seems harder than even the colic sometimes.", "controversiality": 0, "created_utc": 1398290898, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0acr1", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433490742, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DarthLeia2", "author_flair_css_class": "purple", "author_flair_text": "Ashelia (5yrs), Emrys (2yrs), and Roman (newborn)", "body": "My daughter was my difficult one. After a difficult birth, she turned out to be a very demanding baby. Just as I was healing from my c-section, she decides to give colic a go. We battled that for about 3 months, then it all changed when she was about 4 months old. She was a much easier baby after that (she even started sleeping through the night as that point). She's 4 now and while she is strong-willed and stubborn, she's still a really good kid. \n\nMy son is 15 months now and he's a much more laid-back child than my daughter. He never had colic and he slept through the night by about 2 months. So, you will get through this with your first and any other kids you have won't necessarily be as difficult. Hang in there! :-) ", "controversiality": 0, "created_utc": 1398291130, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0agmo", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433490793, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1398293609, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0bm74", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433491338, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "apurrfectplace", "author_flair_css_class": null, "author_flair_text": null, "body": "Preemie twin mom w 1 son who has an autoimmune disease, the other had colic and an epigastric hernia plus both have had at least 4 surgeries.  The son w the AI disease was 3 yo and 19 lbs, w disordered eating that required a team of experts.  A living hell for the past 6 years.  Just seeing the light.... Bless you!!!   It will happen", "controversiality": 0, "created_utc": 1398294683, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0c3bd", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433491622, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I had one of those. He didn't sleep through the night reguarly until he was almost 3.  Honestly, I resented him and didn't really like him much for awhile.  The thing is, he's brilliant.  In kindergarten, he's reading Harry Potter and doing his brother's 2nd grade math homework faster than he can, (my older is VERY good at math, btw).  Anyway, some kids' brains seem to move faster than they develop, if that makes sense.  He was just always super frustrated and got really irritated when he was over or under stimulated.  He's a kick ass kid now and totally fun to be with, but birth to 4 were not very fun years for me.  \n\nWe made it out of those dark times and we're really, really close now.  I utterly adore being with him now instead of constantly hiding from him and wishing he'd *juststopscreaming*.   You'll make it, too!!", "controversiality": 0, "created_utc": 1398294756, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0c4gv", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433491637, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "layingaguy", "author_flair_css_class": null, "author_flair_text": null, "body": "Why do they fight sleep? My girl just thinks sleep is the worst! ", "controversiality": 0, "created_utc": 1398296261, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0ctfd", "link_id": "t3_23sg16", "parent_id": "t1_ch08t5h", "removal_reason": null, "retrieved_on": 1433491964, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Soupsnakes", "author_flair_css_class": null, "author_flair_text": null, "body": "While my daughter didn't have any of the problems you listed, she was THE most difficult baby for the first 9 or 10 months of her life. Nursing was a struggle because of an upper lip tie, she didn't ever want to be put down, I couldn't leave her with a sitter, and until I was forced to stop nursing at 8 months she refused a bottle (from me or anyone else). My husband and I were pulling our hair out, wondering what we got ourselves into. \n\nAfter that, she gradually got easier to handle. She went through the \"terrible twos\" and \"f-u threes\", but she is THE most chill 4-year-old you'll ever meet. Loving, sweet, funny, smart, chatty...just the type of kid I hoped she would become when we were in the throes of difficult infanthood. \n\nHang in there, I promise it does get easier! ", "controversiality": 0, "created_utc": 1398298360, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0dsef", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433492421, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes.  My baby had reflux, latching issues, I couldn't produce milk properly, and she didn't sleep through the night for the first time until she was nearly 2.  She's 5 now, and she's *such an awesome kid.*  I'm not going to tell you everything is perfect, but the good days far outnumber the bad and we're actually considering having another now. \n\nThe girl is smart, funny, and so incredibly sweet.  Not a day goes by without dozens of hugs, kisses, cuddles and \"I love you\"s.  \n\nIt gets better.", "controversiality": 0, "created_utc": 1398298486, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0dujq", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433492450, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vitaminmary", "author_flair_css_class": null, "author_flair_text": null, "body": "My first had terrible colic.  That's the diagnosis they gave me.  Which felt like \"well we don't know... he seems healthy... so colic\".  There were days I would put him in his crib crying and I would lay on his floor and cry too.  He's now 3.5.  He's the most gentle kind soul.  Seriously, the sweetest little boy who is always so concerned with me being happy.  Hang in there.  He's going through some stuff and it's hard for him.  But it gets better.", "controversiality": 0, "created_utc": 1398300225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0enp1", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433492833, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "swimminginvinegar", "author_flair_css_class": "orange", "author_flair_text": "4yo and 2yo boys", "body": "Oh, I am here for you.\nSecond kid.  Colicky, dairy intolerant, terrible sleeper.  He screamed non stop for months it seemed.  It wasn't in reality but it so feels that way.  Oh, and he has asthma (resolving now) and had febrile seizures.  He had 4 ER trips before he was 1.\nHe's 2.5 now and the funniest, sweetest kid ever.  Super chill, slept well after a bit of sleep training (I was resistent because of space issues and room sharing but it went fine).  He can now eat small amounts of dairy and is seriously a happy kid.\n\nIt got a ton bettter after he turned 1.  But colic is bad.  My ped said that i needed all the help I could get and to be aware of my own anger and triggers because its so frustrating.  \n\nPM me anytime you need to vent.  Colicky kids can be isolating because all those other babies are all snuggly and yours is just screaming.  I wore him in the Beco for months...", "controversiality": 0, "created_utc": 1398301746, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0fdcv", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433493167, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "swimminginvinegar", "author_flair_css_class": "orange", "author_flair_text": "4yo and 2yo boys", "body": "Oh man, that was my kid.  I couldn't stand still for months because I was so used to rocking him that even when I wasn't holding him I was moving.", "controversiality": 0, "created_utc": 1398301872, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0ffdd", "link_id": "t3_23sg16", "parent_id": "t1_ch07lch", "removal_reason": null, "retrieved_on": 1433493193, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "orchd84", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter had colic - it was awful. At some point I realized that there wasn't anything I could do but be there with her. Simply being present and walking that path with her was my role. I bought earplugs so that I could hold her while she cried - that helped a lot. \n\nToday is a very happy, independent 4 year old who is a joy to be around and is a great sleeper. Hang in there - right now it feels like it will never end, but I promise soon you'll look back on it like it was all a dream while you play with you sweet kiddo.", "controversiality": 0, "created_utc": 1398302631, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0fs6b", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433493361, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "daddakamabb", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter had reflux, and milk protein allergies as well and it was constant crying day and night even though we changed her formula and everything. Oatmeal helped. It helped with the reflux and helped with the tummy problems. She still cried a lot but she was a much much happier baby. I put oatmeal in every bottle she had, it was the consistency of thin paste. She is now over a year, and only cries when teething. You will know if they are teething because there will be swelling of the gums and it will be a bump where the tooth is going to come in. It does get better! It's just finding out what works for your baby. Don't get discouraged, they are in pain, and can't tell you what's wrong. It's frustrating but they love you and need you. You are their world, and they want the pain to stop just as much as you do. My daughter is a delight, and laughs and giggles and plays and is extremely happy. You can do it!", "controversiality": 0, "created_utc": 1398303569, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0g7vt", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433493567, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gwape", "author_flair_css_class": null, "author_flair_text": null, "body": "I have an 11-month-old who is still doing this. She was sick when she was born and is just fussy and needy 24/7. There are times where I get extremely emotional and feel like it will never end, but it will. She's the youngest of 4 and my oldest was the same way. He grew out of it shortly after 1 and has not had needy issues since then. \n\nIt's hard though because I have a needy 6 year old already who is jealous and a jealous 8 year old as well. I honestly though the age gap would make things easier, but nope. It's easiest with my son who is 12 and self-sufficient. ", "controversiality": 0, "created_utc": 1398305356, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0h3e8", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433493978, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "hydrogenbound", "author_flair_css_class": "blue", "author_flair_text": "boy wonder 2.5", "body": "My little guy was a TOTAL velcro baby, he would scream like he was being murdered if mommy wasn't holding him in exactly the right way every minute of the day and woke up every 20-30 minutes at night full on screaming. We called him Guantanamo baby. He is still not the easiest toddler and doesn't play on his own a lot, but he is SO MUCH EASIER. He loves other people now, is so funny and charming. People adore him. He has leadership qualities. I taught him baby sign language by using the baby signing time DVD'S and he learned to talk really early and communication has helped immensely. I wish I had taken better care of myself during that ridiculously hard first year. Maybe forced Daddy to learn to sooth him or something. Now they are BEST FRIENDS. I still don't get a lot of sleep, but my body is a little bit adjusted. I have so much fun with my little guy now! He is really friendly and talks to everyone :) Hang in there! I know it's hard, and probably no one understands but r/velcobabies. I met a few moms who had had a tough one, any other moms just didn't understand and thought I was doing something wrong. Stay away from judgemental people for your own sanity! ", "controversiality": 0, "created_utc": 1398305737, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0ha3b", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433494067, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "marchmay", "author_flair_css_class": null, "author_flair_text": null, "body": "They're so cute when they sleep. That makes me smile after a long day of baby tending.", "controversiality": 0, "created_utc": 1398307312, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0i1pk", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433494428, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "My son's poop was like BLACK. Like charcoal. It was unmistakable. I've read that forest green poop is caused by iron supplements in formula. That has happened with my daughter, who is mostly breastfed but gets supplementation with formula sometimes.\n\nAs for the ulcers, the doctor suspected them because of the black poop. He said we could do an endoscope kinda test to look, but only if the black poop persisted after we tried the Zantac. It didn't. And I don't know if I needed that test done either, it seems really traumatic and/or I didn't want any heavy sedation to happen with my little guy unless it was absolutely necessary. \n\nI'm glad you're not letting anyone just brush off your concerns. It's so hard as a mom to feel like you're \"crazy\" because you're worried about your baby and no one is listening. Ugh. I hope you can get some help with your baby boy. I used to lay awake at night, frustrated at myself for being so short fused with my crying baby... knowing that he was crying because he was in pain. Worst feeling ever. ", "controversiality": 0, "created_utc": 1398308964, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0it65", "link_id": "t3_23sg16", "parent_id": "t1_ch07i2l", "removal_reason": null, "retrieved_on": 1433494788, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "alpacathecamel", "author_flair_css_class": null, "author_flair_text": null, "body": "My son was extremely fussy.  I had trouble talking to friends about kids because their worst days usually sounded easier than my best days and I just didn't know how to respond.  It was hard to be sympathetic.  And I learned to leave the room when the topic of sleep came up because any time I heard how other people's babies were sleeping I would get angry and resentful.    Anyway.  For us, things got a lot better around 13 months.  Part of that was night weaning (we didn't do cry it out, but there was a ton of crying involved), but I think more than anything was that was when he began talking.  As he learned to communicate with us and understand what we were telling him things got better and better.  Really, I think that communication was nearly all of the change, and it made a huge difference.  By 15 months I finally had the feeling of \"I love my kid so much I'm going to explode\" that I had never had before. And then by 18 months I started having that feeling daily.   I always loved him, but it was so hard.  I remember when people asked me, \"But it's all worth it, right?\" my usual response had been \"Not really, not right now, but I do believe that it will be worth it someday.\"    I also started having the feeling of \"This is what I signed up for.\"  I still believe I had pretty realistic expectations of motherhood, but that first year was brutal.  I'll say that 18 months to 2.5 were really great.  And as a 2 year old he was probably easier than most 2 year olds.  Now at almost 5, I'll say he is still a different kind of kid.  Not your typical boy, or your typical 4 year old.  He is hard in ways that other kids are typically easy and easy in ways that other kids are typically hard. But I don't mind so much anymore.  I understand him better and I feel more fulfilled at having the job of helping him negotiate his way in the world with his unique characteristics. He's awesome! With a constantly crying baby there just isn't very much fulfillment.  It is a lot of rewardless work.  I'll also say that I still constantly hear people say \"oh, the first year is when they are easy.\"  Bullshit.  I have two kids now, and I'm pregnant with a 3rd.  Never, NEVER, have things been even close to as hard as that first year with a fussy baby.  It will get better.  Hang in there.  ", "controversiality": 0, "created_utc": 1398310032, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0jami", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433495016, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rslashdp", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter had ear infections that were pushed off as teething for a while. I'm not sure if they checked tour little one out but I'd say have someone look in those ears just in case. Also it gets so much easier as they get older. I didn't have all the problems you had but my daughter has really bad allergies and had ear infections consistently that resulted in needing tubes and after the initial infant time it gets so much easier. Even if the problems stay with them they seem to be able to cope easier. Hang in there mama.", "controversiality": 0, "created_utc": 1398313185, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0kmc6", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433495707, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PhantomGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "It gets better! My son has GERD, erosive esophagitis, and MSPI. It was crazy the first four months of his life ( just turned six months last week), if he was awake he was crying. What finally made a huge difference was prilosec, Zantac never did anything. He's on the max dose of prilosec and it has been magical. When he pukes now it's like nothing ever happened, where as he used to have extreme pain afterwards when he was on Zantac. He is literally the happiest baby these days, people comment how he's so sweet, and a good baby all the time. Reflux is also supposed to peak at four months (unfortunately not true for us) so you may be just on the cusp of things getting easier. Also like others suggested if you can try to get his dose upped on the prilosec, could make a huge difference. If you're getting the prilosec compounded make sure you are getting it refilled every two weeks. After two weeks the stuff they buffer it with starts to break it down and it loses it's potency fast! Hang in there. I swear it does get better.", "controversiality": 0, "created_utc": 1398315642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0ljs9", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433496145, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PeopleInMyHead", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. That sounds exactly what I've been through with my son. First it was reflux, then pyloric stenosis, then milk protein allergy, and teething. If he's still crying a lot take him to his GI doctor and ask about food allergies. My son is almost one now and we're having to get full allergy testing done and an endoscopy. With the endoscopy they're looking for a disease called EOE. Does your son have a rash on his face? If he does a food allergy can cause the whole body to itch, which would make anyone fussy. Also it does get better, I promise. Even though my son still has a lot going on, he's doing better and sleeping.  Please PM me if you would like. I think you're the first person that I've heard the exact same story from. ", "controversiality": 0, "created_utc": 1398321314, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0n4iv", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433496888, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kittysue804", "author_flair_css_class": "purple", "author_flair_text": "Aubrey Anne 12/04/12", "body": "That really sucks no one would watch him, for you to get a break when you needed it most. I don't think I could survive without my parents giving me one night off a week to be a regular human being. ", "controversiality": 0, "created_utc": 1398339378, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0qakc", "link_id": "t3_23sg16", "parent_id": "t1_ch06dk7", "removal_reason": null, "retrieved_on": 1433498380, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kittysue804", "author_flair_css_class": "purple", "author_flair_text": "Aubrey Anne 12/04/12", "body": "I'm going to show my husband this thread, maybe that will offput him wanting a second child for a while. ", "controversiality": 0, "created_utc": 1398339763, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch0qdgm", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433498419, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jbugg411", "author_flair_css_class": null, "author_flair_text": null, "body": "I am so glad you posted this.  Going through the same thing with my four month old.  Doctors said as long as he's alive and gaining weight, not to worry about the all day ScreamFest :(  What about quality of life and sanity??\n", "controversiality": 0, "created_utc": 1398451100, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch1xtaj", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433519231, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my god... YES! Every single one of the last 20+ sick visits, they've told me how beautiful the growth chart looks, shrug at all his symptoms, and send me on my way. Just yesterday I went in and they told me the same thing. I've finally decided to go get a second opinion, and I'm already sad it took me this long! Hang in there!!!", "controversiality": 0, "created_utc": 1398453513, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch1yzzd", "link_id": "t3_23sg16", "parent_id": "t1_ch1xtaj", "removal_reason": null, "retrieved_on": 1433519790, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "That's so crazy!! I've looked everywhere and haven't found anyone with the same story! So glad you found me!!! I went to his doctor and asked about an endoscopy...he said that \"it's not emergent\" and he doesn't want to put the baby through it...so now I feel bad for wanting it! Either way, I have an appt with a new GI doctor in the middle of May and I'll ask them about it.\n\nHe doesn't get rashes almost ever, but he is on Neocate b/c over the counter hypoallergenic formulas once we discovered the blood in his stool still made him vomit...I'm guessing because it took so long and by then, there was already too much damage done internally for his stomach to handle anything... Ugh...the guilt!\n\nI'll definitely keep in touch! Us moms of one of a kind (now 2 of a kind) babies have to stick together! :) And good luck with the endoscopy...let me know how that goes!", "controversiality": 0, "created_utc": 1398454243, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch1zcvo", "link_id": "t3_23sg16", "parent_id": "t1_ch0n4iv", "removal_reason": null, "retrieved_on": 1433519960, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PeopleInMyHead", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is also on Neocate. I also thought of something, has your son gotten sick a lot? I was wondering because ear infection can make them cry a lot. Don't feel bad about asking for an endoscopy, ask again when you see the new GI. I'll PM you soon. ", "controversiality": 0, "created_utc": 1398457522, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch20xti", "link_id": "t3_23sg16", "parent_id": "t1_ch1zcvo", "removal_reason": null, "retrieved_on": 1433520768, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey, sorry it's taking me forever to respond these days! It sounds like you've had your hands full, too! Can I ask, what testing was done to get your diagnoses? I'm wondering because we've had I think everything except for the endoscopy and I've been to the office with my concerns at the bare minimum 20 times and all they ever say is \"reflux\". My instincts are telling me there's got to be something majorly wrong with his esophagus, because this is nothing like what I've heard typical reflux is, but 7 doctors at our pediatrician's practice have told me again and again that it is, plus the ER staff and the GI wing at CHOP. I'm getting a second opinion on Monday to see if they agree with that diagnosis, but I'm wondering if I should press them for more specific testing,... Another thing, thank you for the tip on the Prilosec! No one's ever mentioned that before either! I'm beginning to feel like our medical treatment has been a joke!! :( ", "controversiality": 0, "created_utc": 1398469591, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch265uw", "link_id": "t3_23sg16", "parent_id": "t1_ch0ljs9", "removal_reason": null, "retrieved_on": 1433523229, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "If by sick, you mean vomiting, then yes, but as far as colds or fevers, never. I don't feel bad about asking for endoscopy at all if that's the answer to all of our questions... in fact, right after I responded to your first message, I called another reputable hospital nearby and they had an opening with a specialist for this upcoming Monday!!! It takes me a MONTH to schedule an appt through our first network...so this is pretty unbelievable and I'm already mad at myself for waiting so long to call. Hopefully we start getting to the bottom of things! I've been looking into EOE and it does sound pretty spot on except my baby has never failed to grow. I am hoping it's not the case, but I'd much rather know exactly what's going on than fearing the unknown. Thanks!", "controversiality": 0, "created_utc": 1398470769, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch26mdw", "link_id": "t3_23sg16", "parent_id": "t1_ch20xti", "removal_reason": null, "retrieved_on": 1433523446, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup, I could've written those last two sentences. It's a nightmare. Thank you!", "controversiality": 0, "created_utc": 1398471063, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch26qjj", "link_id": "t3_23sg16", "parent_id": "t1_ch0it65", "removal_reason": null, "retrieved_on": 1433523500, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry, he just turned 5 months! This made me feel better. Thank you!!\n", "controversiality": 0, "created_utc": 1398471121, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch26rcq", "link_id": "t3_23sg16", "parent_id": "t1_ch07zhw", "removal_reason": null, "retrieved_on": 1433523511, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Just 3.5 more years.........oh^my^god \n\nlol thanks!", "controversiality": 0, "created_utc": 1398471237, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch26t18", "link_id": "t3_23sg16", "parent_id": "t1_ch0c4gv", "removal_reason": null, "retrieved_on": 1433523534, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!!! I hope you're right!", "controversiality": 0, "created_utc": 1398471287, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch26trp", "link_id": "t3_23sg16", "parent_id": "t1_ch0dsef", "removal_reason": null, "retrieved_on": 1433523542, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Heyyy it's your cake day! I wish I could give you more upvotes. :) Thanks!!! I guess I can wait another 4 years.", "controversiality": 0, "created_utc": 1398471395, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch26vc4", "link_id": "t3_23sg16", "parent_id": "t1_ch0dujq", "removal_reason": null, "retrieved_on": 1433523563, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!!! I really need all the help in the world right now, and my husband and I are feeling so isolated... His family is 4 hours away and seemingly unaware of the extent of his issues and let's just say my family is not the best of help. I'm half tempted to look into a nanny or something we really can't afford, because this is truly the hardest thing I've ever done. I can't imagine having another kid at this point...it's scary to think about!!  ", "controversiality": 0, "created_utc": 1398471780, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch270vt", "link_id": "t3_23sg16", "parent_id": "t1_ch0fdcv", "removal_reason": null, "retrieved_on": 1433523636, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Ohhh God bless YOU!!! I'm so sorry, you've been through so much more than I could imagine! I hope you have had a TON of help and support and that things keep getting so much better now. You and your babes deserve it! Take care!!! &lt;3", "controversiality": 0, "created_utc": 1398471984, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch273pn", "link_id": "t3_23sg16", "parent_id": "t1_ch0c3bd", "removal_reason": null, "retrieved_on": 1433523672, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "swimminginvinegar", "author_flair_css_class": "orange", "author_flair_text": "4yo and 2yo boys", "body": "No problem.  If my colicky kid was my first I would never have had a second.\nI hired a mothers helper - much cheaper per hour. It was most helpful in the early evening when my tensions were highest.\nMy dad and in-laws avoided us.  People are freaked out by colic.  They want sweet babies. \nSeriously, pm anytime.", "controversiality": 0, "created_utc": 1398475262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch28emo", "link_id": "t3_23sg16", "parent_id": "t1_ch270vt", "removal_reason": null, "retrieved_on": 1433524286, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "Do you mind telling me what the max dose of prilosec is? My son is on itand I'm fairly certain the does is to low, he projectiles often and hates it when he does it also comes out hoods nose and it's painful. It's gotten beret on prilosec but I don't think it's enough. He's on the 2mg? kit suspension and he's taking .9 cc a day", "controversiality": 0, "created_utc": 1398479680, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2a5ms", "link_id": "t3_23sg16", "parent_id": "t1_ch0ljs9", "removal_reason": null, "retrieved_on": 1433525178, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "We skipped zantac because the emergency pediatrician he saw right after we brought my son home from the nicu is a professor of pediatrics and he said zantac almost never works. The prilosec worked wonders, Alex only cries if he wants something, is sick, throws up or refluxes out his nose.\n\nBtw my son has nasty reflux accompanied by consistent projectile vomiting. Pretty sure he has a lip tie ill be talking to his pediatrician about. He also might have a milk allergy.", "controversiality": 0, "created_utc": 1398479867, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2a864", "link_id": "t3_23sg16", "parent_id": "t1_ch265uw", "removal_reason": null, "retrieved_on": 1433525211, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, and I somehow managed not to notice until it was over.  It's also my birthday today, and I somehow hadn't realized that I joined reddit on my birthday either...", "controversiality": 0, "created_utc": 1398480486, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2ah07", "link_id": "t3_23sg16", "parent_id": "t1_ch26vc4", "removal_reason": null, "retrieved_on": 1433525327, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PhantomGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh gosh, the mouth and nose is so horribly painful. I remember my LO would just meltdown when that happened. Anyway, dosage is based on weight, so I do not know what the max would be for your LO. My LO has been on 3ml (3cc) twice a day since he was four months, he's big though 18 pounds and over 28 inches at 6 months. The dose is still very effective even with him puking a ton he's a happy baby and he never cries when he spits up anymore. ", "controversiality": 0, "created_utc": 1398489555, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2dqg3", "link_id": "t3_23sg16", "parent_id": "t1_ch2a5ms", "removal_reason": null, "retrieved_on": 1433526863, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizbitz27", "author_flair_css_class": null, "author_flair_text": null, "body": "Aww well happy birthday!!!! \n\n", "controversiality": 0, "created_utc": 1398489767, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2dswv", "link_id": "t3_23sg16", "parent_id": "t1_ch2ah07", "removal_reason": null, "retrieved_on": 1433526896, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PhantomGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry if this is long and or rambly!\n\nI feel your pain, I so thought I was going to have a complete breakdown before we got all his issues under control! \n\nWe finally got into a GI when he was 4 months she confirmed the GERD and she said she could tell by the sound of his cry and a quick look at his throat that he had esophagitis. While your LO may not have it, I'm sure there's still a lot of pain due to the reflux.  We had to see 2 other pediatricians, before we found one who wasn't dismissive about his spitting up, she referred us to the GI. The other doctors would simply repeat \"all babies spit-up, he's not losing weight, so he's fine. \" It seems a lot of pediatrician's think reflux is BS. We were so lucky our current pediatrician had a daughter just like him, GERD and MSPI. His pediatrician diagnosed the MSPI, by blood in his stool. (not to mention projectile vomiting, and constant diaper blowouts due to diarrhea-which as first time parents we didn't know it was diarrhea, we thought he just pooped a lot :( ). He's been doing great on Alimentum since he was 8 weeks, no more projectile pukes!\n\nOh and as an FYI, his vomiting was/is so bad he was checked for a pyloris twice! \n\nWe had problems with Prilosec too until the GI told us about the drug deteriorating quickly when compounded. Our pediatrician didn't tell us about that so we were refilling once a month! It was almost comical when we told the GI it would seem to work for a while and then stop. She promptly made the connection to not refilling the RX every two weeks. As a benchmark for you, he's taking 3mls of a 2mg per ml compound twice a day he's ~18lbs and slightly over 28 inches at 6 months. \n\nSeriously though, he is so different now, he's happy 90% of the time now instead of the opposite. He sleeps incredibly well at night, instead of waking up every 1/2 hr screaming , he sleeps from 7pm till around 6am every night without waking up (no sleep training necessary)! \n\nHere's hoping your second opinion goes well Monday! Hopefully you'll get some help figuring out what's going on. \n\nI've found the site 'reflux rebels' very informative.\n\n", "controversiality": 0, "created_utc": 1398493640, "distinguished": null, "downs": 0, "edited": 1398493858, "gilded": 0, "id": "ch2evux", "link_id": "t3_23sg16", "parent_id": "t1_ch265uw", "removal_reason": null, "retrieved_on": 1433527406, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bravelittletoaster87", "author_flair_css_class": "blue", "author_flair_text": "Alexandr Julius 7 weeks Preemie, Feb 27th, 2014", "body": "That's amazing thank you my son has an appointment in a few days and I think I'm going to ask if we can increase it. He's about six pounds and was almost 19 inches at his last appointment he's almost two months old so I don't know what his max will be but maybe that will help.", "controversiality": 0, "created_utc": 1398500126, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2g6vh", "link_id": "t3_23sg16", "parent_id": "t1_ch2dqg3", "removal_reason": null, "retrieved_on": 1433528089, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anajnar", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is 18months, they suspected pyloric stenosis, reflux always wants to be held cranky... It was so very difficult coupled with me having retained placenta. The first three months were the most difficult. The reflux got better month 4, I introduced solids around 4.5m and it changed. She is an angel... Life seems normal now... Still hectic with a child but nothing like first few months. Hang in there... Good times are coming ", "controversiality": 0, "created_utc": 1398549734, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ch2uhek", "link_id": "t3_23sg16", "parent_id": "t3_23sg16", "removal_reason": null, "retrieved_on": 1433534894, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}