{"submission": {"author": "W0rdN3rd", "author_created_utc": 1336097748, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_7mqe5", "created_utc": 1401105761, "domain": "self.Mommit", "edited": 1401135936, "full_link": "https://www.reddit.com/r/Mommit/comments/26ikqr/my_daughter_wants_to_skip_the_8th_grade_and_the/", "gilded": 0, "id": "26ikqr", "is_self": true, "media_embed": {}, "num_comments": 59, "over_18": false, "permalink": "/r/Mommit/comments/26ikqr/my_daughter_wants_to_skip_the_8th_grade_and_the/", "retrieved_on": 1441339803, "score": 50, "secure_media_embed": {}, "selftext": "My daughter is finishing up 7th grade, having been a stellar student her entire academic career. She's earned top grades, and she's also a student-athlete, active in track and cross-country running, and a member of the drama club and the band. She is more mature than her peer group; she's had a lot to deal with in her young life, including the loss of her dad six years ago after a prolonged illness. \n\nShe asked me if she could skip 8th grade because most of her friends are a year ahead of her in school, but I think that's a lousy reason to skip a grade. High school is characterized by change, and the friends she has now may not be her besties a year from now. I'm also concerned that the other student-athletes would have a one-year competitive edge on my daughter, and that she'd lose out on at least one or two performances with the drama club. \n\nMy first instinct is to say no, but I told her that I would consider the question fairly, so I'm asking moms: What do you think?\n\n\nUPDATE: She didn't want to wait until dinner. She's been texting and Skyping with her friends all day to come up with her lists, and she decided all by herself that she doesn't want to skip 8th grade after all. We talked it over, and I reiterated some of the points you kind ladies made. I was actually leaning toward letting her skip (at one point, I think I was even trying to talk her into it), but I guess the point is moot now. \n\nHer reasons for not wanting to skip are, in _her_ order of importance: \n\n(1) she wants that extra year to grow and train and hopefully win some sports scholarships to fund her education (I told her about \"redshirting,\" but she doesn't want to repeat the 7th grade for the sake of college money...bit of a disappointment, that)\n\n(2) she doesn't want to miss the class trip to Memphis (Ha! I called that one)\n\n(3) her friends in drama club who are graduating this year told her the thing they would miss most about school was being in drama club, and that she's nuts for wanting to miss even one production and they would give anything to be in just _one more show_ and I think I heard one of them crying (oh, drama club!)\n\n(4) she's the smartest kid in the class, but if she skipped, she wouldn't be anymore and she likes being special\n\n(5) she likes not having to spend a lot of time studying because it gives her time for other other interests (\"School is easy. I don't want it to be too hard. [I don't have time for more homework](http://i0.kym-cdn.com/photos/images/original/000/284/529/e65.gif).\")\n\nWe also talked about AP classes, and she's just as happy to do that and get a headstart on college instead of missing out on a year of her childhood. And we left the door open for future grade skipping, in case she changes her mind. I'm proud of her for making an informed decision. She had more reasons, but those were the top 5. Thanks for all your help, /r/mommit. &lt;3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "My daughter wants to skip the 8th grade, and the school says she's competent enough academically...should I let her?", "url": "http://www.reddit.com/r/Mommit/comments/26ikqr/my_daughter_wants_to_skip_the_8th_grade_and_the/"}, "comments": [{"archived": true, "author": "beautifulview", "author_flair_css_class": null, "author_flair_text": null, "body": "I say let her. I think one thing to consider is her social-emotional experience, which she indicates is stronger in the year above. She can still have a great experience in her assigned grade, but would it be worth watching your best friends have fun without you at things like prom and graduation? Kids adjust, but it seems she has a strong preference. Also, as far as student athletics, her performance could change in a minute, and she would likely be on a junior varsity team in HS (which is very typical for young players in HS). She can always advance to varsity team. Honestly, she would be skipping middle school, not anything in high school. My point is that high school is where the memories are made and challenge are really faced. I think if she stayed in assigned grade, she would be bored and resentful. Give her a challenge, but explain that this advancement isn't to hang out with friends, and there will be consequences for not putting in HS-level work in class. Also, drama club is always more fun in high school. I did theater in HS and MS and without a doubt loved HS more. Good luck to you both!\n", "controversiality": 0, "created_utc": 1401108377, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chre6vt", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433959478, "score": 32, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "I was in a very similar situation when I was her age. However, my parents did not let me advance. I can say it was an awful decision. I was so bored academically I let everything go. I didn't care. I basically gave up and then didn't put any effort in when I did get to the 9th grade because what I had been taught was there was no rewards for your hard work and achievements so why bother?\n\nKids can adjust to the social aspect of skipping a grade much like they can if they were to be held back. You can be there for her if she starts to struggle socially. You mentioned you think she's more mature. Use that and let her know she can always come to you if things get difficult and you'll help her out. \n\nEdit: word ", "controversiality": 0, "created_utc": 1401109972, "distinguished": null, "downs": 0, "edited": 1401113524, "gilded": 0, "id": "chrejzg", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433959650, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "redidnot", "author_flair_css_class": null, "author_flair_text": null, "body": "If she's frustrated with the work and losing interest academically I would let her - it's not an irreversible decision. If it doesn't work out she can go back. If it's just about being in the same class as her friends I would think further on it. \n\nIf she did skip I would also consider sending her abroad for an exchange year between high school and university so she ends up the same age as her peers later on.\n\nI don't think possibly winning less at athletics is a good reason to hold her back. College has drama club too. ", "controversiality": 0, "created_utc": 1401112361, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrf6k3", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433959946, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "redidnot", "author_flair_css_class": null, "author_flair_text": null, "body": "Didn't let you advance or did? ", "controversiality": 0, "created_utc": 1401112383, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrf6rj", "link_id": "t3_26ikqr", "parent_id": "t1_chrejzg", "removal_reason": null, "retrieved_on": 1433959948, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Meg_Shark", "author_flair_css_class": null, "author_flair_text": null, "body": "I would say if you can ask the question \"is she emotionally mature enough to skip a grade and be with the older kids?\" and the answer is \"yes\" then the decision could be pretty simple considering that she definitely seems intellectually mature enough and she already has friends that age. \n\nAnother consideration; however, are her peers in 9th grade that are NOT her friends. Young teenagers can be total assholes and would they be hard on your daughter because she skipped 8th grade? Perhaps they resent her and/or find something to tease her about?  This absolutely might not happen but could be worth exploring with her and maybe a trusted teacher or guidance counsellor? \n", "controversiality": 0, "created_utc": 1401112669, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrf9nn", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433959986, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your thoughts. She really is more mature than her age-group, and we had already planned to enroll her in AP classes when she gets to high school. If she skips the 8th grade, she'll have to go to summer school to catch up, and she's already got cross-country and band camp going on. \n\nAnd believe me, I've asked her many times if she'd like to give something up, but she enjoys all her activities, and she seems to thrive on being busy. ", "controversiality": 0, "created_utc": 1401112822, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrfb9p", "link_id": "t3_26ikqr", "parent_id": "t1_chre6vt", "removal_reason": null, "retrieved_on": 1433960007, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you, and I'm grateful that we do have the kind of relationship we where can talk things out. \n\nShe's very independent and self-motivated. She takes her grades very seriously (more than I do), and she's conscientious about being on time and prepared for all her activities (more than I am). \n\nIn sixth grade, she was being bullied by another girl in her class, and her solution was to make an appointment for herself and the bully with the guidance counselor. The other girl was very surprised to hear her own name being called down to the office, but the two of them managed to work things out. I only found out about it after the fact, when the guidance counselor called me to let me know what was going on. I think that speaks volumes about her level of maturity and problem-solving skills. \n\nInitially, I was against the idea, but I'm leaning toward it now. ", "controversiality": 0, "created_utc": 1401113118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrfe88", "link_id": "t3_26ikqr", "parent_id": "t1_chrejzg", "removal_reason": null, "retrieved_on": 1433960046, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "You make a very good point. I supposed we could try summer school and she how far she gets and whether she still likes the idea afterward.", "controversiality": 0, "created_utc": 1401113219, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrff9y", "link_id": "t3_26ikqr", "parent_id": "t1_chrf6k3", "removal_reason": null, "retrieved_on": 1433960060, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "That is exactly the point I was wondering how to make: teenage assholery. She's dealt successfully with a bully in the past, but that was middle school and high school is a whole different ball game. \n\nShe's a very results-oriented kid, but I worry that she might be pushing herself too hard.", "controversiality": 0, "created_utc": 1401113505, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrfia4", "link_id": "t3_26ikqr", "parent_id": "t1_chrf9nn", "removal_reason": null, "retrieved_on": 1433960100, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "Didnt* \nWords are hard in the morning. ", "controversiality": 0, "created_utc": 1401113506, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrfiap", "link_id": "t3_26ikqr", "parent_id": "t1_chrf6rj", "removal_reason": null, "retrieved_on": 1433960100, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "someoneinwyoming", "author_flair_css_class": null, "author_flair_text": null, "body": "One piece to consider is how mature will she be when she graduates and goes to college.  We kept our daughter back a year to start kindergarten  because I just couldn't imagine sending a 17 year old to college on her own.  ", "controversiality": 0, "created_utc": 1401114373, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrfrl4", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433960220, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TeaTeaAndCoffee", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not yet a mom (due this June) but when I was a kid I skipped from 6th grade math to 8th grade math (only math, no other subjects, although truthfully I probably could have skipped ahead in other areas). Let me ask you this: how does she respond to frustration, how do you think she might respond to possibly no longer being the smartest kid in the class, and even being behind most of the class? In very the beginning of the school year, my math class was tested on topics that were review for everyone else, but were brand new to me (because they learned it all in the class I skipped). So I failed that quiz--the first time that ever happened to me.  The teacher did not volunteer me any support and I was not used to asking for help--so I had to figure it out on my own. And of course, everything we learned later built on those concepts. So it is crucial at the beginning of the school year to realize that since she advanced a year, she is no longer ahead of everyone else, she is actually behind, and she needs to work a bit harder than everyone else in the beginning just to get on the same page. For other subjects like English this may not be a problem, but for math and science she may need extra help and encouragement from you and/or a tutor in the beginning, if you decide to go this route.", "controversiality": 0, "created_utc": 1401115627, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrg5yv", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433960412, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "And that's another thing...she'll be 17 when she graduates. If she skips a grade, she'll be 16 when she graduates. Her birthday is in August, so she's already a year younger and quite a bit smaller than her peer group. \n\nAt least the university she wants to attend is right here in town and she'd be able to live at home. ", "controversiality": 0, "created_utc": 1401115701, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrg6v5", "link_id": "t3_26ikqr", "parent_id": "t1_chrfrl4", "removal_reason": null, "retrieved_on": 1433960423, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TeaTeaAndCoffee", "author_flair_css_class": null, "author_flair_text": null, "body": "I should also mention that I did figure it out eventually and wound up with a B that semester instead of my usual A.", "controversiality": 0, "created_utc": 1401115744, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrg7d4", "link_id": "t3_26ikqr", "parent_id": "t1_chrg5yv", "removal_reason": null, "retrieved_on": 1433960428, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Feet2Big", "author_flair_css_class": null, "author_flair_text": null, "body": "I often find that maturity does not match age. I've known 18 year olds who you'd swear was only 16 and vise versa.  Even the face value of \"maturity\" is no guarantee they're ready for college, kids are assessed on a case by case basis.", "controversiality": 0, "created_utc": 1401115802, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrg81e", "link_id": "t3_26ikqr", "parent_id": "t1_chrfrl4", "removal_reason": null, "retrieved_on": 1433960440, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "californialimabean", "author_flair_css_class": null, "author_flair_text": null, "body": "I say, let her.  My daughter is in the 4 year old class at school.  She's the youngest, too, at 3 1/2.  She loves to try and \"keep up\" with the other kids.  She's very coordinated, recognizes letters and is exceeding milestones consistently.  There are some things you can't help!  All you can do is feed their little minds.  In this case, feed your daughter's expanding mind.  If you haven't already noticed, she mature beyond her time.  The death of her father has forever changed her path.  She's experienced a trauma that most of us won't understand until our children have children.  Sounds like you two are very connected.  Does she have a strong father figure in her life?  Good luck to you both!  ", "controversiality": 0, "created_utc": 1401115835, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrg8fd", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433960442, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Right. The counselor already told her she'll have to go to summer school this summer to catch up with what the 8th graders have already learned. She seems enthusiastic about the idea (she loves school), even though she's already got band camp and cross-country for most of the summer, too. \n\nShe's only ever failed one test, and it did upset her, but it was more the format of the test than the fact that she failed. She knew the material, and I agreed, the test was badly designed. So many kids in the class failed that test, the teacher threw it out. Her first soccer team didn't win a single game all season, but she'd always say something about fresh air, exercise, and everybody-gets-a-snack-anyway. She was actually one of the worst scorers, and _the_ worst goalkeeper, on her team, but she loved the running part, so we went back week after week. Losing didn't seem to bother her. She's not the best runner on her team either, but she tells me she's only running against her own time and not competing with anyone but herself. \n\nShe doesn't get frustrated easily, but she's stubborn when she thinks she's right and impossible to argue with. \"Because I said so\" has _never_ been good enough for her; she's always needed a reason. It's frustrating for _me_, but she seems fine with it. \n\n", "controversiality": 0, "created_utc": 1401116851, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrgkvo", "link_id": "t3_26ikqr", "parent_id": "t1_chrg5yv", "removal_reason": null, "retrieved_on": 1433960604, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Meg_Shark", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, if you let her do it and she fails then it could be an amazing, amazing learning opportunity.  It sounds like she is someone who has big plans in life--something like this will only help to shape her character.\n\n As far as an escape plan, is she allowed to repeat grade nine if she doesn't like it or isn't achieving the results she wants? ", "controversiality": 0, "created_utc": 1401117078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrgnrj", "link_id": "t3_26ikqr", "parent_id": "t1_chrfia4", "removal_reason": null, "retrieved_on": 1433960642, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Sometimes, she reminds me of me at that age, and sometimes I don't understand her at all. Since her dad died, I've found someone else, and we're managing to cobble together our two families (his children are all grown), and he's a great dad. She's also very close with her uncle, who moved in with me for a year to help take care of things. \n\nThanks for your thoughts.", "controversiality": 0, "created_utc": 1401117144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrgom1", "link_id": "t3_26ikqr", "parent_id": "t1_chrg8fd", "removal_reason": null, "retrieved_on": 1433960653, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Polandra", "author_flair_css_class": null, "author_flair_text": null, "body": "It looks like I'm in the minority here but I'll chime in anyway.\nAs a teacher i can say that I've taught a number of students that have skipped a grade. Academically many have done quite fine (as the reason for their advancement was academic achievement) but socially and emotionally I can *almost* always pick them out in the crowd. Their ability to cope with challenges socially and the oft changing dynamic of high school social interactions has often left them either isolated or noticeably awkward. Interactions with teachers and adults can be noticeably immature- pouting, emotionally driven rather than logically, and sometimes they hit a wall intellectually where  certain courses require a more advance level of thinking that their brans just aren't ready for yet. I would talk to her teachers- the ones you feel know her best to get a feel for this possibility not just academically but socially as well.", "controversiality": 0, "created_utc": 1401117550, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrgtmy", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433960718, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "The guidance counselor said she'll have to attend summer school, and based on the results, she'll either be allowed to skip 8th grade or not. I guess it wouldn't hurt to let her try.\n\nShe definitely has a plan. Last year, she decided she wanted to be a vegetarian, so I made her do some research and figure out how to get enough protein into her diet without meat. She presented me with meal plans, recipes, and stacks of studies she'd found. After a consult with our family doctor, I let her go for it. It sparked an interest in nutrition, and she's decided on it for her field of study. \n\nI'll admit, some of the smoothies she makes are pretty darn tasty, and she tells me the kale-banana-sweet potato one is a \"nutritional powerhouse.\" ", "controversiality": 0, "created_utc": 1401117726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrgvyy", "link_id": "t3_26ikqr", "parent_id": "t1_chrgnrj", "removal_reason": null, "retrieved_on": 1433960750, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you should follow her lead on this one.  If she feels this strongly about it, it's best to get out of her way and see how it pans out.  It may be wonderful or it may be a bust, but she'll always resent you if you hold her back. \n\nPlus, she sounds like a kid who's resilient enough to deal with the challenges that come with grade skipping, and she has a supportive mom to help her pick up the pieces if it falls apart.  \n\nSo take a deep breath and tell her you support her no matter what she decides.  Good luck to you both!  ", "controversiality": 0, "created_utc": 1401117914, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrgyee", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433960781, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1401118548, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrh6v5", "link_id": "t3_26ikqr", "parent_id": "t1_chrfrl4", "removal_reason": null, "retrieved_on": 1433960892, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! I was hoping a teacher would chime in. I haven't spoken with her teachers or her coaches yet, but I have talked to the guidance counselor. I'm going to line up some meetings this week, though, and get their thoughts, too. The guidance counselor is all for letting her go to summer school and then assessing the outcome before we make a final determination.\n\nI'm inclined to make a somewhat-final determination before I let her go to summer school. To do otherwise smacks of starting a project you have no intention of finishing. ", "controversiality": 0, "created_utc": 1401118842, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrhapu", "link_id": "t3_26ikqr", "parent_id": "t1_chrgtmy", "removal_reason": null, "retrieved_on": 1433960943, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that forcing her to stay behind a year would leave her bored and disenchanted with learning. Worse, she could get the idea that she doesn't have to work hard to succeed - she's just naturally smart, and doesn't have to do homework or study like the other kids to do well on tests. You don't want her developing the idea that she's smarter than her peers, different, an exception, or thinking that nobody else is as smart as her - if you leave her with peers that are a grade below her academically, that might happen. She's independent and self motivated now... but what about after a few more years when she's at the top of the class? And she figures out she doesn't have to work hard to get there? Big trouble.\n\nBumping her up by a grade, I think, would challenge her academically and socially - and set her up better for the future. I think she'll be happier, too. It'll be harder than staying in the same grade, but she won't be bored out of her mind. \n\nSports and drama performances are important, but not at the cost of her education. It sounds like you're already making a lot of decisions for her: what university she'll go to, how she'll fare bumping up a grade. In reality, you just don't know - she doesn't know either. Things change. I think you guys should try it out, and if it doesn't work, you can send her back to the lower grade.", "controversiality": 0, "created_utc": 1401120614, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrhyqm", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433961257, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TeaTeaAndCoffee", "author_flair_css_class": null, "author_flair_text": null, "body": "To me, it sounds like your school district counselor is a good resource, and you are the type of mom to investigate things, and that she is the type of kid to persevere. This is the ideal combination and I bet she will do well. \n\nHigh school is rough on everyone, for the most part. Being academically bored won't help her. Might as well put her at the right academic level to challenge her somewhat.\n\nI understand your concern about teenage assholery. Unfortunately, it's just part of high school. Is it a large school? If so, she will probably find a group of kids that she fits in with, and do just fine. It sounds like she already has a core group of friends to start with, so she's not going in without knowing anyone. My bigger concern would be college. My sister entered an out-of-state university at 17 and I think it was too early for her. I would suggest exploring community college or at least a local college for her first year. ", "controversiality": 0, "created_utc": 1401121744, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chriemu", "link_id": "t3_26ikqr", "parent_id": "t1_chrgkvo", "removal_reason": null, "retrieved_on": 1433961464, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "I skipped first grade, and while it was good for me academically, it was terrible for me socially.  The social aspect of grade-skipping is typically *the* biggest problem with it.  Given that your daughter already has an established social group that's a year ahead of her, I'd say you should let her try it.", "controversiality": 0, "created_utc": 1401121962, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrihnk", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433961504, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizardisanerd", "author_flair_css_class": "blue", "author_flair_text": "My toddler is trying to kill me... ", "body": "I would let her do summer school and see if she still wants to do it at the end of summer. Don't think of it as failing a project as much as doing a trial run or doing your research. ", "controversiality": 0, "created_utc": 1401123049, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrixcg", "link_id": "t3_26ikqr", "parent_id": "t1_chrhapu", "removal_reason": null, "retrieved_on": 1433961710, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizardisanerd", "author_flair_css_class": "blue", "author_flair_text": "My toddler is trying to kill me... ", "body": "I went to college at 17 without skipping a grade and it was fine! (I'm in a second Masters program now at 33!)", "controversiality": 0, "created_utc": 1401123210, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrizmd", "link_id": "t3_26ikqr", "parent_id": "t1_chrfrl4", "removal_reason": null, "retrieved_on": 1433961741, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "lizardisanerd", "author_flair_css_class": "blue", "author_flair_text": "My toddler is trying to kill me... ", "body": "Early grade schoolers  are bigger assholes than high schoolers, IMO. ", "controversiality": 0, "created_utc": 1401123470, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrj3fo", "link_id": "t3_26ikqr", "parent_id": "t1_chrihnk", "removal_reason": null, "retrieved_on": 1433961790, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "That's my biggest concern, too. She wants to take AP classes, too, so theoretically, she could enter university as a 16-year-old sophomore. \n\nShe's had the same friends since grade school, but this year, since she started cross-country and drama club, she's hanging out with those kids, and they're a bit older than she is. It's not a huge school; there are about 250 kids in her graduating class.", "controversiality": 0, "created_utc": 1401123736, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrj78m", "link_id": "t3_26ikqr", "parent_id": "t1_chriemu", "removal_reason": null, "retrieved_on": 1433961839, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rainbowmoonheartache", "author_flair_css_class": "blue", "author_flair_text": "DS born Feb2012", "body": "&gt; I was in a very similar situation when I was her age. However, my parents did not let me advance. I can say it was an awful decision. I was so bored academically I let everything go.\n\n\nThis was my experience, too. My parents were given the option to skip me two grades and refused; I nearly failed out of school entirely after 9th grade, when I was bored out of my skull. I say, if she *wants* to skip a grade, let her.", "controversiality": 0, "created_utc": 1401124092, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjccl", "link_id": "t3_26ikqr", "parent_id": "t1_chrejzg", "removal_reason": null, "retrieved_on": 1433961912, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed.", "controversiality": 0, "created_utc": 1401124456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjhmk", "link_id": "t3_26ikqr", "parent_id": "t1_chrj3fo", "removal_reason": null, "retrieved_on": 1433961974, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I say, if she feels she can handle it and the school says she can, let her do it. She may need the challenge.", "controversiality": 0, "created_utc": 1401124714, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjle2", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433962091, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "That is amazing.  I say she is very aware of her own ability and what she can handle.  ", "controversiality": 0, "created_utc": 1401124771, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjm7a", "link_id": "t3_26ikqr", "parent_id": "t1_chrfe88", "removal_reason": null, "retrieved_on": 1433962103, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with the other comment.  Look at it as a trial run.  ", "controversiality": 0, "created_utc": 1401124837, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjn4t", "link_id": "t3_26ikqr", "parent_id": "t1_chrhapu", "removal_reason": null, "retrieved_on": 1433962114, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "It was pretty amazing. She's always been independent, but I was shocked to find out that (1) she was being bullied, and (2) she figured out a solution on her own. Afterward, I did tell her that she can always come to me if she has any problems, no matter what they are, and she just shrugged it off and told me she knew that, but she didn't need my help this time. \n\nHer entire attitude can be summed up in her favorite catchphrase: \"Don't worry, Mom. I got this.\" ", "controversiality": 0, "created_utc": 1401125232, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjswy", "link_id": "t3_26ikqr", "parent_id": "t1_chrjm7a", "removal_reason": null, "retrieved_on": 1433962191, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, it is good that she can handle things in an adult manner.  I DO worry a little that she might be trying to handle things on her own as not to worry you, but I only say that from my own weird childhood experience and have no idea about how you guys are as a family unit (which sounds pretty healthy from what I can see).  As long as she knows she can come to you if she feels she really can't handle something, that is good.  ", "controversiality": 0, "created_utc": 1401125413, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrjvkz", "link_id": "t3_26ikqr", "parent_id": "t1_chrjswy", "removal_reason": null, "retrieved_on": 1433962225, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "I would have the same concern, except that she's always been that way. \n\nFirst day of preschool, while the other kids were clinging to their moms and crying, she walked right into her classroom without a backward glance. No fear. She's like that with everything. I'm more concerned that she's stretching herself too thin, trying to do too much.", "controversiality": 0, "created_utc": 1401126021, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrk4kq", "link_id": "t3_26ikqr", "parent_id": "t1_chrjvkz", "removal_reason": null, "retrieved_on": 1433962342, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "We're definitely making this decision together. She asked me about it, after she talked to her guidance counseler about it. Apparently, she's been thinking about it for a while. I've only just been added to the discussion this weekend. \n\nSo, I'm doing a little websurfing, seeing what kind of studies are available on the topic, but it's always a good idea to get perspective from people who have real-world experience. For her part, she's supposed to come up with a list of reasons why it's a great idea to skip a grade, and another list of why it's a horrible idea. I want her to be able to see both sides of the argument. She also has to come up with a list of her own personal reasons for wanting to skip a grade. \n\nWe have a \"date\" to talk about it again over dinner, and then we'll decide whether or not to proceed with the teacher/coach meetings. ", "controversiality": 0, "created_utc": 1401127133, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrkkuw", "link_id": "t3_26ikqr", "parent_id": "t1_chrhyqm", "removal_reason": null, "retrieved_on": 1433962556, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "scoutycat", "author_flair_css_class": null, "author_flair_text": null, "body": "I skipped a grade when I was younger.  I never had trouble keeping up with the academics, but the social aspect was at times challenging for me.  I doubt anyone thought I was going off the rails when I first got to high school, but I was an easy target for kids and adults who wanted to take advantage of others.  There are a lot of tougher social situations that kids face in high school where being a year younger does you no favors.  Hormonal changes can lead to anxiety and depression and make even a really solid good kid stumble. \n\nIn your situation, I would look into alternatives - get an IEP, maybe, see if there are options for advanced learning, try and provide enrichment in other ways.  Teach her to find excellence and push herself when she doesn't feel she is being pushed hard enough.  I would be very reluctant to skip a grade unless it seemed to be the only way to keep her from struggling and being bored.", "controversiality": 0, "created_utc": 1401128376, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrl39z", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433962798, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rogue_pineapple", "author_flair_css_class": null, "author_flair_text": null, "body": "Same.\n\nWe randomly moved to a different state my junior year of school. I was leaps ahead of my peers both academically and psychologically. They wanted to place me into senior year, but my parents refused. \"She needs to have a senior year.\" Naturally, I gravitated towards all of the AP and senior courses, and ended up having ALL senior friends.  \n\nMy senior year was  *horrible*. It was dull, lonely, and a complete waste of a year. I ended up getting really depressed and lost sight of my life goals. At the time I was working a mc-job and decided that that was all my life was going to amount to because it was the only place that would appreciate my hard work and  intellect. \n\n ", "controversiality": 0, "created_utc": 1401129115, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlehn", "link_id": "t3_26ikqr", "parent_id": "t1_chrejzg", "removal_reason": null, "retrieved_on": 1433962947, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Joeycam28", "author_flair_css_class": null, "author_flair_text": null, "body": "As a college student athlete I would say no... If it is only academics you and your daughter are worried about then definitely do it, but if you want her to have a future in athletics, and the greater possibility of a scholarship, wait until she is in high school. They offer AP college classes in a lot of high schools, which actually count as college credits. She can still maintain a competitive advantage in sports while challenging herself academically. ", "controversiality": 0, "created_utc": 1401129266, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlgsh", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433962977, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "If she wants to go to college, she'll need scholarships, and I think this is something we definitely need to think about. \n\nWhile I've been researching this topic, I found out about a practice called \"redshirting,\" in which children are deliberately held back a year to give them a competitive advantage. Depending on how prevalent that practice is, my kid could be competing against kids two or three years older than her. \n\nGood point. Thanks!", "controversiality": 0, "created_utc": 1401129634, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlm92", "link_id": "t3_26ikqr", "parent_id": "t1_chrlgsh", "removal_reason": null, "retrieved_on": 1435491618, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dolphininafishbowl", "author_flair_css_class": null, "author_flair_text": null, "body": "I skipped the 8th grade as well. The only part that sucked for me was that 8th grade was a huge bonding year for all of the kids in my class. They had 8th grade class trip and started being allowed into dances so they all got really close that year. I felt left out and like I didn't really fit in anywhere. However, looking back, it was the right choice for me. I also loved the reaction I got saying I was a 17yo freshman in college. Being 17 in college came with its own consequences though. At least you seem to have a great relationship with your daughter so she can come to you about these things as they come up.", "controversiality": 0, "created_utc": 1401130158, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlu1h", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433963148, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "miseleigh", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe making a deal would help then - have her decide which activity she would give up if her grades start to slip.", "controversiality": 0, "created_utc": 1401130267, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlvnv", "link_id": "t3_26ikqr", "parent_id": "t1_chrk4kq", "removal_reason": null, "retrieved_on": 1433963170, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "I appreciate your answer, thank you. I skipped a grade, too, and it was frustrating in high school not being allowed to do things my friends could. On the other hand, it was fine to have friends old enough to buy beer (this was many years ago). And, I think I just found another argument against! LOL \n\nOne of the questions I plan to ask is whether or not she can take AP classes. It hasn't really come up before, but now might be a good time to bring it up. I think that might be the better solution. \n\nHigh school is hard enough, and she's so busy already. Next year, in addition to track/cross-country, drama club, marching band, and a community service club, she wants to join the quiz bowl team and the robotics team. It seems to me she's really enjoying the social aspect of school, certainly more than I ever did. She manages to keep up with everything, and still get straight As. She seems to be succeeding, and I don't want to fix something that isn't broken. High school is hard enough already; I don't want to make it harder for her than it has to be.", "controversiality": 0, "created_utc": 1401130368, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlx2z", "link_id": "t3_26ikqr", "parent_id": "t1_chrl39z", "removal_reason": null, "retrieved_on": 1433963188, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Another good point! The 8th graders are going to Memphis next year, so she'd miss out on that trip. \n\nOnce she realizes that, she might change her mind about skipping a grade. Ha! ", "controversiality": 0, "created_utc": 1401130557, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrlzth", "link_id": "t3_26ikqr", "parent_id": "t1_chrlu1h", "removal_reason": null, "retrieved_on": 1433963225, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "That's always been the deal. Education is Job #1 at our house. The kids don't even have to do very many household chores during the school year, just keeping their rooms clean; homework is more important. It has to be done, but not just done, it has to be done properly and thoroughly. I expect my kids to get As because they are capable of it. They know that. And they know that as long as they get As, they don't have to do dishes or laundry. It's a wonderful motivator. My kids are are on the honor roll and the dean's list every time. And as long as they live at home and don't have to do dishes or laundry, I expect that they will both earn several doctorates. \n\n", "controversiality": 0, "created_utc": 1401130786, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrm34n", "link_id": "t3_26ikqr", "parent_id": "t1_chrlvnv", "removal_reason": null, "retrieved_on": 1433963266, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "She wants to skip 8th grade, let her skip 8th grade. If she \"changes her mind\" after all the exhausitve listing you're making her do, remember that that wasn't her initial instinct, and probably reflects your wishes rather than hers.\n\nI think you should let her take a risk, challenge herself, and potentially fail. She'll be out of your house in 4 years, I would let her make this decision with less meddling from you.", "controversiality": 0, "created_utc": 1401130816, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrm3lh", "link_id": "t3_26ikqr", "parent_id": "t1_chrkkuw", "removal_reason": null, "retrieved_on": 1433963272, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "janeawesome", "author_flair_css_class": null, "author_flair_text": null, "body": "I would say let her-- both as a mom and as a \"gifted\" student myself. I was always so frustrated by the fact that I was limited in my academic options, as my school district did all it could to keep students from \"skipping\" grades. I think that it gives her more of an academic challenge, more time to think about college (it seems like that's in the future if she's skipping grades) and perhaps taking a gap year between high school and college to do volunteer work abroad or something, which could be really helpful. \n\nI wish someone had listened to me and had let me jump up when I wanted to and needed to. I felt like a social outcast because I was \"too smart\" which just made me self-conscious and awkward, rather than confident. It might be good for her to not be the absolute best at something and to enjoy the thrill of academic challenge-- so perhaps that is something else to focus on rather than the negative points that drama and athletics bring up?", "controversiality": 0, "created_utc": 1401130918, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrm54l", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433963292, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "My daughter is a grade ahead, and she loves it (she's now 10). Talk with the principal and counselors at the school, and make sure you have a viable backup in case any of her, you or her teachers decide it's not working out. Part of growing up is learning how to assess the risks and benefits of choices, and making those big decisions. I think this is something benign enough that if it doesn't work out its not the end of the world, but it will be a big lesson learned. If it does work out, she'll be happy. My daughter is in math classes with older kids, so it is entirely possible she'll be ready for 9th grade math by 8th grade. What else will she miss in the 8th grade that's so crucial? ", "controversiality": 0, "created_utc": 1401131539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrme9e", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433963413, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1401132210, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrmo8y", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433963544, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem. It's more than a mere parenting issue, so I appreciate your input.", "controversiality": 0, "created_utc": 1401132497, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrmsec", "link_id": "t3_26ikqr", "parent_id": "t1_chrmo8y", "removal_reason": null, "retrieved_on": 1433963598, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "W0rdN3rd", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, there's the class trip to Memphis next spring...\n\nSeriously, though, I'm not a teacher, and I have no idea what the knowledge gap risks may be. It's something we'll definitely add to the list of things to talk about. She'll have to attend summer school to play catch-up, but the idea doesn't seem to bother her. I don't know if they can honestly cram a whole school year into less than three months. ", "controversiality": 0, "created_utc": 1401132652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrmuot", "link_id": "t3_26ikqr", "parent_id": "t1_chrme9e", "removal_reason": null, "retrieved_on": 1433963629, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DiggingNoMore", "author_flair_css_class": null, "author_flair_text": null, "body": "I skipped 2nd.  It's not 8th, but it still got me out of high school and into university at age 17.\n\nI say, if you *can* do it, do it.", "controversiality": 0, "created_utc": 1401135775, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chro55c", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433964236, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ryzzie", "author_flair_css_class": "green", "author_flair_text": "Mama of 2", "body": "Well, I'm going to make the assumption that the only thing she will need to catch up on is language arts and/or social science. If the school has a way to do it, I think that's very proactive! \n\nAs far as the trip, why not volunteer as tribute... Er... A chaperone. My kiddo will be in college by 16, so I might go back and get my masters so she won't be at it alone. Looking back at middle school days, I don't think it would have made much of a difference other than friends... And she says her friends are in the next grade up. ", "controversiality": 0, "created_utc": 1401136767, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrojtd", "link_id": "t3_26ikqr", "parent_id": "t1_chrmuot", "removal_reason": null, "retrieved_on": 1433964428, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "japanicjapanic", "author_flair_css_class": null, "author_flair_text": null, "body": "YES! of course! I graduated a year early because of a similar situation and it was the best thing that ever happened to me\n", "controversiality": 0, "created_utc": 1401150689, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chru0sf", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433967071, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dalaim0mma", "author_flair_css_class": "purple", "author_flair_text": "SAHM; 3 gremlins", "body": "I feel like I should chime in here. I was the youngest kid in my class because I skipped kindergarten. On top of that, my birthday is in late November, so I was more than a year younger than everyone else. \n\nEverything was fine until around high school, when I had some unforeseen consequences that I think you might want to discuss before deciding. \n\nI was twelve when I started high school. Twelve. I was the last of my friends to hit puberty, last to start dating, get my drivers permit, etc. I finally got my license as a sixteen year old in my senior year, and seventeen at graduation. When my friends celebrated the big \"18\", I was 16/17. \n\nNone of this had any really horrible consequences on me, but in my teenage angst, it really sucked. Just thought you should think about it and bring it up to your daughter so she can know what to expect.", "controversiality": 0, "created_utc": 1401157147, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chrwqxt", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433968355, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rippersole", "author_flair_css_class": null, "author_flair_text": null, "body": "I have nothing really to contribute to your issue, but I just want to thank you for talking about this on Reddit.  Three months ago my husband was diagnosed with an incurable form of cancer.  His prognosis is 5-10 years.  Our daughter is nine months old.  I don't worry much about how losing him someday will affect me, there'll be plenty of time to grieve him when he's gone.  However, I worry endlessly about how losing her father at a young age will affect my daughter.  I don't know anyone personally who lost a parent at a young age.  This post, well, gives me hope.  So, thanks for that.", "controversiality": 0, "created_utc": 1401161285, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chryhsv", "link_id": "t3_26ikqr", "parent_id": "t3_26ikqr", "removal_reason": null, "retrieved_on": 1433969178, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Joeycam28", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Redshirting\" is not holding her back a year. As a NCAA player she will have five years to actively play four years. You have the option to \"redshirt,\" which means you are part of the team and you practice but do not compete, or \"grayshirt,\" which means you are a part of the team but do not practice or compete, all you do is focus on academics, stay in shape, and go to team meetings. I'm sure there is a more detailed description about the two this is just a description from an athletes standpoint. However, I still believe you should not move her up a grade. If I could go back in time I actually wish I was held back a grade, especially for football. I played football wrestling and track. I was a year around athlete. Although I was very good, if you look at the statistics, athletes born in December, and January, that are early in age for their grade, are more likely to go pro. Most NFL players are born in December and the reason is they are more developed and stand out from the crowd, outperforming the less developed athletes. Keep her in her current grade and if things are two easy for her and she needs more of a challenge have her take advanced classes in high school or I have heard of community colleges allowing high school students to take classes on their campus in between, before, and/or after their regular classes.  ", "controversiality": 0, "created_utc": 1401170720, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "chs1kva", "link_id": "t3_26ikqr", "parent_id": "t1_chrlgsh", "removal_reason": null, "retrieved_on": 1433970702, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}