{"submission": {"author": "sarahoflayton", "author_created_utc": 1302406533, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_52z0n", "created_utc": 1403108870, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/28gyrk/i_dont_know_how_to_be_a_stay_at_home_mom_of_a/", "gilded": 0, "id": "28gyrk", "is_self": true, "media_embed": {}, "num_comments": 58, "over_18": false, "permalink": "/r/Mommit/comments/28gyrk/i_dont_know_how_to_be_a_stay_at_home_mom_of_a/", "retrieved_on": 1441306364, "score": 77, "secure_media_embed": {}, "selftext": "I've been a stay at home for just 3 months, my daughter is 2.5 years old. The mornings usually start out okay but somewhere towards the middle of the day I just don't have any patience to offer choices, to beg and plead over diaper changes, for getting hit and kicked by tiny little hands.\n\nI've read articles about all the tricks for tantrums but what about getting through all the tiny awful shit? All the little things like taking your shoes off every time we get in the car, or refusing to get in your carseat for 15 minutes any time we need to go somewhere, or kicking me in the face halfway through a poopy diaper change? \n\nThis defiance stage just feels like every mandatory interaction with my daughter is raking my brain across a cheese grater.\n\nI'm sorry if this is the wrong place for this, but who do you talk to about this stuff? All my parent friends act like toddlerdom was never this bad. Am I just not cut out for stay at home parenting? At this point I'm having more tantrums than she is.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I don't know how to be a stay at home mom of a toddler without totally losing my shit every other hour.", "url": "http://www.reddit.com/r/Mommit/comments/28gyrk/i_dont_know_how_to_be_a_stay_at_home_mom_of_a/"}, "comments": [{"archived": true, "author": "kimchichi", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I had advice to give.  I'm a SAHM to a almost 2.5 year old boy.  Some days are bad, some are better. \nI've been getting super frustrated with him lately,  which I'm sure he can sense, and his behavior gets worse :(\nI thought I was gonna lose my damn mind yesterday :/ Good luck to you!", "controversiality": 0, "created_utc": 1403111636, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaul08", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434295910, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kat_loves_tea", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not there yet as my little one is much younger but I have to say this. Being a stay at home mom is HARD. Though I had a very demanding and fast paced career that I thought was eating my soul, it was still much easier than raising a tiny human. The ability to live in a world where you get to communicate with adults daily, go to the bathroom when you want, and to sometimes just sit in silence and do whatever it is you need to do... Yeah.. That's golden. Now I love my little girl with every fiber of my being and staying home is clearly beneficial to her so it's what we're doing right now. It doesn't change the fact that it's hard and when my Mr comes home, I sometimes need a baby break.", "controversiality": 0, "created_utc": 1403111840, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaup2v", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434295964, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Elda30", "author_flair_css_class": "blue", "author_flair_text": "Mom to 2.5 year old Nate", "body": "I wish I had advice to offer, but mainly I'm just posting to commiserate. My son will be 3 in August and it's as though every interaction we have is a fight. He kicks, screams, hits...just flips his little blond head over everything. I honestly cannot wait for him to outgrow this stage. I miss my sweet little smiling, cooing baby.\n\nI just try to have as much patience with him as I can, because they all go through it. It's just really hard sometimes and I have to force myself to smile at him through gritted teeth.", "controversiality": 0, "created_utc": 1403111883, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaupw9", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434295978, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MonsoonAndStone", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not you. Don't beat yourself up. She's learning defiance and pushing boundaries and disobedience which are all *good things* but a huge pain in the ass when what you need is cooperation.  ", "controversiality": 0, "created_utc": 1403112227, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciauwbu", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296058, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "crazyfordisney", "author_flair_css_class": "lightcoral", "author_flair_text": "Working Divorced w/ 17m.o. girl", "body": "I may not be 'qualified' to answer this because I am not a stay at home mom and my LO is only 17 months old, but how is your structure/ activity level for your daughter? \n\nI find that when my LO and I are busy things go smoother when we are just winging it.  Since back when I was on maternity leave, if we didn't get out of the house for at least a bit by 3pm it became crazy time... and then she feeds off my stress and gets even crazier... and we enter an infinite loop of mommy &amp; baby crankiness/ tantrums. \n\nAlso, do you have any policies in place? \nI have watched a TON of nanny shows and read blogs and watched other parents and at 17 months am already working on time-outs.  The other night my LO bit me, intentionally and then when I firmly told her no, we don't bite and hurt people, she pinched me.  So I finished her diaper change and put her into her crib for time out for 1 minute (1 yr old, figured 1 min seems like eternity).  She screamed but there was no more biting or pinching that night.  Similar thing the next night so same process.  The big thing is to have policies, communicate them, and be consistent.  \n\nAnd you are definitely not alone, we are just a society that wants to shout from the rooftops if our kid makes the honor roll but god forbid we even whisper that little tommy threw a tantrum at the toy store.  ", "controversiality": 0, "created_utc": 1403112244, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciauwmd", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296062, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Stella_the_Vengeful", "author_flair_css_class": null, "author_flair_text": null, "body": "My mother days vodka in the tea helps....I say make lots of friends and have play dates...or drink wine. I am a sahm of a four year old boy. I drink a lot of wine and go on lots of play dates and hang out at parks if he's happy so am I.", "controversiality": 0, "created_utc": 1403112440, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciav0j6", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296114, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "DarthLeia2", "author_flair_css_class": "purple", "author_flair_text": "Ashelia (5yrs), Emrys (2yrs), and Roman (newborn)", "body": "I'm not a stay at home mom, but I typically have the kids with just me on the weekends. When my daughter was that age, there were plenty of weekends that I looked forward to Monday. Toddlerhood is *hard*. \nIt does get better. My daughter is 4 and she's mostly stopped the tantrums and such now (though she still has her days). \n\nThe only advice I have to give is be firm and be consistent. Pick the things that are really important and work on getting those behaviors where you want them, then pick something else to work on. It takes time and patience, but you will get there. If I needed a break, I would turn on my daughter's favorite movie to get a bit of peace. \n\nGood luck!", "controversiality": 0, "created_utc": 1403112592, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciav395", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296152, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ancilla1998", "author_flair_css_class": null, "author_flair_text": null, "body": "Please don't feel obligated to stay home if it really isn't working and you can go back to work. I did not enjoy being a SAHM. Luckily, I was taking college classes for two nights a week for three years and I cherished every last moment I was in the classroom.  I felt really guilty the entire time and was thrilled when I went back to work.", "controversiality": 0, "created_utc": 1403113009, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciavays", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296251, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1403113467, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciavjiy", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296362, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "momma_bunny", "author_flair_css_class": "green", "author_flair_text": "2.5 y/o little monster", "body": "As previous comments have said, staying at home with a toddler is hard. Especially at 2-2.5 when they still can't quite communicate effectively. My go to techniques are 1.) Pick your battles 2.) Distraction and 3.) Stay laughing. \nFor example; Does it really matter if shoes are on in the car? Maybe this is a battle that doesn't need to be fought. Tell your child they can leave shoes off till you are at the destination, but they must have them on when out of the car. Save your combat energy for important things like not touching the hot stove or not kicking you in the face.\nSecond, distraction. My son loves toy cars, so every single time we change a diaper I hand him a car to hold and play with till we're done. Usually, this distracts him long enough for me to ninja him out of and into a diaper. Also by distraction I mean activities. A busy toddler is a happy toddler which is in turn a happy parent. This can be anything along the lines of playgroups, play dates, park or outdoor time, painting, exploring, playing with toys, watching a fun show, etc. Toddlers are easy to distract and the more busy they are the less likely they are to drive you insane.  \nAnd lastly, have fun! If my son is driving me up the wall, the very best thing for it is to go into the bedroom and let him jump on our bed. I sit with him while he jumps and we have tickle fights and blow on his belly and get kisses and hugs and it ends in fits of giggles. What's easier to make you both feel better than laughing together? \n\n", "controversiality": 0, "created_utc": 1403113485, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciavjuj", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296366, "score": 53, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha, more wine. Noted.", "controversiality": 0, "created_utc": 1403113629, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciavmg3", "link_id": "t3_28gyrk", "parent_id": "t1_ciav0j6", "removal_reason": null, "retrieved_on": 1434296402, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, I can empathize. My son just turned 3, and I'm expecting my second any day now. I am a\nSAHM and have had quite a few days lately where things are harder and harder.\n\nTo answer your question about getting through all the tiny little problems through the day: I TRY to remain calm and think of ways that are compassionate, yet still assert the boundaries I want to set as a mom. For example, I give lots of 2 option choices (even though both options are ones I can live with). \"You have a choice - you can get in the car or I can put you in the car\"...and then follow through. With regard to the kicks at diaper changing (I can definitely empathize). My favorite is if it's before nap or bed time: \"Your behavior is showing me you are too tired for a story, so you can either calm your body and stop kicking or we are going straight to bed without a book\"...and then follow through. \n\nUsing the choices and the \"your behavior is telling me...\" line helps him, but being consistent is key. When all else fails, I put him in a safe place and walk away after explaining that we both need a break. \n\nAlso, getting out everyday to get out energy is essential - park, walk/run around block, etc definitley helps us. \n\nAnd, lastly, make sure you get some time for yourself. I don't know how hands on your partner is, but it's amazing what a trip to Target or Starbucks alone at the end of the day can do. I find alone time essential to my well-being. \nDon't beat yourself up. Toddlers are nuts sometimes. I'm sure you're doing your best, but it's always nice to reach out for support like this - I know I do the same thing when I've had it. Good luck! ", "controversiality": 0, "created_utc": 1403113954, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciavsf3", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296478, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Whaaa I'm nursing! I can't do this! :(", "controversiality": 0, "created_utc": 1403113992, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciavt6c", "link_id": "t3_28gyrk", "parent_id": "t1_ciavmg3", "removal_reason": null, "retrieved_on": 1434296489, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vidiuk", "author_flair_css_class": null, "author_flair_text": null, "body": "We've just started this with our 2 year old and though it's taking a while (the first few times I offer options his answer is usually \"no\"), it's definitely starting to gain traction. He's even more cooperative with things for him if I give him some trivial choices for me (what shirt should mommy wear, should I drink tea or milk?). At what age did you start with your son? And how long until it was pretty routine for him?", "controversiality": 0, "created_utc": 1403114556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaw43j", "link_id": "t3_28gyrk", "parent_id": "t1_ciavsf3", "removal_reason": null, "retrieved_on": 1434296632, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "polysepalous", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not quite there yet either, but yes, the days get very long. Is she still taking naps? I try to take full advantage of nap time. Other ways to break up the day: snacks, parks, coloring in the high chair (I tape parchment paper to the whole top of the tray), bath time (mine likes baths so it's a good go to when he can't be pleased), bathroom time (he takes all my lotion, hairspray, etc. out of baskets. I just have to make sure the containers stay closed), we also do a quiet time around 4pm. I put him in his crib with toys for a half hour or so. Used kids books/toys are a great cheap way to get 10-20 minutes of quiet while the kid checks them out. And yes, I've on occasion had 1 beer in the afternoon. Putting your needs after someone else's every day is so hard! But she's halfway from newborn to kindergarten, so there is hope! You are not alone.", "controversiality": 0, "created_utc": 1403115012, "distinguished": null, "downs": 0, "edited": 1403115268, "gilded": 0, "id": "ciawcp4", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296744, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much for your reply. I have just been so frustrated and wrapped up in the small irritations that I forget to have fun and laugh and to focus on that. That advice is helpful.", "controversiality": 0, "created_utc": 1403115316, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciawiaa", "link_id": "t3_28gyrk", "parent_id": "t1_ciavjuj", "removal_reason": null, "retrieved_on": 1434296818, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "midgetyaz", "author_flair_css_class": null, "author_flair_text": null, "body": "Afternoons with my 2.5 year old make me happy that I work full time.  Angel all morning, monster-demon all afternoon.  And he's stopped napping.  I just try to wear him out: pool, jump house, playground.  Anything to keep him moving.  It is hard.  I'm also 6 month pregnant, so I am constantly exhausted anyway, and I thank God for daddy.  \n\nYou are a saint, and I offer my best hopes for you in getting through this period.  I hear that at 4, they turn back into real people.", "controversiality": 0, "created_utc": 1403115678, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciawp45", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434296907, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. The advice about explaining what their behavior is telling you could be useful. I always just assume she doesn't understand language like that. I'll try it. ", "controversiality": 0, "created_utc": 1403115691, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciawpe5", "link_id": "t3_28gyrk", "parent_id": "t1_ciavsf3", "removal_reason": null, "retrieved_on": 1434296910, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Bo_Peep", "author_flair_css_class": null, "author_flair_text": null, "body": "You certainly can drink while nursing.  As long as you are [sober enough to drive](http://kellymom.com/bf/can-i-breastfeed/lifestyle/alcohol/), you are sober enough to nurse.  Cheers!", "controversiality": 0, "created_utc": 1403117441, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaxmof", "link_id": "t3_28gyrk", "parent_id": "t1_ciavt6c", "removal_reason": null, "retrieved_on": 1434297347, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kathog", "author_flair_css_class": "lightcoral", "author_flair_text": "3 yo daughter + due 5/26 w #2", "body": "It all sounds pretty normal to me. The plan was always for me to stay home with our kids. It's way harder than I ever expected. \n\nI have a 2.5 yo as well. She likes to kick too. I've started to over react to kicks and hits like they're really hurting me. And then I make her say \"sorry mom\". If she keeps kicking then the discipline comes in \"if you kick again, your dinosaurs go bye bye.\" I tend to do time outs for behaviors that she knows better but is testing me with. For example, she knows not to pull the cat's tail. If she does it once, she gets a warning \"no tail or you go to your room\" when she does it again she gets 2-3 min in her room. I set the timer on my phone and set it outside her room really loud so she knows when it's over. We have a doorknob cover on the inside of her door so she can't get out. \n\nFor diaper changes, I'll either do a toy or we'll sing a song with motions. \"Happy and you know it\", \"row your boat\" and \"wheels on the bus\" are popular. \"Head and shoulders\" works with non-poopy diapers. \n\nThere are days I just want to strangle her. That's when we have an early bath so she can play to her hearts content while I relax on my iPad while I watch her. I also use nap time for me time. I spend maybe 20 min doing chores and then the rest is recharging time for me. I'm willing to let the dishes be dirty in the sink so I don't start screaming. ", "controversiality": 0, "created_utc": 1403118495, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciay6qr", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434297613, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dalaim0mma", "author_flair_css_class": "purple", "author_flair_text": "SAHM; 3 gremlins", "body": "Yes, you can! http://www.amazon.com/gp/aw/d/B000UEA96G/ref=redir_mdp_mobile", "controversiality": 0, "created_utc": 1403118859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaydfr", "link_id": "t3_28gyrk", "parent_id": "t1_ciavt6c", "removal_reason": null, "retrieved_on": 1434297697, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm nursing, too... And pregnant. I have the patience of a rabid marmot and a 20 month old that is going through a biting and slapping revival. I've resorted to sniffing the whiskey off my husband's breath for the semblance of a contact high. ", "controversiality": 0, "created_utc": 1403118884, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaydw3", "link_id": "t3_28gyrk", "parent_id": "t1_ciavt6c", "removal_reason": null, "retrieved_on": 1434297702, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Dalaim0mma", "author_flair_css_class": "purple", "author_flair_text": "SAHM; 3 gremlins", "body": "Oh, yes! That's me! \n\nI'm a SAHM of three kids, 11, 5, and 2-1/2. I lose my sanity quite frequently, actually. The only balance I have found (which just began this past year) is having alone time, with NO kids, for an hour per day. Sometimes I go to the gym, sometimes I veg out in front of the TV or computer, other times I go out to a friends house or go get a massage or mani-pedi. \n\nThe biggest thing I've found to help is getting away for just enough time to hit the \"reset\" button, as I end up missing the kids if I'm away too long. When I get back, I'm refreshed and I find my patience is GREATLY increased, and my sensitivity GREATLY decreased.\n\nGood luck! I'm here if you'd like to chat.", "controversiality": 0, "created_utc": 1403119293, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciayltu", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434297806, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't really remember when we started this, but I believe it was somewhere around 2-2.5. Another really good strategy that works well with this age is letting them know you understand their feelings. I'll give you an example that literally just happened. 5 minutes ago, he told me wanted to watch a certain movie. I said no, and he got upset. I responded by saying, \"I know you're mad because you want to watch it now, but it's almost nap time so we'll watch it later.\" He's now fine. \n\nObviously, at 3 (he just turned 3 this week), he can understand more complex language like this. At 1.5-2.5, it was more like, \"you're mad, mad that you can't do _______. We'll do it later\" (or something like that). I can honestly say that this type of acknowledgement helps a lot at the tender age of 2. Is it perfect? No. Does it prevent every temper tantrum? No. But it makes things a lot better and makes him feel like I actually care about his feelings - which, I obviously do.  \n\nEverything takes a good few days to a week I feel, but consistency is key and eventually they figure it out. ", "controversiality": 0, "created_utc": 1403119388, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciaynq0", "link_id": "t3_28gyrk", "parent_id": "t1_ciaw43j", "removal_reason": null, "retrieved_on": 1434297832, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "I know what you mean about not thinking they'll understand. If it seems it's over her head, make very short, simple sentences. From my experience, she'll get those with some repetition. Good luck! \n\n", "controversiality": 0, "created_utc": 1403119505, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciayq0y", "link_id": "t3_28gyrk", "parent_id": "t1_ciawpe5", "removal_reason": null, "retrieved_on": 1434297862, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha! I feel your pain! I often smell my husband's beer or bourbon. Gosh, I can't wait for a glass of wine. ", "controversiality": 0, "created_utc": 1403119661, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciayt42", "link_id": "t3_28gyrk", "parent_id": "t1_ciaydw3", "removal_reason": null, "retrieved_on": 1434297902, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "smartache", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sure a lot it is just your daughters age.  That said... why did you choose to be a SAHP? Is it possible you are getting extremely frustrated with your daughter because you don't really prefer to be a SAHP? For me, personally, I know I am not cut out to be a SAHP.  My husband is the SAHP in our family. \n\nAlso there is a sub /r/SAHP, they might have some helpful insight too. :) ", "controversiality": 0, "created_utc": 1403119743, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciayunh", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434297922, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks, I was needing to change jobs and was considering staying at home for a little while just to see how it suited me. We had been able to only use daycare for a few hours a day working opposite schedules but as soon as I left my job my daughters schedule changed and now we would need full daycare before I could go back to work. So right now we're trying to decide if I can stay home, whether I can handle it mentally and if we can handle it financially.", "controversiality": 0, "created_utc": 1403121453, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciazrxi", "link_id": "t3_28gyrk", "parent_id": "t1_ciayunh", "removal_reason": null, "retrieved_on": 1434298357, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. I don't get a whole lot of alone time throughout the day. I would love to see if some alone time, completely away from her in the middle of the day would help with my patience. I'm constantly questioning whether I have the patience to be a parent. ", "controversiality": 0, "created_utc": 1403121586, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciazuie", "link_id": "t3_28gyrk", "parent_id": "t1_ciayltu", "removal_reason": null, "retrieved_on": 1434298391, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the advice. I haven't tried singing the motion songs while doing diaper changes. That could work!", "controversiality": 0, "created_utc": 1403121702, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ciazwt1", "link_id": "t3_28gyrk", "parent_id": "t1_ciay6qr", "removal_reason": null, "retrieved_on": 1434298421, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vidiuk", "author_flair_css_class": null, "author_flair_text": null, "body": "This is really encouraging. We've also been trying to get him telling us when he's upset in place of hitting. I'm hoping this works since I'm a little worried about the hitting when his little sister arrives. ", "controversiality": 0, "created_utc": 1403121964, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib01m3", "link_id": "t3_28gyrk", "parent_id": "t1_ciaynq0", "removal_reason": null, "retrieved_on": 1434298484, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok I can see myself getting SOOOOOO turned on if I did this!", "controversiality": 0, "created_utc": 1403124879, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib1l0e", "link_id": "t3_28gyrk", "parent_id": "t1_ciaydw3", "removal_reason": null, "retrieved_on": 1434299275, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I've read articles about all the tricks for tantrums but what about getting through all the tiny awful shit? All the little things like taking your shoes off every time we get in the car, or refusing to get in your carseat for 15 minutes any time we need to go somewhere, or kicking me in the face halfway through a poopy diaper change?\n\n1. Choose your battles - if she takes her shoes off in the car, start just putting her in the car without shoes. Hold her shoes up in the front with you, then put her shoes on when you get to your destination.\n\n2. Do not beg, plead, or argue with a toddler - physically place your daughter in her car seat. I'm going to estimate that you have at least 100 lbs on her. When you change her diaper, restrain her legs so she cannot kick you. Toddlers are irrational creatures driven by their desires - 90% of the time you have to physically parent them. By that I mean you have to physically move them away from the outlet, you have to physically restrain them, you have to physically put them where you want them. Otherwise you are basically just talking to a brick wall if you want them to do something that conflicts with their desires.", "controversiality": 0, "created_utc": 1403125059, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib1op3", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434299324, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Lelide", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a teacher and home for the summer with my six month old and 2.5 year old. It's crazy frustrating sometimes, but I find having a schedule helps. We go somewhere every morning. If the library's not having story time, and we don't have a play date, I go to the gym and they go to the childcare in the gym. Home by 11, lunch, independent play in her room (if you come out, I will put you in your crib.) She eventually is ready for nap, comes out to tell me she is ready, then nap. After nap we do some kind of \"activity\" bubbles, colored ice cube play, sprinkler, colored cold spaghetti, something. Then dad's home! Yay! We survived another day!", "controversiality": 0, "created_utc": 1403125083, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib1p8c", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434299331, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "momma_bunny", "author_flair_css_class": "green", "author_flair_text": "2.5 y/o little monster", "body": "I forget often as well. Sometimes they're just so frustrating! Lol! ", "controversiality": 0, "created_utc": 1403128878, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib3l8a", "link_id": "t3_28gyrk", "parent_id": "t1_ciawiaa", "removal_reason": null, "retrieved_on": 1434300220, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "liamquips", "author_flair_css_class": null, "author_flair_text": null, "body": "Toddlers are hard! My twins are only 15 months, so take what I say with that in mind. I've been staying at home with them since they were born. \n\nThis is part of the adjustment, and I go through the same adjustment when they have big changes (nap schedule changes, developmental spurts, etc). Patience, my friend. Slog through and try to make it easier on both of you in any way you can. If you just recently started staying at home, and she had been with another caregiver or in daycare, she is adjusting too! \n\nIt will get better! It is a gradual process and one day you will realize that things are much easier, and that you are used to being a sahm.\nAlso, people who say toddlerdom wasn't hard don't remember it. ", "controversiality": 0, "created_utc": 1403129729, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib3z73", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434300403, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Muficita", "author_flair_css_class": "green", "author_flair_text": "11 month old boy", "body": "Man I have so much empathy for you. I'm also SAHM to a 2.5 yr old. I love him like crazy but I get SO MAD lately, I just want to throttle him. It's the defiance, as you said, and the tantrums are just getting crazy. He never used to cry much so now that he is crying a ton, loudly, and isn't really distractible I am going craaazy. \n\nThis is going to probably sound flaky but a friend just reminded me to work on mindfulness. Like: ok, there's that feeling again, I'll just feel it, it's uncomfortable, isn't it weird how tight my chest gets? Also deep breathing or picturing yourself letting go of your anger like a leaf floating down the river or something. It all sounds pretty silly but I swear it works if you can remember to do it, and it gets easier with practice. \n\nLast suggestion, xpost to /r/breakingmom or consider subscribing over there. \n\nGood luck and hang in there mama. ", "controversiality": 0, "created_utc": 1403130763, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib4g62", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434300626, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously. I'm only 5 weeks in and though I love my little man so much I really start to watch the clock waiting for my husband to get home from work. When he has to work late I get upset (at the situation, not at him). \n\nI think it's the constancy of it. You literally never get a break. Even if they go down for a nap you never know when you might need to be 100% involved with them again. They could sleep for 2 hours or 2 minutes and you need to be ready for that. ", "controversiality": 0, "created_utc": 1403130826, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib4h7p", "link_id": "t3_28gyrk", "parent_id": "t1_ciaup2v", "removal_reason": null, "retrieved_on": 1434300639, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kat_loves_tea", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;They could sleep for 2 hours or 2 minutes and you need to be ready for that. \n\nThat is the truth! I'm 4.5 months in and some days are easy breezy and full of sweet baby smiles but days like today where she's gassy and fussy and tries to claw my face while biting my nipple and kick me in the stomach... Well let's just say it's a special kind of day and mama really wants to order sushi delivery tonight.", "controversiality": 0, "created_utc": 1403131336, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib4pmh", "link_id": "t3_28gyrk", "parent_id": "t1_cib4h7p", "removal_reason": null, "retrieved_on": 1434300749, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "themilkmaiden", "author_flair_css_class": null, "author_flair_text": null, "body": "Head on over to r/breakingmom !!", "controversiality": 0, "created_utc": 1403132353, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib565f", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434300966, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Deracinated", "author_flair_css_class": "lightcoral", "author_flair_text": "Hazel&amp;Lily", "body": "I'm also gritting my teeth, as we speak, with a mason jar of moscato, listening to my two year old scream and scream. She has a clean diaper, full bottle, full tummy, and a whole day of playtime.\n\nGod help us.", "controversiality": 0, "created_utc": 1403136441, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib6xnb", "link_id": "t3_28gyrk", "parent_id": "t1_ciaupw9", "removal_reason": null, "retrieved_on": 1434301798, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "The YMCA in our area has childcare included in the membership for 2hrs/day....they also have a cafe and library. Never worked out there before but my kids get daypasses and I get a break when it gets bad. Then we all go for a swim and head home for naptime. ", "controversiality": 0, "created_utc": 1403140922, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib8rgm", "link_id": "t3_28gyrk", "parent_id": "t1_ciazuie", "removal_reason": null, "retrieved_on": 1434302658, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "natashska", "author_flair_css_class": "blue", "author_flair_text": "2 yr old and one on the way", "body": "It takes time to adjust and you've started at a rough age. Make friends with other SAHPs and get out of the house together often. Kids playing together give you a break and another adult to talk to is good for those days when you wish you could pour spiked coffee directly into your blood steam. Try to plan ahead (extra clothes, snacks, a toy, and a little bag of bribery gummies for mommy emergencies) then get out as much as possible.", "controversiality": 0, "created_utc": 1403141248, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib8wa3", "link_id": "t3_28gyrk", "parent_id": "t1_ciazrxi", "removal_reason": null, "retrieved_on": 1434302721, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "shelllbee", "author_flair_css_class": "lightcoral", "author_flair_text": "SAHM 2 yr old daughter", "body": "I would be lying if I didn't go through these exact same things as well. It takes an ungodly amount of patience. But it sounds like you're doing well.", "controversiality": 0, "created_utc": 1403143753, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cib9xsd", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434303279, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fuschiafrog", "author_flair_css_class": null, "author_flair_text": null, "body": "I have been a stay at home mom for almost 10 years (with part time jobs on and off, for sanity) and I have days where I have a meltdown like my 3 year old.\n\n I lost more than a few years to serious depression and am only recently coming \"out of the fog.\" It took me years to admit staying at home with my kids was the reason I was depressed. I had such guilt, because I'm supposed to love this right? Meh!  I have found that if I have something to work on, a project or goal, and take time for myself to work on those, I am much happier. You know when you hear mom's say \"take time for yourself!\" And you roll your eyes, like, yeah right, who has time? For me, it helps. I have to make time.  If I go more than a few days without some separation, that's when my anxiety meltdowns happen. That reminds me to make time or else dragon lady shows up! :) \n\nAnd toddlers are hard. They just are. My 3 year can be such a terror, I have days I question having children. You are doing good, mama. :) ", "controversiality": 0, "created_utc": 1403148218, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibbpxg", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434304118, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anditron", "author_flair_css_class": null, "author_flair_text": null, "body": "One thing that worked for me was deciding what were non-negotiable  sand what (as others mentioned) is not fight worthy. Non-negotiable weren't arbitrary and all care givers must know what they are so the same rule is always enforced. Holding hand when crossing the street = non-neg. holding hands while walking down the block, ok, but stay x steps from the road. At dinner she had to have 3 bites of everything, beyond that, up to her. Hitting me, absolutely never. And when non-negs were broken she got punished. The first couple times get warnings, after that it's nuclear option (to bed until the end of the next sleep cycle) so if it's almost nap time, everything stops go to bed stay there until normal nap is over.t.\n\nFor all other things I tried to eliminate out the negotiations as much as possible or rather, control the options. We are going now, you have to wear a hoody, do you want the red or green one? Don't ask what do you want, they can't figure it out and will drag it out because their brains can't wrap around all the choices. Controlling the options limits the possibilities but gives them the sense that they are in control. The great thing here is that you know your kid and what they'll want but you know what you want them to choose, so on issues where you really want them to do this thing your way, you give them an option you know they won't like as much as the option you want them to take. And they choose what you wanted them to do. \n\nI never use just because as a reason either, I tell her the truth and am straight forward/don't sugar coat or dumb down. I might not go into super detailed reasons, I scale that to her age, but at the same time, I don't shy away from big words. Using adult terms makes her able to function around adults. Example, she could use the word conversation correctly in a sentence at 2.  I also told her I would always consider her ideas and opinions but never if they were screamed at me. I value her thoughts and wants but she has to speak them to me not scream or throw a fit.\n\nGood luck, it does get better :)", "controversiality": 0, "created_utc": 1403148897, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibbziq", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434304245, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "patchgrrl", "author_flair_css_class": null, "author_flair_text": null, "body": "I am so in your shoes and reading all the responses helped me feel not so lost and alone. I saw some post on facebook I think that had ideas for entertaining a toddler on the cheap, maybe if you Google that the ideas will come..? I am trying out the one that sounded most promising taping a cardboard tube to the wall (or in my case, three different sizes to a piece of cardboard) and letting your kid drop pompoms through them, cost $1).  Playing chase a lot helps wear me...I mean him...out. Safaris are fun and we ride the lawnmower a lot. \n\nDiaper changes for us have been improved by letting my little dude decide where he wants to be changed. He prefers his bed to the changing station and sometimes the floor. The fine art of distraction wore off its efficacy rather quickly...but practicing body parts helps. Having him lift his feet and lift his butt to help with changes has made him feel more in control too. (Lift your arm. *tickles*) We are in the beginning stages of potty training so that has to be considered. And when all else fails and I'm near the end of my rope - fucking cookies. I know its awful but my child has healthy eating habits overall so I do what I have to do (ie, pick your battles). ", "controversiality": 0, "created_utc": 1403149674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibca64", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434304388, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, hitting. Yeah, that's rough, because it's obviously a behavior that we don't want happening - especially around a baby. When my boy acts out in less-than-calm ways, I still acknowledge his feelings (\"You must be so angry to be ______, but that's not ok\". Let's take a break and calm down\".) Then, I separate us from one another. I certainly don't want to be a pushover and let it happen, but I still want him to know it's absolutely unacceptable while still letting him know I get why he did it. This type of intervention usually works. Toddlers are so fun sometimes. I am sure I'll be ready to pull my hair out in a couple weeks, once the sleep deprivation is paired with caring for a newborn and a jealous kid. \n\nSomeone else gave me some advice that I found useful. Of course, we want to promote a positive relationship between siblings, but it's okay to acknowledge that it kinda sucks from the perspective of the older child at times. For example, if I notice that my 3 year old is getting upset while I feed the baby, I might say, \"I know it's hard when mommy has to feed sister so much instead of playing. How about when Daddy gets home, you and me have some special time together?\" And then do something one on one with the older child (a walk, trip to the park, an ice cream date, etc.). From others' experiences, this seems to help with the jealousy.\n\nOh, dear. I'm freaking out now. Good luck to us all! ;)\n\n\n", "controversiality": 0, "created_utc": 1403150783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibcpf8", "link_id": "t3_28gyrk", "parent_id": "t1_cib01m3", "removal_reason": null, "retrieved_on": 1434304584, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vidiuk", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! This is all really great info. ", "controversiality": 0, "created_utc": 1403151341, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibcwyn", "link_id": "t3_28gyrk", "parent_id": "t1_cibcpf8", "removal_reason": null, "retrieved_on": 1434304682, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "You're welcome. Hope it helps. :) ", "controversiality": 0, "created_utc": 1403152783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibdfo2", "link_id": "t3_28gyrk", "parent_id": "t1_cibcwyn", "removal_reason": null, "retrieved_on": 1434304927, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RatSandwiches", "author_flair_css_class": null, "author_flair_text": null, "body": "You might be surprised how much she can understand! The key is repetition. I have a thing with my daughter where any time she is upset or tantruming, I ask her if I can talk to her \"for a minute\" (sometimes I will ask \"Can I tell you something?\" Sometimes she says no at first, and I calmly let her know that I will be right there to talk to her when she is ready. When she is calm enough to talk, I will ask her or tell her about whatever just happened (I.e., \"Mama had to pick you up because you said no to walking up the stairs\" or \"Did you feel angry because it was time to leave the playground?\") Then I try to explain why, and offer some resolution (\"I know it's sad sometimes to leave the playground, but right now it's dinner time. We can come back tomorrow to play some more.\") Does it always work? No. But it's way more effective than when I lose my temper, and I think it truly is helping her understand consequences of her actions and being able to talk about her feelings.\n\nSorry for the wall of text!", "controversiality": 0, "created_utc": 1403166330, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibgwf9", "link_id": "t3_28gyrk", "parent_id": "t1_ciawpe5", "removal_reason": null, "retrieved_on": 1434306626, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly. Sometimes I lay a contented sleeping baby down at night and smile and other times we're both crying ourselves to sleep lol. ", "controversiality": 0, "created_utc": 1403178203, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibix14", "link_id": "t3_28gyrk", "parent_id": "t1_cib4pmh", "removal_reason": null, "retrieved_on": 1434307577, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "Building on the language thing, does she have words for emotions? I tell my daughter (nearly three) about emotions all the time and have done since she was a baby. We play \"face games\" where I ask her to show me an angry, sad, happy, whatever face. I find when she's getting defiant it's often because she's angry. If I stop and as her how she's feeling and deal with whatever's bugging her, she turns into a new child.", "controversiality": 0, "created_utc": 1403181625, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibjqdj", "link_id": "t3_28gyrk", "parent_id": "t1_ciawpe5", "removal_reason": null, "retrieved_on": 1434307962, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarav", "author_flair_css_class": null, "author_flair_text": null, "body": "Good advice. I do this occasionally, but I am going to try to do it more often. Thanks for the reminder! ", "controversiality": 0, "created_utc": 1403183319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibk7sk", "link_id": "t3_28gyrk", "parent_id": "t1_cibgwf9", "removal_reason": null, "retrieved_on": 1434308189, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "I definitely like the \"you do it or I do it\" method - you get in the car or I'll put you in the car. You stop throwing the ball at the TV or I'll take away the ball so you cannot throw it at the TV and you can have it back tomorrow.\" In some instances, it is about control - getting dressed, getting in the car, brushing teeth - toddlers love control and then other times it is about discipline - throwing a ball, turning off the TV, etc. - if you don't do it I will but it comes with a price. Regardless of \"who\" does it, it gets done and you aren't begging or arguing with a ~~terrorist~~ toddler to get things done.", "controversiality": 0, "created_utc": 1403183949, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibkf1i", "link_id": "t3_28gyrk", "parent_id": "t1_ciavsf3", "removal_reason": null, "retrieved_on": 1434308285, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1403196408, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cibptve", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434310902, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha, Thanks I think. ", "controversiality": 0, "created_utc": 1403219067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cic13fm", "link_id": "t3_28gyrk", "parent_id": "t1_cib9xsd", "removal_reason": null, "retrieved_on": 1434316289, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "sarahoflayton", "author_flair_css_class": null, "author_flair_text": null, "body": "Something I wonder about when other mom's say \"take time for yourself\" is, does the 2 hours after they go to bed before I go to bed count?", "controversiality": 0, "created_utc": 1403219314, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cic177f", "link_id": "t3_28gyrk", "parent_id": "t1_cibbpxg", "removal_reason": null, "retrieved_on": 1434316327, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "fuschiafrog", "author_flair_css_class": null, "author_flair_text": null, "body": "That's what I did when I only had one child and it seemed enough at the time. When I had my second child, it became really clear that it wasn't enough for me anymore. I didn't live around family and my husband worked all the time, so it was always just me and the kids. It's so draining. It gets easier as they get older... it just feels like a fucking eternity.", "controversiality": 0, "created_utc": 1403220489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cic1opd", "link_id": "t3_28gyrk", "parent_id": "t1_cic177f", "removal_reason": null, "retrieved_on": 1434316555, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "youlleatitandlikeit", "author_flair_css_class": null, "author_flair_text": null, "body": "Here's the good bad news: you going completely crazy is absolutely normal. Few people handle it better than you are handling it now.\n\nFor the seat: does she get in the seat by herself yet? I find that having a surprise/present (usually a toy), that I display in my hand and say, \"If you can get in the seat by the time I count to five (four and a quarter, four and a half, four and three quarters…) you can play with this toy.\"\n\nSome toddlers really like the feeling of agency. If you can, try to make it seem like many of the things she has to do are things that she \"gets\" to do and has control over.\n\nAssuming you do not actually live in a china shop, if the kid drives you crazy, especially if you notice yourself getting angry, give yourself a \"time out\". Let your kid know this is happening: \"Mommy is getting angry so she gets a time out. I will be out very soon.\" Then go somewhere close by with a door and close it (bathrooms are great for this). The kid may bang on the door or yell. This is okay. Just take some deep breaths and try your best to get centered.", "controversiality": 0, "created_utc": 1403718915, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cigum1g", "link_id": "t3_28gyrk", "parent_id": "t3_28gyrk", "removal_reason": null, "retrieved_on": 1434399757, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}