{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1409236506, "domain": "playdatesonfridays.com", "full_link": "https://www.reddit.com/r/Mommit/comments/2etq3j/i_freaking_hate_mom_circles_thought_this_was_a/", "gilded": 0, "id": "2etq3j", "is_self": false, "media_embed": {}, "num_comments": 59, "over_18": false, "permalink": "/r/Mommit/comments/2etq3j/i_freaking_hate_mom_circles_thought_this_was_a/", "retrieved_on": 1441197922, "score": 88, "secure_media_embed": {}, "selftext": "", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "http://b.thumbs.redditmedia.com/6JEmvZLVoxTn6kwbzlPKY_zfoGm2W8hXYttj-MsMVLc.jpg", "title": "I freaking hate mom circles. Thought this was a good message to share here.", "url": "http://playdatesonfridays.com/2014/08/28/my-quest-to-break-the-mom-circles/"}, "comments": [{"archived": true, "author": "Popcycle-guzzler", "author_flair_css_class": null, "author_flair_text": null, "body": "She makes it sound so easy, mom groups are usually way more catty than this. I'm sure as soon as the new girl walks away they begin talking shit.", "controversiality": 0, "created_utc": 1409237477, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2tmnp", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427317135, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "All the moms in my daughter's daycare class are older than I am and they never seem too friendly. I found out we were the only ones not to get invited to a birthday party recently, and that really hurt. I was surprised at how much it upset me.", "controversiality": 0, "created_utc": 1409239362, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2uk10", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427316120, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "That freaking sucks. Not cool. I think the article was more about the people in the circle should be the one more aware. Trying to get in is hard enough. And whenever anything comes down to your kids it hurts. I'm sorry that happened to you.\n", "controversiality": 0, "created_utc": 1409239611, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2uoms", "link_id": "t3_2etq3j", "parent_id": "t1_ck2uk10", "retrieved_on": 1427316057, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm definitely going to try and be aware of it. I don't want anyone to feel that way!!", "controversiality": 0, "created_utc": 1409240640, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2v7o5", "link_id": "t3_2etq3j", "parent_id": "t1_ck2uoms", "retrieved_on": 1427315740, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "throw_away_pancake", "author_flair_css_class": "purple", "author_flair_text": "Zoey Jan 3 2014", "body": "This just happened to me earlier this week. I also got a bonus mom-shaming!\n\nI joined a local baby wearing group on Facebook to try to connect to other moms and they were having a meet up in the next town over. Another mom expressed interest in trying out my Ergo360, so I popped over with my husband. It was obvious that all of the moms there already knew each other and had established friendships as they were sitting in tight circles facing each other. I'm not shy and am generally outgoing, so I assumed I'd fit right in. I plop our blanket down and say hi to the moms next to me. \n\nOther mom: \"Oh, what carrier do you have?\"\nMe: \"An Ergo360! We picked this one because our daughter really likes facing forward.\"\nOther mom: \"Uh huh\" and she turned away. \n\nHmmm. Not the reaction I was expecting. Then the group leader came over and checked out the Ergo and was commenting how it was the better of the forward facing options out there. After hearing the group leader speak...\n\nOther mom: \"Well, I'd just NEVER forward face my child.\" The group leader at this point gave me a look as though she agreed with the other mom and proceeded to go on and on about how it would only hold a child up to a measly 30 lbs.\n\nApparently, at least from what I gathered about this mom group, is that the only acceptable baby wearing is done with either a wrap or a sling. How horrible was I for bringing an Ergo, let alone the one that allows forward facing! I quickly met up with the mom who wanted to try my Ergo (her little girl loved it by the way) and then my husband and I booked it out of there. \n\nI don't think I've ever felt so judged and isolated in such a short amount of time. ", "controversiality": 0, "created_utc": 1409242973, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2wh0d", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427314655, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BatFace", "author_flair_css_class": "orange", "author_flair_text": "R 02/2012", "body": "I'm shy, socially awkward and an introvert. I have anxiety. Even getting out to the groups is supper hard for me. My husband is military and the base has a weekly spouses group at the community center with a indoor play area. I know I should go for my son, and for a long time I did. For 4 years I went almost every week. Sometimes I'd be introduced to someone, very rarely I'd have enough courage to introduce myself. A couple times I was even welcomed into a group for a few weeks. I'm not sure if it's this base or military in general, but once it was clear that these women only ever complained about the base, their husbands or their kids, I didn't want to hang out with them anymore.\n\nThe straw that broke the camels back was my son's last birthday, he turned 2, and his birthday just happened to be on Thursday, he day of the social. I'd asked the woman who organizes it if I could bring cupcakes for the kids, I just wanted to do it for fun, to make his day special, since we were leaving town that weekend for his brithday. The woman who organized initiated singing happy birthday for him, and almost everyone ate the cupcakes. Then I over heard one group of moms, while eating my cupcakes, talk about how sad it was that we didn't have any friends of our own and had to hijack the social for a brithday party. And go on about that for a while. I felt like I was back in high school. I was just trying to be nice, and have fun. That was the last time we went. Every week I think about going back, my son would have a blast, but then I remember those moms and how awful I felt, and I just can't do it.\n\n4 years of trying to fit in, 4 years of really bad anxiety. It's just not worth it. ", "controversiality": 0, "created_utc": 1409243134, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2wkar", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427314559, "score": 30, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "honmamichin", "author_flair_css_class": null, "author_flair_text": null, "body": "As an aside, I want to say that I also have social anxiety, and getting therapy really helped. It's amazing how much more outgoing/adventurous I am and now much *less* stuff like this bothers me. Don't get me wrong, those women talking about you are horrible and I don't blame you for not wanting to spend time with them ever again. It's just that I know there's a stigma against getting help for conditions like anxiety (\"like just get over it, amirite?\"), and it stops a lot of people from even seeking help, but it was really the best thing I ever did for myself. The anxiety is still there, of course, but it doesn't control me anymore. If you haven't tried it before, it might be worth looking into.", "controversiality": 0, "created_utc": 1409244315, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2x8jd", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wkar", "retrieved_on": 1427314084, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe the article should be rewritten: breaking into the right moms circle. That experience sounds like it sucks, but I like the advice below. Don't let it stop you from being a circle breaker. Sometimes people just suck.\n", "controversiality": 0, "created_utc": 1409244566, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2xdms", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wkar", "retrieved_on": 1427314019, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BatFace", "author_flair_css_class": "orange", "author_flair_text": "R 02/2012", "body": "I know. And I have no real excuse, since I get care for free. But I just haven't been able to get over that hump. I'm terrified of strangers, so I need to go talk to a stranger for help....", "controversiality": 0, "created_utc": 1409245400, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2xulw", "link_id": "t3_2etq3j", "parent_id": "t1_ck2x8jd", "retrieved_on": 1427313594, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SugarandSass", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh, that's awful. I'm a member of the babywearing group in my area on Facebook, but haven't been to a meeting in person yet, so I'm nervous for a similar experience. My daughter loves facing forward too, and there are ways to do it safely (like with your Ergo 360, which I totally want to try too). Those judgy bitches are not helping the cause! Rude!\n\n\nI notice a lot of woven wrap snobbery in my local group too, and I use our k'tan more than anything, so I'm preparing myself for unpleasantness and hoping I'll be surprised!", "controversiality": 0, "created_utc": 1409245994, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2y6c3", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wh0d", "retrieved_on": 1427313440, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously, you guys are all passionate about baby wearing and there's still the Judge Judies out there on the right way to do it? Isn't that like saying if you're breastfeeding only do it from the left boob? WTH are people thinking...", "controversiality": 0, "created_utc": 1409246742, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2ykyb", "link_id": "t3_2etq3j", "parent_id": "t1_ck2y6c3", "retrieved_on": 1427313250, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Zifna", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for posting this. I've been on a several-month quest to find \"mom friends\". It's harder than I would have thought.\n\nSomeone posted below about people reacting negatively to their choice of carrier. I feel for her, but those kinds of situations are tough in some ways. If one of the moms had responded to her, \"Ah, we went with this Mei Tai since we're not comfortable with the strain forward-facing puts  on the crotch,\" it's likely that would have been seen as hurtful as well. \n\nMany people put a lot of thought into the choices they make for their children, and get very up-in-arms when people make different choices - as if the fact that they didn't make the choice you made is a slight to you, specifically. I'll even see people be preemptively aggressive - like \"Oh, I work so my son's in daycare... WHICH IS SO GOOD FOR HIM. Kids who don't go to daycare are SO deprived. Where do you work? Or... do you stay home?\"\n\nDoes anyone have a good way to navigate this? Sometimes it's probably okay to just walk away due to different parenting decisions (i.e. anti-vax parents). But if someone has made a more trivial decision you disagree with/did differently, how do you gracefully navigate the discussion to a friendly place without talking down your own choices/pretending to think their choices are the best.\n\nI see people say \"Well, we each do what we think best\" but that seems hostile-ly received as well sometimes.", "controversiality": 0, "created_utc": 1409246904, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2yo5p", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427313210, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SugarandSass", "author_flair_css_class": null, "author_flair_text": null, "body": "I know. People love to find ways to be judgy douchebags.", "controversiality": 0, "created_utc": 1409247690, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2z3mq", "link_id": "t3_2etq3j", "parent_id": "t1_ck2ykyb", "retrieved_on": 1427312775, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I run into this a lot, particularly when it comes to snacks, lunches, etc. I have a daughter with a neurological condition, so I'm pretty careful about what I feed her as it relates to dyes and artificial ingredients. I've had moms I actually like say some pretty nasty things to me, and I usually say something like: I think everyone has their parenting \"thing\". This is totally mine and I know I'm crazy about it but it makes me feel more in control if I do it this way.\" People usually respond pretty well. I know I shouldn't have to say it, but it's easier. Usually if they are reacting that way, it's about THEM and something they are insecure about, so just stay strong in what you believe in and eventually you'll meet like minded people, or people who aren't as close minded.", "controversiality": 0, "created_utc": 1409247935, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2z8ed", "link_id": "t3_2etq3j", "parent_id": "t1_ck2yo5p", "retrieved_on": 1427312716, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not easy. It sucks. But if you think all the moms are catty, you're probably coming off that way too.", "controversiality": 0, "created_utc": 1409248432, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck2zi48", "link_id": "t3_2etq3j", "parent_id": "t1_ck2tmnp", "retrieved_on": 1427312346, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Angel3", "author_flair_css_class": null, "author_flair_text": null, "body": "Am I the only one who has never even thought of getting involved in a mom circle? Maybe its because I'm old, 40 with a 1 year old, but it never even dawned on me to actively try to involve myself with a bunch of moms.  Honestly the idea of it even sounds awful.  I'm an outgoing person for the most part but I have my friends.  A couple have toddlers, one has a grand baby, and the rest either have adult children or no kids at all. My son socializes with whom ever is around, child or adult and spends time at the playroom at the gym when I go.  I figure that's good enough.  As he gets older I'm sure hell have school friends or whatever but why would I have to go try to hang out with a bunch of women?  ", "controversiality": 0, "created_utc": 1409251846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck31bv0", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427311106, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "titsmcfly", "author_flair_css_class": "blue", "author_flair_text": "Mom of a 2 year old", "body": "Oh god, that sounds awful! I'm part of a Facebook group for cloth diaper moms, and I've never been to one of their meet ups, primarily because I'm scared of something like this happening. I don't have any mom friends and it really hurts sometimes. I don't want my kiddo to pick up on my feelings of isolation or become shy as a result, as he's a pretty outgoing little dude naturally. ", "controversiality": 0, "created_utc": 1409253391, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck325p2", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wh0d", "retrieved_on": 1427310535, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "Sigh. My husband is a pipeliner and we move frequently as a result. I have 2 boys - 3 and 1 - and am always by myself at the park, library, etc. I have social anxiety, but I am very tough on myself to do stuff despite not wanting to for them. But my various efforts to join play groups have failed. I'm always the youngest mom there (I'm 24) and I happen to do the more natural stuff - cloth diapers, breastfeed, baby wear, etc and I guess that makes me the 'weird mom' a lot. I don't get invited back after my first meet up and it's tough. I want my boys to have friends and to have other moms to chat with about mom stuff, but no one wants to give us a chance. Maybe things will change since my son is starting preschool next week but I doubt it. No one talked to us at his open house and they all got groups and chatty while I stood alone with my husband. ", "controversiality": 0, "created_utc": 1409254102, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck32jo6", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427310283, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bekahbv", "author_flair_css_class": "red", "author_flair_text": "Two Girls Ages 16 and 5", "body": "As a former military wife, I understand completely. But there ARE good military wives. They just aren't at those socials, from my experience. They are on the fringes, like you. I remember all too well those socials. I went to them too. I only lasted through four and never went back. My husband was how I made some of my military wife friends. The rest I met on base, at the commissary, or at civilian classes (mommy and me classes and such) at the library. ", "controversiality": 0, "created_utc": 1409254728, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck32vwn", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wkar", "retrieved_on": 1427310123, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Popcycle-guzzler", "author_flair_css_class": null, "author_flair_text": null, "body": "I never said all moms were catty, I said mom groups are catty. I don't belong to any or have any interest in them after being to a couple play groups and attempting to join a moms meet up club. Yeah, never again. ", "controversiality": 0, "created_utc": 1409255662, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck33e1n", "link_id": "t3_2etq3j", "parent_id": "t1_ck2zi48", "retrieved_on": 1427309889, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry you had bad experiences. I've moved around a lot, and that's always how I made friends. I didn't like everyone, but if you keep trying, you usually find people just like you. But I get it. \n", "controversiality": 0, "created_utc": 1409255905, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck33iv0", "link_id": "t3_2etq3j", "parent_id": "t1_ck33e1n", "retrieved_on": 1427309825, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "megalynn44", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm actually on both sides of this blog. I'm semi0new to my town and don't know a lot of people, practically zero fellow moms- especially with a child my baby's age. But I'm also the type to get exhausted having to spend time with a bunch of people I don't really know. Throwing me into a party is a terrible way for me to meet people. I'm much better at forming friendships one on one and prefer the company of people I know well. I guess that's why I still spend most my time alone with the baby. ", "controversiality": 0, "created_utc": 1409256250, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck33ph2", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427309740, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I hear you. I don't think you have to get \"into\" a circle, but if you are standing somewhere public, don't shut anyone out. It's really just about reaching out instead of shutting out. But I'm not quite sure why trying to involve yourself with a bunch of moms sounds awful? And I'm 41!\n", "controversiality": 0, "created_utc": 1409256551, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck33vbb", "link_id": "t3_2etq3j", "parent_id": "t1_ck31bv0", "retrieved_on": 1427309664, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "IslaGirl", "author_flair_css_class": "lightcoral", "author_flair_text": "14 and 11 year old girls", "body": "I had an awful time trying to find a circle when we moved last time (didn't have to be a mom circle, but other parents is the easiest place to start when you're a busy parent).  All the moms I met at my older daughter's school had their circles and were oblivious to everyone else (I choose to think they are oblivious rather than purposely being catty). For some reason I kept being thrown in with the same damn moms at school and at sporting events.  It sucked and made me feel very insecure. \n\nAs it happened, the one time they actually did bring me in changed my life, but not how you'd think.  My husband and I were having dinner and the queen bee's husband (who recognized us from soccer) invited us to join them and one other couple at their table.  Being invited in did so much for my confidence that night, I approached another couple later on at a nearby table to introduce myself - I recognized him as a local twitter presence and we'd interacted there.  Fast forward five years and his wife is my best friend and we have a tight circle of friends who we have a blast with.  It's a great circle, and I can't think of a single one who isn't completely welcoming of new people.  So refreshing!\n\nIt's amazing how much those feelings of insecurity can inhibit you - how quickly you can feel like you were thrown back to high school.\n\n", "controversiality": 0, "created_utc": 1409256564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck33vka", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427309661, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Letshelpthefatguy", "author_flair_css_class": null, "author_flair_text": null, "body": "Same here. My son is a little over a year old and we still breast feed though he does eat whatever we eat as well. I'm also 23, all the other moms I've met were older and so critical of what I was doing. Just waiting for me to do something wrong so they could comment. \n\nOh, I also look like I'm still in high school which makes it SO much worse. I get snarky remarks like \"I can't imagine having a child at such a young age.\" Then don't! Wtf. \n\nI'm supposed to meet with a new group but I'm really hesitant about it, I hope it goes well. I just moved to a new state with no friends or family here and this is like my one way of getting to know people. ", "controversiality": 0, "created_utc": 1409262785, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck374yk", "link_id": "t3_2etq3j", "parent_id": "t1_ck32jo6", "retrieved_on": 1427308139, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Angel3", "author_flair_css_class": null, "author_flair_text": null, "body": "Just doesn't seem like a good time to me.  I don't have too many typical female interests so usually gatherings of women bore me.  Add to that the preachy judgemental crap and it is far removed from my idea of fun.  ", "controversiality": 0, "created_utc": 1409264904, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck386m1", "link_id": "t3_2etq3j", "parent_id": "t1_ck33vbb", "retrieved_on": 1427307651, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "honmamichin", "author_flair_css_class": null, "author_flair_text": null, "body": "I completely understand. It's so worth it to work up the courage and just go, though. Even if you can just try it once, I think that would be a huge step all on its own. ", "controversiality": 0, "created_utc": 1409266032, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck38qah", "link_id": "t3_2etq3j", "parent_id": "t1_ck2xulw", "retrieved_on": 1427307396, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1409268305, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck39t5r", "link_id": "t3_2etq3j", "parent_id": "t1_ck2uk10", "retrieved_on": 1427306892, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "throw_away_pancake", "author_flair_css_class": "purple", "author_flair_text": "Zoey Jan 3 2014", "body": "I think wording and tone will really make or break the conversation. \n\nI was the one who posted about the carriers, and if the other mom would have said something more encouraging like, \"that's great that you're into baby wearing and that you found something that works for you\" instead of being snobby with \"I'd never use the carrier you picked out\" I don't think I would have been so hurt by it. I'm totally a 'do whatever works for your family' kind of person and never realized how judgy people are towards EVERYTHING until I became a parent. ", "controversiality": 0, "created_utc": 1409268379, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck39udx", "link_id": "t3_2etq3j", "parent_id": "t1_ck2yo5p", "retrieved_on": 1427306876, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "imnotacrazyperson", "author_flair_css_class": null, "author_flair_text": null, "body": "OH god no, I have no interest in being involved with other moms on a regular basis.  I mean, no offense ladies, I just get annoyed easily and have zero ability to bite my tongue. ", "controversiality": 0, "created_utc": 1409270144, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3anzk", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427306481, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "It's really tough! I always try to say hi and be friendly towards the other parents, tell them how cute their kids are. We seem to be in a spot where she is one of the few only children, with the other kids having older siblings the same age so their parents have known each other awhile.", "controversiality": 0, "created_utc": 1409270684, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3awxt", "link_id": "t3_2etq3j", "parent_id": "t1_ck39t5r", "retrieved_on": 1427306366, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "I was 25 when my daughter was born. Most of the parents of the kids at her daycare are well into their 30s and early 40s. I feel like I will never fit in! She was one of only two breastfed babies in her class. I feel pretty lonely but I'm hoping that when she starts kindergarten there will be a better mix of parents for me to get to know.", "controversiality": 0, "created_utc": 1409271407, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3b97s", "link_id": "t3_2etq3j", "parent_id": "t1_ck32jo6", "retrieved_on": 1427306207, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm interested that you choose to move with the pipeline work. My father runs a hoe and he would always leave for work while we stayed in one location. It had a different set of difficulties, for sure, but I wonder if you might find it easier to deal with the kids that way. We knew families who did what you are doing, but I never gave much thought to how that would work.", "controversiality": 0, "created_utc": 1409272582, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3btjf", "link_id": "t3_2etq3j", "parent_id": "t1_ck32jo6", "retrieved_on": 1427305942, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1409272900, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3bywf", "link_id": "t3_2etq3j", "parent_id": "t1_ck3awxt", "retrieved_on": 1427305873, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Feet2Big", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a huge introvert, and I'll usually shy away from interactions if given the chance. But I feel it's really important to give my LO examples of healthy adult interactions, so I will be taking this article to heart and try to get out there and be involved.  Twist: I'm a stay-at-home Dad.", "controversiality": 0, "created_utc": 1409274185, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3ckew", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427305594, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "I love this! I'm a weird mix of introvert and extrovert. Around those I know well, I'm talkative and outgoing and tend to say dorky things to make people laugh. But when I'm around a group of people I mostly don't know (or worse, *entirely* don't know!), I clam up. It's scary. I don't know how to put myself out there, or what to talk about; I'm afraid that people won't like me because, as I said, I'm kind of a dork; and I tend to stick to my own company because it's easier. Sometimes I break out of this, but not every time, and it's just hard. It's weird, because with kids I'm not really shy at all. I love kids and it's fun to get to do kid things with them - I'm always down for a game of tag, or hide-and-seek, or grounders, and I love running and climbing and cutting up. Just because I'm 30 doesn't mean I have to act like it. lol And kids are cool with that. But other adults...? Not so much. I'm always the only mom at the park who's running around and actively playing kid games. And it makes me feel like maybe other moms see me as an overgrown kid and not a peer.\n\nAnyway, all that to say, I wanna break circles too! I want to be the kind of person who can make the other shy parents feel welcomed and included. I want to be brave enough to break into circles and become part of them.", "controversiality": 0, "created_utc": 1409274612, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3crgo", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427305504, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, that was super catty of her! Imagine what it must be like to live in a mind as petty as hers. Yikes.\n\nI also hear you about moms and complaining...I can't stand it when women get together and spend the majority of the conversation talking smack about their partners and children. I've seen moms do that *in front of their kids*. WTF? And then they wonder aloud why their child doesn't behave or seems withdrawn and sullen...duh, it's because of you, genius! Anyway, it's rude and tasteless to air everyone's dirty laundry like that. If you're stressed, you phone one friend that you can trust and talk it over like that - you don't just snark about your problems to everyone!", "controversiality": 0, "created_utc": 1409274810, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3cuv9", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wkar", "retrieved_on": 1427305461, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": ":(   That's lousy. Some people never grow out of high school drama.", "controversiality": 0, "created_utc": 1409274885, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3cw4z", "link_id": "t3_2etq3j", "parent_id": "t1_ck2uk10", "retrieved_on": 1427305442, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "...seriously? How petty of them. Forward facing carriers are the shizz - your baby can actually see stuff and breathe. I never could make wraps work! We had a good old-fashioned Snuggli, found in a second-hand store, fresh from the 90s, and I wore the shit out of that thing. We also had an old second-hand baby backpack. I will never understand why so many people need to judge other parents over something as unimportant as what sort of baby wrap they use.", "controversiality": 0, "created_utc": 1409275086, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3czhm", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wh0d", "retrieved_on": 1427305399, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1409275623, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3d8s1", "link_id": "t3_2etq3j", "parent_id": "t1_ck33vbb", "retrieved_on": 1427305278, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Misschiff0", "author_flair_css_class": null, "author_flair_text": null, "body": "Amen, Angel3. This is going to sound awful, but I kind of avoid other women with children who I was not friends with prior to having a child in the same way I avoid coworkers in my off hours. I love my sons and I love my job, but when I do have free time, I don't want to spend it talking about either of those topics.\n", "controversiality": 0, "created_utc": 1409275649, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3d97o", "link_id": "t3_2etq3j", "parent_id": "t1_ck31bv0", "retrieved_on": 1427305273, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "themelephant", "author_flair_css_class": null, "author_flair_text": null, "body": "What an awful thing for them to say.I've seen lots of moms do that in similar situations and that thought never occurred to me. I'm sorry to read that happened.", "controversiality": 0, "created_utc": 1409275859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3dcvc", "link_id": "t3_2etq3j", "parent_id": "t1_ck2wkar", "retrieved_on": 1427305226, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "themelephant", "author_flair_css_class": null, "author_flair_text": null, "body": "I remember finding that out at my son's preschool and it was sad for me. Luckily,he has made a couple of friends since he started elementary school. I hope things get better soon.", "controversiality": 0, "created_utc": 1409275879, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3dd8j", "link_id": "t3_2etq3j", "parent_id": "t1_ck2uk10", "retrieved_on": 1427305220, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BatFace", "author_flair_css_class": "orange", "author_flair_text": "R 02/2012", "body": "Yeah. I keep hoping it's just this base. This is the smallest air force base, with the lowest allowances. Funnily enough we also just won an award and money for being the \"best\" air force base. But I believe that is only because this is a training base, most of the people stationed here are just to support the students and teachers, so there is plenty of time to keep things clean and up to exact standards, and the very few real missions they get they make sure the most experienced get on them and they are almost always completed perfectly. So I really hope the next base is better. According to command they are trying to change the station of everyone who's been here 5 or more years and we've been here 5 this month.\n\nWhat got me was that it wasn't just a comment, this group of girls chatted about it and made assumptions about my life and my family. We had an awesome brithday for my son with our very large family, and I so wanted to go back and start loudly showing off the pictures. ", "controversiality": 0, "created_utc": 1409278744, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3epjg", "link_id": "t3_2etq3j", "parent_id": "t1_ck3cuv9", "retrieved_on": 1427304594, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BatFace", "author_flair_css_class": "orange", "author_flair_text": "R 02/2012", "body": "Yes, that was my thought, my family and where I'm from it was a common thing to do. I just couldn't believe how much they talked about me and made assumptions about my life. What kind of people get that much pleasure from making other people's life so terrible.", "controversiality": 0, "created_utc": 1409278819, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3eqrb", "link_id": "t3_2etq3j", "parent_id": "t1_ck3dcvc", "retrieved_on": 1427304579, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "BatFace", "author_flair_css_class": "orange", "author_flair_text": "R 02/2012", "body": "Yeah. I keep hoping it's just this base. This is the smallest air force base, with the lowest allowances. Funnily enough we also just won an award and money for being the \"best\" air force base. But I believe that is only because this is a training base, most of the people stationed here are just to support the students and teachers, so there is plenty of time to keep things clean and up to exact standards, and the very few real missions they get they make sure the most experienced get on them and they are almost always completed perfectly. So I really hope the next base is better. According to command they are trying to change the station of everyone who's been here 5 or more years and we've been here 5 this month.\nWhat got me was that it wasn't just a comment, this group of girls chatted about it and made assumptions about my life and my family. We had an awesome brithday for my son with our very large family, and I so wanted to go back and start loudly showing off the pictures.", "controversiality": 0, "created_utc": 1409278939, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3espt", "link_id": "t3_2etq3j", "parent_id": "t1_ck32vwn", "retrieved_on": 1427304553, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Misschiff0", "author_flair_css_class": null, "author_flair_text": null, "body": " “I just want to hang out with the people I know already like. I mean, I have my family and my close friends…is it wrong that I don’t want to spend what little free time I have with people I don’t even know if I’ll like?”\n\nNo, it's not wrong. I could not agree more with this woman. She did you a favor by being honest with you- she flat out said that she wasn't in a place where she wanted new friends.  OK, fine, move on. Try and respect that. It's refreshingly honest. There's nothing inherently mean girl about not wanting to extend yourself to get to know a new individual. Yeah, she could be missing out on something amazing, but that's her potential loss. I think there's real value in consciously choosing to have fewer but deeper connections and in investing the time to nurture those connections. ", "controversiality": 0, "created_utc": 1409281554, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3fz2i", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427304004, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "yeuxsee", "author_flair_css_class": "green", "author_flair_text": "O, 1/14/13", "body": "I tired to keep up \"mom friends\" with some ladies from our Bradley Class but it never really clicked - we're just waaaay different people. I'm so thankful many in my social circle are all havin kids at the same time. It's so much easier. Besides, having grown up friends when I was a kid was really cool so I hope my little dude feels the same way. ", "controversiality": 0, "created_utc": 1409281953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3g5bb", "link_id": "t3_2etq3j", "parent_id": "t1_ck31bv0", "retrieved_on": 1427303923, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bekahbv", "author_flair_css_class": "red", "author_flair_text": "Two Girls Ages 16 and 5", "body": "I've noticed that some military wives get catty. It is usually those that feel they are \"better\" then the others. Usually, once their husbands find out the way they are acting, they have a reality check with them, but sometimes, the husband is just as bad.\n\nMy ex and I were stationed at Naval Station Norfolk. It's big. I believe it is the largest naval station in the world. It's the same situation there. Though, like I said, there are ways of meeting other, not so catty, military wives. I was lucky enough to live on a very large military base that also had families from every branch of the military and there were also four other naval bases (Oceana, Dam Neck, Little Creek, and Portsmouth), an army baase (Fort Eustis), Coast Guard (Hampton Roads), and, of course, Langley AFB. There were a lot of military spouses to meet. \n\nHopefully, you will get a station change soon and get the chance to meet some really awesome military wives. I have a friend whose husband is stationed at Tyndall AFB and seems to really enjoy it there. \n\nI understand completely about the pictures. I wanted to do that regularly with the majority of the wives I met. I got along with the husbands and service members more than the wives. I don't know what it is with some of the wives that made them so snooty, but I couldn't deal with it. The guys tended to be more down to earth. But keep in mind, just because you are a military wife, it doesn't mean your friends have to be military wives. You would be surprised at how many civilians would understand the crap you have to deal with. ", "controversiality": 0, "created_utc": 1409285066, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3hf1g", "link_id": "t3_2etq3j", "parent_id": "t1_ck3espt", "retrieved_on": 1427303332, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Neerganna", "author_flair_css_class": "green", "author_flair_text": "Nell 5, Ez 3, Ley 1", "body": "Yes! I agree. I'm not an unfriendly person. I mingle at church, talk to every mom and dad who bring their 3 year old to my class. I make friends with the other parents walking to school. If I'm with just a friend or two at the park, we will hang out with the mom who seems lonely. I chat with people in grocery store lines. I know all our neighbors and visit with them at least once a week. \n\nBut I'm not inviting every solo mom I see at the park to join my friends in our group time. The author may think it's rude, but we see each other maybe once every three months. We want to talk about sex, pooping, periods, breastfeeding, our parents, someone's cancer scare, who is the next to have a baby, and the status of foster children we know. We want to gossip without being judged. We don't invite strangers dining alone to join us when we are out to dinner together, and I don't see why we should be expected to do so at the park.\n\n That's not to say we are rude! I know big groups (there's 6 of us) are intimidating. We say hi, encourage the kids to involve everyone in games, etc. We just make sure to sit a little further away from the general parent area to ensure our privacy. If someone breeches the bounds to insert themselves in our circle, it generally doesn't go well.  Not everyone in the world needs to be friends.", "controversiality": 0, "created_utc": 1409285949, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3hrg2", "link_id": "t3_2etq3j", "parent_id": "t1_ck3fz2i", "retrieved_on": 1427303170, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "FrancisScottMcFuller", "author_flair_css_class": null, "author_flair_text": null, "body": "I look younger then I am and on top of that most moms around me are 10-15 years older then me. I am 27 and my oldest one is 4, I kid you not all the moms that were using the same preschool as me looked at me like I was way too young to have kids. I am really friendly and can have a conversation with just about anyone but they probably feel like they are more mature then me? Idk I really never wanted to be a part of these circles mostly because I have over heard conversations they have and I want no part of that.", "controversiality": 0, "created_utc": 1409286191, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3hurb", "link_id": "t3_2etq3j", "parent_id": "t1_ck2uk10", "retrieved_on": 1427303128, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 45 with a 5-year-old. Moms are still catty, and I always feel the odd one out because I'm older than most parents in my child's age group and because we aren't living in a 6 bedroom house carved out of the mountain. Most of my friends are the kids' grandparents, who are 10, 20 years older than me. They are done with that bullshit. ", "controversiality": 0, "created_utc": 1409292495, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3jwff", "link_id": "t3_2etq3j", "parent_id": "t1_ck31bv0", "retrieved_on": 1427302083, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Angel3", "author_flair_css_class": null, "author_flair_text": null, "body": "exactly! Most of my friend's kids are at the age where they'll be having kids soon.  I don't need some 20 year old who still hasn't figured out the real world doesn't work like high school telling me about how I should be raising my child.  I had 20+ years of observing how good moms and the not so good moms raised their children.  Further more, I have no want to try to tell anyone else how they should raise their children.  Breastfeeding bottle feeding, baby wearing stroller sitting, cloth diaper disposable.  If these wack-a-do chicks think any of that matters in the long run they're fooling themselves.  Rant over.", "controversiality": 0, "created_utc": 1409306952, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3mqxm", "link_id": "t3_2etq3j", "parent_id": "t1_ck3jwff", "retrieved_on": 1427300714, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband works in an office doing title (legal paper work and such to get rights to build from land owners) and projects last for 2-3 years. I couldn't imagine it want to be away from him 99% of the time. It'd be like I wasn't married and my kids don't have a dad. They need him and I need him. I wouldn't do it any other way. Maybe if my kids were older but defiantly not right now. Yes moving is hard but not moving would be harder on us. Other people who don't move are much stronger than I am for sure. ", "controversiality": 0, "created_utc": 1409316604, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3p05s", "link_id": "t3_2etq3j", "parent_id": "t1_ck3btjf", "retrieved_on": 1427299662, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh we've breastfed past the one year mark as well and find it hard to find anyone who's understanding. I got really lucky here and happened to book a hotel room next to a mom who's got two boys my boys age and breastfeeds and cloth diapers. She also home schools which is awesome because I want to do that with my kids, just not sure where to start so she's going to help. Her husband works in the same field as mine sort of lol and so they move a lot as well. Our boys seem to get along great :) ", "controversiality": 0, "created_utc": 1409316825, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3p2pz", "link_id": "t3_2etq3j", "parent_id": "t1_ck374yk", "retrieved_on": 1427299628, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "You're not the only one.\n\nI'm pretty friendly with people, and if we go to the park or something I'll chat here and there with people, but for the most part I sit on a bench and watch my kid play (or play with him) while the other moms circle or pair up.  Doesn't bother me at all, but I'm pretty introverted and perfectly happy standing by myself under a tree, not talking to anybody.  \n\nFor whatever reason when I start chatting with moms or trying to do the circle thing, I just don't have a lot in common with most of them, so it doesn't feel genuine.  There are a few parents from daycare I really like and seem to get along with, and I could see us getting together in the future, but see no need to go bust circles or be included in Mom-Groups.  Just not my thing, I have some other circles I'm part of, friends from before I had my son, and that is fulfilling and enough.  I think more social obligations on top of everything else in my life would just stress me out. ", "controversiality": 0, "created_utc": 1409318956, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3ptid", "link_id": "t3_2etq3j", "parent_id": "t1_ck31bv0", "retrieved_on": 1427299281, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "herbertbadgery", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a hard time meeting people as well. Especially in groups. I have a bit of a problem with hearing things, and I never can tell if it's my anxiety manifesting or really somebody being horrid. Since little bit was born I'm having a better time of it, but I dread the sound of somebody's voice saying I'm ugly or not cool enough to be wherever I happen to be.\n\nSo when my son was born, I promised myself I'd try really really hard for his sake; there's no reason I should raise a scardey-cat like myself. We've been going to baby and toddler playgroups and a really nice breastfeeding support group. The playgroup was kinda clique-y, but the breastfeeding support group is filled with other moms like me who don't have many mom friends and are just starting to navigate the world of nursing in public and making sure our children are fed.\n\nToday we're going to try the local baby wearing group. I can tell that it's all about the wraps by the facebook posts, but I'm hoping somebody can help me with my Ergo.\n\nI have been very fortunate these past few weeks I've been reaching out. I went to The Big Latch On about a month ago at a natural birthing center and found a whole bunch of great support and play groups. Thus far I've found pretty nice moms and super supportive places to meet them. I hope it continues.", "controversiality": 0, "created_utc": 1409325874, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3swj9", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427297771, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "My closest friend here is a grandmother, and a few of them are in my daughter's age ranges: 4, 6, 9. She's an \"outsider\" like me and in our small town, we both feel like the other families here are way too judgmental and snobbish. We bonded over that originally, and then we found out we really do enjoy each other's company. \n\nOne of the moms here will not speak to us and avoids us like the plague. One time I decided to try and be nice to her and chat. She looked like she wanted to vomit before answering. The conversation was brief and awkward. So hubby and I decided to kill her with kindness, so to speak. We will smile and be friendly. If she chooses to act like a bitch, then it's on her. \n\nSo, at a community barbeque, the only seat available near us was a seat right next to her, so hubby sat down next to her. She looked at him with a strained smile, got up, and left. She was done eating, anyway. ", "controversiality": 0, "created_utc": 1409328960, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3uhoh", "link_id": "t3_2etq3j", "parent_id": "t1_ck3mqxm", "retrieved_on": 1427297030, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "doidaredisturb35", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you're terrific.  You made me feel so calm, just reading this, knowing that other moms might---JUST MIGHT--be just like you. &lt;3\n", "controversiality": 0, "created_utc": 1409332607, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3wee3", "link_id": "t3_2etq3j", "parent_id": "t3_2etq3j", "retrieved_on": 1427296140, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah, I see. That is quite different circumstances. The pipelining I know is work here 8 months, there 6 weeks, back here for a week, laid off three months...", "controversiality": 0, "created_utc": 1409332846, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck3wizd", "link_id": "t3_2etq3j", "parent_id": "t1_ck3p05s", "retrieved_on": 1427296080, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "themelephant", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess some people can be be catty about anything.", "controversiality": 0, "created_utc": 1409351724, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck461ay", "link_id": "t3_2etq3j", "parent_id": "t1_ck3eqrb", "retrieved_on": 1427291545, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "PineappleZest", "author_flair_css_class": null, "author_flair_text": null, "body": "I hear you. I had my first son at 24. I live in a small town, so there seems to be quite a few other younger Moms (seriously, when did having kids in your 20s turn into being a young Mom?), but we moved here right before my son was born and we know *no one*. I work full-time, so I'm not available for playgroup things or volunteering at his school. I've met a few parents at his school and while he was playing soccer, but it's still so strange. Our conversations begin and end with comments about our kids.  *Sigh* It really is no surprise that most parents end up with no friends by the time their kids are teens.", "controversiality": 0, "created_utc": 1409599459, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck6g0oh", "link_id": "t3_2etq3j", "parent_id": "t1_ck3b97s", "retrieved_on": 1427252651, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}