{"submission": {"author": "Catbunny", "author_created_utc": 1254963270, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_3nzkr", "created_utc": 1409854740, "domain": "self.Mommit", "edited": 1409886159, "full_link": "https://www.reddit.com/r/Mommit/comments/2fh54f/mommit_i_need_help_dealing_with_my_wellmeaning/", "gilded": 0, "id": "2fh54f", "is_self": true, "media_embed": {}, "num_comments": 59, "over_18": false, "permalink": "/r/Mommit/comments/2fh54f/mommit_i_need_help_dealing_with_my_wellmeaning/", "retrieved_on": 1441186876, "score": 32, "secure_media_embed": {}, "selftext": "What is the best way to deal with a family member who likes to buy useless or one use items as gifts?  My MIL is being very thoughtful and loves buying stuff for her kids (and now grandchild).  More often than not we end up with things we aren't going to use or that just take up space.  \n\nI should mention that she has no concept of clutter. She and my FIL probably still have everything they have ever brought ever, as well as stuff that other people were getting rid of.  Currently I know they are on their way down with a 25 year old Little Tykes slide that her youngest son had.  Her kitchen is over flowing with gadgets that are for one specific function.  Last time she was out here she randomly got us a salt block for cooking food on. It is neat, but pointles and takes up space. We barely have room for the things we DO use, let alone something that we will use once as a gimmick.\n\nI would like to nip this in the bud now before it becomes a bigger issue with my daughter, but want to do so as nicely as possible.  I know she is just being thoughtful so I don't want to insult her.  She can sometimes take things the wrong way and be very passive-aggressive about it.\n\n---------------------------------------\n\nEdit:  As this is getting bigger than I expected, I am going to start listing some of the suggestions from below for the people coming here for that reason.\n\n- Being honest and forward about not needing things.  Many below have tried this and it has either worked with mixed results or hasn't worked at all.  Eventually you may just need to gently hurt feelings by returning items to stores, donating them to Goodwill, or flat out sending them back with the giver.\n\n- Have them keep the toys at their house.  This would work especially well if you are visiting them a lot or your child stays there a lot.  In our case they are 8 hours away so it isn't a good option, especially since we are trying to keep them from adding mroestuff to their over-filled house.\n\n- Divert the energy from buying things into somethine else.  Experiences such as memberships to museums or zoos were one way to do this.  We belong to a Fine Arts museum that has art classes from infants on up, and so far they have been fun.  We may try and ask for gift certificates towards her classes.  College funds such as 529 plans that anyone can contribute to was another suggestion.\n\n- Flat out tell them exactly what you need.  As one person said \"I know you are awesome with finding things at garage sales. We could really use a ______. Call me if you see one!\" If they are the type that likes to buy things for people, they will likely just pay for it themselves.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Mommit - I need help dealing with my well-meaning MIL in regards to a minor issue.", "url": "http://www.reddit.com/r/Mommit/comments/2fh54f/mommit_i_need_help_dealing_with_my_wellmeaning/"}, "comments": [{"archived": true, "author": "goddesspyxy", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have the answer, but if you figure it out, please let me know. Mine does something similar: she buys things that seem useful, but in iterations that make them not very useful, or worse - things we already have. Like navy blue throw pillows (there's nothing navy in my whole house) and piles and piles of blankets that are too small for a bed but too big for a throw on the couch, or kitchen gadgets that I already own. Who needs two food grinders? Not me. \n\nThe thing I've noticed is that she doesn't think much about what we might really want or need. Instead, she sees something that she likes and would buy for herself and assumes that everyone else would also want it. I have yet to figure out how to address it, so we just collect these things until I do a Goodwill purge.", "controversiality": 0, "created_utc": 1409855383, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95bs6", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427197431, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "My mothers-in-law (i have 2) both buy tons of stuff.  Yet both deplore clutter and both agree with me that it would be great if dear son had less crap but they keep buying and so does my husband.  The three of them don't go a week without adding to the toy horde and they all want me to cull down.  If you figure out the secret please share.", "controversiality": 0, "created_utc": 1409855890, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95lcx", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427197307, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "delicat", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a very sweet and well-meaning MIL who also will not stop with the constant barrage of \"stuff\". Not just for the grand-kid either; she shops discount stores and will pick up random stuff for me or my husband as well. \n\nAlmost every visit to her house I come back with a large shopping bag of \"stuff\". I process the stuff as follows:\n\n* Some things will never be used. They immediately get posted to Kijiji (AKA Craigslist). A lot of the time I post the stuff as free, sometimes I post it for a bargain price. Examples: new (with tags) clothes that are too large (husband and I have lost weight, MIL still buys our 'old' sizes or has stockpiles of stuff in our old sizes). Also, I sold three of the SIX snowsuits that MIL bought for our son last year.\n\n* Some things can replace other things we already have. A new toy dump-truck means that one of the older or less-used dump trucks can go. \n\n* Some things we might get one or two uses out of. Then they too go on Kijiji. If MIL gave us a Little Tykes slide I'd probably let our son play with it for a day or two and then give it away after the novelty wore off.\n\n* The really nice, useful, or meaningful things are kept and used. \n\nI know that selling or giving away gifts can feel wrong, but this process has come about after we've made it clear that all this 'stuff' is too much and causes us stress and makes us unhappy. MIL enjoys the giving, but doesn't have a lot of expectations about what we will do with the stuff. She is not the type of person to visit and mention \"oh, where is the [ FANTASTIC ITEM X] I gave you?\" and expect us to bring it forward with flourish and gushing. As long as you've taken an opportunity to tell her that the 'stuff' is a bit too much, and as long as she's not going to be weird if she ever finds out the stuff was \"donated to a family that needed it more than us\" then I say LET IT GO, LET IT GO!", "controversiality": 0, "created_utc": 1409856179, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95qty", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427197236, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "uhhidontcare", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry, I don't have any advice either. I usually just talk openly about how I love a clutter-free house and make a point to bring up when I'm doing dejunking/donations in case they want to take anything to their church or something. But I'm hoping someone else does because my MIL sounds exactly the same as yours. They bought my daughter coins one Christmas. None of us collect coins and they know how I feel about 'thing'. They have saved every single thing they've ever owned, not exaggerating. ", "controversiality": 0, "created_utc": 1409856265, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95sj3", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427197214, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Jadebolt77", "author_flair_css_class": "purple", "author_flair_text": "Lilybug - Dec. 2013", "body": "Is it possible to politely refuse to take it? Don't let them unload it, explain there's no room for it, would they please store it at their house for LO to play with when you're all visiting, LO would love to have such a special thing at their house, etc. If there's no way to get them to not bring it down, I feel like the Point of No Return is unloading the slide. Do not let them unload the slide.\n\nAlternatively, if the item is worth anything, maybe wait until they leave and then take it to a thrift shop? ", "controversiality": 0, "created_utc": 1409856328, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95tsc", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427197197, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Thankfully she is 8 hours away and can't possibly drop things on us weekly.  If they lived closer (and they may soetime in the future - eeek) I think I am going to impose a rule (or have my husband do it) that she runs bigger things by us first.\n\nUnfortunately, if there is a space to fill in their house it is filled. It isn't hoarder bad (well - maybe the basement and freezer is) because it is very liveable, but we can't take the stance in reference to clutter.\n\nMaybe someone will have a magic answer.", "controversiality": 0, "created_utc": 1409856426, "distinguished": null, "downs": 0, "edited": 1409857479, "gilded": 0, "id": "ck95vou", "link_id": "t3_2fh54f", "parent_id": "t1_ck95lcx", "retrieved_on": 1427197174, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I think this is part of the case as well.  She LOVES gadgets and if she sees something she wants for herself and has already spent too much on herself (or already has something similar), buying things for her children is the next best thing.", "controversiality": 0, "created_utc": 1409856437, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95vwh", "link_id": "t3_2fh54f", "parent_id": "t1_ck95bs6", "retrieved_on": 1427197170, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MrsAnthropy", "author_flair_css_class": "green", "author_flair_text": "Two girls, 1.5 and 5.5", "body": "I think there are only two \"polite\" options here. \nOne, you keep accepting the stuff and quietly donate it when she isn't looking. If she is that big of a clutter bug, I wouldn't imagine she would notice when things aren't there. \n\nTwo, you ask your husband to talk to her about it. My husband and I have a pretty serious rule that I deal with my parents and he deals with his. If one or the other of us has an issue, then the adult child will go to that parent, not the in law. If that makes sense. If your MIL is super passive aggressive, it would definitely be best to have her son talk to her rather than you. No matter what, she may be offended, but it would probably be worse if you approached her about it.", "controversiality": 0, "created_utc": 1409856538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck95xrg", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427197146, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, I know the thing about saving everything.  It partly comes from the fact that they came from poor families.  This includes taking anything that could possibly be useful from jobs that are getting tossed.  My dad was the same way in a less sever form.  They literally have boxes of old old computer keyboards.  Cabinets, fridge, freezer, and closets are stuffed to the brim. ", "controversiality": 0, "created_utc": 1409856801, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck962w3", "link_id": "t3_2fh54f", "parent_id": "t1_ck95sj3", "retrieved_on": 1427197079, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, the slide is so that we have control over its use in the case that it is unsafe. We thought about leaving it there for our LO, but if we have it we can throw it away  - and it is another thing out of their house.  My SIL will throw things away when she is visiting them and are not home.  If the slide is safe (and I honestly think it is), we will actually use it. I just can't beleive they have kept it this long. \n\nOther things tend to be things that can't be returned (like from craft shows or the like) so it is hard to make her take it back, but I think we are going to get to that point.", "controversiality": 0, "created_utc": 1409856876, "distinguished": null, "downs": 0, "edited": 1409857524, "gilded": 0, "id": "ck964dg", "link_id": "t3_2fh54f", "parent_id": "t1_ck95tsc", "retrieved_on": 1427197060, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I think the difference is that she has a ton of expectations about what we are going to do with the stuff.  She will periodically ask about some things.  I think changing her expectations about what will be done with the items is probably where we need to start. \n\n(Also, SIX snowsuits?) ", "controversiality": 0, "created_utc": 1409857021, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck967bk", "link_id": "t3_2fh54f", "parent_id": "t1_ck95qty", "retrieved_on": 1427197022, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "We have that rule as well when dealing with parents.  I just need to find a way that he should approach her about it and then I can back it up with actions or polite comments as things happen.\n\nThere are some items she will ask about.  I am not the type to dress up my child for every holiday (again it goes back to things that only get used once) and she gets put off if I forget to take a picture of something (like a Patty's day outfit she got).  ", "controversiality": 0, "created_utc": 1409857395, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck96ely", "link_id": "t3_2fh54f", "parent_id": "t1_ck95xrg", "retrieved_on": 1427196930, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "megalynn44", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I had a solution to this. My MIL is a hoarder and over-gifter. Every time we see her she has gifts, which typically consist of old things she's found in her home that are loaded with sentimental value (according to her). The first year or so with my now husband I let myself feel guilty and over polite about this stuff but at this point I've crossed-over to arguably rude/distant because anything else just encourages more. Now I just say thank you and always include \"You shouldn't have\" \"you really didn't have too\" etc.\n\n\nSome examples of things \"gifted\" to us: My husband's baby bottles for \"us to use with our baby\" (no), a scratched up, pleather purse from the 80s was once left on our front stoop as a birthday present, she once saw an off-hand comment I made about color-dye in baby tylenol staining clothes on facebook and mailed me 6 coke bottles filled with ionized water from her faucet \"because it will get stains out\", not ever letting us leave without taking old food, eh it goes on. \n\n\nI know I'm sounded really dispassionate about this stuff but after so many years of it I know there's no way to get her to stop and the only way to minimize it is to not feed into it. Yes, I threw away the water bottles. Yes I put the purse in the Goodwill pile. No, I have not eaten any of the food. I sure as hell am not using 30 year old bottles to feed my baby. And no, I'm not gonna drop everything to call her back every time she leaves a passive-agressive voicemail about how she's getting rid of [terribly important due to sentimentality thing we don't need] if we don't come get it. ", "controversiality": 0, "created_utc": 1409858064, "distinguished": null, "downs": 0, "edited": 1409858481, "gilded": 0, "id": "ck96rfv", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427196761, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "bildash", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, I just have to say it's nice to find so many other people who are dealing with this issue! My MIL is a very sweet, generous woman who loves giving. She's also a hoarder. And a discount store shopper. We live two hours apart, so she only gets to give my son (and my husband and me) gifts when we drive up to visit. We usually end up with three or four large paper bags full of things we will literally never use that we have to pack into our already cramped car once a month. Things like clothing in the wrong sizes, three or four pairs of shoes for each of us, random magazines or knick knacks with things that she thinks we like on them, expired food or candy she got on sale, plus a bag usually full of dusty old stuff she dug out of her house. Oh, and something for the dog. EVERY TIME WE SEE HER.\n\nThis has been a serious point of contention between my husband and I for a while. He wants to take things home, sort through them, and then return whatever we don't want to his mom the next month. Yes, she expects us to return things. We recently decided we would just start giving things away immediately instead. Now I check the bags, take the one or two items worth keeping, and give the rest to charity. I am planning on letting her know I do this so that maybe she'll realize most of her \"gifts\" are just being donated. It's not a great solution, but it's all I have for now. I wish you luck, OP!", "controversiality": 0, "created_utc": 1409858829, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck976iz", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427196566, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Slugowski", "author_flair_css_class": "blue", "author_flair_text": "Ethan- June '12", "body": "This is totally my grandmother. It it's her greatest source of pride in her life to be able to give gifts to her family members. She is at the age where trying to get her to change what is essentially her personality, is pretty pointless. I try to minimize damage by casually mentioning the things that we DO need. If she is going to spend money, I'd rather actually get things I need/want. I sometimes pose it as a challenge to her shopping skills, such as \"I know you are awesome with finding things at garage sales. We could really use a ______. Call me if you see one!\" She will always end up paying for it herself rather than take my money, but I don't make a fuss about. It's a way she can still satisfy her urge for bargains and for gifting. ", "controversiality": 0, "created_utc": 1409859684, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck97nl8", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427196345, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "uhhidontcare", "author_flair_css_class": null, "author_flair_text": null, "body": "omg, yes...this is spot on! Meanwhile I'm the complete opposite. They always comment on how my home is so tidy. It's like they don't make the connection that saving everything you come across=messy house (borderline hoarding...well, they are, just not as gross as the shows. Beautiful home filled with shit everywhere.)", "controversiality": 0, "created_utc": 1409859991, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck97tjm", "link_id": "t3_2fh54f", "parent_id": "t1_ck962w3", "retrieved_on": 1427196267, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Beautiful home filled with shit everywhere.\n\nYup!  And totally not child-safe at this point.\n\n", "controversiality": 0, "created_utc": 1409860467, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck982yy", "link_id": "t3_2fh54f", "parent_id": "t1_ck97tjm", "retrieved_on": 1427196145, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "There are definately things we need, but I don't feel comfortable pointing them in that direction out of the blue, especially since we do not talk much outside of text.  If they asked if we needed something, that would be great.  I know they would get anything for us.  Anytime we so much as mention to each other around them how something might be neat suddenly we have one from them before we have even decided if we really want/need it.  I have a steamer I have never used in my closet.  We don't do that anymore.", "controversiality": 0, "created_utc": 1409861068, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck98ert", "link_id": "t3_2fh54f", "parent_id": "t1_ck97nl8", "retrieved_on": 1427195941, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, my goodness I can't even imagine.  Bottles of water from the faucet? \n\nI know about old food.  She brought hamburger meat from her freezer that was 2 years old at one point for us to cook one visit.  That was probably one of the easier things to get from the freezer. They have a HUGE freezer packed as packed as you can get it and I can't imagine how old the stuff in the back is.", "controversiality": 0, "created_utc": 1409861346, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck98k8b", "link_id": "t3_2fh54f", "parent_id": "t1_ck96rfv", "retrieved_on": 1427195832, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I have no qualms about returning baby clothing to the store in the correct size.  I wish she would ask before buying them.  We are always onto buying the next size or size after the current one being worn.\n\nIf they ever go through their house in the spirit of decluttering, I can't imagine what they will try to give all of us. ", "controversiality": 0, "created_utc": 1409861495, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck98n5f", "link_id": "t3_2fh54f", "parent_id": "t1_ck976iz", "retrieved_on": 1427195794, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "I think there are a few ways to handle it:\n\n* If you visit their home frequently, ask that they please keep these gifts at their house as \"grandma toys\"\n* Tell them that you appreciate how incredibly generous they are, but that your personal preference for your own home is to keep your possessions to a minimum. Talk about how for you, when you feel that you have too many items in your home, even if you think they might be useful, it causes you stress. For this reason, you try to buy items that are multi-use and only keep things that you use frequently. Don't use the words \"useless,\" or \"crowded,\" or \"clutter\" as these will be seen as negatives. Also make it very personal - focus on yourself in this conversation and talk about how while you think all of the gadgets and one-use items are cool and can be very useful, you just don't have the room for it, and again, having too many possessions makes you stressed because you personally can't keep it organized. Don't give the impression that you feel that her home is unorganized or cluttered or over-crowded (even though it is). \n* Ask them to divert their funds into a larger/more expensive gift for your daughter that can be given to her on a holiday or her birthday, or even just straight up cash that can go into a college fund (I have a 529 account for my kids and outside people with the account number can \"donate\" to it).\n* If all else fails, just dump the \"junk\". Sell stuff you can make money from, donate stuff you can't but is usable to others, and toss the junk. She's going to just keep giving you crap and you have to keep your house clean and clutter-free, so this way she is happy, and so are you.", "controversiality": 0, "created_utc": 1409862335, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck993bd", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427195584, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "Will it hurt her feelings if when she goes to give it to you, you just say \"Wow that looks really [cool, cute, fun, etc.], but honestly we just don't have the room for it and I don't see us using it enough for it to be worth storing in our limited space.\"", "controversiality": 0, "created_utc": 1409862527, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck996z0", "link_id": "t3_2fh54f", "parent_id": "t1_ck967bk", "retrieved_on": 1427195537, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "I find that pointing them in the direction of needed items works best. Tell them what you DO need or DO want from time to time. It helps to ensure you don't have as much crap everywhere. They want to help and buy and supply, so get them to get the things you need or want. They feel needed and wanted and you don't have a basket full of not needed gadgets. \n\nAnd be honest with them when you truly don't need something. No need to be passive here. Be up front. ", "controversiality": 0, "created_utc": 1409863067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck99heu", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427195402, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "It might, but I think it is something we are going to have to start doing.", "controversiality": 0, "created_utc": 1409863875, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck99x00", "link_id": "t3_2fh54f", "parent_id": "t1_ck996z0", "retrieved_on": 1427195200, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "theuntamedshrew", "author_flair_css_class": null, "author_flair_text": null, "body": "My mothers-in-law both live accross the country.  My son thinks ups and fedex rock...lol...", "controversiality": 0, "created_utc": 1409865261, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9an64", "link_id": "t3_2fh54f", "parent_id": "t1_ck95vou", "retrieved_on": 1427194860, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "TheSaintedMartyr", "author_flair_css_class": null, "author_flair_text": null, "body": "I have let my mom, and Mom-in-law, know that I have issues with stuff and that I need to cut down, for my own sanity. They've tried to quell it but I know it makes them happy to give, so I've just been transparent with the fact that I will not keep stuff around if I don't need it. I accept gifts gratefully, as an expression of love, but I then treat those things as mine to do with however I need to. If she gave you something, then came around and asked about it, and you were just matter-of-fact: \"I love that you were thinking of me when you got that! But we didn't need it so I passed in on.\" She might be hurt, or react- that's hers to do. But you have done nothing wrong, and your relationship isn't likely to break over it, and she might even think twice about the next gadget she wants to pass along to you. I think my approach helps my relationships with the moms because it allows me to be grateful, avoid resentment on my part, and be honest with them about who I am (ie it's a more real relationship than if I tried to pretend it wasn't an issue). That's what I try for, anyway! Good luck :)", "controversiality": 0, "created_utc": 1409866193, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9b4js", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427194635, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "jysalia", "author_flair_css_class": null, "author_flair_text": null, "body": "My mom sounds similar, and I had to have a heart-to-heart with her about what kinds of things were appropriate for my kids.  I let her know in no uncertain terms that they have everything they *need,* and I want them to actually use and enjoy the stuff they have rather than swamp them with more than they can handle.  Since then, she'll ask me before she buys or sends something for my kids.  If she already got it and we don't want it, she does have other grandkids to potentially take it.\n\nWe also have been hinting strongly that we value experiences more than things, so gifts of tickets to the zoo, or museums, or a play at the children's theater are all very welcome.\n\n", "controversiality": 0, "created_utc": 1409866791, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9bfrg", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427194490, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "I-heart-naps", "author_flair_css_class": null, "author_flair_text": null, "body": "If my husband weren't an only child, I would think we had the same MIL. We have literally no room for anything yet my MIL brings bags and bags of stuff evert time she visits. She is also addicted to Amazon and has stuff delivered for my kid (who is now only 11 months, this has been going on for a while). At first I told her no more big things because we don't have room. She apparently has no concept of \"big\" so I told her she wasn't allowed to buy ANY toys at all. None. She came over on Sunday with a toy car that's like the size of a loaf of bread,  and this giant blue stuffed dog thing that you sit on?? I can't describe it but it is ugly and creepy and I hate it. What does NO MORE TOYS AT ALL mean?!", "controversiality": 0, "created_utc": 1409868261, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9c6mw", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427194142, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "potatoisafruit", "author_flair_css_class": null, "author_flair_text": null, "body": "My mother has done this for years. Like the others, I don't have much advice for how to get her to stop. I have had really direct conversations with her, to the point I've hurt her feelings...and yet she does not stop. I've told her how uncomfortable multiple presents make me feel. She does not stop. \n\nMy children have very little in their college fund. I would have LOVED it if every time Grandma felt the urge to shop, she could have just put a little in a bank account for them, but instead, I have a house filled with ridiculous egg slicers and pizzelle makers and puppy purses and educational card games. \n\nPerhaps you could print out this thread and leave it where your mother could see it? Suggest that she buy one little thing for your daughter, like a lip gloss or a nail polish, and put a twenty in a bank account for later? \n\nThese issues go deep and most people (especially older parents) are just not willing to confront the \"things = love\" and shopping addiction that often lies behind this behavior. \n", "controversiality": 0, "created_utc": 1409868344, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9c81y", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427194123, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "itchyitchyichabod", "author_flair_css_class": null, "author_flair_text": null, "body": "Read Simplicity Parenting. It discusses the problem of Too Much Stuff very powerfully in terms of how it negatively impacts children. Then tell your MIL about all the epiphanies you're having from reading it, and if possible, ask her to read all or parts of it.", "controversiality": 0, "created_utc": 1409868433, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9c9m4", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427194103, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1409868444, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9c9si", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427194101, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "robotpiratenow", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL does things like this too. I hate stuff, I throw it away or give it away with abandon and she knows this about me. She's accused us of having a \"throwing things away thing\". And when the baby was coming she immediately went into bargain bin/thrift store/whatever I can get my hands on overdrive.\n\nWe found 2 solutions. One was my husband (we have a 'your parents, your awkward conversation' deal) told her in no uncertain terms, \"NO MORE STUFF\". This worked for about 6 months and then she started trickling the stuff in, but it's usually now just one or two items, an outfit or something we don't mind taking. But we made it clear that we appreciate the thought, but we a) don't have room for it and will get rid of it so you're wasting your money and b) don't want our son to just associate his grandma with presents instead of as a loving and supportive family member. If she came to visit and he greeted her with, \"What'd you bring me?\" I'd be livid.\n\nThe second thing that saved us was my sister-in-law (my MIL's baby) got pregnant. Cue evil laughter. So now she's getting all of it. ", "controversiality": 0, "created_utc": 1409869831, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9cybx", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427193783, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kailu0912", "author_flair_css_class": "green", "author_flair_text": "\"K\" 09/09 &amp; \"L\" 10/12", "body": "This is exactly what I do. My OPs MIL sounds very similar to my MIL. She means we'll and her excuse is that when her boys were growing up (she has 3 sons) she couldn't always buy them, and she's better off now that she CAN buy stuff. Mostly it's clothes and toys but there are some things that get put aside as something nice. \n\nIf it's clothes she gets, make it an excuse to go through your closet and clean out older stuff. I go through everyone's closets once a year (or when I start running out of hangers). \nUltimately OP, make it clear to mil that you don't have room for everything and purge when you need to. Craigslist can be your friend. ", "controversiality": 0, "created_utc": 1409872704, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9eb6o", "link_id": "t3_2fh54f", "parent_id": "t1_ck95qty", "retrieved_on": 1427193149, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Little_birds_mommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know if this will work for you, but I turned a well meaning parent from a stuff stuffer to a college fund donator. Basically I sat down with my mother and told her in the most sincere manner possible that her intentions were good, but I needed her help another way. I involved her in setting up a 529 college fund, let her have a copy of the statements and asked her to please donate there every time she had an impulse to buy something. I also kept updating her and made her part of \"the savings team.\" It made her feel useful and included. Every dollar or rolled coin case would help and even turning in things for recyclable change could be donated. It worked like a charm for me. Less junk and a future savings account for rising college... And a happy mother. Just a suggestion.", "controversiality": 0, "created_utc": 1409876580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9g43k", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427192238, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NinjaGinny", "author_flair_css_class": null, "author_flair_text": null, "body": "My mom does this. For the kids stuff I pretty quickly made a rule that all the toys she buys stay at her house. Occasionally things make it to my house but it is so much better when the clutter is at her house. She bought my daughter several winter coats last year too. I ended up giving those to her neighbor's kids. ", "controversiality": 0, "created_utc": 1409877087, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9gcyk", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427192123, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "NinjaGinny", "author_flair_css_class": null, "author_flair_text": null, "body": "I warned my mom that if she kept bringing my daughter presents EVERY time she visited that my daughter would take it for granted. The very next visit she brought nothing and was greeted with \"what did you bring me?\"  My mom was a bit shocked, but she finally realized she needed to cut back. ", "controversiality": 0, "created_utc": 1409877317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9gh5y", "link_id": "t3_2fh54f", "parent_id": "t1_ck9cybx", "retrieved_on": 1427192069, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "If someone comes up with the solution to this, I'm all ears. I've tried heartfelt conversations, practical conversations, and full on grumpy \"why don't you listen to me when I ask you to stop buying things\" rants. My mom is coming tomorrow and has warned me to expect overwhelming quantities of new baby clothes. *sigh*\n\nEdit: We've also straight out told her that things we don't want, we will return or donate. Then we follow through. Hasn't stopped her yet.", "controversiality": 0, "created_utc": 1409877415, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9gj1c", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427192045, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Tell me about it. My son thinks the mailman is his own personal Santa Claus :D", "controversiality": 0, "created_utc": 1409877599, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9gmge", "link_id": "t3_2fh54f", "parent_id": "t1_ck9an64", "retrieved_on": 1427192000, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh, I wish this worked for my mom! She wanted to get my son this gaudy plastic contraption for his first birthday. I instead offered the choice between a wooden trike and a wooden push cart. They both were just more in line with our family's style and didn't seem so in-your-face. She bought both because she \"just couldn't choose\" GAAH", "controversiality": 0, "created_utc": 1409877922, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9gsbf", "link_id": "t3_2fh54f", "parent_id": "t1_ck99heu", "retrieved_on": 1427191924, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "We are planning to make a 529 fund and once we do we will definately be telling people. Once we have it I will ask my husband to sit down and talk to her about directing her impulses towards that.  Thanks.  =)", "controversiality": 0, "created_utc": 1409878450, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9h1m4", "link_id": "t3_2fh54f", "parent_id": "t1_ck9g43k", "retrieved_on": 1427191804, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I think if it got to that point I would have a box that I would put them directly into right in front of her and put it in my trunk for donations.", "controversiality": 0, "created_utc": 1409878615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9h4ea", "link_id": "t3_2fh54f", "parent_id": "t1_ck9gj1c", "retrieved_on": 1427191768, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL is constantly trying to give us things. Luckily my husband keeps her in check most of the time. If she wants to bring something she knows my husband will refuse she calls me instead. I just flat out (nicely) tell her no. and I give her a heads up if I'm getting rid of something she gave us. She ALWAYS wants everything back!", "controversiality": 0, "created_utc": 1409878631, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9h4oa", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427191764, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "Lol. Geez. That's madness! I have a Mom who smokes like a train and no matter how nicely or rudely I tell her the things that she brings in smell awful and go in the trash she continues to bring stuff. Ugh. ", "controversiality": 0, "created_utc": 1409879876, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9hqys", "link_id": "t3_2fh54f", "parent_id": "t1_ck9gsbf", "retrieved_on": 1427191475, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you rechannel her generosity? For example, we just don't have room in our little apartment, so we requested experiences instead. They have contributed year long passes to the aquarium for the family, ballet lessons, etc. Then be sure to send lots of photos and emails of how much you are enjoying their generosity!", "controversiality": 0, "created_utc": 1409880732, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9i7dk", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427191263, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Amiliz", "author_flair_css_class": null, "author_flair_text": null, "body": "My MiL does the same things!  The thing is, she does it on purpose, so we've had to start being not so nice about it.  It started with the baby shower and her buying things similar to the stuff on my registry, but total crap.  Here's a neon green diaper bag with a giraffe on it and not the nice one you wanted.  So, we took everything back.  She pouted about it.  Then she started buying tons of electronic toys from yardsales.  I am picky with toys and think they need to be simple and serve a purpose, so we got rid of all of them.  I started to specify educational toys, so that brought more vtech toys.  Argh,  Those were gone in a week.  Then we went clothes shopping with her once.  She held up a pair of clearance jeans that were size 4t (my daughter was 9 months).  The jeans were UGLY.  Frayed bottoms and holes everywhere, looked worn and terrible.  Both my husband and I said no, no jeans that have holes.  Plus, we're pentecostal (MiL isn't), so while my daughter wears pants for now, she probably won't always.  MiL threw a complete fit and said she will keep jeans like that at her house for my daughter to wear.  WTF.  She's now trying to move to our town and mentioned recently that she bought \"a bunch of jeans\" for our daughter and has them at her house.  So, she's doing this on purpose and wants to do the opposite of whatever I say.  \n\nAnyway, just stand your ground and be consistent and on the same page with your hubby.  It works for us.  She gets mad, but keeps buying crap and we keep throwing it out and she gets mad all over again.  I give zero cares anymore.  My house, my child, my rules. ", "controversiality": 0, "created_utc": 1409881125, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9ien7", "link_id": "t3_2fh54f", "parent_id": "t3_2fh54f", "retrieved_on": 1427191168, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Yuck, that's rough. At least the stuff she buys is useable, even if it is obnoxious. I know she's coming from a place of love, which makes it that much harder for her to understand how it feels like she's disregarding our wishes and why we're frustrated.", "controversiality": 0, "created_utc": 1409881703, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9ipnd", "link_id": "t3_2fh54f", "parent_id": "t1_ck9hqys", "retrieved_on": 1427191026, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Trust me, we've considered it! We know she keeps buying stuff because it's her way of showing her love. Which is nice…but complicated, as you well know. It's hard to balance her need to show her love with our desire to have our wishes respected. In the end, I know there are worse problems to have :/", "controversiality": 0, "created_utc": 1409881923, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9itof", "link_id": "t3_2fh54f", "parent_id": "t1_ck9h4ea", "retrieved_on": 1427190974, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "anniczka", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe it's a conversation that your husband can lead? We both try to manage our parents respectively - so even on an issue like getting put on a group text by my MIL the other day with TEN other people, DH was the one to go, hey mom - you're blowing up our phones! It sounds a lot better coming from him even though I made the first complaint to him. ", "controversiality": 0, "created_utc": 1409881928, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9itrr", "link_id": "t3_2fh54f", "parent_id": "t1_ck99x00", "retrieved_on": 1427190972, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "You can always pass it along later. It's hard for them to get it. ", "controversiality": 0, "created_utc": 1409882349, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9j1st", "link_id": "t3_2fh54f", "parent_id": "t1_ck9ipnd", "retrieved_on": 1427190868, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "nilbogresident", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, you sound almost exactly like me and my mother! Her husband (my dad) makes very good money, yet she insists on buying the cheapest, most generic stuff from Walmart or Dollar General. Fine if that's what she wants for herself, but we don't want cheap synthetic tacky clothes for our kids or poorly made, flimsy, gimmicky toys that she's constantly buying them. Christmas is the worst. She'll ask what we want and then somehow find the worst, cheapest version if it. ", "controversiality": 0, "created_utc": 1409883149, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9jg4g", "link_id": "t3_2fh54f", "parent_id": "t1_ck9ien7", "retrieved_on": 1427190683, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Other people suggested making a 529 plan or another plan that people outside can put money into for your child's college. Maybe if you do this she and let her know how much it will help your child's future it will give her a different outlet?", "controversiality": 0, "created_utc": 1409883729, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9jqiv", "link_id": "t3_2fh54f", "parent_id": "t1_ck9itof", "retrieved_on": 1427190548, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh it is definately something he is going to lead. He knows this is he rule.  He has decided he is definately going to be more forward with her when she gets stuff we really don't need.  Hopefully it will be done delicately enough that she won't get too upset by it.", "controversiality": 0, "created_utc": 1409883773, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9jrat", "link_id": "t3_2fh54f", "parent_id": "t1_ck9itrr", "retrieved_on": 1427190538, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Lol, she already started one. I'm telling you, this woman is unstoppable! ;) I appreciate all these suggestions, though. There's got to be one or two that might work!", "controversiality": 0, "created_utc": 1409883866, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9jsvx", "link_id": "t3_2fh54f", "parent_id": "t1_ck9jqiv", "retrieved_on": 1427190517, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Once my bee is a little older this will definately be a route to take.  I may mention how we are considering taking her to swimming lessons very soon.", "controversiality": 0, "created_utc": 1409883886, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9jt94", "link_id": "t3_2fh54f", "parent_id": "t1_ck9i7dk", "retrieved_on": 1427190512, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, a lot of the toys get donated. At least she's gotten better about texting me pictures of clothes before she buys them…sometimes ;)", "controversiality": 0, "created_utc": 1409883928, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9ju16", "link_id": "t3_2fh54f", "parent_id": "t1_ck9j1st", "retrieved_on": 1427190502, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Amiliz", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes!  Always buying the cheapest knock off version of everything.  So annoying!", "controversiality": 0, "created_utc": 1409883966, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9jur4", "link_id": "t3_2fh54f", "parent_id": "t1_ck9jg4g", "retrieved_on": 1427190493, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I also liked the experiences thing someone suggested.  We belong to the Fine Art Museum where I take the little bee for art classes (yes they have infant ones... which are more for the adults, I think). I told hubby that he can suggest a gift certificate from there to go towards her classes, or maybe pay for some swimming lessons since I want to start her early - or even Romp n Roll (which is too expensive for us).  As a SAHM this will help us tons since she isn't in daycare and I am struggling at her age to get her around other kids.", "controversiality": 0, "created_utc": 1409885116, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9kfcs", "link_id": "t3_2fh54f", "parent_id": "t1_ck9jsvx", "retrieved_on": 1427190226, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh lord. The clothing. Thankfully my MIL and SIL have decent taste. But the amount of clothing our 3yo has worn is embarrassing. \n\n", "controversiality": 0, "created_utc": 1409885271, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9kia6", "link_id": "t3_2fh54f", "parent_id": "t1_ck9ju16", "retrieved_on": 1427190188, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "After you do it the first time it becomes a lot easier. I never thought it would happen but my MIL will now ask, \"Hey, could LO use some x?\" And I'll say no but if you're out and see a good deal on Y that would be great we are really low.\n\nSo glad we had that first awkward conversation but things are great now and MIL is actually a huge help. Harness the power of your MIL's buying to fill the gaps in LO's wardrobe, diapers, snacks, etc. \n\nAlso: 6 snowsuits? Had to echo the WTF because wow, lol.", "controversiality": 0, "created_utc": 1409921727, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ck9ud7t", "link_id": "t3_2fh54f", "parent_id": "t1_ck99x00", "retrieved_on": 1427185483, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MumMumMum", "author_flair_css_class": null, "author_flair_text": null, "body": "Sigh. I don't understand those blankets. And the older my mum gets, the shorter she gets, and the worse this blanket problem is going to get. ", "controversiality": 0, "created_utc": 1410787607, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckiui5i", "link_id": "t3_2fh54f", "parent_id": "t1_ck95bs6", "retrieved_on": 1427003466, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}