{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1410117845, "domain": "self.Mommit", "edited": 1413406056, "full_link": "https://www.reddit.com/r/Mommit/comments/2fqp4o/i_want_to_put_up_my_disabled_6_month_old_for/", "gilded": 0, "id": "2fqp4o", "is_self": true, "media_embed": {}, "num_comments": 57, "over_18": false, "permalink": "/r/Mommit/comments/2fqp4o/i_want_to_put_up_my_disabled_6_month_old_for/", "retrieved_on": 1441182306, "score": 85, "secure_media_embed": {}, "selftext": "Done", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "default", "title": "I want to put up my disabled 6 month old for adoption", "url": "http://www.reddit.com/r/Mommit/comments/2fqp4o/i_want_to_put_up_my_disabled_6_month_old_for/"}, "comments": [{"archived": true, "author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "Are there any support groups for parents of disabled children? You should look and see. It sounds like you are feeling rather alone in all of this. There are probably subreddits for parents like you, too, who would be happy to help you.\n\nAre you currently taking anti-depressants? If not, you should...if you are and they aren't helping, see your doctor for a different kind. Sometimes you have to try more than one to find something that works.", "controversiality": 0, "created_utc": 1410119323, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbtn9a", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427142742, "score": 23, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsmagneon", "author_flair_css_class": "blue", "author_flair_text": "2yo boy", "body": "Honestly I don't think there is any shame in placing your baby fire adoption if that's what you ultimately decide is best for your family. There are people out there who want to adopt children with special needs, and have the resources to offer them the care they need. But just as an anecdote, I have a friend who's son had a stroke in utero, possibly similar to your child. He certainly has his challenges, but if you saw him you won't know it to look at him, except that he's a bit small for his age. So your child may very well be fully capable of having a good life. I hope that helps. ", "controversiality": 0, "created_utc": 1410119730, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbtvco", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427142377, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "What country do you live in? Can you ask your child's pediatrician for help? Please look for help and resources. I hope someone in this sub can provide you with more help than I can. My heart goes out to you and your daughter. She needs you. ", "controversiality": 0, "created_utc": 1410121105, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbumkd", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427141148, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "structuredchaos", "author_flair_css_class": null, "author_flair_text": null, "body": "Check out parent2parent.org. They have a ton of resources and can hook you up with other parents with children with similar disabilities. PT is going to take a lot of time. It is unlikely to see improvement so quickly in an infant. Be patient. I have a soon with autism. You go through the stages of grief almost like losing a child. You have to \"bury\" the child you dreamed of. It is a loss. You will be depressed, tired, angry, and much more. But, when you find super and see improvements, you will feel excited, happy, and much more!  No one can really prepare for a disabled child. I'm sorry that you feel you need to give up your child. Please take a minute to check out that website before you make any decisions. ", "controversiality": 0, "created_utc": 1410121566, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbuvvq", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427140837, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Sg1324", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe you can find someone who can take custody of your child like a close family member or friend. You can be reassured that your baby is being loved and taken care of, and you can still have contact. Explain the severity of the situation just as you explained to us. One of them may be willing to help you.\n\nYou might also ask for help in /r/Parenting if you haven't already.", "controversiality": 0, "created_utc": 1410121836, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbv14o", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427140773, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "finnerpeace", "author_flair_css_class": null, "author_flair_text": null, "body": "My brother has cerebral palsy, and has ended up being a great delight and lifelong companion to my parents. Can you get some help now to help you cope better, and give the child another year or two before you decide to pass her to someone else? That is a serious decision and it could well be that the baby period (and your initial adjustment) is the hardest and afterwards things could be quite different.\n\nCaring for this child, if you find a way that you can indeed do it, could drive a degree of personal growth and development in you that very little else could achieve. And your daughter will be eternally grateful. However, she certainly doesn't want you over-burdened, or taking your life etc! Please talk more with us, or the folks at r/breakingmom and other even more relevant forums for mums of disabled children, and find the companionship, support, and wisdom you need.\n\nIf financial help would make a great difference, then consider that there could be ways to raise the money. A mother who wants to raise her daughter but needs $$ for a part-time maid, PT, or anything else can likely find that type of financial assistance in today's world, hallelujah.", "controversiality": 0, "created_utc": 1410124153, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbw8qp", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427139629, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "finnerpeace", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, yes, yes to the anti-depressants for sure. They've helped me a ton, and I just have a nervous/artistic/overly sympathetic nature combined with the angst of having taken my hubbie away from his family in the developing world, and the irritations of raising 3 kids. Nowhere NEAR the challenges of raising a disabled child. Yes yes yes to all the help you can get, and definitely antidepressants/antistress meds!", "controversiality": 0, "created_utc": 1410124319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbwbrw", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbtn9a", "retrieved_on": 1427139456, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "LinLeigh", "author_flair_css_class": null, "author_flair_text": null, "body": "I will probably get downvoted for this but here goes. \n\n\nI don't think your comment is realistic. Disabled children have to be incredibly lucky to find a family. Most of them end up in the system. And that is not even taking into account that op said herself social care is really bad in her country. \n\nI know you are just trying to be supportive and I think the rest of your comment is really good. ", "controversiality": 0, "created_utc": 1410124416, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbwdid", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbtvco", "retrieved_on": 1427139433, "score": 54, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "turkproof", "author_flair_css_class": "purple", "author_flair_text": "How baby? HOW BABY?!", "body": "It sounds like you don't have a lot of effective support and are overwhelmed, which is completely understandable. Even a healthy newborn can feel overwhelming and can bring on intense, unprecedented feelings of depression, intrusive thoughts, etc. I know it seems just so hopeless and awful right now, but like they say... Don't make promises when you're happy, don't make decisions when you're sad.\n\nYou need sleep, food, self-care. You need more than a few weeks of therapy -- maybe psychiatry isn't for you, maybe you need a counsellor or religious support. Maybe you need to find he right mix of antidepressants. Hell, go to massage therapy, if that floats your boat. It can't hurt. \n\nI imagine my daughter alone in bed for the rest of her life and I get so unbearably sad. Looking back now, in sound health and mind, at where you are and where I felt I was, I'm telling you, you will regret putting your child -- your *child* -- in that sort of situation. You are her mother, you are charged with protecting her and caring for her, even when it seems impossible. Without you there is literally no one else who can speak for her they way you can. \n\nPT will take time. Your health will take time. But the time is going to happen regardless, so you may as well use it well. I'm sorry, it will take so much strength, more than you think you can give, but you will, because we all give that much and more to our children too. It's a mother's way. ", "controversiality": 0, "created_utc": 1410124580, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbwgbj", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427139397, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "Hugs. Just hugs. You are overwhelmed and depressed and your brain chemistry can't handle it. Please go to your primary care doctor and/or OB and tell them what you're feeling. If they don't take you seriously or help you, go to the next doctor or therapist on the list. Don't stop seeking help until someone HELPS you. \n\nDo you have a partner who can help? Look into social services, respite care, anything. There are very likely support groups just for women in your situation. \n\nIf you want to share your location, maybe one of us can do the heavy lifting of looking up services who can help you. ", "controversiality": 0, "created_utc": 1410124723, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbwj78", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427139198, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Amelia__Pond", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's also very possible you are suffering from post partum depression. I know I am, and I planned for my son, and he is cognitively normal, and I'm told he's a \"good\"/easy baby.... But I still have had a lot of similar thoughts. Wanting to go back to my \"before\" life, thinking if I could just give him up for adoption, etc. things would be better, etc\n\nI don't want to discount your feelings , but it also sounds like you are suffering from a lack of support and resources. I don't know about the country you're in, but I know in the US social services can provide respite care for disabled children-- take the for a few days, a week, etc, so that parents can get a break. \n\nI bet if you shared the country you're from people would be able to give you more targeted suggestions.\n\nI am sorry you are going through this stress and feeling this way.", "controversiality": 0, "created_utc": 1410125850, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbx3n5", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427138688, "score": 22, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RaOnSouthProvidence", "author_flair_css_class": null, "author_flair_text": null, "body": "Woah, just woah.\n\nMy own daughter had a brain hemorrhage during pregnancy as well. I totally track with you here. Nonetheless, I wish I knew where you lived! There may be resources in place to help you as your daughter.\n\nAs for adoption, I don't want to guilt you out of it but prior to my daughter's birth I worked with adults with developmental/intellectual disabilities. I have to warn you, your daughter will likely not be adopted as a disabled child. What's more likely is that she will be abused and neglected. Disabled adults and children are mistreated at disturbingly high numbers in foster/governmental care. In fact, of the 30+ disabled adults on my caseload (all in state care), I only had THREE that had no record of being abused/neglected/exploited in some way throughout their life. So if you are thinking some foster family can do \"better\" at raising your daughter than you can, statistics show that to be unlikely.\n\nOn the other hand, you do need some help. You aren't wrong or bad for feeling this way, but you don't have to stay stuck with these feelings either. \n\nIf it's any consolation, the condition your daughter dealt with is a type of brain injury. Which means that 6 months is NOT enough time to gauge what she is capable of and what her life is going to look like. My daughter will be 3 in a few months and we are only just now getting a good gauge for what her abilities are. At 6 months she was effectively, a potato. It took a year for her brain to heal, and another year of intense therapy to see results. But now she is exploding developmentally. Yes, she's still disabled but re situation is not as dire as it appeared initially. \n\n\nAll I am trying to say is this: 6 months is not enough time to determine your daughter's future. So please don't make a determination based on that. \n\nGet some help for yourself and your daughter first, then try to explore adoption if you still aren't sure. Do you live in North America? I can message you my cell number and we can text about it if you want some help. I've been through the whole kit and kaboodle with my daughter's medical stuff. I know how lonely it can get.", "controversiality": 0, "created_utc": 1410128379, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbybpz", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427137768, "score": 185, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "confused123456", "author_flair_css_class": "blue", "author_flair_text": "2.5 year old and 12weeks with #2", "body": "I think you have post partum depression and possibly PTSD. I understand what you are going through to some extent. My son was born early. He would stop breathing during feeds so I would have to watch his breathing pattern. He almost passed away in front of me. \n\nHe also developed hypothyroidism and had bad FTT. During this time we should have noticed his jaw/tongue muscles were also weak but we had so many other medical issues we didn't. He's two now and is only speech delayed with some facial weakness. He's in therapy. It's hard. In the beginning I would often wish I just died. I blamed myself for his health/issues. I was very angry. Therapy helped a lot. ", "controversiality": 0, "created_utc": 1410128398, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbyc2j", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427137754, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Boommia", "author_flair_css_class": null, "author_flair_text": null, "body": "Whatever you choose to do is your choice. What are the doctors saying about her progress in pt? What is their professional option on the severity of her disability in the long term? Babies are resilient and the pathways in the brain are pliable and adaptable to an extent, so keep some hope alive. ", "controversiality": 0, "created_utc": 1410129119, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbyobx", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427137549, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cassiope", "author_flair_css_class": null, "author_flair_text": null, "body": "A psychiatrist will only help with medications and biological/neurological changes related to depression. A psychotherapist will help you figure out how to figure out all of your options and make the best decision. If your country has give psychotherapists, please consider this option. \n\nAnd full support for the looking for support groups - in person or online. \nGood luck to you as you figure out what you will do. May you find a way to move forward with a peaceful heart that you are finding the best decisions you can. \n\n", "controversiality": 0, "created_utc": 1410130989, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckbzjqr", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427136798, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mommyoffour", "author_flair_css_class": "purple", "author_flair_text": "B-G-B-B", "body": "Great message. I hope she reads it. ", "controversiality": 0, "created_utc": 1410133795, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc0rfi", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbybpz", "retrieved_on": 1427136106, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "soccer_trekkie", "author_flair_css_class": null, "author_flair_text": null, "body": "It may be good to look into private adoption if you are serious about this.  Even if you just talk to somebody who works there they can give you a lot of information and it may push you one way or the other.", "controversiality": 0, "created_utc": 1410133939, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc0tnm", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427136078, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "SamiLMS1", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for pointing this out. I understand that some depression is a chemical and hormonal problem, but this sounds more like a situation where depression is a normal emotion to feel and medication might not necessarily be the best solution. ", "controversiality": 0, "created_utc": 1410135619, "distinguished": null, "downs": 0, "edited": 1410145410, "gilded": 0, "id": "ckc1jhg", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbzjqr", "retrieved_on": 1427135675, "score": -2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I was about to ask her this.  It may be that she would get more specialist advice and resources in a local forum. ", "controversiality": 0, "created_utc": 1410136132, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc1rj8", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbumkd", "retrieved_on": 1427135479, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "You said you went to a psychiatrist and it didn't help.  A psychiatrist only prescribes medication and usually does very little talking therapy.  You need a psychologist or a therapist, possibly in conjuction with a psychiatrist.  You need to stick with it.  It isn't a one time thing that you do. I would not be suprised if you are dealing with PPD on top of the stress of trying to taking care of your child.\n\nGood luck.", "controversiality": 0, "created_utc": 1410137414, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc2beh", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427135068, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "pippx", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Which means that 6 months is NOT enough time to gauge what she is capable of and what her life is going to look like.\n\nThis was totally my thought as well. Not holding head up? Bad hand eye coordination? I don't think this 100% guarantees *anything.*", "controversiality": 0, "created_utc": 1410142489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc4m1j", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbybpz", "retrieved_on": 1427133676, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mamabeans", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like, if nothing else, you could definitely use a break. Not sure if this is the same in your area, but here, families can request part time help with care or even just someone to hang out with her for a few hours while you go out for lunch, get a pedicure, nap, whatever. I volunteer with Children Services and they really try to support the whole family unit to keep the child with their biological family if possible and not harmful to the child. Do you have supportive family or friends? \n\n", "controversiality": 0, "created_utc": 1410145649, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc60x6", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427132622, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410147050, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc6mph", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbybpz", "retrieved_on": 1427132260, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vinceravivere", "author_flair_css_class": null, "author_flair_text": null, "body": "also, look around in your area to see if their are any Parents As Teachers or Healthy Families programs. It's a free community-based program that essentially gets you a personal support worker who can help hook you up with resources and support groups, as well as help you start forming a better attachment with your baby. It's an amazing thing and I believe that there are programs internationally, so it might be available!", "controversiality": 0, "created_utc": 1410147631, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc6vgz", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427132147, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410149294, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckc7j2u", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbuvvq", "retrieved_on": 1427131771, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410152028, "distinguished": null, "downs": 0, "edited": 1410152324, "gilded": 0, "id": "ckc8hzf", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbybpz", "retrieved_on": 1427131283, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh I have no advice but I want to give you a huge hug. My son had heart surgery at birth and was very delayed. It's so frustrating, but he is starting to come around. Still no coordination though. He turns 1 year in two days.  This is really so scary for you. Do you have a MIL or a mom or any family who can help? You need a break. Also you may want to hook up with the OP of this comment via Facebook so you can really connect. OP can help you cope, as one who has walked your same path. Having support will do wonders for you. You have a precious beautiful baby and it wasn't her fault or yours. I hope that you can get through this hard time unscathed as possible.", "controversiality": 0, "created_utc": 1410158086, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckca7ns", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc8hzf", "retrieved_on": 1427130248, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; It took a year for her brain to heal, and another year of intense therapy to see results. But now she is exploding developmentally. \n\nThis part is really important to take on board. In infants the brain is much more \"plastic\" and capable of remapping and healing than an adult brain.  Even adult brain injury victims can heal, though it takes time and patience.\n\nWith an infant healing will be quicker and more effective.\n\nYou don't mention a father so I imagine if you are a single parent it must be very stressful and isolated for you.  Please reach out as much as you can.  You obviously communicate flawlessly in English so you may even be able to contact overseas specialists when appropriate.\n\nBut you definitely need to see your doctor and consider your own stress and depression. Post partum depression is still very normal at 6 months.\n\nI wish you and your daughter the best, whatever you decide.", "controversiality": 0, "created_utc": 1410159942, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcamu6", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc8hzf", "retrieved_on": 1427129943, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410164306, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcbgkq", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc4m1j", "retrieved_on": 1427129401, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410165418, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcbn9k", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbyc2j", "retrieved_on": 1427129315, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410165667, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcbopd", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbyobx", "retrieved_on": 1427129297, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410167287, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcby2x", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcbopd", "retrieved_on": 1427129174, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dianasaurusmex", "author_flair_css_class": null, "author_flair_text": null, "body": "Did you ever find out the root cause of the hemorrhage? My son was born 4 weeks ago and suffered a hemorrhage. After a 10 day stay in the NICU, we discovered it was the result of something called Neonatal Ammoimmune Thrombocytopenia (NAIT). Just curious if it was something else in your experience? Some of the nurses were telling us that brain bleeds can be common in infants. ", "controversiality": 0, "created_utc": 1410169515, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckccan0", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbybpz", "retrieved_on": 1427128957, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410169820, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcccfr", "link_id": "t3_2fqp4o", "parent_id": "t1_ckccan0", "retrieved_on": 1427128934, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "annietym", "author_flair_css_class": null, "author_flair_text": null, "body": "This was very well said. As a mother you are showing her love through all of your actions. While it doesn't feel like it's enough, it's the only world she's ever known. I'm also gathering that this is your first child? So you also have the stress of being a FTM with normal anxieties and insecurities. She is so very young. Take it easy on her. Take it easy on yourself, too. Reset your own expectations. Come here to get support whenever you want. ", "controversiality": 0, "created_utc": 1410170842, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckccifk", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcby2x", "retrieved_on": 1427128773, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "cassiope", "author_flair_css_class": null, "author_flair_text": null, "body": "Meds will not \"cover up\" real feelings. Sadness makes sense. However, if someone can't sleep, has trouble eating, or otherwise can't function or see what options there are, then meds make sense to help. ", "controversiality": 0, "created_utc": 1410173011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckccvpl", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc1jhg", "retrieved_on": 1427128560, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "ChrissiTea", "author_flair_css_class": null, "author_flair_text": null, "body": "Re anti depressants, they can take up to 6 months to show effects so it's another \"wait and see\" situation", "controversiality": 0, "created_utc": 1410173456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckccykf", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbtn9a", "retrieved_on": 1427128523, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "inferior_troll", "author_flair_css_class": null, "author_flair_text": null, "body": "Is the father in the picture? Or are you a single mother? What does he think about all this?\n\nI understand your conundrum really well. And I think you are scared of being honest (to others and perhaps to yourself) because your thoughts and experiences are not in tune with what everyone considers \"good\" or \"virtuous\".\n\nAnd that's ok. You're only human.\n\nWhen we plan for babies, we mostly plan fir the perfect case. Like, it will be very hard in the beginning; sleepless nights, stress and such. Then they'll be a cute little toddler, in some ways it will be easier, in other ways it will be harder. The challenges will change. But they will be there. Then they'll start school, then they'll act up when they are teenagers, yada yada all the way to their adulthood. And beyond.\n\nI'm sure you also planned for this. Like most people, you wanted *that* child. The normal child. You were prepared to sacrifice predefined parts (according to the above plan) of your life to have an offspring. Maybe a bit more. But not a lot more.\n\nSo now you feel trapped. You feel that you'll have very different challenges compared to what was planned. You feel like you will never get to have the baby / child experience you dreamed of.\n\nIt is a very big deal. Having to care for someone that will most likely to be bodily and mentally disabled is like getting into a car accident that changes your life forever. Sudden, unexpected and sad.\n\nBecause of that, you probably failed to bond properly with your child. You feel very guilty about it. You don't want your child. You don't want this experience. If you could reverse the conceiving of this child with a push of a button, you'd press it right now.\n\nIf you speak about these feelings, you'll be seen as a bad person, bad parent. People will think and say awful things about you. They'll say \"how can she think like that, it's her *child*\". They don't know what they are talking about I'd say.\n\nIt's very hard. You want your child to disappear into thin air. You don't want to have anything to do with her. Then maybe you want to try for another child, who is healthy and normal.\n\nI don't think you are a terrible person for thinking those. I think you are just another human being. Yeah, I know a lot of people who are virtuous with their severely disabled children. It's like they have a source of energy that never depletes. They are tired all the time, and they have a persistent sadness in their eyes; but their story with their children, if you get to hear it, moves you. You think \"How can she do that? How is that humanly possible?\". Because it's a rare sight.\n\nYou will be hurt, one way or another. Even if you give your her up, you'll probably feel guilty for the rest of your life. And there is a chance that she will suffer from it. If you don't do it, well, then all your dreams and aspirations about how your life would look like in the future is pretty much gone, forever.\n\nIt's really hard to come up to terms with such a decision and situation.\n\nMost important thing is that unfortunately, it's your decision to make. People will talk to you about \"hope\", \"chances\", and others might tell you just to get it over with and forget that it ever happened.\n\nThey'll all come from people that are not in your shoes. Even if it comes from parents of disabled children, or people that gave their disabled children to \"the system\"; every situation is unique. If you were someone else, maybe your disabled child would be the light of your life, and you'd find a way to be happy devoting your life to the well being of your child. Maybe you wouldn't even need to find a way, it would just come naturally to you. Or maybe if you were someone else, you'd just give her to the system and not think twice about it, and move on with your life, no guilt.\n\nBut you are this person, with her own situation; you can't make anyone understand it. I don't think anyone (me included) is capable of making you feel genuinely better about this. I'm so sorry about it. \n\nJust don't let anyone judging you about what you feel about your daughter get to you. You are jut human, and it's ok to feel devastated and hopeless about something like this. And whatever you decide to do is also ok. It might be sad, but it's ok.", "controversiality": 0, "created_utc": 1410178192, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcdy9z", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427127944, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "beccainblue", "author_flair_css_class": null, "author_flair_text": null, "body": "[This is a Romanian Orphanage in the 90's](http://youtu.be/bvL_DGjGuhA)\n\n\nI hope in twenty years this has changed, but I really doubt it has changed much. \n\n\n\n[This is a Romanian Hospital/Orphanage in 2006](http://youtu.be/Kh8eov81Cc4)", "controversiality": 0, "created_utc": 1410179201, "distinguished": null, "downs": 0, "edited": 1410179433, "gilded": 0, "id": "ckce7ol", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427127822, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410179615, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcebs7", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427127769, "score": -6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AMerrickanGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you afford to travel elsewhere in the EU and get some better doctors to examine your child?", "controversiality": 0, "created_utc": 1410180326, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcej6u", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcccfr", "retrieved_on": 1427127673, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410180570, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcelqu", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcdy9z", "retrieved_on": 1427127640, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "structuredchaos", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry. The website is p2pusa.org. If you are in the starts, there its one for each state. If not, you should still be able to find some good resources. ", "controversiality": 0, "created_utc": 1410180616, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcem7u", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc7j2u", "retrieved_on": 1427127635, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AMerrickanGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "She's in Romania. Nobody adopts kids there with special needs ,given that there are thousands of normal kids rotting in orphanages there.", "controversiality": 0, "created_utc": 1410180642, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcemig", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbtvco", "retrieved_on": 1427127631, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AMerrickanGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "She's in Romania. There isn't much support there.", "controversiality": 0, "created_utc": 1410180666, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcemqq", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbwj78", "retrieved_on": 1427127627, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "mrsmagneon", "author_flair_css_class": "blue", "author_flair_text": "2yo boy", "body": "Ugh, that's so sad :-(", "controversiality": 0, "created_utc": 1410181028, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckceql2", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcemig", "retrieved_on": 1427127548, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410183492, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcfju7", "link_id": "t3_2fqp4o", "parent_id": "t1_ckccifk", "retrieved_on": 1427127170, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "rachael8a", "author_flair_css_class": null, "author_flair_text": null, "body": "There is so much support and we'll wishing in these comments.  I'm guessing there is no real community sentiment coming from the government in Romania. I hope that's not the case.  I have a special needs child in my life. She is a ray of sunshine.  It's not always a picnic, but the good times definitely outweigh the tough times.  I how you find the answers you're looking for.  This doesn't help at all,  but I would take her in a second.", "controversiality": 0, "created_utc": 1410184262, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcftvh", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427127039, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410184888, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcg2km", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcej6u", "retrieved_on": 1427126848, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "AMerrickanGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Seeing a better specialist might help. Why not? Obviously your local doctors don't know what they're doing, and elsewhere in the world are better ones.\n\nAlso see if there's a cerebral palsy association that you can contact. They may have resources that will help.", "controversiality": 0, "created_utc": 1410185687, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcgdtf", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcg2km", "retrieved_on": 1427126703, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410185858, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcggd1", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc0tnm", "retrieved_on": 1427126670, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "duckiesuit", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I don't think I have PPD. Would someone with PPD look at other people's children and wish she had that? \n\nYES, 100% yes. PPD manifests in different ways for everyone. Some women wish their baby were different, or had never been born. Some fantasize about throwing their babies in the oven or out of a moving car. Some are just quietly despondent or feel like they are not cut out to be a parent. And some feel totally normal but can't bond with their babies.  Please don't blame yourself and please don't believe everything your brain is telling you right now. You have been through several huge traumas -- pregnancy, birth, finding out about the hemorrhage,  and fears of disability. I truly believe talk therapy and/or antidepressants would help so much. \n\nThinking of you, mama. ", "controversiality": 0, "created_utc": 1410187084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcgz02", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcbn9k", "retrieved_on": 1427126429, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "freemoney83", "author_flair_css_class": null, "author_flair_text": null, "body": "Where is her father? Do you have ANY family near by?  \nThis might be a long shot, but could you look into moving to the states? Much better support here", "controversiality": 0, "created_utc": 1410187271, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckch1tw", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427126391, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "apis_cerana", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh god, those poor kids...", "controversiality": 0, "created_utc": 1410188101, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckchfa8", "link_id": "t3_2fqp4o", "parent_id": "t1_ckce7ol", "retrieved_on": 1427126217, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dallasdarling", "author_flair_css_class": null, "author_flair_text": null, "body": "I just wanted to say that if you feel like you are not equipped to best care for this child given your psychological state and the life-time of medical care it will need, it is not unreasonable to hand it over to an institution that has a better chance of caring for the child. ", "controversiality": 0, "created_utc": 1410188746, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckchpsv", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427126080, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RaOnSouthProvidence", "author_flair_css_class": null, "author_flair_text": null, "body": "That's exactly what happened to us. We had a hematologist visit us at the birth of my daughter because her platelets were so low. He's the one who explained NAIT to us (my blood is apparently not \"compatible\" with my husband's blood. This causes my body to attack the fetus during pregnancy, which causes all sorts of lovely treats like NAIT). He told us to avoid future pregnancies or to use IVIG treatments during any future pregnancies if we were comfortable taking the risk to have more kids. \n\nThis is why it's really important that the OP finds out what the cause of her daughter's bleed was. Because if it's NAIT (usually characterized by a low blood platelet count at birth) then she REALLY needs to know that for any future pregnancies. Depending on what caused the NAIT, any future kids they have could have similar or worse issues. \n\n", "controversiality": 0, "created_utc": 1410190356, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcigx4", "link_id": "t3_2fqp4o", "parent_id": "t1_ckccan0", "retrieved_on": 1427125730, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RBRR", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a child with special needs (low tone, feeding tube, rare genetic disorder) And So I get...its hard. She needs constant care and this is not what we expected. We had a great pregnancy, no sign until she went into a coma 20 hours after birth. We have no idea what impact this will all have on her in the long run, but we know shes a sick kid. \n\nI understand that you have tried to cope and lost a bunch of weight, etc. Im sorry you feel this way...BUT part of being a mother is being able to put all of YOUR needs aside and take care of your baby. No matter what. Get some help, talk to people, continue with PT. Three months of PT is nothing. Physical therapy needs to continue for years. \n\nI know I will probably get downvoted but whatever. Giving up your child just because its hard is selfish in my opinion. Things are tough some times. You just gotta love your child and keep trying. ", "controversiality": 0, "created_utc": 1410190774, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcio2o", "link_id": "t3_2fqp4o", "parent_id": "t3_2fqp4o", "retrieved_on": 1427125637, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "MidwestMemories", "author_flair_css_class": null, "author_flair_text": null, "body": "NAIT seems to  be similar to Rhesus disease. I'm o neg and my husband was a pos and we were told if I didn't get the rhogam shot we'd have issues down the road. I wonder if a shot can prevent NAIT if it's a blood incompatibility thing.", "controversiality": 0, "created_utc": 1410191252, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckciwi2", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcigx4", "retrieved_on": 1427125527, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "Boommia", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe this is a good move before making the permanent decision of adoption. Go find a really good specialist. Get their perspective and perceived outlook. This way you know you explored all options available to you before letting go. I mean, what if she is only going to be slightly impaired as she grows older? What if her condition is not as severe as you perceive it to be? ", "controversiality": 0, "created_utc": 1410193015, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcjrha", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcg2km", "retrieved_on": 1427125125, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RaOnSouthProvidence", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh, I was truly crossing my fingers and saying \"please don't say Romania\". No disrespect meant to your country, it's quite beautiful. However, the organization I used to work for sent a team of QSP's there to volunteer their training expertise at some of their facilities for the disabled. And, well...you live there. You know even better than I do why that's needed. Their care system is a mess. \n\nYour daughter will sit in a crib all day, every day if you let one of those places have her. She will probably never be potty trained, and never be held. They will hand her bottles in her crib (when they get time to feed her.) She will likely be dirty all the time, and sedated when she gets uncooperative. \n\nIf you send your child to one of these places, you are condemning her to a life of hell on earth. I'm not telling you this to hurt you or to make you feel like a bad parent. I'm telling you this because your government and health care system has a long history of lying to it's citizens (and the world) about how bad these places really are. I'm telling you because you need to be fully aware of what you would be doing by giving her up. \n\nThere is a cultural tendency in Romania to demonize the disabled, or really anyone who isn't born \"normal\". The worst story I know of was a little girl in Bucharest who was given a Mental Retardation diagnosis, for no other reason than that she had crossed eyes. She was institutionalized for a cosmetic and totally fixable problem that's not even considered a disability anywhere else. \n\n Romania is an especially dark place for orphans and the disabled. Here are some links for anybody who is interested in learning more about it. \n\nhttp://newint.org/features/2013/11/01/abuse-romania/\n\nhttp://www.aljazeera.com/programmes/peopleandpower/2014/04/europe-hidden-shame-2014414124139195247.html\n\nhttp://www.disabilityrightsintl.org/wordpress/wp-content/uploads/romania-May-9-final_with-photos.pdf\n\nhttp://abcnews.go.com/GMA/story?id=1941485&amp;page=1\n\n\nLast I knew, Romania no longer allowed adoptions to the US, which was at one time the nation that adopted the most frequently from Romania. Her chances of adoption are very, very low.  Once she is labeled as disabled in the Romanian system, she will probably never leave. \n\nNow, off my soapbox about Romania and on to my soapbox about parenting. Your child needs you. She needs you because she is an infant who needs her mother. She needs you because she is a medically fragile person who needs an advocate. She will not get an advocate in the foster care system in Romania. She won't, period. It has to be you. You have to find a way to deal with this. The problem will not be solved by you dropping her off somewhere. It will only create new problems, problems much worse than the ones you are dealing with now if you can believe that. \n\nNonetheless, you are suffering. You need help. People aren't going to give you a hand up, you are going to have to take help for yourself. Call up every doctor she's ever had and ask them what kind of resources they know of that can help you. Therapy. Support groups. Charities. Call churches and universities and ask them the same thing. Medical schools. Therapy schools. Dental schools. Call all of them, see if they have clinics for their students to work in and if they are taking new patients. \n\nAre her doctors not trying to give you the information you need? Fire them. They work for you, you can fire them if they aren't doing their job well. Say \"so long\" and find another one. Yes, sometimes there just isn't a known answer for a medical condition. But the refusal to look into it any further is unacceptable. \n\nThese other moms you speak of, try and create relationships with them. They may know of things that can help you. Be honest and open about your feelings with them, they've probably been through it too! \n\nGet counseling for yourself. Anything you can afford. If you can't afford anything, try and find religious counseling. Anything is better than nothing. Take care of yourself. Eat well, get exercise. Take vitamins and get sunshine. Treat your body right so that your mind can recover from the shock and anxiety. \n\nIn the interim, some things to consider that might help your daughter. \n\n\n -Look into Occupational Therapy, not just Physical Therapy. Look into Speech Therapy too since there's a good chance she will have delays there as well. \n\n-There is a high instance of something called Cortical Visual Impairment among kids like your daughter. Her eyes may be perfectly fine, but she still may have trouble seeing because the vision center of her brain might have been damaged. This can cause global delays in children, because how motivated would you be to explore the world around you if you couldn't see well? CVI goes overlooked a lot, but it's totally treatable with Vision Therapy. So maybe find someone who knows about Cortical Visual Impairment and get her evaluated, just in case. \n\n-Do range of motion exercises with her. They think it's fun playtime at this age. Here are some links. Be gentle, but do them consistently (1-2 times a day). It will help keep her flexible and help her get the most out of physical therapy. \n\nhttp://www.drnathbrachialplexus.com/images/pdf/babyromprint.pdf\n\nhttp://www.family-friendly-fun.com/therapy/baby-range-motion.htm\n\n-Let her spend lots of time on her stomach while playing to encourage head control and strength. \n\n-Feed her a diet high in healthy fats like Fish, Nuts, Olive Oil, Avocado and Coconut Oil. Her brain needs these fats to continue to heal and develop properly. \n\n- Moving. I'm not kidding. We moved 6 hours away ourselves because our daughter had so little resources where we lived before. I understand this may not be possible, but it's worth looking into if you can. \n\nOne last thing before I finish up this novel; your daughter loves you. You love her. You couldn't control what happened to her while you were pregnant, and it wasn't your fault. It's not your fault that you feel this way now. This is hard stuff, they don't prepare you for this when you are picking out baby clothes and buying cribs. But the hard stuff is a part of parenting too. And it takes a lot out of you to fight for it, but it's worth the fight. Your daughter and you are worth the effort. Please, don't give up. Get your mama bear claw's out, and get ready to fight. \n", "controversiality": 0, "created_utc": 1410193901, "distinguished": null, "downs": 0, "edited": 1410194087, "gilded": 0, "id": "ckck7i2", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc8hzf", "retrieved_on": 1427124918, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RaOnSouthProvidence", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly. ", "controversiality": 0, "created_utc": 1410194104, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckckb3j", "link_id": "t3_2fqp4o", "parent_id": "t1_ckc4m1j", "retrieved_on": 1427124871, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "vivalaemilia", "author_flair_css_class": null, "author_flair_text": null, "body": "This is an excellent, excellent comment, and I really hope OP sees and reads this. ", "controversiality": 0, "created_utc": 1410199833, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcn99d", "link_id": "t3_2fqp4o", "parent_id": "t1_ckck7i2", "retrieved_on": 1427123495, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410201554, "distinguished": null, "downs": 0, "edited": 1410202325, "gilded": 0, "id": "ckco6nd", "link_id": "t3_2fqp4o", "parent_id": "t1_ckck7i2", "retrieved_on": 1427123020, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410203122, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcp1qg", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcdy9z", "retrieved_on": 1427122546, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "soccer_trekkie", "author_flair_css_class": null, "author_flair_text": null, "body": "That's really tough.  Are there any social services that can help?  Here (Canada) if you have a seriously disabled family member you are usually entitled to assistance where a caregiver is provided for a certain number of hours a week so you can get out on your own.", "controversiality": 0, "created_utc": 1410203632, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcpbq5", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcggd1", "retrieved_on": 1427122415, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410203679, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcpcnu", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcio2o", "retrieved_on": 1427122404, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "finnerpeace", "author_flair_css_class": null, "author_flair_text": null, "body": "Physical anxiety attacks can largely be successfully managed with medication. I use citalopram. Without it I get life-threatening insomnia and palpitations: with it, I'm good. Talk to a doctor... Any help is good help at this point!", "controversiality": 0, "created_utc": 1410206754, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckcr2fa", "link_id": "t3_2fqp4o", "parent_id": "t1_ckco6nd", "retrieved_on": 1427121604, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dianasaurusmex", "author_flair_css_class": null, "author_flair_text": null, "body": "It goes a little deeper than a blood disorder, as it is a component of the blood that is incompatible. There are treatments, but they can be pretty harsh. An IVIG (antibody) treatment once a week that can take hours to administer, and a daily dosage of Prednisone to suppress mom's immune system. I sincerely hope that one day it's something that can be solved with a shot!", "controversiality": 0, "created_utc": 1410229740, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckd2yy8", "link_id": "t3_2fqp4o", "parent_id": "t1_ckciwi2", "retrieved_on": 1427115951, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "dianasaurusmex", "author_flair_css_class": null, "author_flair_text": null, "body": "Did you guys decide to have any more children? Honestly, looking at the treatment options, it doesn't exactly look like a walk in the park. And I my husband and I discussed it: We can't do this again. The NICU...my god. It nearly crushed us. \n\nI would love to have another child, but I am considered high risk and would need to see a specialist before even conceiving. But looking at the options and knowing that there's a 1 in 3 mortality rate? Man, I don't know if I could go through with it. ", "controversiality": 0, "created_utc": 1410229900, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckd31u8", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcigx4", "retrieved_on": 1427115915, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "RaOnSouthProvidence", "author_flair_css_class": null, "author_flair_text": null, "body": "We will likely not have more children biologically. My husband is going to get a vasectomy as soon as possible. I was okay taking the risk, but he certainly wasn't. I can understand either decision so we are going to avoid future pregnancies. \n\nWe would like to do foster care for special needs kids in the future. I have so much experience in social services/disability care, plus we already have to live in ADA apartments for our youngest. It seems silly to let that go to waste when we could help other kids. My husband assures me that once he finishes grad school next year and gets a job, that we can begin the home study process. \n\nAnd I feel you on the NICU. A set of twins died while my daughter was in the unit. I could hear their mom screaming down the hall the day it happened. ", "controversiality": 0, "created_utc": 1410230251, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "ckd385b", "link_id": "t3_2fqp4o", "parent_id": "t1_ckd31u8", "retrieved_on": 1427115833, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "durtysox", "author_flair_css_class": null, "author_flair_text": null, "body": "Did you not read her first post to you? Her daughter has the same condition of brain hemorrhage. She has gone through this. ", "controversiality": 0, "created_utc": 1410329669, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cke6gpr", "link_id": "t3_2fqp4o", "parent_id": "t1_ckco6nd", "retrieved_on": 1427096438, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410330456, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cke6nzb", "link_id": "t3_2fqp4o", "parent_id": "t1_ckbtvco", "retrieved_on": 1427096344, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "durtysox", "author_flair_css_class": null, "author_flair_text": null, "body": "Your baby is too young to know a prognosis! I'd say hang in there and don't give up, yet. Keep giving love and hope for at least another 6 months. Babies recover fast from brain injuries at this age. Give her a chance to surprise you. ", "controversiality": 0, "created_utc": 1410330616, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cke6pfk", "link_id": "t3_2fqp4o", "parent_id": "t1_ckcbn9k", "retrieved_on": 1427096325, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": true, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1410342318, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cke90de", "link_id": "t3_2fqp4o", "parent_id": "t1_cke6gpr", "retrieved_on": 1427095250, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}