{"submission": {"author": "tessiegamgee", "author_created_utc": 1330213210, "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "author_fullname": "t2_70ojd", "created_utc": 1413092039, "domain": "self.Mommit", "edited": 1413164531, "full_link": "https://www.reddit.com/r/Mommit/comments/2j096l/im_afraid_to_leave_my_husband_alone_with_my_son/", "gilded": 0, "id": "2j096l", "is_self": true, "media_embed": {}, "num_comments": 83, "over_18": false, "permalink": "/r/Mommit/comments/2j096l/im_afraid_to_leave_my_husband_alone_with_my_son/", "retrieved_on": 1441126896, "score": 39, "secure_media_embed": {}, "selftext": "UPDATE: We are nearly positive the problem is sleep apnea.  He is overweight.  He has a family history.  His breathing patterns at night are consistent with those of obstructive sleep apnea.  Thank you Reddit for your collective knowledge! \n\nI went out to ask him about the apnea, and he had passed out on the couch with a full, cold glass of beer next to him, glasses on, and remote in hand.  I had to physically shake him to rouse him.  We both think this is the possible problem and he's going to pursue weight loss as a course of action until we can schedule a sleep study. \n\nPS-- the people who thought I was super-overreacting by being desperate for a solution to this problem can take a chill pill themselves.  I'm by no means a perfectionist, nor am I uptight about... anything.  My kid eats, sleeps, and gets held or played with whatever feels right for all of us at the time.  I don't expect perfection out of my husband, either, which is why I forgave (but did not forget!) the first time this happened.  Of course I trust him.  I prefaced the whole post with \"wonderful relationship.\"  I believe everything he says.  We just had a very real problem that needed a solution, not more judginess.  \n\nMy husband and I have a wonderful relationship.  We have a happy, healthy 5 1/2 month old son.\n\nAt the beginning of July, when our son was ~2.5 months old, I had to stay at work later than my usual 10PM as the next shift was running extremely late.  I called at 9:30 to let my husband know that he should defrost some more milk-- no answer.  I sent him a Google Hangout message.  No answer.  I sent him a Steam message through my phone, thinking maybe he was playing a video game.  No answer.  I figured he had left his cell phone next to his computer, as he sometimes did, and was in another room with baby.  I tried to call again three times-- thinking certainly he would be getting worried-- but to no avail.  I got home around 11:30 to find a raccoon on my front doorstep.  Fuck if I was going to mess with him!  Went around to the porch to come in the side door.  As soon as I stepped into the porch, I knew something was wrong.  The light was on in the office, and I could hear my son SCREAMING.  That sort of **I am in pain** scream.  I go to open the door to get him-- and the chain is on the door so I can't open it. I yell for my husband, no good (obviously.)  Scream his name.  No good. I am less than 2 feet from my baby, who was in his rocker in his PJ's, with a snuggly blanket around his legs and a pacifier next to his head, but I can't get to him.  I try unsuccessfully to unlock the chain with my hand.  Try to call my husband again.  See/hear his phone right in front of me on the desk.  After what felt like an eternity but was probably 2 or 3 minutes, I grabbed an axe from the porch and lit out after the racoon so I could get in the front door.\n\nI'm thinking the worst.  My husband has had a seizure.  Maybe he's dead.  Maybe he completely lost it and left the house.  Maybe he's drunk off his ass and passed out.  Someone's broken in and tied him up and stolen all of our stuff.  I didn't know what to think, but Momma Bear had kicked in at that point, so I'm sure I was a sight to behold-- running and yelling down my sidewalk at midnight, and waving an old rusty axe.  The racoon didn't move until I got about 5 feet away.  Luckily he took off when I got close.  \n\nI bust in the house, and the bedroom is about 10 feet from the door.  My husband is laying on the bed.  I scream his name from the doorway and run to his side.  He wakes up.  He was **sound the fuck asleep.** Curled up in bed, on top of the covers, in his gym shorts and undershirt.  I yelled \"WHAT THE FUCK IS WRONG WITH YOU, OUR SON IS SCREAMING.\"  I came within an inch of throwing the rusty old axe at him.  He wakes up in a daze, wondering what I'm so worked up about.  He finally (after ~5 seconds) gets the message that our son is screaming at the other end of the house.  He goes to get him, still in a daze.  I'm thinking at this point that surely he's drunk.  Why else would he leave our son unattended like that?  Realize my mistake and go take the baby from him as soon as he's picked him up.  I'm still flipping out.  Realize the baby is still freaking out, and I'm not helping that situation, so I calm down some.  Feed the baby and get him to sleep safely in his crib with the monitor on.  Talk to husband, who fell back asleep in the meantime.  He insists he hadn't had anything to drink, and was just very tired, and wanted to rest his back.  And fell asleep.  He told me (and I believe him) that he knew I would be home any minute and the baby was asleep when he left him, and it hadn't been that long-- but that he'd just fallen asleep accidentally.  My issue wasn't that he had fallen asleep while in charge of our son, but that if something had happened (I was stuck at work all night, I was in a car accident, something had happened to my parents and I had to go to the hospital with them, etc) he never would have answered the phone (which had been left in the office, as I thought) or woken up and our son would have been left out there for 9+ hours by himself, crying uncontrollably until he passed out.  \n\nHe apologized and blamed the long work day, and taking care of a baby for 4 hours after that.  He blamed his cell phone for not ringing.  I get on him about making excuses, and he says \"I feel bad enough about this already, alright?  I get it.\" \n\nI'm not sure what happened after that.  The adrenaline faded.  I do remember telling my husband, \"This will never happen again.\"\n\n------\n\nFast forward to tonight.  I worked all day and brought home another infant who belongs to some friends of mine who wanted to attend an outdoor festival.   We have a great time with my 12-year-old brother and the two babies.  Little girl's mom and my mom come to pick up their respective kids.  Husband's had a fair amount of video game time that evening, so I request that I can eat a snack and play some video games.  He's tired.  Fair enough!  Offers to take the baby into the bedroom and watch youtube together so I can play.  Sounds like an awesome idea.  Brings baby out after a little while so I can feed him his before-bedtime solid food.  Take a clean, happy, full baby back into my husband, who's still watching Youtube in the bedroom.  Hand him over and get back to my video game.  About half an hour later, I see a funny Reddit post and send it to my husband's phone.  Don't hear back in ~30 seconds, so I go back to tell him about it.  I get about halfway there before I hear that sound again-- the **I AM IN PAIN AND ANGUISH** scream that makes a mother's heart stop.  Say, \"Oh my god\" and run to his room.  He's face down (well, I say face down-- he can hold his head up great now so he wasn't wallowing in it) in a puddle of drool/spitup, up against the rail, red-faced from crying so hard.  Pick up baby, calm him down, go in to bedroom to ask husband wtf-- and he's there on the bed asleep with the baby monitor on the bed next to him.  Apologizes for not hearing the baby.  Baby is soaked, so go to change him and only get halfway through before going back into the bedroom to tell my husband that he needs to get up and change the sheet and blanket in the crib.  He must have been really out of it because he asked my \"why\" after I'd just told him that our son was screaming in a pool of drool.  This whole time my son is just clinging to me, quiet as a mouse.  It was almost like he was in shock-- but once I sat down with him to feed him, he was all smiles and cuddles.  He went right to sleep.  I rocked him for about half an hour after he fell asleep, thinking how precious he is, and marveling at how his loving, doting Daddy could possibly abandon him like that AGAIN.  This time my husband was much less apologetic and was in and out of sleep the whole time I tried to talk to him about it.  I gave up but was too worked up to try to go to sleep.\n\nI debated calling my mother, but she'd never forgive him.  I thought about calling a friend, but it was late and all of our friends are mutual friends-- and I feel like it would be a huge breach of trust to talk about this very sensitive, personal problem with a friend of his.  So, I turn to you, Reddit.  I'm afraid to leave him at home with my husband at night.  I work 3 nights a week though-- and we can't go without that income.  My husband doesn't think that his is a very big deal, but to me it's a HUGE deal.  These are situations that ended in pretty much the best possible way, with Momma swooping in to rescue screaming baby while Daddy snoozes, and everyone is OK in the end.  To me, this is a much bigger deal with potentially deadly consequences. \n\nPlease help.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I'm afraid to leave my husband alone with my son. Please-- I need your help.", "url": "http://www.reddit.com/r/Mommit/comments/2j096l/im_afraid_to_leave_my_husband_alone_with_my_son/"}, "comments": [{"archived": false, "author": "beanbaconsoup", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not normal that he can sleep through the baby crying like that- does he have any sort of sleep disorder?", "controversiality": 0, "created_utc": 1413093654, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75fqp", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426569137, "score": 22, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "eldurphoenix", "author_flair_css_class": null, "author_flair_text": null, "body": "I am convinced men do not have the same fight or flight response to baby's cries. For evolutionary reasons, a woman reacts to the cry of a baby.. I'm sure it's something to do with the fact that she alone (until modern formula) is the one who provides sustenance.  Whatever the scientific reason behind it, men have the ability to block out the sounds of babies crying, especially when they perceive their own needs as greater.  \n\nMy advice, since kicking your husband in the balls doesn't seem like a viable option, is to arrange for a friend to watch your child (offer to trade for them to have a date night instead of $$) on those nights and insist your husband get (another?) job so you can stop working nights since you feel he is unable to be responsive to the needs and/or safety of your son.  He will not understand how serious his inactions are until you show him through your actions. That trust is very hard to rebuild.  You will most likely have trouble dealing with the anxiety of even thinking about leaving kiddo alone with him until the child is well beyond toddler years.\n\nTl;dr - trade services with a friend who will sit for you those nights until your husband gets a (second) job so you can quit those shifts to be with your son.", "controversiality": 0, "created_utc": 1413093691, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75g2x", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426569131, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Wesa", "author_flair_css_class": null, "author_flair_text": null, "body": "How much sleep does your husband get? Is he normally a deep sleeper?", "controversiality": 0, "created_utc": 1413093749, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75gn9", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426569124, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1413093758, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75gq6", "link_id": "t3_2j096l", "parent_id": "t1_cl75fqp", "retrieved_on": 1426569123, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "this-one-is-mine", "author_flair_css_class": null, "author_flair_text": null, "body": "Assuming you follow crib safety guidelines it doesn't sound like your son was in any danger. I would be upset too if I were you but it seems like a solution is possible.\n\nCould you put a cot or something in your baby's room for your husband to sleep on when he's alone with the sleeping baby? That way he couldn't miss the cries.", "controversiality": 0, "created_utc": 1413094140, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75kdv", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426569076, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "He had Epstein Barr whole in college, but nothing wrong now as far as we know. The issue is that he leaves baby in another room and then falls asleep--without turning the baby monitor on or up.", "controversiality": 0, "created_utc": 1413094504, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75nrw", "link_id": "t3_2j096l", "parent_id": "t1_cl75fqp", "retrieved_on": 1426569032, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Though I agree with your point that men are less responsive, I have hope that this problem can be solved without bringing friends into it. (Plus, who would want to keep an infant every weekend night? We don't have friends that close.) \n\nThis approach would also deal an irreparable blow to my husband's confidence in his parental fitness.", "controversiality": 0, "created_utc": 1413094856, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75qy0", "link_id": "t3_2j096l", "parent_id": "t1_cl75g2x", "retrieved_on": 1426568991, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "He usually goes to bed around 10:30, gets up once around 3 to change baby and bring him to me to feed, and then gets up for good between 6 and 7.  He is a bit of a deep sleeper, but I've seen worse. He is out of it, comprehension wise, when just waking up, though.", "controversiality": 0, "created_utc": 1413095037, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75sjp", "link_id": "t3_2j096l", "parent_id": "t1_cl75gn9", "retrieved_on": 1426568970, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "UnidentifiedEntity", "author_flair_css_class": null, "author_flair_text": null, "body": "Could you possibly move the baby's crib into the bedroom? (Preferably like right next to your husbands side of the bed) That way he'd be sure to wake up and hear him crying. ", "controversiality": 0, "created_utc": 1413095169, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75trk", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426568954, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "That would be ideal, wouldn't it? Unfortunately, my husband is 6'2\" and the nursery is too small for a full size bed.  The other alternative is a rock and play a sleeper, which my son still cuddles up in for bedtime bottles with Daddy on nights I work. He usually carries it with him to whatever room he's in, and puts it so he can hear if the baby cries. The issue is that he doesn't stick to routine all the time, especially when he just lays down for a second and then is out like a light.", "controversiality": 0, "created_utc": 1413095307, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75uyc", "link_id": "t3_2j096l", "parent_id": "t1_cl75kdv", "retrieved_on": 1426568939, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Unfortunately, there is not enough room. Most nights, if he is going to bed when I'm not home, he will put baby in a rock and play sleeper and carry that into the bedroom with him. Then puts baby in his crib as soon add I get home. It's just not *always* happening that way.", "controversiality": 0, "created_utc": 1413095482, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl75wi4", "link_id": "t3_2j096l", "parent_id": "t1_cl75trk", "retrieved_on": 1426568919, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "emmatini", "author_flair_css_class": null, "author_flair_text": null, "body": "First of all, is your husband okay? I mean, that sounds like there could be something wrong to be so tired you're near unconsciousness like that. What about his hearing? Is there any chance he is doing it on purpose, like some kind of passive aggressive issue? Maybe when you hear your baby crying like that, you could go get your husband and show him (obviously a quick check on bub to ensure they aren't being eaten by an alligator or something first) what you are talking about, instead of getting him once baby has calmed down? I know that sounds a little mean, but otherwise, if he only sees the 'after' he might not see why you are so upset.\n\nIs it a parenting difference between you two? How is he at responding to baby signals the rest of the time? \n\nWhat does he have to say about it? Does he just brush it off as not a big deal? Have you tried talking to him about your worries calmly (as in not in the heat of the moment)?", "controversiality": 0, "created_utc": 1413096856, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl76877", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426568767, "score": 36, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "UnidentifiedEntity", "author_flair_css_class": null, "author_flair_text": null, "body": "I dunno, I was a super paranoid new mom and I work overnights as well. (I was pleasantly surprised and my husband turned out to be a rockstar in terms of taking care of our son while I was gone) but we have a dropcam. Its a webcam like baby monitor that comes with an iphone/android app that you can watch anywhere and alerts you to any movement/noises. I'd often check the baby monitor while at work and I absolutely insisted my husband keep his cellphone volume on. If I got an alert on my phone, I'd click the app and I'd give him like 3-5 minutes to respond and I'd be watching lol. If he didn't get up and get the baby, I was on the phone calling him. I probably drove the poor man nuts but you can bet he was waking up and I started to relax knowing our baby was in good hands. ", "controversiality": 0, "created_utc": 1413097019, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl769ip", "link_id": "t3_2j096l", "parent_id": "t1_cl75wi4", "retrieved_on": 1426568750, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "freckledcupcake", "author_flair_css_class": "lightcoral", "author_flair_text": "Violet born 7/26/13", "body": "You need to have a place for the baby to sleep in the room with him. Our bedroom was 10 x 12 and we fit a full size crib in our bedroom, between the wall and the bed. Make it work. No excuses. You need to have a \"come-to-jesus\" level talk with him about how completely unacceptable this is. \n\nMy husband is literally the deepest sleeper (and slowest waker) I've ever met, but we had the crib side-carred to the bed in our room, and I was never worried he wouldn't get her if she was crying. ", "controversiality": 0, "created_utc": 1413097128, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl76ag7", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426568738, "score": 38, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "magdalenmaybe", "author_flair_css_class": null, "author_flair_text": null, "body": "I remember being so utterly exhausted when my children were infants/toddlers that there were a couple times when I fell into a dead sleep totally inadvertently, usually under circumstances similar to your husband in the first situation. Baby's in the crib, clean, full, sleepy and safe ... I'll just rest my aching back for a sec ...wake up a full three hours later to him/her screaming their little lungs out (awake now; clean no more, hungry, lonely - but still ultimately safe). Hub was usually working, so wasn't around to pile on as I awoke in an absolute and instinctive panic and ran to them in the room next to mine, feeling like the worst mom on the planet.\n\nI'm sure I woke up the way I did because my mama-wiring overruled my body's forced shutdown, but babies shriek to wake the dead the way they do for a reason too. We're each wired to respond to the other. \n\nDads can be just as engaged, but it's usually an opt-in kind of thing. It's not innate in all of them. I don't think your husband's being a neglectful dick. I think he hasn't yet fully internalized the role of provider/protector that we come with as standard equipment. Maybe a constructive, non-judgey, non-accusatory conversation about it would help, sincerely looking for solutions like the cot in the nursery. He could probably use some insight into the reasons for your fears about the baby in general, without feeling like the complete cause of them too. Nothing you wrote suggested he doesn't truly love your son. He may share your fears ... it's common ground, and a really good step toward that internalization of his Daddy gig. If this is your first baby, give everybody (you, him, the baby) a couple of years, at least, to learn to family. It's both a skill and an art. Your son is fine ... that's what matters. Good Luck with it all :).", "controversiality": 0, "created_utc": 1413097741, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl76fd8", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426568674, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Is it an option to have the baby monitor always plugged in and always turned on?", "controversiality": 0, "created_utc": 1413101701, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl777i2", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426568239, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fruitjerky", "author_flair_css_class": null, "author_flair_text": null, "body": "Once is an accident, twice is neglect. What have you said to your husband about this? Two times already you've come in to find that the baby's in distress and he's not responding to either the baby or his phone--I think it's reasonable for you to feel uncomfortable leaving your son with him. Ask him how he'd feel if another caregiver had done that.", "controversiality": 0, "created_utc": 1413102042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl779st", "link_id": "t3_2j096l", "parent_id": "t1_cl75nrw", "retrieved_on": 1426568209, "score": 30, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mcdoxieson", "author_flair_css_class": null, "author_flair_text": null, "body": "This IS a huge deal. If you'd left him with a babysitter and they did that, you'd never consider leaving baby with them again. Ask your husband if he would be fine with another carer doing what he did.\n\nI would be sitting down (pick the least stressful time you can, where you're not fighting or anything) and having a serious discussion about this. The fact that you are so upset should motivate him to help, and treat it as a 'what can WE do to solve this problem' rather than just putting it all on him. Should he be going to bed earlier, can you change where baby sleeps, change routine slightly, change baby monitor, make him send you check in texts while you're at work? \n\nPersonally I would give him one more chance with your discussed changes, and if it happened again I'd be thinking he had to get a second job &amp; I'd leave mine, because I didn't trust him with baby. ", "controversiality": 0, "created_utc": 1413102811, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl77eps", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426568145, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "derva", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow.  \nTLDR: ‘abandon’ is a really strong word to use about what happened there.  This guy is your life partner, and he’s learning just like you are… I think you need to take off the ‘judge and jury’ attitude and step back a bit.  You are not better at this than your husband, and believing that you are will eventually be toxic to your relationship.  He’s learning too.  And I’m sure you have BOTH made mistakes.  It would be good for your husband to make sure he is reachable – so he does need to make sure he has a phone nearby.  But other than that, this is no big deal.\n\nBefore I go on – fellow mom of 2 here - 3 yr old and 5 yr old.  I have been there… and it will be ok, the baby will be ok, and you guys will figure it out.. but I think you need to reset some expectations and check some ideas at the door.  Here’s what I thought while reading your rant:\n\n1)\t“less perfection, more ‘good enough’ or ‘better next time’ - It's easy as a new mother to be a perfectionist and want everything to go exactly a certain way.  It doesn't last.  I used to measure milk bottles to the exact ounce and refuse to give the baby more because that wasn't what the books said.  Why the heck not? the baby was hungry!!! but in my head I was controlling it and doing it 'right'.  That was crazy.  babies are resilient and pretty easy.  let them eat until they are full.  if they don't ask to eat, it's ok if the bottle is 30 mins late.  It's ok if daddy forgets it... the baby is not going to starve in a few hours time.  each minute or hour is a lot less important than what happens over the course of the week.\n\n2)\t“don’t give the baby feelings he is too small to have” babies really are that simple - do not read more into their emotions than are there.  they are eating pooping crying machines.  he is not clinging to you in fear, he's not in shock... he also probably didn't care that much he had drool all over him.  he was just hungry, and he was using the only communication tool he has. \n\n3)\t“You are not better at this than your husband” – and believing that you are will eventually be toxic to your relationship. You both need to learn how to be parents.  You may get more practice sooner – but he needs practice too and he can and will get to be as good at it as you.  You will regret it if you create a situation where you are the all-knowing expert on the baby and he can’t do anything right.  After a while that will start to feel shitty for him and he’ll stop trying – and I don’t think you want that.  The best thing you can do is step back and give him space to figure it out.  And if he makes a mistake, let him say sorry and move on.  He feels bad and panicked about it too, but he doesn’t need scolding from you.  He’s already beating himself up about it.\n\n4)\tYour husband is human.  And a male human.  And they really do sleep through babies crying.  ‘Abandon’ is a strong word to use about a guy who is probably tired, and is wired differently than you.  As per point #3. – use liberal doses of forgiveness, and acknowledge that you are both learning.  One day you are going to make a mistake, and you’ll need that same support from him! As a mom you will hear crying that your husband honestly will not hear.  5 years in, my husband still thinks I have super powers b/c I’m already walking to the kids bedroom before he hears the first cry.  Dad’s are wired for different things. Those differences are important and you need them.  Later in life Dad will be the one who lets your child experience thrilling new things, throw him high in the air.  He will also be the one to pull junior away from a speeding car or catching him falling off a bike faster than you do.  Dads have a super high tuned danger ‘alarm’…   have a look at this article: [Why Women Wake When a Baby Cries](http://parenting.blogs.nytimes.com/2009/12/08/why-mom-wakes-up-when-baby-cries/?_php=true&amp;_type=blogs&amp;_r=0).  basically *“these differing sensitivities may represent evolutionary differences that make that make women sensitive to sounds associated with a potential threat to their children while men are more finely tuned to disturbances posing a possible threat to the whole family”*\n\n5)\t“Find the trust for your husband”  Life is long and you have many, many big and small decisions to make for your child.  The only way it works is if you get back to trusting him. Especially as your son gets older.  He needs to see that you both respect each other.\n\n6)\t“you don’t want to be in charge of all decisions ever” – 18 years is a long time to have to decide everything. Life is much better if Dad feels good about being able to decide what goes in the lunch, or if he does the bath, or will do bedtime. but he wont’ do ANY of that, or even try, if you are going to be hovering, disagreeing or criticizing. \n\n", "controversiality": 0, "created_utc": 1413106351, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7806l", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426567868, "score": 78, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "thedifficultpart", "author_flair_css_class": null, "author_flair_text": null, "body": "What about setting up s pack n play in your bedroom so baby can sleep there for when hubby feels he has to nap? ", "controversiality": 0, "created_utc": 1413110500, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl78n4j", "link_id": "t3_2j096l", "parent_id": "t1_cl75uyc", "retrieved_on": 1426567569, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AlphaDeltaAlpha", "author_flair_css_class": null, "author_flair_text": null, "body": "With my first, I was like OP's husband. I was just so exhausted that I would fall asleep and even screaming wouldn't wake me. My husband woke me a few times asking how I could possibly not hear her, but I just didn't. I'd fall asleep nursing her. I'd fall asleep trying to put her to bed or down for a nap. I'd crash out watching cartoons with her. \n\nIt scared me a few times, but sometimes you can't control it. You reach a point of exhaustion where your body just takes over and you have to get some sleep. \n\nI don't think he's being malicious with it (as in ignoring him and feigning ignorance); I'm sure he's just overextended and it's taking a toll physically. \n\nTo OP: You need to talk to your husband like the above comment said and explain your side. Ask him how he feels and if he's having any problems. Maybe see if a family member or friend can take the baby for an afternoon or a night (if you're comfortable with that) and you **both** get a much needed break. \n\nDon't let it freak you out that he doesn't have the same primal response that you do. It isn't built in for everyone and there's a learning curve for first-timers.\n\nEdit: built, not build ", "controversiality": 0, "created_utc": 1413111435, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl78sbv", "link_id": "t3_2j096l", "parent_id": "t1_cl76fd8", "retrieved_on": 1426567502, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AlphaDeltaAlpha", "author_flair_css_class": null, "author_flair_text": null, "body": "Those are all really excellent points. Sometimes we put our emotions on the kids, when really they are pretty indifferent to things as long as basic needs have been fulfilled. \n\nIt would be a terrible thing to alienate Dad so early on. Too much criticism turns people off and it will be a lot harder to get him to offer to help if he knows it won't be good enough.", "controversiality": 0, "created_utc": 1413111855, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl78ump", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426567472, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "squigglesthepig", "author_flair_css_class": null, "author_flair_text": null, "body": "That level is distress can psychologically damage baby, especially if frequently repeated. So there is real danger.", "controversiality": 0, "created_utc": 1413112097, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl78w3j", "link_id": "t3_2j096l", "parent_id": "t1_cl75kdv", "retrieved_on": 1426567453, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "therowan", "author_flair_css_class": null, "author_flair_text": null, "body": "You said it perfectly. ", "controversiality": 0, "created_utc": 1413112101, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl78w46", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426567453, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "zhiface", "author_flair_css_class": null, "author_flair_text": null, "body": "Now that the crib is in our room, the bed has to go right against the front of the dresser so there is room to get to the crib. Our bed constantly slides back and forth the two feet from dresser to crib depending on what we need lol", "controversiality": 0, "created_utc": 1413112359, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl78xlo", "link_id": "t3_2j096l", "parent_id": "t1_cl76ag7", "retrieved_on": 1426567434, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "HeartbatsAngel", "author_flair_css_class": null, "author_flair_text": null, "body": "I honestly have no advice for you as our situations are a bit different. I'm a SAHM so the kids are my main responsibility. But my husband does take over care of our infant son in the evenings so I can have a bit of a break. I'm mainly commenting to let you know you're not alone. My husband has sleep apnea and is hard to wake up, even when our son is lying next to him screaming his head off. It can be frustrating and down right scary sometimes. If you ever need someone to talk to or just vent with, feel free to message me.", "controversiality": 0, "created_utc": 1413115332, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl79gia", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426567189, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kaiserverbalbyrnes", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you honestly know how long your baby cries before you wake up?", "controversiality": 0, "created_utc": 1413119689, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7aefm", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426566691, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "HiveJiveLive", "author_flair_css_class": null, "author_flair_text": null, "body": "Something to think about is the role sleep apnea may play. Lots of men have it and it results in almost narcoleptic-type episodes of sleep because the sleep they are getting is not sufficient for the body's needs.\n\nCheck out symptoms lists online and see if anything looks familiar. Have him start sleeping on his side- that can be a tremendous help right away. \n", "controversiality": 0, "created_utc": 1413120016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ahly", "link_id": "t3_2j096l", "parent_id": "t1_cl75sjp", "retrieved_on": 1426566653, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "You. I like you. \n\n\nI've been sound asleep and not heard the baby. I had the monitor on as loud as it would go right by my head. After 4 weeks of getting up for the day at 4am, and 3 days of sick baby &amp; toddler, I was out. My husband literally shook me awake that night. \n\nIt happens. You feel horrible about it, but eventually the exhaustion will win. ", "controversiality": 0, "created_utc": 1413121336, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7au91", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426566486, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "acinomismonica", "author_flair_css_class": null, "author_flair_text": null, "body": "Op please read this. Your husband is not doing this on purpose.he's a good man.don't accidentally hurt him and say things like you are neglecting and abandoning your child,especially when there are people actually doing this in the world. Have him lay on the floor, put a pack n play in the living room so he can sleep on the couch, a cosleeper, or Get a vibrating baby monitor to help wake him up. Work with your husband since he sleeps very heavy, don't accuse him of abandoning your son because if it was the other way around you'd feel awful. ", "controversiality": 0, "created_utc": 1413121420, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7av1t", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426566476, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "A babysitter is paid to watch the baby. That is their job. A parent is with a baby all the time. They have to sleep too. This is NOT anything like if a babysitter was in this situation. \n\nI think you're blowing this out of proportion. A problem that should be fixed? Yes, but not the end of the world. ", "controversiality": 0, "created_utc": 1413121466, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7avik", "link_id": "t3_2j096l", "parent_id": "t1_cl77eps", "retrieved_on": 1426566471, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "Ours is always on. We just keep it on the base in our bedroom. When we need to have them with us while we're in other rooms, we just go pick it up and hang it around our necks. ", "controversiality": 0, "created_utc": 1413121518, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7avzn", "link_id": "t3_2j096l", "parent_id": "t1_cl777i2", "retrieved_on": 1426566464, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "This. For all OP knows, the baby had just started crying. BOTH of my sons go from sleeping to \"Holy Hell! The world is ending!\" in less than 1 minute. ", "controversiality": 0, "created_utc": 1413121586, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7awnr", "link_id": "t3_2j096l", "parent_id": "t1_cl7aefm", "retrieved_on": 1426566456, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Teriyaki_Pterodactyl", "author_flair_css_class": null, "author_flair_text": null, "body": "Daddy may need a sleep study. ", "controversiality": 0, "created_utc": 1413122536, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7b69v", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426566330, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "earthpeesfire", "author_flair_css_class": null, "author_flair_text": null, "body": "New rule: when he's home alone with the baby, the monitor will be turned on and the volume up *at all times*.  Would that solve the problem?  ", "controversiality": 0, "created_utc": 1413122867, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7b9t2", "link_id": "t3_2j096l", "parent_id": "t1_cl75qy0", "retrieved_on": 1426566285, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Pawprint959", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine slept through me going into labor. Some guys just sleep through what they don't deem a priority. ", "controversiality": 0, "created_utc": 1413126716, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ckab", "link_id": "t3_2j096l", "parent_id": "t1_cl75fqp", "retrieved_on": 1426565683, "score": -5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mementor", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for this. ", "controversiality": 0, "created_utc": 1413128016, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7d2g6", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426565447, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "duckherder", "author_flair_css_class": null, "author_flair_text": null, "body": "Came here to say this.  My husband was nearly impossible to wake before his diagnosis, and the level of exhaustion he was at literally landed him in the hospital. The cpap saves his life and also allows him to function during the day. Recently it was broken, and things reverted back to scary quite quickly. Without his cpap the situation you described is spot on to our house, OP.  Before being furious (though I was, and understand) get to a doctor and arrange a sleep study. Don't mess around with sleep apnea. ", "controversiality": 0, "created_utc": 1413128225, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7d5e7", "link_id": "t3_2j096l", "parent_id": "t1_cl7ahly", "retrieved_on": 1426565409, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "whateverynameistaken", "author_flair_css_class": null, "author_flair_text": null, "body": "Are you sure your husband hasn't been taking drugs of some sort? I know that's quite a bit of an accusation, but you kind of described someone on some sort of drugs. There's a difference between being tired and being out of it. Or maybe he's dealing with some sort of grief. ", "controversiality": 0, "created_utc": 1413128644, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7dbhj", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426565334, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "anwoods", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like you have an exhausted husband.  But, baby still needs cared for.  I know I'm guilty of going into attack mode when something isn't done the way I think it should, so he careful with that.  My husband basically doesn't listen when I go into attack mode, but listens wonderfully if I can remember to have a discussion instead of a lesson.  Have you thought about getting a video monitor that you can access from your phone?  There are a lot of those out there.  Then if you're at work and you check in and something isn't safe, you could call him (if he would answer) or go home...etc.  you might also have him checked medically for things like sleep apnea.  I have sleep apnea and if it's not treated you are absolutely exhausted.  I was sleeping through baby crying-luckily my husband wakes up to every little whimper our son makes.  Good luck.  I know this is stressful, but be careful how you handle it.  You don't want to ruin a marriage over this.  ", "controversiality": 0, "created_utc": 1413128900, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7dfa4", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426565281, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1413129328, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7dln5", "link_id": "t3_2j096l", "parent_id": "t1_cl7dbhj", "retrieved_on": 1426565199, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "clumsyotter", "author_flair_css_class": "black", "author_flair_text": "Boy 04/06, Girl 05/13", "body": "My thoughts as well. ", "controversiality": 0, "created_utc": 1413129886, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7dtz4", "link_id": "t3_2j096l", "parent_id": "t1_cl7dbhj", "retrieved_on": 1426565091, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "GreetingsNsalutation", "author_flair_css_class": null, "author_flair_text": null, "body": "I thought the same thing. When she mentioned back pain and the way he was acting immediately made me question a possible pain pill addiction.", "controversiality": 0, "created_utc": 1413130736, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7e6rw", "link_id": "t3_2j096l", "parent_id": "t1_cl7dbhj", "retrieved_on": 1426564855, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "hissxywife", "author_flair_css_class": "green", "author_flair_text": "SAHM to 8 yo boy", "body": "My son is 7, almost 8. So I remember these times, although it's been awhile. My husband and I both got so exhausted in his first year that there were times he'd be crying in his room and neither of us would hear him, even with the monitor on. \n\nIt sounds like you both need a break. I assume your husband is working too and is probably tired at the end of the day. I highly doubt he was thinking \"well, the baby's safe, I'm going to go pass out and pretend not to hear him when he wakes.\" He's probably worried about his own mistakes but doesn't want to tell you that because you're already irate.", "controversiality": 0, "created_utc": 1413131278, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7efdb", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426564744, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "nervousnell89", "author_flair_css_class": null, "author_flair_text": null, "body": "I think the issue stands, the husband is responsible for watching the baby alone only three nights a week, he should be making more of an effort to stay alert and capable of caring for the baby. This means keeping your phone on you at all times in case of an emergency, if you might fall asleep setting an alarm for yourself as a precaution, turning the monitor up all the way, etc.\n\nNow it is important to correct this behavior and people make mistakes, but OP said the second time it happened he was more unapologetic, and if it happened a second time to me, I would have a hard time being comfortable leaving my daughter alone with my husband until there was improvement on the situation. I'm not saying people don't make mistakes, but if you knowingly leave a child in the care of someone that has a history of sleeping through crying, not only is it neglectful, it's dangerous. ", "controversiality": 0, "created_utc": 1413131915, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7epnb", "link_id": "t3_2j096l", "parent_id": "t1_cl7avik", "retrieved_on": 1426564610, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CharlieChuu", "author_flair_css_class": null, "author_flair_text": null, "body": "I strongly recommend getting a landline put in that only you and maybe your parents know the number to. One that is cordless but rings from the base and the receiver. Have a base in the bedroom and in the living room so anywhere he could fall asleep (bed or sofa) he can be jarred awake by your call by the unholy loud ringer!", "controversiality": 0, "created_utc": 1413132060, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ery6", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426564582, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AK2K12", "author_flair_css_class": null, "author_flair_text": null, "body": "So much of this is exactly what I thought when reading this post. It's not like he's locking the kid up so he can drink or do drugs. My husband is a heavy sleeper, and while it can be frustrating, it's not like he was ignoring our sons cries. It was completely un intentionally. Not saying it's ok, but no one's perfect. The baby wasn't harmed either time.  Just need to find another solution. ", "controversiality": 0, "created_utc": 1413132247, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ev11", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426564541, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "Biologically, father's are typically not \"wired\" like mother's to respond to their baby's crying. So while even a mother who used to sleep very deeply and would not wake up for most noises pre-baby will hear every little peep once her baby is born, a man might not experience the same change (although some do - its not a choice though). \n\nNow, biologically this might not be something he can change. However, there are alternative arrangements that can be made so that these situations do not happen in the future. Things like keeping the baby monitor plugged in at all times, or keeping your son in the same room as your husband on the nights that you work. Also, creating a checklist for your husband to run through on the nights that you aren't there - cell phone volume on high, baby in his room or monitor volume on high and monitor plugged in (so it won't die), etc. ", "controversiality": 0, "created_utc": 1413133011, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7f7t4", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426564375, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AK2K12", "author_flair_css_class": null, "author_flair_text": null, "body": "Really? You'd be telling your husband to get another job so you could quite yours to be home over this? That's pretty harsh for what happened. Poor guy would be even more exhausted and never get to see his family. No harm can to the baby either time. The child was in a safe place and, besides her husband being so exhausted that didn't wake up, he did nothing wrong. No way I would be doing something that drastic to the man I've picked to share my life with over this situation. ", "controversiality": 0, "created_utc": 1413133114, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7f9k8", "link_id": "t3_2j096l", "parent_id": "t1_cl77eps", "retrieved_on": 1426564352, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "phin_gage", "author_flair_css_class": null, "author_flair_text": null, "body": "There seems to be a lot of overreaction in this post. You don't know how long the baby had been crying for prior to your intervening. He's putting the baby in a safe place before he falls asleep. I think you need to talk to your husband about how important it is that he wake up, and make sure he has the phone and monitor on and up before he falls asleep (if he is aware enough to put baby to bed he's aware enough to grab his phone and baby monitor). If this continues maybe you could ask that he make it a routine to call and have baby tell you \"goodnight\" to remind him what he needs to do. You need to discuss this when your not already upset, and tell him why it upsets you. You're being waaaaay to harsh, and if you continue feeling this way it could potentially harm their bonding and push him away and feel incompetent. It sounds like the way you react to baby crying is not in a calm manner, and that's not good for him. He looks to you for comfort, and overreacting to his cries will only be harmful to everyone involved. ", "controversiality": 0, "created_utc": 1413134422, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7fwz4", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426564049, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jhartsfi", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for this. I'm a new mom to a 5 week old and a bit of a perfectionist while my husband sort of wings it. It gets on my nerves, but just reading what you wrote really helped me see I need to back off and let him learn just like I'm learning. Seriously, thank you.", "controversiality": 0, "created_utc": 1413134788, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7g3jj", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426563964, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "numberthangold", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes. OP needs to read every word of this. ", "controversiality": 0, "created_utc": 1413135820, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7gn9u", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426563708, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "niccamarie", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you just leave the monitor on, at top volume, all the time? Get a second one that just stays in the bedroom all the time, if you need one in other parts of the house?  Remembering things while sleep deprived is hard.  Anything you can do to take forgetting out of the equation helps.  It's way easier to adapt your environment to your habits than your habits to your environment.", "controversiality": 0, "created_utc": 1413136190, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7guie", "link_id": "t3_2j096l", "parent_id": "t1_cl75nrw", "retrieved_on": 1426563614, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "Same with my husband.  He got a mouthpiece and it has helped with his sleeping and waking.  My husband can have full conversatins with me and still be asleep.", "controversiality": 0, "created_utc": 1413138118, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7hvtc", "link_id": "t3_2j096l", "parent_id": "t1_cl79gia", "retrieved_on": 1426563131, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "lookslikedaria", "author_flair_css_class": null, "author_flair_text": null, "body": "Does he have a drinking problem? Why do you mention alcohol?", "controversiality": 0, "created_utc": 1413139133, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ie65", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426562893, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Phanners", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm glad I wasn't the only one who thought this. ", "controversiality": 0, "created_utc": 1413140215, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ixir", "link_id": "t3_2j096l", "parent_id": "t1_cl7dbhj", "retrieved_on": 1426562642, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "QueenOphelia", "author_flair_css_class": "blue", "author_flair_text": "New Mom to 20mo. Wulfric", "body": "Even well intended prescription drugs could be the source not just self medicating ones. Please keep this in mind. I was having severe migraines for some time and the medication the doctor gave me nearly turned me into a narcoleptic and I have a history of seizures as well (FYI I was off those meds a few years before I had my LO) . I am a heavy sleeper (seriously, like the dead) so is my dad, so is my little sister, my brother, and now my son (nearing 3yrs). During his first few months I slept very lightly but at 6 months or so, I was back to normal, and my son's father would actually have to wake me for nighttime feedings. It's quite a bit of an accusation yes but a legitimate concern, just please (op) don't jump to conclusions on this, he is your husband and partner and you're obviously already not trusting him, take a breather but definitely ask and work WITH him to get the problem solved ", "controversiality": 0, "created_utc": 1413141726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7jpl5", "link_id": "t3_2j096l", "parent_id": "t1_cl7dbhj", "retrieved_on": 1426562278, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kinderheart", "author_flair_css_class": "purple", "author_flair_text": "Little Doom is 3!", "body": "Honestly it sounds like your husband needs more sleep. It doesn't do you any good to berate him and belittle him, it only undermines his confidence in being a parent. Work on finding solutions, not inflaming the problem.", "controversiality": 0, "created_utc": 1413143633, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7kpky", "link_id": "t3_2j096l", "parent_id": "t1_cl75uyc", "retrieved_on": 1426561813, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ryzzie", "author_flair_css_class": "purple", "author_flair_text": "1 Girl age 9, #2 on the way", "body": "I agree here. I think OP should talk to him about this. If dad is really that tired, then maybe he needs a nap before watching baby. Sometimes you just gotta rest, and the body's need to regenerate overrides everything else. \n\nI always want to hope for the best first. ", "controversiality": 0, "created_utc": 1413150529, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7o8dh", "link_id": "t3_2j096l", "parent_id": "t1_cl76fd8", "retrieved_on": 1426559893, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CleoMom", "author_flair_css_class": null, "author_flair_text": null, "body": "Daddy may be simply exhausted.   Wonder what his work schedule and demands are.", "controversiality": 0, "created_utc": 1413153734, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7psco", "link_id": "t3_2j096l", "parent_id": "t1_cl7b69v", "retrieved_on": 1426559167, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "He works 9am-5pm at a mostly desk job.  3 days a week, he leaves work to drive half an hour to get baby, then 15 minutes home.  Weekends off (but I work a 7 hour shift saturday-sunday morning, so he has baby for a big chunk of that day.)\n\nNo volunteer work or extraneous exercise.", "controversiality": 0, "created_utc": 1413159590, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7sjpd", "link_id": "t3_2j096l", "parent_id": "t1_cl7psco", "retrieved_on": 1426557785, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "As long as I've known him, he's just gotten SUPER sleepy all at once when he's ready to go to bed.  He has a snack and 20 minutes later he's nearly incoherent.\n\nHearing is A-OK.  Absolutely no chance he's doing this on purpose.\n\nThe first time, I went in to him first and made him go get the baby so he could see the impact of what had happened.  The second time, I knew husband was OK and just asleep, so I went straight to baby.\n\nNormally, we're 100% on the same page.  He too jumps up at an \"I'm in pain\" cry-- lets baby fuss a few minutes when he's just fussy-- tends to needs without bub having to cry when we know he'll need food/diaper/change in activity.\n\nThe first time, he too was mortified--but also very tired.  We talked the next day and agreed that it would never happen again.  The second time, he totally brushed it off and went right back to sleep.  We did have a constructive talk today--and agreed that if he was feeling sleepy, he's just going to put himself in the same room as the baby.  If baby's in the crib, he's going to get moved to the rock-n-play sleeper in the bedroom, or else Daddy doesn't get to lay down.  My worry is that he's not going to want to move a sleeping baby, and the same situation is going to happen again.", "controversiality": 0, "created_utc": 1413160039, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7sqxr", "link_id": "t3_2j096l", "parent_id": "t1_cl76877", "retrieved_on": 1426557690, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "wearenighthawks", "author_flair_css_class": null, "author_flair_text": null, "body": "My SO doesn't hear my son crying either. Crib is in our bedroom, on my side of the bed. Kid could be screaming bloody murder, SO continues snoring. Has no idea. It's like trying to wake the dead", "controversiality": 0, "created_utc": 1413160255, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7sujm", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426557643, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Possibly-- but that would not have prevented the first episode-- baby was in a bassinet in the office.  ", "controversiality": 0, "created_utc": 1413160969, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7t604", "link_id": "t3_2j096l", "parent_id": "t1_cl7guie", "retrieved_on": 1426557495, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "I know that from the first movement to a real cry is usually about 3 minutes.  From a real cry to the OH MY GOD SOMEONE PICK ME UP I AM DYING IN HERE cry is about 5 minutes after that.  I wake up at some point during the real crying phase at night-- never has it gotten to the screaming bloody murder phase.", "controversiality": 0, "created_utc": 1413161204, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7t9rq", "link_id": "t3_2j096l", "parent_id": "t1_cl7aefm", "retrieved_on": 1426557447, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Not enough room for a pack-and-play, but we do have a little collapsible bassinet that fits!  He usually carries it with him (baby inside) to whatever room he's in.  Just not always.", "controversiality": 0, "created_utc": 1413161297, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7tbdc", "link_id": "t3_2j096l", "parent_id": "t1_cl78n4j", "retrieved_on": 1426557426, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Absolutely positive there are no drugs involved.  His dad had narcotic addiction problems and ended up committing suicide.  As a result, he completely avoids them.  The one time he had to take narcotics for a short-term dental problem, he gave me the bottle and told me to dole out the correct dosage.  \n\nHe's always gotten super out of it when very sleepy, ever since we met 7 years ago.", "controversiality": 0, "created_utc": 1413161496, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7teqy", "link_id": "t3_2j096l", "parent_id": "t1_cl7dbhj", "retrieved_on": 1426557382, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "He is passionate about beer, brewing, fermentation, etc and sometimes doesn't pay attention to the ABV of what he's drinking.  He's been drunk-- like REALLY drunk-- fewer than a dozen times in the 8 years we've been together.  All were accidental.", "controversiality": 0, "created_utc": 1413161610, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7tgps", "link_id": "t3_2j096l", "parent_id": "t1_cl7ie65", "retrieved_on": 1426557356, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "We have a place!  There is a rock-n-play sleeper which folds up that fits wonderfully at the foot of the bed with JUST enough room between bed/dresser to unfold.  First time he left baby in said sleeper in the office.  Figured he'd only be gone a minute to change to PJs.\n\nSecond time, he was going to let baby crawl around in his crib for a while, but did not have volume up on the baby monitor. \n\nIn both situations, the problem was him just falling asleep without planning for it-- not that there wasn't a place for baby to sleep near him.", "controversiality": 0, "created_utc": 1413162004, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7tn29", "link_id": "t3_2j096l", "parent_id": "t1_cl76ag7", "retrieved_on": 1426557273, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I'm a mother like your husband, sometimes when I sleep I'm asleep and that's it. We had a crib in our bedroom for the first year of our daughters life. It was the only way to make sure I woke up and would hear her cry.", "controversiality": 0, "created_utc": 1413162856, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7u10l", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426557094, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ggkimmiegal", "author_flair_css_class": null, "author_flair_text": null, "body": "When my son was a newborn he was terribly colicky.  He would scream his little head off until one or two am. I remember one night my husband offered to take his turn holding the baby. We were up in our room.  I handed the baby off and laid down on the bed. I slept for two hours through my son screaming less than four feet away from me. \n\nI am not saying your husband did well here. I am just saying I can understand being tired enough that he sleeps through it. ", "controversiality": 0, "created_utc": 1413163414, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7uafp", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426556972, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mcdoxieson", "author_flair_css_class": null, "author_flair_text": null, "body": "One of the times he left the baby down the other end of the house without being able\nto hear it at all. I don't think that's at all adequate supervision of a 5 month old baby.\n\nI know not everyone thinks it is a big deal, and I agree everyone has to sleep, hence my suggestion to discuss the problem together and try to find other solutions. But if that was my baby, to me it would be as serious as I had suggested. ", "controversiality": 0, "created_utc": 1413171196, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7xxrd", "link_id": "t3_2j096l", "parent_id": "t1_cl7f9k8", "retrieved_on": 1426555258, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mcdoxieson", "author_flair_css_class": null, "author_flair_text": null, "body": "Babysitters are not always paid though. I wouldn't be happy if it was grandma at my house a few nights a week and the same thing happened. Sometimes the babysitter perspective is useful for the other parent to take a step back and further examine their behaviour. \n\nI only have my kids to go on, but if that was my husband, it would be a major problem, not a minor one. Granted I don't know OPs baby but most babies don't go to full hysterical, wet through the cot sheet, hard to calm down in the few Minutes of crying it should take you to wake up and get to the them. ", "controversiality": 0, "created_utc": 1413171959, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7ya1x", "link_id": "t3_2j096l", "parent_id": "t1_cl7avik", "retrieved_on": 1426555098, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "whateverynameistaken", "author_flair_css_class": null, "author_flair_text": null, "body": "That's great to hear. Just something I thought was worth mentioning, but like some others are saying, extreme fatigue CAN be a symptom of something wrong with your health. Maybe it's something to look in to.", "controversiality": 0, "created_utc": 1413174219, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl7z70k", "link_id": "t3_2j096l", "parent_id": "t1_cl7teqy", "retrieved_on": 1426554671, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "esaruoho", "author_flair_css_class": null, "author_flair_text": null, "body": "Change daddy's diet.", "controversiality": 0, "created_utc": 1413186834, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl82pas", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426553034, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "esaruoho", "author_flair_css_class": null, "author_flair_text": null, "body": "and by snack, you mean what? what's his diet like?\n", "controversiality": 0, "created_utc": 1413186874, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl82pkp", "link_id": "t3_2j096l", "parent_id": "t1_cl7sqxr", "retrieved_on": 1426553030, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Peachmaru", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm late to this, but I read your update and having your husband talk to his doctor is a very good idea. I've been to 3 sleep studies, I don't have sleep apnea I just have \"excessive daytime sleepiness\" and was diagnosed with fibromyalgia. Each sleep study cost me about $800, after insurance. Just a warning. \n\nI have a story for you, just to make sure you know you're not alone. When I was younger than 5, my mom worked 3rd shift, my dad worked days. When my mom was about 6 months pregnant with my little sister (I was 4) her car broke down on the way home from work, a little over a mile from the house, at about 5:00 in the morning. Also it was snowing, we lived in NH and it was the 80s, so no cell phones. She walked to a pay phone and called my dad several times, no answer. So she walked all the way home in the snow, 6 months pregnant, cause my dad didn't wake up. She was fucking livid.", "controversiality": 0, "created_utc": 1413197818, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl84j39", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426552111, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AK2K12", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not saying it's ok, but we all make mistakes and I really don't feel like this is a major one. It's not like he left the baby on the couch where he could roll off or free to roll about the house and get into who knows what. The baby was napping in a safe place when he left and he didn't mean to fall asleep. The next time the mother was there and the child was in the crib. \n\nI feel for this dad because my husband is the same way. He's a deep sleeper and is just stupid when he first wakes up. In no way does this make him an unfit or neglectful father. Is it annoying, he'll yes, but I do understand this isn't something he's doing on purpose. It's just how he is. He's a great father otherwise and I wouldn't dream of punishing him for something he can't control. ", "controversiality": 0, "created_utc": 1413205396, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl8671w", "link_id": "t3_2j096l", "parent_id": "t1_cl7xxrd", "retrieved_on": 1426551334, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Usually he'll have a cheese stick and a tomato with balsamic vinegar. In winter he has two cheese sticks instead.", "controversiality": 0, "created_utc": 1413212499, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl88r30", "link_id": "t3_2j096l", "parent_id": "t1_cl82pkp", "retrieved_on": 1426550141, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "Thank you so much for this reply! We figured a sleep study would not be cheap, but he had not used any of his deductible this year so we are going to wait a few months until the new calendar year. ", "controversiality": 0, "created_utc": 1413212762, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl88v8i", "link_id": "t3_2j096l", "parent_id": "t1_cl84j39", "retrieved_on": 1426550087, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Peachmaru", "author_flair_css_class": null, "author_flair_text": null, "body": "Good idea! Good luck! ", "controversiality": 0, "created_utc": 1413212834, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl88weq", "link_id": "t3_2j096l", "parent_id": "t1_cl88v8i", "retrieved_on": 1426550073, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tessiegamgee", "author_flair_css_class": "green", "author_flair_text": "Mommy to Arthur born 4/23", "body": "OP agrees. It is simply a problem that needs to be fixed, not something to completely change or lives over. Thank you for not being nutso.", "controversiality": 0, "created_utc": 1413212904, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl88xj6", "link_id": "t3_2j096l", "parent_id": "t1_cl8671w", "retrieved_on": 1426550057, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "esaruoho", "author_flair_css_class": null, "author_flair_text": null, "body": "cheese = dehydration = passes out.\n\nget him to drink tons. and tons. and tons. of water. it will improve his sleep if he has a glass or two before going to sleep, and it'll wake him up in the morning or after sleep if he drinks 3 or 4 glasses. and whenever he starts feeling tired, he needs to drinka da watera.\n\n", "controversiality": 0, "created_utc": 1413221002, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl8cvz8", "link_id": "t3_2j096l", "parent_id": "t1_cl88r30", "retrieved_on": 1426548140, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "burket10", "author_flair_css_class": null, "author_flair_text": null, "body": "I wanted to mention narcolepsy as well. I had a client (I handle disability claims) that had narcolepsy. It was not the tradition narcolepsy that you consider  where you just fall asleep, it was more than that. He could barely function certain times of the day and couldn't be woken by family. A crying baby definitely wouldn't wake him. He also fell asleep at inopportune times (including once at my desk). Please get a sleep study, there is a lot they can do here! GOod luck! ", "controversiality": 0, "created_utc": 1413226402, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cl8fo3m", "link_id": "t3_2j096l", "parent_id": "t3_2j096l", "retrieved_on": 1426546843, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Simon_P_Waffle", "author_flair_css_class": null, "author_flair_text": null, "body": "Some good points here. Also some utter nonsense. ", "controversiality": 0, "created_utc": 1413369760, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cla0i6n", "link_id": "t3_2j096l", "parent_id": "t1_cl7806l", "retrieved_on": 1426518950, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}