{"submission": {"author": "cutecottage", "author_created_utc": 1356187443, "author_flair_css_class": "green", "author_flair_text": "Mom", "author_fullname": "t2_9yzns", "created_utc": 1414517307, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/2kl575/on_postbaby_bodies_rant/", "gilded": 0, "id": "2kl575", "is_self": true, "media_embed": {}, "num_comments": 62, "over_18": false, "permalink": "/r/Mommit/comments/2kl575/on_postbaby_bodies_rant/", "retrieved_on": 1441100023, "score": 129, "secure_media_embed": {}, "selftext": "This morning, I read this article in the Washington Post: [\"My child is here, but my body is still not my own.\"](http://www.washingtonpost.com/news/parenting/wp/2014/10/27/my-child-is-here-but-my-body-is-still-not-my-own/?tid=sm_fb) I saw it pop up in my Facebook feed and I got a little excited -- is there really an article talking about the crazy things that happen to your body post-pregnancy without any glamorization?\n\nBut, unfortunately, I was wrong. The article has a few mentions of reality -- juggling groceries and a baby -- but falls into the mom-as-superhero trap (and actually uses that word). \n\nI was really hoping this was an article that presents the reality of a post-baby body -- or at least something close to it. I was hoping it would talk about how, unlike what WebMD recommends, losing all of the weight six weeks after birth isn't possible for most people. Or how there are a good number of us who can't lose a pound while breastfeed and even GAIN weight despite watching our diets. Or how post-partum depression is more than depression and includes a wide variety of mood disorders. Or maybe how your body goes haywire when you stop breastfeeding and many people experience a period of depression. How, even a year after a successful, complication-free emergency C-Section, I still have pains in my lower stomach if I roll over too quickly. How having a baby can completely fuck with your periods and make them debilitatingly painful, even if they were pain free before. How the months-and-months-on-end of sleep depravation fucks with your mood. How being a household with two working parents, a single parent, or one working and one stay-at-home parent are all insanely stressful in their own ways. How fucking maddeningly gendered children's clothes and toys are. \n\nOr something. Something of SUBSTANCE.\n\nI'm so tired of reading articles that make motherhood into something off of Pinterest and paint it to be this grand, blissful, \"I became a superhero!\" experience. Don't get me wrong -- my daughter is awesome, and I'd never change a thing. But having a baby fucks up your body for a very long time, and it (may) never be the same again. Can we talk about the reality instead?", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "On post-baby bodies [Rant]", "url": "http://www.reddit.com/r/Mommit/comments/2kl575/on_postbaby_bodies_rant/"}, "comments": [{"archived": false, "author": "Hammer_of_Antares", "author_flair_css_class": null, "author_flair_text": null, "body": "A-frickin-men.  Some days I wake up and just want to shoot something.", "controversiality": 0, "created_utc": 1414519924, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmcic1", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426306114, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cgsf", "author_flair_css_class": "green", "author_flair_text": "6/14/12", "body": "Yes!\n\nWhen I came home after my second birth, my family visited me at home (with my first I was living across the country). My older brother (who is married and has a kid of his own) exclaimed how I looked 6-months pregnant even though I'd had my baby a few days before. Of course I do!! It struck me how ignorant he was about the post-birth body even though his wife had a baby (though in his defense maybe, his wife is overweight and pregnancy and postpartum looked a lot different on her than me). I had to explain that how I looked was normal. Gah. \n\nIt is unbelievable how much pregnancy and hormones fuck up the female body. You feel out of control, really. There is no standard. I'm embarrassed to see pictures of myself or look at myself in the mirror because of the thirty pounds that are hanging on. ", "controversiality": 0, "created_utc": 1414520447, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmctc0", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305967, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "RBRR", "author_flair_css_class": null, "author_flair_text": null, "body": "I think its important that we write things like this on public forums for other moms so you dont feel as alone. \n\nI gained over 50lbs during pregnancy, i ate well and exercised the entire time. We are 9 months post pregnancy and Im down 40ishlbs but it was a struggle. Not to mention my body is still very doughy and not at all looking like I did before baby. I couldnt lose much of anything while breasfeeding exclusive pumper) and now that im weening im having some pretty intense hormonal shifts. Most of the time i feel like a crazy person. Sleep gets some what better than when she was a newborn but I still feel like a zombie about 60% of the time. My daughter has a lot of medical issues so the stress is higher, I dont have the time nor energy to be a pintrest mom nor really care to be. I think these articles try to depict what moms WANT to be and play into that. Its a shame because that doesnt really describe the majority of women and their experience post baby. ", "controversiality": 0, "created_utc": 1414520474, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmctwl", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305960, "score": 14, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "redditerrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "There is no point in comparing, but people can't resist.  The same as when we are pregnant and get compared in behavior, size, and shape to every other pregnant woman.\n\nI also ended up with an emergency c-section after 36 hours of labor.  I was super fit before and during my pregnancy (kickboxed until 7.5 months, ran until 8 months, lifted on my due date, walked 1+ hours a day for the two weeks my son was past due).  I still gained 60 lbs.  My body wanted red meat and milk, I listened to what it wanted and stressed myself out about every pound.  In 5 months, I lost 65 lbs.  It was brutal to get it all off, but it came off quickly in retrospect.  I also nursed for a year and for me it was impossible to count calories and feed myself and my giant baby.  So, I worked my ass off.  Nothing I hadn't done before, just had to relearn every movement after major abdominal surgery.  There were tears, there was anger, I was furious with my body.  I hated my body for failing me in so many ways. \n\nThat was almost 2 years ago.  Up to a year or so after the surgery I had sharp pains in the gym.  It was a really long healing process.  I am 38 weeks pregnant now with my second.  I have only gained 40 lbs so far, but it has been much harder to work out this time around (nausea, more demanding job, life with a toddler, etc).  I am terrified of how my body will react to losing this weight.  Everyone at my office and in my gym tell me frequently how great I was for losing all the weight so quickly last time.  I am totally intimidated about it this time.  The outside pressure to bounce back is a lot to handle.  And this time I will have a newborn and a toddler, it will not be easier by any means. But somehow I have set this precedent and I have this reputation put on me. \n\nNo matter how it ends up, 'bouncing back' shouldn't be something that I worry about right now.  I should be free to prepare for the birth of my daughter and watch my son grow into a big brother.  I should be pulling my family close and getting ready to embark on this next adventure in our lives, not stressing over what will be said about my body at holidays when I am 5 weeks postpartum.  After all, no one else's body is going to be a topic of group conversation around the dinner table, is it?\n\n", "controversiality": 0, "created_utc": 1414520509, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmcumg", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305951, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Super_Mommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Kinda leaves ya feeling invalidated, doesn't it? ", "controversiality": 0, "created_utc": 1414520534, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmcv6c", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305943, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "uhhidontcare", "author_flair_css_class": null, "author_flair_text": null, "body": "I really just hate everything written about pregnancy and post pregnancy. I only gained 20-30 lbs for both kids and both times I dropped the lbs pretty effortlessly within a few weeks. Although the last one (3 months old now) left me with some love handles that I can't quite fit into most of my old pants. \n\nEven being on the luckier end of post-pregnancy bodies it still annoys me when I read or hear any about what will or should happen to a body with pregnancy and after. Everyone is different and there just isn't a  likely scenario for anyone. I just tell all of my friends who are getting ready to try to not read any of that junk because it will f with your head. Listen to your body, eat healthy, nap often and accept what happens. ", "controversiality": 0, "created_utc": 1414521588, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmdhl4", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305653, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "BeBopShop", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! I have been struggling to lose the baby weight. I'm finally down 10 pounds, but my son is 10.5 months. I work part-time my husband works full-time. We go for walks and bike rides, but I still don't seem to lose anything! I watch what I eat (I will admit to eating horribly every once in a while). I just cancelled the gym membership because there are not enough hours in the day to go! The staff at the gym nursery are awful. When I would go they would come get me out of class because my son was crying (even though my son is incredibly even tempered and rarely fusses). It just got to the point it wasn't worth the packing of the diaper bag and going to the gym for MAYBE an hour work out.  \n  \nI get really down on myself sometimes when I see other moms looking great and I am still trying to lose 40pounds. How do they do it??  \n  \nI also remember when I was 2 weeks post-partum and my mother told asked me in front of the entire family if I was still pregnant. Like maybe there was still another baby inside! What?! My mother is a whole other story though. ", "controversiality": 0, "created_utc": 1414522150, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmdtnz", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305496, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CrystalbetterthanTim", "author_flair_css_class": null, "author_flair_text": null, "body": "YES. My daughter is 18 months and I am still about 15 lbs over my pre-pregnancy body. (gained ~80lb). My friends occasionally commented on how I still have a baby belly. I just want to slap them (I do in my mind). I was pre-eclamptic and gained ~15 lbs the last two weeks in water which gave me horrible stretch marks. Losing 65lbs for a person is astounding in a year and a half, but for a post-pardum mom there is an exception and she has to lose it all?! \"Lose your baby weight fast\" ads just keep making moms feel horrible because EVERYONE is different. Sorry for the rant. Rant ended. ", "controversiality": 0, "created_utc": 1414522340, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmdxq4", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305444, "score": 27, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "duck_duck_rabbit", "author_flair_css_class": null, "author_flair_text": null, "body": "Your experience seems pretty close to mine.  I wish there was a way for women accept their bodies, both pre-and post-baby.  Or at least I wish that societal messages would stop doing harm.  \n\nI weigh slightly less now than I did before the baby, and my body is moderately different.  I think that objectively, a stranger would say that I look worse.  My breasts went from large to huge and saggy.  My butt went from lovely and round to flat and average.  My stomach always stuck out some, but now it sticks out in a squishier way.  \n\nI like my body better now.  It did a thing that I desperately wanted it to do.  I struggled with infertility and I hated my sexy looking body.  I hated the irony of looking so fertile when I was not.  ", "controversiality": 0, "created_utc": 1414522482, "distinguished": null, "downs": 0, "edited": 1414524217, "gilded": 0, "id": "clme0ux", "link_id": "t3_2kl575", "parent_id": "t1_clmdhl4", "retrieved_on": 1426305403, "score": 20, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Inconspicuously_here", "author_flair_css_class": null, "author_flair_text": null, "body": "It socks that every mom is expected to lose the baby weight immediately.  Some of us don't.  I'm still 30lbs over my prebaby weight,  while my best friend is wearing a size smaller than her prebaby size. It varies from person to person.  I think it's cool that,  large or small,  we made tiny humans.  While I occasionally look at my tummy and get a little bummed,  I also get a sense of pride that those stretch marks and extra pounds housed my little man", "controversiality": 0, "created_utc": 1414522774, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clme7c6", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305319, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "&gt; I like my body better now. It did a thing that I desperately wanted it to do. I struggled with infertility and I hated my sexy looking body. I hated the irony of looking so fertile when I was not.\n\nWow. That's such a powerful way of phrasing that. That sounds like a difficult experience.", "controversiality": 0, "created_utc": 1414522837, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clme8qk", "link_id": "t3_2kl575", "parent_id": "t1_clme0ux", "retrieved_on": 1426305301, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Inconspicuously_here", "author_flair_css_class": null, "author_flair_text": null, "body": "Next time a friend mentions your \"baby belly\"  please slap them for me.  That is so not OK! ", "controversiality": 0, "created_utc": 1414522859, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clme96t", "link_id": "t3_2kl575", "parent_id": "t1_clmdxq4", "retrieved_on": 1426305295, "score": 30, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "It's been 2 years since I had my youngest son and I still have 5 lbs to go. It's been very hard to drop that weight. I have been exercising hard for the last year and a half and trying to eat healthy foods. I'm less firm than I was after I had his brother, which is sobering somehow. I know that I'm fitter now though even if I'm softer and heavier. Exercising is a huge stress relief. I make sure to put that time in because I deserve it after a long day at work.", "controversiality": 0, "created_utc": 1414523481, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmemfs", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305123, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "BespectacledOwl", "author_flair_css_class": "orange", "author_flair_text": "Expecting Mama!", "body": "Ugh, amen, sister! Also, why is it treated as a desirable thing to lose weight quickly? That's not necessarily healthy, and why the fuck should a woman whose body just gave life (and continues to sustain it if she nurses) be prioritizing \"getting her body back\" over recovery? \n\nPeople need to stop with this \"getting your body back\" nonsense. Getting what back, exactly? Our bodies are not supposed to look/be the same over the course of our entire lifespan! No toddler ever thinks, \"UGH! If only I could get back to my original weight. 7 lbs 8 oz... How much less nursing would I have to do to get back in my NB onesies?!\" It would be unhealthy and strange if our bodies *didn't* look different at different life stages, and after the remarkable feat of creating an entirely new person. \n\nI am tuning out the media hype and anything/anyone else that doesn't make me feel great about the hard work my body is doing. I will always do my best to be healthy-- eating well, staying active, resting whenever possible-- but if my skin changes or I gain weight in the process, oh the fuck well! I trust that my body is doing what it needs to to keep me alive, and I'm no longer going to let ridiculous ideas about what I \"should\" look like-- which are completely, demonstrably insane!-- poison the way I think about myself. ", "controversiality": 0, "created_utc": 1414523845, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmeueb", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426305020, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "uhhidontcare", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in better shape now than before because I don't drink as much and eat at home more. I always had an athletic build and I don't think anyone would guess I had two kids. No extra skin or stretch marks. But damn the breasts. So saggy and soft. They were always big, epically for my petit frame, but while breastfeeding I still don't look good in most tops or sweaters. And all my bathing suits have to be the supportive bra type. I wish I were brave enough to have a reduction and lift when I'm done nursing my last but I don't think I will. I just want to be able to golf without squeezing my boobs with every swing. Or run without them going crazy. And wear clothes that fit my personality instead of my breasts. ", "controversiality": 0, "created_utc": 1414524134, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmf0mm", "link_id": "t3_2kl575", "parent_id": "t1_clme0ux", "retrieved_on": 1426304940, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "crimsondhampiel", "author_flair_css_class": null, "author_flair_text": null, "body": "I couldn't have written this better. I'm also petite with large, now saggy breasts and I'm almost positive that's why I hate my body so much. I can't wear anything I like because they make them for \"average\" busted people..", "controversiality": 0, "created_utc": 1414525375, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmfs1d", "link_id": "t3_2kl575", "parent_id": "t1_clmf0mm", "retrieved_on": 1426304584, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "I had Bell's Palsy at the end of my pregnancy (and didn't fully recover) and all kinds of crazy shit. NICU parent, PPD PTSD, breastfeeding. EVERYTHING affects your mental state and nothing really talks about it in a serious way. \n\n", "controversiality": 0, "created_utc": 1414527624, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmh5pm", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426303941, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dustywillson2003", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it also comes from a lack of education on exactly what happens during childbirth. Although we know so much about it for people who haven't had a child yet theres a whole bunch of things you never even thought were possible, I remember being in a birthing class and thinking \"damn theres a lot more too this then i thought\" while I myself was about 8 months pregnant. \n\nOne of the most helpful things i read getting ready was \"expect to wear your maternity pants home\". Even if theres no baby anymore theres a lot of water that takes their place and the skin still needs to go back to normal. Its kind-of common sense but you just don't think about it really. \n\nAnd i agree, although it is kind of nice to be compared to a superhero for just doing what you have to do, there should be less focus on weight and more focus on how the mother is actually doing after childbirth mentally, emotionally and physically. ", "controversiality": 0, "created_utc": 1414528091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmhg30", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426303806, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "livinghorcrux", "author_flair_css_class": null, "author_flair_text": null, "body": "The outside pressure is ridiculous and I found that my mom was more bothered about it than anyone else. So much so that she offered to pay the joining fee for the gym. I declined because I knew I'd never get a chance to go there. That was the first time  round. I'm now sitting with a pumpkin of a belly getting ready for my second, though apparently you can't tell I'm pregnant from the back (I doubt it) and this time round I'm not going to stress one bit. I know it will take a year to get back in shape. I know I'll have crazy cravings while nursing and put on more weight. I know that's what's needed and everyone else can get lost. Ladies, remember that to your children you are the most beautiful thing on the world, especially when you smile, so stop stressing and take it slowly. ", "controversiality": 0, "created_utc": 1414529290, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmi67h", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426303457, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cg037", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! I was one of those freaks that lost the pregnancy weight a couple weeks after I had my daughter but.. Um, pre-pregnancy weight is NOT equal to pre-pregnancy body. My hips will never be the same and my formerly perfect boobs are sad, saggy sacks. \n\nBut I have a perfect angel baby, so I got that going for me at least. Worth it!", "controversiality": 0, "created_utc": 1414531848, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmjnf2", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426302767, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "redditerrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, I just resigned myself to buying some boobs when I am done nursing this time around.  I don't really care about anyone else, I can hide what I don't like in clothes, but I can't hide from myself in the mirror.  ", "controversiality": 0, "created_utc": 1414531896, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmjoen", "link_id": "t3_2kl575", "parent_id": "t1_clmf0mm", "retrieved_on": 1426302754, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "redditerrrr", "author_flair_css_class": null, "author_flair_text": null, "body": "There is definitely some peace and clarity the second time around.  I know that it is possible to get to a happy place for me personally after pregnancy and that it also doesn't matter at all compared to holding a new baby.  That is kind of a hard concept to envision the first time around.  Everyone is so focused on appearance during and right after pregnancy that it is easy to get caught up in it.  Plus, if you have never held your new baby for the first time and stared into the little face that you made, it's nearly impossible to imagine.  There was no way for me to know that all the stressing about weight and appearance didn't matter.  I had no idea how powerful and important it would be to care for my own newborn child. ", "controversiality": 0, "created_utc": 1414532222, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmjv1x", "link_id": "t3_2kl575", "parent_id": "t1_clmi67h", "retrieved_on": 1426302668, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "annac2009", "author_flair_css_class": null, "author_flair_text": null, "body": "I swear I tell my new mom friends this like once a week but go read renegade mothering.  She writes a blog about the realities of motherhood unlike any I've read.  Most days she speaks to my soul. ", "controversiality": 0, "created_utc": 1414533385, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmkjfu", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426302352, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "StrawberySwitchblade", "author_flair_css_class": "blue", "author_flair_text": "Girl born May '11, Boy due Jan '15 ", "body": "Thank you. \n\nMy ass disappeared while I was pregnant and it never came back. What used to be a nice round bottom with a defined beginning and end is now a flat, shapeless pillow. I thought baby changes would just be added weight and stretch marks, but my overall shape is so different now.\n\nDid anyone else get insane hunger pains while breastfeeding? I gained so much weight while nursing. The hunger was literally the worst I'd ever experienced. There was no willpower -- usually watching what I eat feels like simple deprivation, but the hunger brought on by nursing felt like I would die. ", "controversiality": 0, "created_utc": 1414535473, "distinguished": null, "downs": 0, "edited": 1414542070, "gilded": 0, "id": "clmlop3", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426301817, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "saratina", "author_flair_css_class": "purple", "author_flair_text": "Alma (9/2011) and Jesse (10/2013)", "body": "&gt; Can we talk about the reality instead?\n\nHave you visited /r/breakingmom?", "controversiality": 0, "created_utc": 1414535907, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmlx3e", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426301708, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Wdc331", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly. I was made to feel weird because I was gaining weight while breastfeeding. Turns out, I am in a sizable group of women whose bodies just react that way. When I tried to diet, my supply tanked. It was between vanity and feeding my child, so I chose feeding my child. She is 13 months, still nursing, and healthy as can be. And while I'm a few pounds more than I want to be, I am healthy and happy too because I finally let go of worrying about my weight. \n\nAs far as I am concerned, all that superhero mom BS on pinterest doesn't even concern me. I don't like at it and don't let it register in my mind. ", "controversiality": 0, "created_utc": 1414535962, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmly6b", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426301694, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "atmoag06", "author_flair_css_class": null, "author_flair_text": null, "body": "Or how about when you are the same weight as you were before pregnancy but your clothes STILL won't fit you. This part hurts me so much as I've recently entered the working world and can't afford a new wardrobe yet", "controversiality": 0, "created_utc": 1414536568, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmm9zg", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426301541, "score": 21, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Hydrangeas0813", "author_flair_css_class": null, "author_flair_text": null, "body": "Even if you loose the weight you can still have saggy tummy skin, I'm back down to my pre pregnancy weight but still look a bit pregnant because of the skin and weird fat deposits. My stretch marks took 4 fucking years to fade away and then I was pregnant again so yeah they're all back in force. They also don't tell you that the plan to wean at one doesn't always go your way. I didn't plan on nursing a toddler but here I am. ", "controversiality": 0, "created_utc": 1414537624, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmmv37", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426301268, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "peachybutton", "author_flair_css_class": null, "author_flair_text": null, "body": "My kiddo is 2, and running/jumping rope still makes me pee with no warning. Uncomplicated vaginal birth, and all the Kegels ever, but still dealing with the random peeing.\n\nAlso I'm glad you mentioned about messed up periods! Just this summer I've developed a mini-PMS and small amount of bleeding with ovulation, so it's like I get a bonus period! I'm about to start on the pill to hopefully fix this, because it's just awful.", "controversiality": 0, "created_utc": 1414540221, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmoars", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426300598, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "rebbek", "author_flair_css_class": null, "author_flair_text": null, "body": "I was diagnosed as having bipolar depression 3 YEARS after giving birth to my twins.  Was told biochemical changes in the brain can sometimes take years postpartum to appear enough so someone will seek treatment.  Why doesn't anyone ever talk about the post-birth major changes in our bodies???  Yes, I'm thankful for two wonderful kids, but I could have used a heads-up that my migraines may get exponentially worse, and that instead of good-old depression, I may start showing mania symptoms and need a re-evaluation.  And i would feel less guilty if I was warned to watch out for symptoms after that golden first year when we're all told to watch for symptoms of depression.", "controversiality": 0, "created_utc": 1414541650, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmp2ta", "link_id": "t3_2kl575", "parent_id": "t1_clmh5pm", "retrieved_on": 1426300235, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "MissMaryMackMackMack", "author_flair_css_class": null, "author_flair_text": null, "body": "Totally uncomplicated vaginal birth, and totally textbook pregnancy.  I have an internal scar from the stitches I had, so I essentially had to have sex for the first time all over again to relax my body back to where it belonged before I had my son. (We only ended up needing to wait 4 weeks, so that was a bonus.)\n\nI only weigh 3 pounds more now than before I was pregnant, and my son is 18 months old.  I have loose skin between my hips and down toward my pelvis, and you can still see stretch marks going all the way up past my belly button.  They also come down from my boobs onto the tops of my rib cage.", "controversiality": 0, "created_utc": 1414541735, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmp4l7", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426300212, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1414543058, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmpv7k", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426299856, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ProspectGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 7.5 months pregnant with my second. The other day, I was standing in the kitchen cooking eggs, when I peed in my pants. I don't mean a little. I mean, they were soaked. I had no warning that it was about to begin and once it began, there was nothing I could do to stop it, no matter how hard I tried. This isn't the first time this happened. Maybe that will go away once the kiddo pops out, but part of me believes this time it won't and I'm in for a long term future of Poise pads or Depends...", "controversiality": 0, "created_utc": 1414543286, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmpzrs", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426299796, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "imnotacrazyperson", "author_flair_css_class": null, "author_flair_text": null, "body": "I still pee my pants if I cough or laugh or sneeze, my baby is two now. \n\nThey make great panty liners that absorb small leaks but damn a good sneeze can soak them fast! ", "controversiality": 0, "created_utc": 1414544696, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmqrzp", "link_id": "t3_2kl575", "parent_id": "t1_clmpzrs", "retrieved_on": 1426299431, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "imnotacrazyperson", "author_flair_css_class": null, "author_flair_text": null, "body": "I weigh less now than when I first got pregnant but my body will never be the same.  My hips are wider, my skin is looser, and I have that fucking \"mommy apron\" that is never, despite the fact that I workout like a maniac and eat less than 1500 calories a day, going to disappear.  \n\nMy stomach looks like a crime scene and I'm supposed to be all, \"Oh fuck it I'm a mom and I have tiger stripes I'm proud!\" - Nah - My body is different and not as attractive as it once was.  Why is it such a bad thing for a woman to just be upset about it?  \n\nI'm not a celebrity who can pay for the lipo and tummy tuck on a whim, I have to deal with my body looking like this for the rest of my life - let me fucking bitch about it and be a little upset OK! ", "controversiality": 0, "created_utc": 1414544952, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmqxdf", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426299361, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "I still have to get up to pee at night :(", "controversiality": 0, "created_utc": 1414546900, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clms02c", "link_id": "t3_2kl575", "parent_id": "t1_clmpzrs", "retrieved_on": 1426298860, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "eyes_scream", "author_flair_css_class": "green", "author_flair_text": "2 Girls, 8 &amp; 2", "body": "Two words: Vaginal prolapse.  ", "controversiality": 0, "created_utc": 1414548388, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmstq9", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426298475, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "annalatrina", "author_flair_css_class": null, "author_flair_text": null, "body": "I breastfed twins. The hunger's insane! I've never been hungrier in my life. Plus, if we want to keep up our supply we can't eat at a calorie deficit. I feel ripped off. I was told nursing would make the pounds melt away. Bullshit!  ", "controversiality": 0, "created_utc": 1414551867, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmuq33", "link_id": "t3_2kl575", "parent_id": "t1_clmlop3", "retrieved_on": 1426297589, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "StrawberySwitchblade", "author_flair_css_class": "blue", "author_flair_text": "Girl born May '11, Boy due Jan '15 ", "body": "Yeah, I felt a little lied to by the pro-breastfeeding crowd. I was also told that tooth decay came from bottle-feeding at night, but that nursing was safe.  My daughter had to get four crowns at age two, despite never drinking soda or juice and always brushing twice a day. (The dentist did tell me that it could be genetic. Still feel like a bad parent though.)\n\nI'm still glad I breastfed. But the hype definitely contains plenty of bullshit.", "controversiality": 0, "created_utc": 1414552067, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmutrp", "link_id": "t3_2kl575", "parent_id": "t1_clmuq33", "retrieved_on": 1426297541, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "hennypen", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a single parent.  My ex cheated while I was pregnant and dumped me when our daughter was three months old.  I haven't seen him since.  I feel used and used up, flabby and dumpy and tired all the time.  It's been a year and a half and I still struggle to not tell him how much I hate him on pretty much a daily basis.  Every time I make a decent effort at getting in shape, it gets derailed because my daughter gets sick, or gets me sick, or something happens at work and I run out of time to run.  Sometimes I really want to date again, but I'm scared and tired and don't know how to find the time.  The first time I went online to fill out a dating profile I was still so beat up from the cheating that I literally couldn't think of a single good thing to say about myself.", "controversiality": 0, "created_utc": 1414552965, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmval8", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426297323, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "vicoli", "author_flair_css_class": null, "author_flair_text": null, "body": "YUP. I lost all my baby weight and then some but I now have a \"flap\" of skin that is less than attractive. Speaking of stretch marks, I HATE when I see people say \"I love my stretch marks they're tiger stripes\" or whatever dumb shit it claims. No. You don't love your stretch marks. I guarantee if you never got any, you wouldn't be complaining that you had none. ", "controversiality": 0, "created_utc": 1414555602, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmwjez", "link_id": "t3_2kl575", "parent_id": "t1_clmmv37", "retrieved_on": 1426296743, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "StrangerSkies", "author_flair_css_class": null, "author_flair_text": null, "body": "My body is different, but I actually really am happier in it. I was constantly down on myself before for the smallest jiggle. Now I look at my blooming, blossoming daughter and my jiggle doesn't matter in the same way. Maybe it's because I didn't have the perfect body to mourn, but I like my post baby body better.", "controversiality": 0, "created_utc": 1414556289, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmwtxi", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426296606, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Oniknight", "author_flair_css_class": null, "author_flair_text": null, "body": "I lost almost a hundred pounds with each pregnancy.  I have weird endocrine problems so people got mad when I gained back the weight, regardless of the fact that I did not change any of my habits and actually decreased my caloric intake.\n\nI have horrible hip pain if I don't sleep with a memory foam wedge between my legs.\n\nThe after-pregnancy hormones were too weird on my body and my body attacked and killed my thyroid.  I will need supplementation for the rest of my life to function properly.\n\nAfter my second birth, I had a slight rectocele, though kegals have helped reverse it so that I don't notice it as much.  I do know that I have \"bulges\" inside when I press down on my core muscles.\n\nLumpy, floppy stomach that sags.  It's never going away.  I'm trying to make peace with it, but add the PCOS hair and insulin resistance (regardless of low glycemic index diet and exercise), and it's pretty fucking ugly.\n\nBreasts that got bigger and never shrunk back down.  I was hoping I'd get a reduction naturally.  They say that breastfeeding can make your boobs shrink.  They went up to M cup at first and now they hover around a K.  It's horrible.  I feel like a cow.\n\nSleep deprivation- can we talk about this?  It's hard to sleep when kids have you on call for years and years.  It didn't bother me for the first couple years of my first child's life.  But this second kid is killing me, even though she actually sleeps far better than many children so I know I shouldn't complain.  I'm so tired of having kids twiddling my nipples at night while nursing and waking me up with their little claws against my chest.  It's creepy and painful.  But they won't stop doing it.", "controversiality": 0, "created_utc": 1414556621, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmwz38", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426296539, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "redidnot", "author_flair_css_class": null, "author_flair_text": null, "body": "It's totally genetic. I'm 30 years old with pretty average dental hygiene. I don't floss or use mouthwash. My parents didn't brush my teeth until I was at least 3 or 4 and no one had heard anything about milk on teeth being bad. My teeth are straight and mostly even without braces and I've never even required a filling. Don't feel bad.", "controversiality": 0, "created_utc": 1414557752, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmxf92", "link_id": "t3_2kl575", "parent_id": "t1_clmutrp", "retrieved_on": 1426296260, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mamaswirl", "author_flair_css_class": "black", "author_flair_text": "Mom to the Terror Tot", "body": "Just say no to the click bait. \n\nI'm typically a fictional writer but I'm hoping that one day through my blogging I can just REACH someone. That there's SO much that people don't tell you EVER. OR they try to make you feel bad when you share it because it's not their experience. It's crazy. ", "controversiality": 0, "created_utc": 1414564740, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmzj0y", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426295278, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "titsmcfly", "author_flair_css_class": "blue", "author_flair_text": "Mom of a 2 year old", "body": "No kidding! Losing a lot of weight very quickly is actually a sign of poor health in many cases. I gained about 50lbs with my first pregnancy, and lost it all plus about 35lbs extra in less than a year after giving birth. People complimented me constantly, they told me I looked great and I must have been working hard. I shudder to think of people looking at me and thinking that kind of weight loss is normal or healthy. Because you know what? It isn't.  \n\nI lost that weight because of a dangerous combination of poverty and anorexia and breastfeeding. I was too poor to buy food, and I was suffering from post-partum depression that triggered the anorexic behaviour that I thought I'd recovered from several years ago. And it wasn't like I started out overweight either - I was on the high side of normal for my height when I got pregnant, and when I finished losing the weight after birth I was back down below the border of underweight for my height. But did anyone care about that? Nope! It was just admiration and compliments. We expect fucked up things from mothers. ", "controversiality": 0, "created_utc": 1414565078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmzlxv", "link_id": "t3_2kl575", "parent_id": "t1_clmeueb", "retrieved_on": 1426295240, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "JnnfrMac", "author_flair_css_class": null, "author_flair_text": null, "body": "So much this. I actually weigh less than I did pre-pregnancy, almost 20 lbs less,  and my clothes still don't fit. My junk has traveled out of the trunk and just landed all over the damn place. Infuriating. ", "controversiality": 0, "created_utc": 1414566026, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clmztm6", "link_id": "t3_2kl575", "parent_id": "t1_clmm9zg", "retrieved_on": 1426295141, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "Oh my gosh. All the hugs in the world to you. That sounds awful.", "controversiality": 0, "created_utc": 1414581992, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cln2rpi", "link_id": "t3_2kl575", "parent_id": "t1_clmval8", "retrieved_on": 1426293766, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "bubbles0901", "author_flair_css_class": null, "author_flair_text": null, "body": "EXACTLY!  The misconception that your body just goes back to normal after baby is getting really old.  ", "controversiality": 0, "created_utc": 1414597000, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cln8o8v", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426290940, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Authentic_Power", "author_flair_css_class": null, "author_flair_text": null, "body": "Congratulations on your *amazing* weight loss. Seriously, wow.", "controversiality": 0, "created_utc": 1414602201, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnbl9c", "link_id": "t3_2kl575", "parent_id": "t1_clmdxq4", "retrieved_on": 1426289579, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Authentic_Power", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; \"UGH! If only I could get back to my original weight. 7 lbs 8 oz... How much less nursing would I have to do to get back in my NB onesies?!\"\n\nThat is so freaking funny right there. Thanks for the belly laugh.", "controversiality": 0, "created_utc": 1414602726, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnbvul", "link_id": "t3_2kl575", "parent_id": "t1_clmeueb", "retrieved_on": 1426289442, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Authentic_Power", "author_flair_css_class": null, "author_flair_text": null, "body": "You're a total badass. Keep your head up.", "controversiality": 0, "created_utc": 1414603155, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnc4nk", "link_id": "t3_2kl575", "parent_id": "t1_clmval8", "retrieved_on": 1426289328, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "thedifficultpart", "author_flair_css_class": null, "author_flair_text": null, "body": "Your points are very well articulated.   I seriously think YOU should consider writing the article you were wanting to reaf.   Based on the responses in this thread alone,  i think mothers are desperate to hear a voice that accurately represents the post parm experience.   As of now,  it still seems to be a secret society of the unheard,  particularly in the US, which doesn't provide adequate or mandatory paid Maternity leave.  Our stories,  real stories deserve...no, NEED TO be heard, damnit!", "controversiality": 0, "created_utc": 1414604337, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnctd1", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426288996, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "That is very tempting. However, I'm job hunting right now and don't want to be so public about being a mother, lest it hurt my chances.\n\n(The irony.)", "controversiality": 0, "created_utc": 1414605045, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnd7xc", "link_id": "t3_2kl575", "parent_id": "t1_clnctd1", "retrieved_on": 1426288807, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "spinzard", "author_flair_css_class": null, "author_flair_text": null, "body": "I can agree with you in some ways but i feel the opposite way as well. I have actually been really surprised how easy pregnancy was. I almost felt like a bystander watching all of this happening, like i didn't have to do anything and my belly just kept growing and growing and out popped a baby, holy shit! Sure, I was extremely constipated at times, I gained more than I should have, I didn't sleep well at the end, had low platelets, various other issues, but overall, I did fine. People always made me think pregnancy and child-birth were pretty serious events so I expected it to be pretty bad, but nothing had me on bedrest or anything. Just some temporary discomforts, really. Perhaps my pregnancy was easier than some other women's pregnancies or perhaps I am less dramatic. Most likely a little of both. \n\nAnd the reason people don't talk about the bad stuff is because its not what you want to remember or linger on. Sure, I hate changing poop diapers, but when someone says \"how is your daughter doing?\" I'm not going to respond \"I HATE CHANGING HER GOD DAMN DIAPERS AND WISH I WEIGHED 40 LBS LESS.\" i mean, there are bad aspects to parenting, sure, but who wants to be fixated on them? I guess there's a time and place to discuss them. I don't find the need to linger on them often although I do sympathize if a friend or relative needs to vent. I understand that. \n\nAnd yes, being pregnant did change my body in a permanent way, but I'm not so bothered by it. And it is unfair that some women bounced back much faster to a much better body than mine, but I'm not jealous. There are probably other aspects of my life that are better than theirs and its not a competition anyway. We're all in this together. I figure my extra weight is a genetically given bonus and i'll just have to work a little longer to get it off, but hey, i have time. \n\nSo i guess i do believe that becoming a mother is a superhero experience. I really have enjoyed it and i get venting, but i don't think its painted as something fake. And I'm fine with infant clothes being gendered, i dress my daughter in a tutu and i'll dress my son in a sweater with a train on it and love it, and there's nothing wrong with that. Just dress your kids in whatever clothes you have if you want to, but don't hate that other people enjoy gendered clothing. \n\nwe're all working together to get through the challenges of motherhood. i hope you have other moms that you can lean on for support and can also focus on the positives, because after all, that's all you really get out of the whole thing. And its sad if you are missing the positives because they really are the best i've ever seen.", "controversiality": 0, "created_utc": 1414605319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnddl8", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426288733, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CalamityJane1852", "author_flair_css_class": "purple", "author_flair_text": "SAHM #2 on the way", "body": "I know you're not looking for advice, but this is reddit, so I'm going to give you some anyway. If I were in your shoes and people complimented me on losing weight so quickly the first time, I would say something like, \"You know, the second one is much more difficult.\" With an air of researched authority. Say it like you believe it and it might help to lower expectations of those around you, even if you're not lowering them for yourself. \n\nOr you know, you can just tell them thanks, but it's none of their business.", "controversiality": 0, "created_utc": 1414605724, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clndlwv", "link_id": "t3_2kl575", "parent_id": "t1_clmcumg", "retrieved_on": 1426288627, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "I think there's somewhere in between constantly ranting and pretending like motherhood and postpartum is skipping through a valley of flowers. That's all I'm looking for, really. \n\nRegarding gendered clothing, you're right, it's all about putting your kids in whatever you want. And I know that companies make things that people buy, so it's all based on demand. But with that's said, it's irritating that boys clothes will say \"Little Genius\" and the corresponding girl outfit says \"Little Princess.\" Trains and building toys are marketed for boys, and dolls for girls. Just this weekend we went to buy a night light for our daughter and found a cool one that projects an image on the ceiling. There was a solar system in boy colors, and a princess castle in pink. Why is girls = pink and princess and boys = blue and smart and science? It's maddening. (We bought the solar system one, FWIW, and our daughter's favorite toys are a wooden kitchen set, Legos, and Brio trains. Screw gender stereotypes.)", "controversiality": 0, "created_utc": 1414606521, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clne1xd", "link_id": "t3_2kl575", "parent_id": "t1_clnddl8", "retrieved_on": 1426288418, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "BespectacledOwl", "author_flair_css_class": "orange", "author_flair_text": "Expecting Mama!", "body": "For real. That's the danger of focusing on weight instead of health; this focus on thinness actually fuels some deeply unhealthy behavior. I hope you're well. ", "controversiality": 0, "created_utc": 1414609020, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnfgw3", "link_id": "t3_2kl575", "parent_id": "t1_clmzlxv", "retrieved_on": 1426287755, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ihatemyself12388", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, I'm under my pre-pregnancy weight. I was 130, went up to 170 while pregnant, and now I'm 125 at three months post partum. It took a week to get down to 130 (without exercising.) I have a few stretch marks on my lower stomach though. My old clothes fit better now than they did before. I breast-fed too, though.  ", "controversiality": 0, "created_utc": 1414611674, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnh076", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426287038, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ihatemyself12388", "author_flair_css_class": null, "author_flair_text": null, "body": "You're not alone. I understand how you feel.", "controversiality": 0, "created_utc": 1414613904, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clniajl", "link_id": "t3_2kl575", "parent_id": "t1_clmval8", "retrieved_on": 1426286438, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "panthur", "author_flair_css_class": "purple", "author_flair_text": "4 yo boy", "body": "After getting the episiotomy and sewn up, I referred to the mess that was down there to my lady lunch meat. It really resembled ground beef more than anything recognizable. You can't talk to anyone about that. Who is it ok to have that conversation with?\n\nSo yeah and hemorrhoids for life. Peeing every time I sneeze. Yeah that makes me feel like a superhero.", "controversiality": 0, "created_utc": 1414623181, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnn8cw", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426284029, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Stellarly", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh, yes. I've lost all the weight- thanks to chasing two crazy kids around all day long and never having time to sit or eat- but shit isn't the same. I was in killer shape before and now I have diastasis and what I suspect is a slight umbilical hernia. I can't even do a crunch properly now. It's stuff like that, that bothers me. I have a numb strip 3 inches wide where my caesarean (x2) scar is and it is so freaky feeling. \n\nHow about the fact that husband/dad gets to walk around totally UNCHANGED? (Physically speaking, I mean). How unfair is that?", "controversiality": 0, "created_utc": 1414640557, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clnw29u", "link_id": "t3_2kl575", "parent_id": "t3_2kl575", "retrieved_on": 1426279896, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm glad you finally go diagnosed and I agree with you. It's frustrating that these things aren't discussed. \n\nI would have serious dips in mood when I'd drop a feed with my daughter. \n\nLooking back I was definitely suffering a lot my first year. And some the next six months. \n\nWe just weaned this summer, almost three years in and it wasn't until near the end that I started to feel like my previous self. ", "controversiality": 0, "created_utc": 1414974055, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clr98l3", "link_id": "t3_2kl575", "parent_id": "t1_clmp2ta", "retrieved_on": 1426221639, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}