{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1415128269, "domain": "self.Mommit", "edited": 1415172030, "full_link": "https://www.reddit.com/r/Mommit/comments/2ladyo/is_there_any_way_to_describe_how_painful_birth_is/", "gilded": 0, "id": "2ladyo", "is_self": true, "media_embed": {}, "num_comments": 76, "over_18": false, "permalink": "/r/Mommit/comments/2ladyo/is_there_any_way_to_describe_how_painful_birth_is/", "retrieved_on": 1441088064, "score": 20, "secure_media_embed": {}, "selftext": "I am not pregnant and not ready to be for years still, but these are questions I cannot flat out ask people. I would like some real uncensored look into just how painful it is for a woman and how her body responds before during and after...\n\n\nThank you so much everyone.  It is still so crazy to me that every one of you had such a drastically different experience with the same resulting feeling. .. that it's worth it", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "default", "title": "Is there any way to describe how painful birth is? Is it terrifying the whole time you are pregnant knowing you have to endure pain? Does your body ever go back to normal?", "url": "http://www.reddit.com/r/Mommit/comments/2ladyo/is_there_any_way_to_describe_how_painful_birth_is/"}, "comments": [{"archived": false, "author": "spinzard", "author_flair_css_class": null, "author_flair_text": null, "body": "If you get an epidural, its really not that bad. It was a lot less painful than i expected. Lots of women do it, you can do it too.", "controversiality": 0, "created_utc": 1415128677, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clswaz6", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426193636, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mareeesha", "author_flair_css_class": null, "author_flair_text": null, "body": "This is a loaded question-- it is so different for every person, and every pregnancy. \n\nMy approach with my first, and now my second, is that labor and delivery is inevitable. Fear is pointless. You do your best to be healthy and take it one day at a time. I gave birth to my first unmedicated, which is what I wanted and it was an amazing experience that I hope to repeat with my second.\n\nAs far as my body going back to normal...no. I was slightly underweight prior to getting pregnant, gained a \"normal\" amount of weight, and was close to my pre-pregnancy weight pretty soon afterwards, and yet, my clothes fit totally differently. Then I got hit with some bad anxiety/depression and my weight shot up. I got pregnant with my second at the same weight I was when I gave birth the first time, and it's much rougher on my body this time around (though I'm not gaining as much this time). Before pregnancy I didn't really have to work that hard, personally, to maintain my weight, but it was damn hard after (coupled with the mental health issues), and I plan to really need to re-commit myself after baby #2 is born.", "controversiality": 0, "created_utc": 1415128841, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clsweal", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426193593, "score": 19, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tangowitmango3eb", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the long response.  It's true fear is pointless but when you have anxiety, as I'm sure you're familiar with, it can be really hard to think that way.  May I ask if you suffered post partum depression?  That's another thing I worry about", "controversiality": 0, "created_utc": 1415129294, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clswnha", "link_id": "t3_2ladyo", "parent_id": "t1_clsweal", "retrieved_on": 1426193474, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tangowitmango3eb", "author_flair_css_class": null, "author_flair_text": null, "body": "I've heard when you push with an epidural you rip more. Is this true?  Sorry if that's too graphic", "controversiality": 0, "created_utc": 1415129417, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clswq0a", "link_id": "t3_2ladyo", "parent_id": "t1_clswaz6", "retrieved_on": 1426193449, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "spinzard", "author_flair_css_class": null, "author_flair_text": null, "body": "i doubt it but i suppose its possible. The real question is can you handle the pain? Most women can't and opt for the epidural. I was extremely thankful for it because the pain became unbearable. You can always try to go without it and see how well you do. I'd recommend doing a lot of practicing/reading/research if you are going to try to go without it. i think you have a better chance of being successful if you have a plan for pain management.", "controversiality": 0, "created_utc": 1415130083, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clsx3nn", "link_id": "t3_2ladyo", "parent_id": "t1_clswq0a", "retrieved_on": 1426193265, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mareeesha", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, diagnosed with anxiety when I was 15 so very familiar. For me personally, meditation/guided meditation and visualizations are very powerful (I used the Hypnobirthing method with my son and I highly recommend it). Having a supportive partner who is patient and dedicated to open, honest communication and who encourages me to get the help/support I need through therapy and regular time for myself has been absolutely key as well.", "controversiality": 0, "created_utc": 1415130601, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clsxeai", "link_id": "t3_2ladyo", "parent_id": "t1_clswnha", "retrieved_on": 1426193127, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ggkimmiegal", "author_flair_css_class": null, "author_flair_text": null, "body": "For me I was always apprehensive about being in labor, but one way or another the baby was coming out.  You can't let fear consume you. Plus after swelling, heartburn, fatigue, etc labor couldn't come soon enough. \n\nFor me the pain was challenging, but I had a completely natural birth. I went in with the attitude that I would try, but if I needed an epidural that was cool too. I regretted my decision briefly about 30 minutes before pushing. The weird thing is I know it was painful, and I know it was tiring, but the only thing I really remember is the relief I felt after I delivered a healthy baby. \n\nYour body will never be the same again. 9months later I am 20lbs below my pre-pregnancy weight, and none of my old clothes fit. None of my really old clothes would fit either. My hips are way wider. ", "controversiality": 0, "created_utc": 1415130822, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clsxisi", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426193069, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tipsycup", "author_flair_css_class": null, "author_flair_text": null, "body": "Okay, \"most women can't\" is just plain bullshit.\n\nI'm all for people having the choice to do whatever they please, but the human species would not have survived as long as it has if it were dependent on epidurals.  Saying that women can't do it is nothing short of fear-mongering.  Saying most women get epidurals ignores statistics from most everywhere but the US.  ", "controversiality": 0, "created_utc": 1415133307, "distinguished": null, "downs": 0, "edited": 1415133756, "gilded": 0, "id": "clsyye2", "link_id": "t3_2ladyo", "parent_id": "t1_clsx3nn", "retrieved_on": 1426192400, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "DarthLeia2", "author_flair_css_class": "purple", "author_flair_text": "Ashelia (5yrs) and Emrys (2yrs)", "body": "At the beginning of my first pregnancy, I was scared of labor and delivery. However, as it got closer to time, I became less scared and more ready to just be done with it. I was pretty uncomfortable by the end, especially since my first was a summer baby. \n\nFor me, there is no describing the pain. I was induced and my body had no trouble letting the Pitocin do it's job. I would not recommend that to anybody. I wanted to do a natural birth, but it just wasn't possible with the induction. I ended up with a c-section (failure to progress), which was a whole different animal than labor. I healed very well from the c-section and went on to do it again (and will yet again in March).\n\nI am a very small person, 5'2, 100 lbs. I got back down to my pre-pregnancy weight plus about 5lbs, but clothes fit differently. I think they fit better. I have hips now! For a lot of women that I've observed, they look better post-pregnancy than they did before. I did not get a lot of stretch marks or anything with either kid. What I did get faded after a few months. The only lasting mark on me is my c-section scar and even that isn't bad. \n\nPregnancy, labor, and birth will cause you to realize that you are much stronger than you ever thought possible. Your body can create and nurture life and that's an amazing thing.", "controversiality": 0, "created_utc": 1415133838, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clsz9s8", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426192253, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tipsycup", "author_flair_css_class": null, "author_flair_text": null, "body": "It seems like most people fear the actual birth part when labor is what sucks.  When you get to the birth part you're mostly relieved to be at that point and I say that as someone who pushed for two hours.\n\n[Here](http://www.reddit.com/r/AskReddit/comments/2icgt1/what_would_you_like_described_to_you_that_you_can/cl0xpb9) is my ~birth story~ as written for a similar AskReddit question, there are lots of replies there as well from other women.", "controversiality": 0, "created_utc": 1415134100, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszfbf", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426192182, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "My labor was pretty difficult (45 hours, ended in c-section) and I'm still 30 pounds up from pre-pregnancy. My body is nowhere close to where it used to me. My muscle is gone, I still have pains in my stomach from the C-section a year+ later, and I've suffered from post-partum depression.\n\nBut, it's worth it. It sounds cheesy and stupid and like something that would incite rage in the childfree community, but I feel like my life is complete now. I can imagine my life 10, 15, 20 years from now. My daughter is awesome. She jumps up in down in her bed in the morning because she's excited to see me. So many moments that make it all worth it. \n\nAnd honestly, pregnancy can be such an annoyance (tiredness, peeing all the time, body size, hunger, etc) that I really didn't spend much time thinking about how I might be in pain for a day in a few months, hah", "controversiality": 0, "created_utc": 1415134317, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszjy9", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426192121, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "I think this has more to do with getting an episiotomy than an epidural. FWIW, many docs don't do episiotomies anymore because it often causes more tearing than necessary. (Think about tearing a piece of paper that already has a tear in it vs. one that doesn't)", "controversiality": 0, "created_utc": 1415134519, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszo72", "link_id": "t3_2ladyo", "parent_id": "t1_clswq0a", "retrieved_on": 1426192065, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "Yeah. Also, the pain from pitocin. I was doing fine with the pain until I was put on pitocin (24+ hours after water breaking, had to speed things up). That was BRUTAL for me. The regular labor pain was pretty damn painful but nowhere near pitocin pain.", "controversiality": 0, "created_utc": 1415134628, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszqf9", "link_id": "t3_2ladyo", "parent_id": "t1_clsyye2", "retrieved_on": 1426192037, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "F0MA", "author_flair_css_class": null, "author_flair_text": null, "body": "I was induced and have heard the pain is a lot more intense than a natural birth. Stupid me thought no big deal, I can handle it. Nope. Worst pain ever. Hubs tried to rub my back and hold my hand. I yelled at him,\"Get your fucking hands off me.\"  Of course I felt bad afterwords but holy shit. I begged for an epidural after that and it was easy peasy. When I told my OB I wanted to start trying for #2, I believe his comment was,\"Forgot about the pain,huh?\"  I'm 22 weeks along. Fearing labor as I did before but know there's a drug I help and in the end, that little ball of love is totally worth it. ", "controversiality": 0, "created_utc": 1415134648, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszqtv", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426192031, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "Have you considered seeing a therapist before conceiving? It sounds like you have some anxiety issues you're aware of and it could be helpful to have healthy coping strategies and a support structure in place pre-pregnancy.", "controversiality": 0, "created_utc": 1415134696, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszru3", "link_id": "t3_2ladyo", "parent_id": "t1_clswnha", "retrieved_on": 1426192018, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "acisnot", "author_flair_css_class": "blue", "author_flair_text": "hola.", "body": "It hurts.   A lot.  But the thing that got me through it was that it wasn't continuous.  For me, it came in waves.  Breathing through the pain helped until I got my drugs (eight hours in the first time, much quicker the second time.)  It was not lamaze breathing,  deep, focused breathing more like yoga.  \n\nI just did focused breathing while I labored but I would HIGHLY recommend Hypnobabies.   It's the same idea - focus movement through the experience.     \n\n\n\n", "controversiality": 0, "created_utc": 1415134996, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clszy5v", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426191819, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Graendal", "author_flair_css_class": null, "author_flair_text": null, "body": "I was afraid of what it would be like as my due date approached. Then I went overdue by 9 days and by the end of it I was just ready to be done. Looking back it's such a tiny part of the whole new parent ordeal you go through. I remember the 3 weeks of intense sleep deprivation (the sleep deprivation continues after that but not quite as intensely) being much much more challenging than labor itself. But I did have an epidural so that helped.", "controversiality": 0, "created_utc": 1415135465, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt07xo", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426191693, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415136050, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt0ke6", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426191530, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/19/12", "body": "Everyone's birth and postpartum recovery is different. For me, there's a very easy way to describe the pain: Not that bad. I never felt a need for medication. Does that happen for everyone? Obviously not. And there were things that helped, mostly the hot water and that because of my career, I'm very practiced at controlling my breathing and mental state under stress. \n\nI also gained very little weight (only 15lbs above where I started, in part because I lost so much to nausea in the first half) and, combined with the easy labor, I was back to my basic size quite quickly. However, just like anything that you stretch out, it's never going to be exactly the same. I don't work out and so my waist is definitely thicker than it was before and I have a squishier stomach. I think that could definitely be largely remedied if I ever actively worked on it. I can still wear all my old clothes but they don't fit as loosely as before. \n\nAs far as being afraid of it, yeah, it's always going to make one nervous to go through an experience that *could* kill you and that will hurt to some extent. But by the time you get to the last few weeks of pregnancy, the anticipation has built up so much and/or you're so uncomfortable already that worry is not the only emotion. Once you're in labor, you don't have much extra brain space to be scared.\n\nAnd yes, epidurals can make labor longer/make it more difficult to push. Again, not every woman or the protocols surrounding getting one would probably be different. ", "controversiality": 0, "created_utc": 1415137078, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt16pl", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426191243, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Owlie", "author_flair_css_class": null, "author_flair_text": null, "body": "Studies have been done showing that epidurals cause no difference in birth outcome.  Would look those up for you, but you can just google them.  \n\nI chose to get an epidural because (1) why experience pain if you don't have to?, and (2) there is a higher incidence of post partum depression in women who elected to not have an epidural and I wanted to do everything I could to avoid PPD. \n\nI did rip like hell (fourth degree tear--DON'T do a google image search, you will never want to have a baby) but I am a small woman and my baby was over 9 pounds.  That ripping would have hurt a hell of a lot more without an epidural.   ", "controversiality": 0, "created_utc": 1415138131, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt1tnn", "link_id": "t3_2ladyo", "parent_id": "t1_clswq0a", "retrieved_on": 1426190945, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "danibobanny", "author_flair_css_class": null, "author_flair_text": null, "body": "It totally varies from person to person.  For some people, it's not that bad at all.  I'm just here to provide counterpoint!  For me personally, it was genuinely 36 hours of hell.  I was writhing in agony just about the entire time, crying, screaming, vomiting, begging them to give me pain relief.  It was so much worse than I imagined.  AND I had an epidural - it helped a lot, but the pain was still off the charts.  Maybe it's because I have a small frame and had an 8 1/2 pound baby.  Probably the Pitocin caused the majority of the pain.  \n\nMy body is more or less normal again, and has been since about 4 months post partum. There are some changes though.  For one thing, it takes time for your abdominal muscles to snap back after having been stretched out so far.  I still don't have the abdominal strength that I had before, but I haven't had time to work out, per se (just walking with baby in stroller or carrier).  Edit:  My hips are slightly wider, too, which changes my gait a little. \n", "controversiality": 0, "created_utc": 1415142025, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt3xpv", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426189960, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "brookmachine", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had three. 2 with an epidural, one without (not by choice! There just wasn't time). With the drugs, it was great. Happy times, cracking jokes. No tearing, and it didn't interfere with my labor progress at all. The thing is, every woman is going to have a different experience. For every person with a good epidural experience there will be someone who hated it. There's just no way to know how it will turn out for you", "controversiality": 0, "created_utc": 1415142231, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt41ib", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426189909, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Rigamarolly", "author_flair_css_class": null, "author_flair_text": null, "body": "Labor is just a small tiny moment compared to the joy of raising a child.  It sounds cheesy, but it's true.", "controversiality": 0, "created_utc": 1415145109, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt5h4c", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426189240, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Cairnwyn", "author_flair_css_class": null, "author_flair_text": null, "body": "Contractions for me were like the worst constipation you can imagine combined with the worst period cramps you've ever had multiplied by 10. I had about 10 hours of those before I was admitted to the hospital and got my epidural. After that I had ZERO pain. And I mean ZERO. The nurses told me I'd still feel the \"ring of fire\" when she crowned. Nope. Not a thing. I had a completely pain free delivery with only 40 minutes of pushing. I felt pressure and knew when to push and how, but the pain was totally gone (to the point where my biggest concern was getting enough oxygen and not passing out). Recovery was not bad at all. My lady parts were right back to normal within 2 months.", "controversiality": 0, "created_utc": 1415146462, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt659e", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426188905, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "HappyGiraffe", "author_flair_css_class": null, "author_flair_text": null, "body": "So here is just ONE story out of BILLIONS of birth experiences:\n\nIt was...eh. \n\nI'm not particularly strong or brave or pain tolerant. I don't like the dentist but I've survived tattoos. \n\nI was induced with Pitocin at 42 weeks, which I was told was the devil and I was terrified of it. \n\nApparently I had back labor, which apparently is \"worse\" but I don't have anything to compare it to. \n\nIt was WORK. Wow. They don't call it \"laboring\" for nothing. Holy moly, was it EFFORT. \n\nI didn't do any pain meds; feeling numb is scarier for me than feeling pain, so I just went with sitting on a ball, using water, and having my husband press so hard on my back HE needed physical therapy afterward (seriously). \n\nBut I never rated my pain above a 7, which is, on its own, useless, but the whole time I thought, \"Ok, prepare for the worst,\" but the \"worst\" just never came. Suddenly, it was time to push (which for me felt fantastic; it was very satisfying to push and there was just a minute or two of real burning pain in the whole hour of pushing) and then it was done. \n\nSo it was certainly painful, but not like how I imagined, and not the worst pain I ever felt (a privilege which goes to a chemical burn ON MY EYEBALL). \n\nMy post-pregnancy body IS a normal body. It's different, sure, but this is what a normal body, that has done what it needed to do, looks like, and I am fine with it. ", "controversiality": 0, "created_utc": 1415147200, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt6i7f", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426188738, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415147796, "distinguished": null, "downs": 0, "edited": 1415148022, "gilded": 0, "id": "clt6ssi", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426188601, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415149011, "distinguished": null, "downs": 0, "edited": 1415153095, "gilded": 0, "id": "clt7eqq", "link_id": "t3_2ladyo", "parent_id": "t1_clsyye2", "retrieved_on": 1426188316, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fellaphant", "author_flair_css_class": null, "author_flair_text": null, "body": "It's like really bad period cramps that come in horrible waves and get worse and worse. Then you feel like you've got to take a big poop. If you get an epidural, it's easy peasy. I've been told both my births were unusal, as they were both quick and very easy. I'm probably not the best person to answer if you're looking for horror stories.", "controversiality": 0, "created_utc": 1415150606, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt87s1", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426187926, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415153198, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clt9jje", "link_id": "t3_2ladyo", "parent_id": "t1_clsxisi", "retrieved_on": 1426187307, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Once_upon", "author_flair_css_class": null, "author_flair_text": null, "body": "I actively avoided getting pregnant because of my fear of labor. Then I got knocked up at 38 and...I regret being so scared. [Birth story here.](http://www.reddit.com/r/Mommit/comments/2iq5jy/being_induced/cl4id3s). I attended Hypnobirthing classes - which I thought were cheesey at the time, but I totally recommend.\n\nNo epidural, no painkillers, no gas and air, *nada*. BTW- I was induced and on a pitocin drip for 12 hours.  I pushed six times in 20 minutes and - boom! - baby. I almost felt traumatized at how quickly it happened. No 'ring of fire' no hours of increasing pain. It was like the world's worst stomach flu. I spent so much time preparing for the worst, that reality was so much better than I could have imagined.", "controversiality": 0, "created_utc": 1415158563, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltc9uz", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426186034, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "OhBonnieDog", "author_flair_css_class": null, "author_flair_text": null, "body": "We have a very similar story... I labored at home for 47 hours before being transferred and ended up having a c section.  Little guy was sunny side up!  Was yours posterior too? \r\rYou are right in it being beyond worth all of it.  I would repeat my terrible labor monthly just to have my perfect little monkey around! :)  ", "controversiality": 0, "created_utc": 1415159084, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltcj8j", "link_id": "t3_2ladyo", "parent_id": "t1_clszjy9", "retrieved_on": 1426185912, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "spyhoppers", "author_flair_css_class": null, "author_flair_text": null, "body": "Every woman's experience is different. There is so much exciting and weird stuff going on during a pregnancy that I really didn't even think about the labor until a few weeks before my due date. As others have said, fear of something inevitable is pointless. After 42 weeks, I was actually looking forward to it, just to have the pregnancy be over with and to meet our LO! To put it in perspective, even if you have a very long, painful labor, it is so fleeting compared to the number of hours in the years of your life. And the first time your baby smiles and coos at you, it becomes an even foggier memory. My experience was at worst a 9 on my 1-to-10 pain scale. I only started to ask about an epidural once I was already fully dilated and so I ended up delivering 20 minutes later without so much as a Tylenol. ", "controversiality": 0, "created_utc": 1415159327, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltcni4", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426185857, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ChronoTriggerHappy", "author_flair_css_class": null, "author_flair_text": null, "body": "I was so afraid of the pain. But I was hell bent on not getting an epidural. When the time came it was no worse then having a really bad flu where you're puking. And when the head comes out that's pretty painful. When I was a teenager, I stretched my ears incorrectly with a taper quickly and its the worst burning pain. Same thing on your hoo ha. But knowing that I was done being pregnant is was got me through the night. And I also napped between intense contractions. ", "controversiality": 0, "created_utc": 1415159962, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltcynk", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426185713, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Sweet_Titties", "author_flair_css_class": null, "author_flair_text": null, "body": "Omg, for my first, I hadn't heard about the ring of fire and when he was about to crown, the doc told me \"I might feel some pressure.\"  More than a few curses were uttered. ", "controversiality": 0, "created_utc": 1415159988, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltcz3n", "link_id": "t3_2ladyo", "parent_id": "t1_clt9jje", "retrieved_on": 1426185707, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "OhBonnieDog", "author_flair_css_class": null, "author_flair_text": null, "body": "Obviously everyone's birth experience is very different.  \r\rFor me the biggest issues came from things I was not prepared for (despite reading as many books as I could get my hands on and taking a birthing class).  I was not prepared for back labor- every bit of pain I experienced was in my back (mine was head down, face up- so the hard part of his noggin was right on my tailbone).  This is very TMI, but I was also not prepared for my ladybits to have the same sensation/ sensitivity... I guess I thought the pressure and swelling would numb it up a bit? Nope- when the midwife sticks her hand in there, it feels like there is a hand in there! Lol! :-\\ \r\rI labored at home with no meds for 47 hours before transferring to the hospital because I stopped dilating at 8 cm.  Ended with a c section.  The epidural I got once I arrived was AMAZING!  I would never go drug free again. \r\rI suffered the weepy baby blues and some depression after- sought help and recovered quickly. \r\rI am just about back to my prepregancy weight- my old clothes fit, but they fit very differently.  My tummy still has a pooch almost 11 months later.  I went 2 weeks past my due date so I have some crazy stretchmarks- will definitely never wear a bikini again. But my boobs held up nicely after nursing so I have that going for me! \r\rPregnancy sucks, labor sucks, recovering is awful, but that little dude (who said his first word just yesterday &lt;3) is worth every last second of it all and I would not hesitate to do it again just for him. :) \r\rEdit: To answer your other question- I was not too concerned about the labor until the last couple of weeks- even then I was more concerned with tearing than the pain of the contractions... ", "controversiality": 0, "created_utc": 1415160200, "distinguished": null, "downs": 0, "edited": 1415160385, "gilded": 0, "id": "cltd2op", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426185660, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "OhBonnieDog", "author_flair_css_class": null, "author_flair_text": null, "body": "I completely agree with you on the sleep deprivation... It is hard to understand what every 2 hours around the clock for weeks feels like until you are doing it!  Man, that part was rough! ", "controversiality": 0, "created_utc": 1415160765, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltdc80", "link_id": "t3_2ladyo", "parent_id": "t1_clt07xo", "retrieved_on": 1426185537, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "OhBonnieDog", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;\"It's different, sure, but this is what a normal body, that has done what it need to do, looks like, and I am fine with it.\" \r\rThis.  I really like this.", "controversiality": 0, "created_utc": 1415161131, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltdiaj", "link_id": "t3_2ladyo", "parent_id": "t1_clt6i7f", "retrieved_on": 1426185458, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "Yep, sunny side up! Plus early water break. Had a high fever at the end of labor &amp; needed double blood transfusion after c-section. But totally worth it!", "controversiality": 0, "created_utc": 1415161712, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltdrte", "link_id": "t3_2ladyo", "parent_id": "t1_cltcj8j", "retrieved_on": 1426185335, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "NeverMyCakeDay", "author_flair_css_class": null, "author_flair_text": null, "body": "Try to look at it his way: when it gets closer to \"the time\", you're going to be tired, sore, and big. You'll be looking forward to it happening a little more than you were in the begining. Even just a little bit. ", "controversiality": 0, "created_utc": 1415168368, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltgge0", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426183982, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "I think the real question is \"can you handle the pain when you know that there is a less painful option.\" Who knows what women in the past would have done if they had the option. I guarantee most women who endured a twilight birth would have preferred something else. It reminds me of the episode of Call the Midwife where the doctor who is on call for the births gets a new gas and air machine and becomes non stop busy going out to the homes of laboring women who pretend like they can't handle it so that they can have the pain relief. ", "controversiality": 0, "created_utc": 1415168903, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltgmoc", "link_id": "t3_2ladyo", "parent_id": "t1_clsyye2", "retrieved_on": 1426183901, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "I've done it twice. Both times with epidurals. The first time hurt a lot because my water broke and baby was malpositioned, so I had to labor naturally for like 8 hours before I was dilated enough for the epidural. Then the epidural wore off and my doctor told the nurses not to top me off because it was time to push. The pain was really bad at the time, but it's temporary, you know. It's hard to remember how painful it was now but I know it was pretty bad and I pushed for an hour and a half. I wanted to watch my baby be born in a mirror and feel the head, but when the nurses tried to remind me to do those things I told them I was in too much pain to do them. So I kind of missed out on that.\n\nThe second time I waited too long to get the epidural, but I only had to endure about an hour of pain before I got it. Then it was just blissful and everything I ever dreamed about in a birth. I was 4 cm when I had it done, and when I was checked an hour later I was 10. The nurse had me labor down for an hour, then after the doctor got there I pushed my TEN POUND four ounce baby out in two contractions. There was no pain at all except during crowning, and that pain elicited a verbal \"ow! Ow!\" From me. I've had worse pain from stubbing my toe. I got to watch her be born in a mirror, touch the head, etc. I was chatting and laughing with everyone the whole time. \n\nAs for the body, I was fat to begin with, but even after losing all the weight my clothes fit differently. I ended up losing more weight than I gained so I still looked better overall.", "controversiality": 0, "created_utc": 1415169557, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltgu5w", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426183804, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "Oh man, posterior was the worst.", "controversiality": 0, "created_utc": 1415169601, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltgund", "link_id": "t3_2ladyo", "parent_id": "t1_cltcj8j", "retrieved_on": 1426183797, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "I had an epidural both times, but just tiny, one stitch tears, even with a ten pounder.", "controversiality": 0, "created_utc": 1415169681, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltgvil", "link_id": "t3_2ladyo", "parent_id": "t1_clswq0a", "retrieved_on": 1426183786, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mhende", "author_flair_css_class": "lightcoral", "author_flair_text": "Alice-3 &amp; Eloise-6m", "body": "Depends on many factors, like where you live and your education level. In the us the rate is 60% overall according to the CDC. http://www.vbac.com/2011/04/cdc-reports-most-women-receive-epidural-or-spinal-anesthesia-for-labor-pain/\n\nI would bet in countries where gas and air are available the rate is pretty low. ", "controversiality": 0, "created_utc": 1415169836, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltgx78", "link_id": "t3_2ladyo", "parent_id": "t1_clt7eqq", "retrieved_on": 1426183764, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "MrsSquidBerry", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have a horror story. My water broke at 37 weeks. Got put on pitocin and I could tolerate the pain just fine. The only reason I opted for the epidural is because I was scared that I might need it later and it would've been too late, lol (yea I guess I pussied out) the pitocin didn't slow down my labor (which the doctor was afraid of) A few hours later the nurse checked me and said she could feel the babies head, yikes! Time to push! Pushed for 20 minutes and that was it. I think the worst part of it all was getting the IV in my arm. \n\nI guess all pregnancies are different =) ", "controversiality": 0, "created_utc": 1415176675, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltim7p", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426182903, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AfroTriffid", "author_flair_css_class": null, "author_flair_text": null, "body": "Can confirm induced contractions are more intense (stronger with less time between to rest). Laboured spontaneously and med free with the first. Induction with the second. I was begging for an epidural 2 hours into active labour. ", "controversiality": 0, "created_utc": 1415177283, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltiqjm", "link_id": "t3_2ladyo", "parent_id": "t1_clszqtv", "retrieved_on": 1426182846, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AfroTriffid", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know about you but I really miss my brain. I used to be mediumly smart 4 years ago before the sleep deprivation. 3 yr old just started sleeping through now but breastfeeding a 6 wk old negates that:( I can't get full sentences out sometimes ", "controversiality": 0, "created_utc": 1415177555, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltisjg", "link_id": "t3_2ladyo", "parent_id": "t1_cltdc80", "retrieved_on": 1426182820, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "MaryTylerDurden", "author_flair_css_class": null, "author_flair_text": null, "body": "Our creator was smart enough to make the third trimester so unbelievably uncomfortable that you want the baby out and don't really think or care about the pain of child birth until the actual moment. Does it hurt? Hell yes! But a few months go by and you can't recall it being as painful as it was. My hips felt like they were breaking apart.\nWill your body ever go back to \"normal\"? Probably not 100%. I have some stretch marks but I don't really notice them, my vagina seems to be normal (odd enough, the sex was better after LO #1) and yes my tummy isn't as firm but it's okay. I'll work harder to stay in shape. ", "controversiality": 0, "created_utc": 1415178091, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltiwb6", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426182772, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Angeeclectic", "author_flair_css_class": null, "author_flair_text": null, "body": "No way to describe it as it is different for everyone.  Personally, giving birth naturally both times was easy for me. I let my body take over and my brain checked out... everything is so different for everyone.  I had my first baby at 16 so I really pushed my body  and it never was the same. But I don't even know how my fully mature, before kids body was meant to look like. I gained 50 lbs (from 100 to 150) with my first, but lost weight with my second (from 145 to 113) . Even my experiences with pregnancy were very diverse.  But I really enjoyed all of it. The glow,  long healthy hair, seeing my babies for the first time, even our hospital stay. It sounds a lot more crazy talking about it than it is actually going though it :) ", "controversiality": 0, "created_utc": 1415179073, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltj2vh", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426182687, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "OliviaEversea", "author_flair_css_class": "blue", "author_flair_text": "JB 07/2012", "body": "The pain and actual childbirth are inevitable so I really didn't fear it so much.  I remember when I was in labour at home after being induced that I had a conversation with my husband that if anything happened I didn't want to be a vegetable.  That was it.  Also my pregnancy was just hideous - I had hyperemesis and was sick until well into my seventh month which is when I started to get pelvic girdle pain so I was just so glad to get it over with.\n\nBut it was worth it.  I would do it all again in a heartbeat to get The Boy.  He's just over two now and adding him to our family has made me happier than I ever thought possible.", "controversiality": 0, "created_utc": 1415187296, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltkjhy", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426182005, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Feydid", "author_flair_css_class": null, "author_flair_text": null, "body": "My body, 5 months post-partum is back to pre-pregnancy weight, but everything fits differently. My boobs are huge for the first time in my life, and I grew an ass. I used to be called no-butt-feydid by family members. Now, I got junk in the trunk :) As for the pain of childbirth? 21+ hours of hell. Pain like I had never felt before, pressure in places I didn't know existed inside myself. But its a different kind of pain. Some call it productive pain. I focused solely on that thought for the 3 hours of pushing I did. Kept telling myself that this is a means to an end and that my baby would be here at the end of it. Like doing an endurance run or marathon, you push through the end no matter how badly it hurts, your body screaming for relief, and at the end of it you get the best prize ever. We are lucky creatures that we cannot remember pain as we remember a smell or any other sensation. If we did, we would never get pregnant again. And it is spot on when people say the pain fades into hazy memory very quickly. The oxytocin dump the moment you give the final push and the baby is out and you hear that first wail is the best high I have ever had in my life, and in my younger days I smoked some fantastic pot so that's saying a lot. It is terrifying if you allow the fear of the pain to consume you. We all make it through, one way or another and many of us go on to spawn more little magic creatures. Every single woman since the beginning of time has gone through the same pains of childbirth, to some degree. It's a kind of solidarity and comfort to know that.  ", "controversiality": 0, "created_utc": 1415191258, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltlemu", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426181601, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Feydid", "author_flair_css_class": null, "author_flair_text": null, "body": "PPD is one thing I worried about most throughout pregnancy, and sure enough I got it. But my now husband and I were prepared. We stayed on top of my symptoms and both agreed when it was time to talk to my OB about it. I was put on Zoloft and after just a week I started feeling a million times better, more capable. I know it is harder for some to find that place but I feel a lot of it is mindset, being prepared and being self-aware. ", "controversiality": 0, "created_utc": 1415191564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltlhdy", "link_id": "t3_2ladyo", "parent_id": "t1_clswnha", "retrieved_on": 1426181566, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "katy_Amourette", "author_flair_css_class": null, "author_flair_text": null, "body": "Did you ever lay on your stomach right after you had baby number 1? So weird.", "controversiality": 0, "created_utc": 1415191597, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltlhp6", "link_id": "t3_2ladyo", "parent_id": "t1_clsweal", "retrieved_on": 1426181561, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415191730, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltlivp", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426181546, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mareeesha", "author_flair_css_class": null, "author_flair_text": null, "body": "I used to sleep on my stomach a lot, but find it incredibly uncomfortable after having a baby for some reason.", "controversiality": 0, "created_utc": 1415196141, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltmwdi", "link_id": "t3_2ladyo", "parent_id": "t1_cltlhp6", "retrieved_on": 1426180905, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Amycado", "author_flair_css_class": null, "author_flair_text": null, "body": "I also used hypnobabies with amazing success with both of my children. ", "controversiality": 0, "created_utc": 1415196679, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltn3ng", "link_id": "t3_2ladyo", "parent_id": "t1_clsxeai", "retrieved_on": 1426180810, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "katy_Amourette", "author_flair_css_class": null, "author_flair_text": null, "body": "I did it right after I had my daughter and I think it's because your abdominal muscles and organs are still moving back in place. ", "controversiality": 0, "created_utc": 1415196761, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltn4s8", "link_id": "t3_2ladyo", "parent_id": "t1_cltmwdi", "retrieved_on": 1426180796, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "I kept reminding myself that if it was THAT bad, no one would have second, third, or sixth children. Lol. \n\nI was pressured into having an epidural when I gave birth so for me it was a lot of sitting around and waiting until the real action happened. The recovery was significantly worse than the delivery. I tore very badly so I was basically healing the same as a surgical procedure. \n\nI can't wait to do it again, and do it \"for real\" this time. For me, having the epidural made me feel very detached from the whole process, which is not what I wanted. It might be exactly what someone else needs, but it ruined the day for me and caused a lot of mental issues (which a whole other story). This time I'm looking forward to pushing myself through the pain and letting my body experience delivery as I think it's supposed to.  I need that to have closure I think, since my first birth was kinda traumatic to me physically and psychologically. \n\nObviously this is rare, but my aunt had zero labour pains. She felt pressure like if she had to poop and delivered my cousin in the bathroom. So I mean, that'd be cool too. Haha. ", "controversiality": 0, "created_utc": 1415196971, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltn7rv", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426180759, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "picklelady", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh. The Pitocin made me vomit so much. I really really hate to throw up. \n\nI think the pitocin from birth #1 was worse than the unmedicated labor and delivery from birth #2, for me. ", "controversiality": 0, "created_utc": 1415197564, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltngbd", "link_id": "t3_2ladyo", "parent_id": "t1_clszqf9", "retrieved_on": 1426180646, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Amycado", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had two unmedicated births using Hypnobabies method and reading Ina May Gaskin's Guide to Childbirth.  I highly recommend both. Ina May's book has one half positive birth stories and you get a healthy idea of how birth is different for everyone. For example:  some women hate the pushing part, some women love the pushing part (crazy bitches). The second half tells you what's going on with labor, how it all works together and loads of tips and tricks to make labor easier and more effective (example: keep a loose mouth/jaw. You can't keep a loose bottom with a tight mouth).  She's a huge huge figure in midwifery and its a great read for you and your partner. \n\nHypnobabies helps with anxiety and relaxation. It's kind of stupid when you start, but fuck - it works. Silly things like changing your wording helps. Don't think \"pain\", say \"pressure\". It's not \"hard\" it's \"strong\". And so on. If you go in saying lots of negative words, chances are you'll have a negative experience.  It's a mind game. The CDs help you zone out and relax (I was 7cm and nodding off - experienced doula couldn't tell when I was having pressure waves (contractions)). You get to a point between awake and asleep - you know everything going on around you, you just stop giving a fuck.  \n\nSo we're my births painful?  The dilating part - no, but they were wildly uncomfortable. The pushing part - yes. I tore both times (first with a little numbing shot, second tore my labia and I nothing, barely a doctor in the room). It doesn't last long but recovery blows (I hate it WAY more than labor)\n\nI would choose natural birth again without batting an eye. Again - a lot of it is a mind game. It's surrendering when you want to fight or flight. It's relaxing when you want to clinch. It's trusting when you are scared to death.  Everyone says you don't get a trophy for it, but fuck that. I have two trophies, two achievements unlocked, two mountains climbed, two amazing experiences that make me feel strong, incredible and proud of my body. \n\n*Experiences may vary*", "controversiality": 0, "created_utc": 1415198148, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltnp5u", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426180531, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "1 important thing to remember is that even though it's cliche, it's true. All pregnancies are different. My 1st was a dream, my 2nd was a nightmare. \n\n\nAlso, \"You'll forget the pain when the baby is born\" that's bullshit. That's something we tell new moms so they don't freak out. You'll remember it. But I promise, you'll decide it was worth it. \n\nLabor for me wasn't bad. My 1st one I was induced and I controlled when I got the epidural. The first one only worked on one side of my body and I had to have another. The person who put in my 1st epi was awful and I could FEEL the needle digging around. The 2nd epi was awesome. She had the old one out and the new one in so fast I didn't know it. \n\nI always asked \"How will I know when I'm in labor?\" I just kept getting, \"You'll KNOW.\" Such a bullshit cop out. Being in labor (at least for me) was like the worst cramps you've ever had. Only deeper. They won't go away, no matter what position you're in. \n\nOnce the epi was in, I was 100% fine. No pain, I had energy, I was ready to go. Baby 1 I only pushed 5 times and he came. No long drawn out labor for me. A lot of women say they were at the pushing stage for hours, even my nurse told me not to expect it to go fast when she said it was time to push. But I was never in pain. They gave me a clicker to control when I got a med boost, and I never felt a thing. I didn't tear, I had an episodomy. I know I spelled that wrong, but it's where the doctor makes a cut to prevent tearing. This is somewhat controversial. Some women say it's worse, some say it's better. I think it depends on your doctor. \n\nThe next day, 9am, I had showered, dressed, and put on a little make up (I didn't want to look like a mombie in any pics) my nurse was shocked. I had a 9lb 10oz baby and she couldn't believe I was up and around so quick. I had some trouble sitting on hard surfaces for about a month, otherwise all good. \n\n\nMy 2nd, I had a horrible pregnancy. Pain pretty much every day. I had a c-section. It was amazing. I felt no pain, I was sick as a dog, I had pre-eclampsia. I vomited on the table. After he was out though, I felt perfect. The pain after was pretty bad, I hurt for days. My incision was low, and couldn't wear jeans for a few weeks. But nothing so bad I couldn't handle it. ", "controversiality": 0, "created_utc": 1415202156, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltpmm4", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426179579, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Coffeebrains", "author_flair_css_class": null, "author_flair_text": null, "body": "This is so true.  Labor is no walk in the park, but it does end.  You will get through it. I kept telling myself this during the hardest parts.  It's such a short time compared to raising a child, you soon get over it, and almost forget the worst.  Women have babies all the time, and if they can do it, so can I. So can you.  ", "controversiality": 0, "created_utc": 1415202166, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltpms2", "link_id": "t3_2ladyo", "parent_id": "t1_clsweal", "retrieved_on": 1426179576, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Jodie182", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 4 months in and even though I can fit into my pre pregnancy clothes my body is not the same. The worst is muscular pain in my back I'm in absolute agony sometimes. Also like the other lady said the pain is inevitable. I had pethidine and a epidural which i would both definitely have again. ", "controversiality": 0, "created_utc": 1415203130, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltq56h", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426179338, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "thirdpeppermint", "author_flair_css_class": null, "author_flair_text": null, "body": "I was induced, it was like bad period cramps (but not worse than the bad cramps I had in high school.) I got an epidural (conveniently right before I was able to push so I didn't have much time to enjoy it) and the guy did a great job - I could still stand and move around and use my legs, they just felt like when you stand outside in winter with pants that aren't warm enough and you get that weird numb feeling. The baby ended up being bigger than they anticipated AND was facing the wrong way, so after 3 hours of pushing the doctor had to do an episiotomy (which I didn't feel) and pulled the baby out. Second degree tear (took forever to heal and I had granulation tissue, but that's another story) and I had to lovely opportunity of feeling the stitches since they turned off the epidural and it wore of instantly (as in I could stand and walk immediately.)\n\nThat being said, I ended up with a kidney infection afterwards and had to be rushed back to the hospital the day after I was discharged and THAT was many, many times worse than my experience giving birth. It was bad enough that when I was checked into the ER they took my back immediately, even though there were people waiting. And the people waiting seemed concerned. Super high fever (over 104 WITH Ibuprofen) and the kidney pain was insane. And THEN they needed to get a clean urine sample, so they had to insert a catheter. It was so messed up down there from having just had a baby that they had to get an expert to fish around and find the right spot. Super duper painful and I don't recommend it. I think the nurses looked like they were about to cry and they just kept saying how sorry they were.\n\nSo yeah - having a baby is ouchy and tiring, but I'd rather pop out a billion babies and feel the stitches in my lady parts every time than have another kidney infection.", "controversiality": 0, "created_utc": 1415204993, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltr5s3", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426178863, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tangowitmango3eb", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you describe what ppd is like?  It seems like all the things women go through even post birth is intense between body changes and adjusting to a completely new life.  ", "controversiality": 0, "created_utc": 1415205356, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltrd4t", "link_id": "t3_2ladyo", "parent_id": "t1_cltlhdy", "retrieved_on": 1426178768, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tangowitmango3eb", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you think it is worth it to opt for a c section instead of vaginal birth?  My mom had a c section with my brother and says it was such a long painful recovery.  Maybe things have changed since hers 24 years ago. ", "controversiality": 0, "created_utc": 1415206228, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltruyc", "link_id": "t3_2ladyo", "parent_id": "t1_cltpmm4", "retrieved_on": 1426178537, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tangowitmango3eb", "author_flair_css_class": null, "author_flair_text": null, "body": "Was the kidney infection related to giving birth? ", "controversiality": 0, "created_utc": 1415206353, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltrxhf", "link_id": "t3_2ladyo", "parent_id": "t1_cltr5s3", "retrieved_on": 1426178504, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "thirdpeppermint", "author_flair_css_class": null, "author_flair_text": null, "body": "Indirectly. It was caused by them putting a catheter in, taking it out, putting it BACK in, taking it out, etc. If they just would have left it in there would have been no problem.", "controversiality": 0, "created_utc": 1415206547, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clts1fz", "link_id": "t3_2ladyo", "parent_id": "t1_cltrxhf", "retrieved_on": 1426178453, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Feydid", "author_flair_css_class": null, "author_flair_text": null, "body": "Everyone is different. For me, it was constant anxiety that something bad would happen to her. That nothing I did could protect her. I hate being scared, and I was scared all the time. Constantly checking to see if she was still breathing. It was like being on overdrive 24/7. I wasn't  sleeping, even if she was. I was too scared. Nightmares, horrific nightmares. I was paranoid that someone would take her from me (which isn't exactly unfounded, her sperm donor's mother is insane and made threats).\n\n My LO and I had a rough start with breastfeeding. I resented her when she shreded my nipples. She was hungry and I was exhausted. I hated breastfeeding. I'd cry when she would latch on. My anxiety made her anxious. It just felt terrible. All of it. I hated how I felt. I felt like I wasn't bonding with her. So I talked to my OB, got the meds. Took a day off from being me. Saw some friends and got a pedi and a haircut. Grabbed some Starbucks and took a few deep breaths. It can be so hard. So overwhelming. But the meds kicked in quickly and I started to see the light at the end of the tunnel. I started to relax more and not get so frustrated with the breastfeeding. We started to bond. And now, at 5 months post, I miss her when I'm at work, so much that it hurts in a nearly physical way. Like, my chest hurts thinking that I could be home cuddling her, making her laugh, helping her learn, watching her sleep so peacefully. I haven't had a bad day since about 2 months post partum. I feel confident in my parenting abilities. My husband has been fantastic. We got married last month and even though he isn't her genetic contributor, he is her father 100%. We are already planning to try for #2 starting in April of next year. I love being a mom. Her mom. I can't really remember what life was like before her. I don't miss the life I had before her. It's a rollercoaster of hormones and craziness, but for me, it has been so very worth it. ", "controversiality": 0, "created_utc": 1415209586, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clttswx", "link_id": "t3_2ladyo", "parent_id": "t1_cltrd4t", "retrieved_on": 1426177612, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tangowitmango3eb", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for sharing!  I never even thought about breastfeeding being painful. ..", "controversiality": 0, "created_utc": 1415210119, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltu44a", "link_id": "t3_2ladyo", "parent_id": "t1_clttswx", "retrieved_on": 1426177467, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Feydid", "author_flair_css_class": null, "author_flair_text": null, "body": "It can really, really suck. Do your research, get educated and be prepared. I wish we had had the money for a lactation consultant. Would have solved the major problems so much quicker. ", "controversiality": 0, "created_utc": 1415210690, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltufth", "link_id": "t3_2ladyo", "parent_id": "t1_cltu44a", "retrieved_on": 1426177316, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Catbunny", "author_flair_css_class": null, "author_flair_text": null, "body": "I have been medicated for anxiety. Doing research into my facility and midwives helped. What birthing method are you planning on? Having a doula and a birth plan helped a ton. My labor and delivery was completely med free.  I should add I went to therapy and dealt with anxiety knowing I wanted to get pregnant and wanting to be mentally healthy for my child.", "controversiality": 0, "created_utc": 1415212716, "distinguished": null, "downs": 0, "edited": 1415213043, "gilded": 0, "id": "cltvnd6", "link_id": "t3_2ladyo", "parent_id": "t1_clswnha", "retrieved_on": 1426176722, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "TheyArentReal", "author_flair_css_class": null, "author_flair_text": null, "body": "What pain? Had an epidural with #1 and a c-section with #2. I got an ingrown toe nail once, now that was painful. ", "controversiality": 0, "created_utc": 1415213715, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltw90u", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426176423, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Trishlovesdolphins", "author_flair_css_class": null, "author_flair_text": null, "body": "Uh, well I didn't opt for one, mine was an emergency. So, I can't say if I felt better about it leading up to it. For me, recovery was MUCH better from a vaginal delivery. I didn't hurt, I could take a bath much sooner, I could lift the baby and my older son without pain, stairs weren't a problem... \n\nMy cousin swears by C-sections. No long labor, you know when the baby will be born, you can plan around it. You hurt for a few days, and for a few weeks after if you sneeze or something like that, it hurts like a mofo. \n\nI think it depends on which you value more. The great convenience of the planning with more pain, or the longer labor with less recovery. ", "controversiality": 0, "created_utc": 1415213866, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltwceg", "link_id": "t3_2ladyo", "parent_id": "t1_cltruyc", "retrieved_on": 1426176379, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "enfermerista", "author_flair_css_class": "blue", "author_flair_text": "Mom of 1 boy 7/11", "body": "Epidurals are linked with substantially longer pushing stage (like an hour) and increased need for vacuum or forceps delivery, which are linked with third and fourth degree tears. However it's effective pain relief, which I consider a very important factor, and it has no effect on the baby. They are not a big dangerous intervention and I wish there wasn't such fear mongering about them.", "controversiality": 0, "created_utc": 1415213883, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltwcqy", "link_id": "t3_2ladyo", "parent_id": "t1_clt1tnn", "retrieved_on": 1426176374, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "enfermerista", "author_flair_css_class": "blue", "author_flair_text": "Mom of 1 boy 7/11", "body": "If your water had been broken for that long and you weren't progressing, you probably weren't having \"normal\" contractions. They were too weak to be effective. Contractions causing progress hurt! Pitocin is not devil's juice. ", "controversiality": 0, "created_utc": 1415214051, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltwgc4", "link_id": "t3_2ladyo", "parent_id": "t1_clszqf9", "retrieved_on": 1426176330, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cutecottage", "author_flair_css_class": "green", "author_flair_text": "Mom", "body": "Yeah, it was non-progressing labor. I was having contractions but they weren't strong enough (though strong enough that I couldn't rest or sleep and had to keep walking around). The pitocin brought on extremely strong contractions in a matter of 15 minutes and it was just brutal. I was also in back labor so that didn't really help.", "controversiality": 0, "created_utc": 1415215571, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltxc9z", "link_id": "t3_2ladyo", "parent_id": "t1_cltwgc4", "retrieved_on": 1426175914, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Ikuisuus", "author_flair_css_class": null, "author_flair_text": null, "body": "With epidural, I'd say I would rather give birth once a month than have my week long periods.", "controversiality": 0, "created_utc": 1415219648, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cltzs0k", "link_id": "t3_2ladyo", "parent_id": "t1_clswaz6", "retrieved_on": 1426174754, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "BelleLune", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not terrifying, no. \n\nI've had two unmedicated births and they were both different. \n\nFirst: I woke up at 9am, feeling like I had to poop really bad. I paced around and kept trying to go to the bathroom but nothing was helping. The contractions were 5 minutes apart but they just felt uncomfortable, like period cramps. Around 12pm that started to get a bit more intense and were 3 minutes apart so we went to the hospital. Once I got there, they made me have an iv and I had to lay in bed for monitoring. That's when they started to get painful. Laying on my back was always the worst feeling. They quickly progressed though and got quite a bit intense. Once my water broke, they became really hard to get through. Then I felt the urge to push and the pain disappeared. I just felt like pushing, but no more painful contractions. So I was trying to catch my breath at that point because it was so relieving but my OB kept yelling at me to push. Finally she cut an episiotomy and THAT hurt. Baby was born at 2:34pm and the pain was all gone.\n\nSecond: I woke up with contractions at 5am.they were very very mild and 20 minutes apart. They would sometimes go away for an hour. This happened all day and it wasn't even really uncomfortable, I was just antsy all day. At 8:30pm, my water broke suddenly so we headed to the hospital. This hospital didn't make me have an iv or be strapped to the bed, so I was free to move around which helped so much. The contractions were barely anything this time and i suddenly felt the urge to push. Once the baby started to crown, it really hurt. The contractions were still coming strong and heavy and i felt like i was just going to rip open. I wasn't pushing as hard as i needed to because of the \"ring of fire\". But eventually my body just did it for me and one huge push and baby was out. No tears or anything!", "controversiality": 0, "created_utc": 1415239363, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cluan1m", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426169625, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415243783, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clucttg", "link_id": "t3_2ladyo", "parent_id": "t1_cltgx78", "retrieved_on": 1426168604, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415243887, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clucvp1", "link_id": "t3_2ladyo", "parent_id": "t1_cltcz3n", "retrieved_on": 1426168580, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "whatim", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I used the Hypnobirthing method with my son and I highly recommend it\n\nThis. I can't recommend Hypnobirthing enough. I went to the full course for Baby #1, then just read the materials/listened to the CD for babies #2 and #3.\n", "controversiality": 0, "created_utc": 1415256026, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cluhzah", "link_id": "t3_2ladyo", "parent_id": "t1_clsxeai", "retrieved_on": 1426166054, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1415257996, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cluiji4", "link_id": "t3_2ladyo", "parent_id": "t3_2ladyo", "retrieved_on": 1426165792, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "OhBonnieDog", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh god yes- the other day I asked my husband for the Automatic screwdriver thing. The drill. I wanted the drill. ", "controversiality": 0, "created_utc": 1415326487, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clvc9n6", "link_id": "t3_2ladyo", "parent_id": "t1_cltisjg", "retrieved_on": 1426151519, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}