{"submission": {"author": "laymedown", "author_created_utc": 1311343279, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_5jvvo", "created_utc": 1415715605, "domain": "jezebel.com", "full_link": "https://www.reddit.com/r/Mommit/comments/2lytcj/loved_this_you_dont_get_to_have_an_opinion_on_how/", "gilded": 0, "id": "2lytcj", "is_self": false, "media_embed": {}, "num_comments": 56, "over_18": false, "permalink": "/r/Mommit/comments/2lytcj/loved_this_you_dont_get_to_have_an_opinion_on_how/", "retrieved_on": 1441076486, "score": 65, "secure_media_embed": {}, "selftext": "", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "http://b.thumbs.redditmedia.com/ycvnCN9vO-gZr1Kie1Dc4ISW5VSZlAUA8oqeqkUEDag.jpg", "title": "Loved this: You Don't Get to Have an Opinion on How Anyone Gives Birth. Ever.", "url": "http://jezebel.com/you-dont-get-to-have-an-opinion-on-how-anyone-gives-bir-1651464132"}, "comments": [{"archived": false, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Yes. The only comment I will make when someone says how they are giving birth is if they will skip with epidural and I will tell them that if they do that it's amazing because I could not. I will also say (especially if it's a first time mom) that if when they are in labor and IF they change their mind not to feel bad it hurts like hell and not everyone can take it or should have to take it.", "controversiality": 0, "created_utc": 1415719629, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzfb4l", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426079384, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Sbandollie", "author_flair_css_class": null, "author_flair_text": null, "body": "I appreciate the authors sentiment, but I think she got a lot wrong with her post. I hate Jezebel so much, though... ", "controversiality": 0, "created_utc": 1415722342, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzglz1", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426078777, "score": 15, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "What did you think was wrong? I couldn't see anything that I didn't agree with. ", "controversiality": 0, "created_utc": 1415726228, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzincp", "link_id": "t3_2lytcj", "parent_id": "t1_clzglz1", "retrieved_on": 1426077826, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fireash", "author_flair_css_class": null, "author_flair_text": null, "body": "That's a good way to say it.  I got so many people telling me that I would change my mind.  That I was crazy.  That I lived in a modern world why not get one.  That I wasn't going to get a medal for going without.  That it would be extremely painful.  I usually found their reactions funny when I told them I was going med free at home. Their eyes would bulge and mouths would drop.  I tell others that they can get one if they want to, but it is possible to go without.  Mine wasn't super painful and everyone reacts differently.  No, there was no trophy, just something I wanted to do and I did it. ", "controversiality": 0, "created_utc": 1415729514, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzkfif", "link_id": "t3_2lytcj", "parent_id": "t1_clzfb4l", "retrieved_on": 1426076997, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "feefio", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I could just send this to my mother in law. She constantly made me feel like shit because she had \"two sons completely unmedicated and didn't even find out what the sex was\" and I had a c section with my son. Like it was a some thing she did that made her better than me. If I had a dollar for every time I heard her say that shit...... ", "controversiality": 0, "created_utc": 1415730755, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzl4t1", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426076596, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "BluCloud", "author_flair_css_class": null, "author_flair_text": null, "body": "A woman's body is her own ,but on the other hand, babies are not property and entitled ,once born, to life and safety. So, if a woman puts her baby in danger by choosing to give birth in a shark tank, society should probably step in. \n\nHow to weigh society's concern for the baby versus the rights of the woman over her body is complicated.  It feels like it is the same problem as withholding medical care from children because of the parent's personal beliefs. ", "controversiality": 0, "created_utc": 1415731597, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzlm4i", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426076371, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "I agree. I have a Masters in Maternity Nursing and there are some things that moms/parents choose to do around births that are stupid and wrong. It's not a judgement from me - it's bad medicine. A good example would be elective c-sections. They are major abdominal surgery and not something to be taken lightly or used as an elective choice. I've met a number of women that regretted that choice deeply while they watched me pack the incision with gauze and hook the wound vac to a wound that just wouldn't heal. There was also the family that watched me do CPR on their infant 2 hours after the elective c-section. He was nursing and then just went blue...", "controversiality": 0, "created_utc": 1415731963, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzltnm", "link_id": "t3_2lytcj", "parent_id": "t1_clzglz1", "retrieved_on": 1426076274, "score": 12, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Sbandollie", "author_flair_css_class": null, "author_flair_text": null, "body": "Making it all about sexism and misogyny- I completely disagree that moms bashing other moms has anything to do with sexism, and it seems like the author is almost using the topic for her own agenda. I don't think that our culture forces women to shut-up and deal with a birth they aren't happy with. Everything that I've ever seen has been supportive and focused on the well-being of the mother and baby. Sure, I've heard some stories here and there, but the overwhelming majority is not bad at all. I myself am a young, low-income mother and I had an amazing pregnancy and birth experience. Every time I ever read a book, looked something up online, talked to a friend or family member, or a nurse at my doctors office, or a random stranger at the grocery store, everything and everyone have always been positive and supportive of me and my choices as the mother. \n\nI also have never heard someone call a mother high-maintenance (or otherwise make fun of her) for having a birth plan. I'm not saying that hasn't happened, but I don't think it's the most common thing. What I do see is people who remind mothers that they shouldn't be too invested in their birth plan and to be prepared for things to change, so that they aren't disappointed. It might be annoying, but it's the truth. \n\nAlso, I am frustrated that the author had to make a point of \"privileged, educated, and more often than not, white women\" being the only ones who have their wishes respected, or whatever. That's not true, no matter how rich or well-educated or white you are, you don't have some special option to not have a c-section if your baby needs it. And it honestly seems like the way she phrased that whole point was as judgmental and rude as the people she's condemning.  ", "controversiality": 0, "created_utc": 1415732539, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzm58x", "link_id": "t3_2lytcj", "parent_id": "t1_clzincp", "retrieved_on": 1426076124, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "orange_and_coconut", "author_flair_css_class": "lightcoral", "author_flair_text": "Baby A- July 2 2013", "body": "I find that most people who say to just \"to just get one so you don't have to be in pain\" are ignoring or are unaware of all the things (other than pain level) that having an epidural can affect during a birth. I didn't want to be stuck in one place, I didn't want labor to potential slow, I wanted to be able to feel the urges to push etc etc. It's not as simple as \"but why would you want to be in pain??\"", "controversiality": 0, "created_utc": 1415734177, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzn2gq", "link_id": "t3_2lytcj", "parent_id": "t1_clzkfif", "retrieved_on": 1426075693, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cupcake_3", "author_flair_css_class": "blue", "author_flair_text": "Mitchell 2013", "body": "I hate people's comments about my C. I tell them, \"If I could have I would have.\"", "controversiality": 0, "created_utc": 1415735398, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clznrib", "link_id": "t3_2lytcj", "parent_id": "t1_clzl4t1", "retrieved_on": 1426075369, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fireash", "author_flair_css_class": null, "author_flair_text": null, "body": "Right.  I had experienced pain of other kinds before and to be honest, running on stress fractures hurt a lot worse.  Labor and delivery was mostly exhausting with a few minutes of pain and a few days of soreness.  I wanted to be able to get in other positions, walk around, and negate even small chances of side effects.  The benefit of a home delivery with midwives was that an epidural was not an option unless I transferred.  It really kept me focused.  Had I been in the hospital I may have chosen one just for some sleep.  Went into labor Monday and delivered Thursday.  Slept maybe 4-6 total hours.  Being exhausted helped with the pain though.  I didn't even feel the catheter.  Body was just like nope, don't got time for pain :P", "controversiality": 0, "created_utc": 1415737586, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzow7l", "link_id": "t3_2lytcj", "parent_id": "t1_clzn2gq", "retrieved_on": 1426074841, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Yes, exactly. What I hate the most is the women who basically told me because I got an epidural I didn't really give birth. It's like are you fucking kidding me!?!?!?!?!!! My labor when from 0 contractions to 1 every single minute and then I waited for 6 hours before getting the epidural and then it was time to push. So not only didn't I want the epidural before hand I was told by the doctors I had to get it because my body couldnt take anymore.", "controversiality": 0, "created_utc": 1415738489, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzpc12", "link_id": "t3_2lytcj", "parent_id": "t1_clzkfif", "retrieved_on": 1426074636, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fireash", "author_flair_css_class": null, "author_flair_text": null, "body": "That sucks.  Of course you gave birth.  People are so judgmental on all sides for every issue.  My sister also had to have one due to pain being extreme.  Her firstborn's cord was so short it was pulling at the placenta.  It kept her from descending but also causing a lot of pain.  It could have been a life or death situation had it pulled free.  Luckily they got her in for a c-section in time.  My choice is in no way a reflection on her or other moms.  I think a lot of the mommy war is just how ingrained we become growing up.  We always have to find an \"us\" vs \"them\". ", "controversiality": 0, "created_utc": 1415740988, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzqqgg", "link_id": "t3_2lytcj", "parent_id": "t1_clzpc12", "retrieved_on": 1426073983, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Axora", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I also have never heard someone call a mother high-maintenance (or otherwise make fun of her) for having a birth plan\n\nYou must've never visited the Baby Center birth boards. ", "controversiality": 0, "created_utc": 1415741892, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzr8ql", "link_id": "t3_2lytcj", "parent_id": "t1_clzm58x", "retrieved_on": 1426073746, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Sbandollie", "author_flair_css_class": null, "author_flair_text": null, "body": "I actually did, at first. But most moms seem to agree that those kind of women are crazy and not the majority. ", "controversiality": 0, "created_utc": 1415744741, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzsts4", "link_id": "t3_2lytcj", "parent_id": "t1_clzr8ql", "retrieved_on": 1426072935, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "79augold", "author_flair_css_class": null, "author_flair_text": null, "body": "Someone with a masters should know anecdotal evidence is not sound research. I had a c section, scheduled, and because of people like you, I often feel I need to add, medically necessary.  Here's my anecdote, it was great.  And I was originally down for no drugs or interventions. Compared to friends who had tears and stitches, I was in much less pain, and had a much easier time dealing with a newborn. I am not judging them. I'm glad we've all had happy, healthy babies. I am just saying, your fear mongering is exactly what this is about. Things can go wrong with any birth, and blaming moms for choices they, and apparently a medical staff, thought was medically sound, is not your judgment to make. You want to tell us elective c sections are bad, then quote peer reviewed medical research. ", "controversiality": 0, "created_utc": 1415745995, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzthh2", "link_id": "t3_2lytcj", "parent_id": "t1_clzltnm", "retrieved_on": 1426072628, "score": 16, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "See, I had a very traumatic birth where NONE of my choices were honoured. I ended up sick because of it, mentally and physically, and everyone told me to be happy I had a healthy baby and essentially, that it didn't matter anymore because it was over. The doctor literally performed procedures on me I did not consent to. I had a medical professional tell me to get over it because that's how it happens. Almost three years later I'm still dealing with the effects of my \"normal\" vaginal delivery.\n\nNow that I'm pregnant again I am doing everything in my power to avoid the same situation and all anyone cares about is telling me how much I'll regret not having access to pain meds, implying I couldn't handle the pain. I've heard comments about how I'm putting everyone at risk because of my birth choices. Everyone has their opinions, but none of them are useful or important. \n\nThis stuff definitely happens, and the point I got from the article was that I'm making choices for my own reasons, and no one should be telling me I should or shouldn't do it any way but how I want. I guess I kinda glossed over all the name calling because I wouldn't do that in real life, so I ignore it. But I think the greater message here needs to be heard by more people, especially those close to a pregnant woman. \n\nMaybe you made the choices that other people are comfortable with, or maybe you're lucky and are surrounded by some great people. I'm so happy for everyone who had a drama-free birth where they walked away happy with their new baby. There are a lot of women who aren't so lucky. When I started telling my story to women I know, a few came out to tell about their hard birth experiences. When they have babies again, they may chose options that other people may not be comfortable with, because it's what they need to feel safe or confident in the experience. I just wish everyone would be more supportive and less judgemental. \n\nSorry, this was way longer than I expected, and kinda snarky sounding. I hope it doesn't seem like I'm trying to be argumentative, I'm just hoping to shed some light on another side of birth. I agree with your comments about sexism and name calling, but needed to say that I was (almost) literally told to \"shut up and deal with a birth I'm not happy with\". It happens, and it sucks when it does. I'm doing things differently this time and everyone else can stfu if they don't like my choices..", "controversiality": 0, "created_utc": 1415746163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clztko4", "link_id": "t3_2lytcj", "parent_id": "t1_clzm58x", "retrieved_on": 1426072587, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "contrailia", "author_flair_css_class": null, "author_flair_text": null, "body": "Just as not every opinion is equally valid, not every opinion is equally invalid. The opinions of experienced medical professionals should be given greater weight. A birth plan conversion should happen between a woman and her doctor(s), but beyond that it's really nobody else's business.", "controversiality": 0, "created_utc": 1415749546, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzv9u7", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426071794, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "If it was medically necessary then it wasn't elective. I'm referring to individuals that choose c-section delivery for no reason other than convenience. The peer reviewed evidence is there to back me up and I will post tomorrow when I'm not on my phone. ", "controversiality": 0, "created_utc": 1415751512, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzw8a5", "link_id": "t3_2lytcj", "parent_id": "t1_clzthh2", "retrieved_on": 1426071348, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "Totally. It's ridiculous.\n\nThat's scary about your sister glad everything was okay in the end!", "controversiality": 0, "created_utc": 1415752372, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzwnqu", "link_id": "t3_2lytcj", "parent_id": "t1_clzqqgg", "retrieved_on": 1426071147, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "NinjaGinny", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an elective csection and it was awesome. Well as good as a birth can be. I have no regrets about it. ", "controversiality": 0, "created_utc": 1415755514, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzy7h8", "link_id": "t3_2lytcj", "parent_id": "t1_clzthh2", "retrieved_on": 1426070425, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "79augold", "author_flair_css_class": null, "author_flair_text": null, "body": "My point was, even though it's not anyone's business really, I feel it is necessary to tell people it was medically necessary because of judgment, which is relevant to the article.  Purely elective c sections are not nearly allowed as much as they used to be. You don't have to post research. My point was your anecdotal evidence was really ipso hoc ergo procter hoc, and purely anecdotal, and if you are as educated as you claim, you should do better than that. What you did instead was post a few stories that had bad turnouts maybe due to the c section, maybe not. But, it is irresponsible to not point out the faulty logic behind your post and the fact it is fear mongering. There is a definite push against c sections, even when they are necessary, and maybe, just maybe, someone in here will be scared away from a viable option because of your attitude. Thank god for my perinatalogist, and her convincing, fact based information. She made my choice easy. I had a choice to try labor first, but in her opinion, and my ob, it would get is to the same conclusion with probably worse results because of the beating my body would have already gone through from a labor that probably would not progress. This is my rant and my pet peeve. When you have a c section, people make terrible comments about taking the easy way out, and not being able to handle \"real\" childbirth. You claim to be educated in the field, so maybe I hold you to a higher standard. ", "controversiality": 0, "created_utc": 1415755857, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzydm2", "link_id": "t3_2lytcj", "parent_id": "t1_clzw8a5", "retrieved_on": 1426070345, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "79augold", "author_flair_css_class": null, "author_flair_text": null, "body": "Awesome. Mine technically was elective too, contrary to what was said here, I would be included in the elective stats. It was highly recommended for medical reasons, but I still had a choice to try getting induced. Good for you. I thought it was great too. It was surgery, which has risks and can be scary. Pretty sure I felt that way about vaginal birth too. Thanks for sharing, I know it can be hard to say something that can receive some judgment.  ", "controversiality": 0, "created_utc": 1415756279, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzyl2z", "link_id": "t3_2lytcj", "parent_id": "t1_clzy7h8", "retrieved_on": 1426070249, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "perrla", "author_flair_css_class": null, "author_flair_text": null, "body": "I know someone whose child is 6 weeks older than my son. She kept telling me how lucky I was to have a c-section, because the vaginal delivery with epidural was too painful. The desire to bitch slap her was high. My c-section was traumatic for me. I went through 7 hours of pitocin induced labor without pain medication and would do that again anytime over the section because of how awful the recovery was. \n", "controversiality": 0, "created_utc": 1415757089, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzyzez", "link_id": "t3_2lytcj", "parent_id": "t1_clznrib", "retrieved_on": 1426070063, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "perrla", "author_flair_css_class": null, "author_flair_text": null, "body": "They expect every woman to have the same expectations of birth. I was terrified of getting an epidural. When I gave in and got an epidural I hated it. I made me feel out of control. ", "controversiality": 0, "created_utc": 1415757592, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "clzz8hc", "link_id": "t3_2lytcj", "parent_id": "t1_clzn2gq", "retrieved_on": 1426069945, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;Carrie Murphy is a poet, freelance writer, and certified birth doula.\n\nThat explains it. Her opinions on birth, whatever they might be, are basically that of a lay person, yet she works in the field of childbirth. She would probably like to believe that all opinions on birth are equal, that her thoughts on the subject are just as valid as those of highly trained and educated CNMs or OBGYNs, and that people who don't respect that are just misogynistic bullies. As a doula, she has probably worked closely with non-CNMs, midwives who do not meet hospital qualifications, and who are basically in competition with hospitals. So it's in her best interest to promote the idea that we're all entitled to our own opinions, but as Daniel Moynihan says, we're not entitled to our own facts. Some birth methods simply carry greater risk than others.\n\nWhile I agree that moms are generally the most judgmental people on the planet, and that we should be a lot more supportive of each other, there are some absolutely unsafe practices that are promoted in the name of feminism or with the \"my body, my choice\" mantra. As a feminist, that bothers me. ", "controversiality": 0, "created_utc": 1415760433, "distinguished": null, "downs": 0, "edited": 1415760689, "gilded": 0, "id": "cm00odv", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426069202, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "NinjaGinny", "author_flair_css_class": null, "author_flair_text": null, "body": "I was induced with my first and it did not go well. With my second I decided to just do a csection. ", "controversiality": 0, "created_utc": 1415761406, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm015vt", "link_id": "t3_2lytcj", "parent_id": "t1_clzyl2z", "retrieved_on": 1426068975, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dropdeadred", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't understand the c-section then blue baby story considering it's two hours afterwards. Vaginal birth would've prevented apnea because that never happens in a vaginal birth?\nI'm a nurse, I had a scheduled c section. My water broke a week beforehand, so I just had a c section then. My decision was not wrong or bad. I healed beautifully and didn't blow out my asshole, tear, or prolapse my uterus. So, that's a win win situation right there. \nI don't understand why convenience is being lambasted as a negative thing. ", "controversiality": 0, "created_utc": 1415767541, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm045p9", "link_id": "t3_2lytcj", "parent_id": "t1_clzltnm", "retrieved_on": 1426067581, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dropdeadred", "author_flair_css_class": null, "author_flair_text": null, "body": "I scheduled my c section too and it was awesome. If someone asks why I has a c section, I literally tell them \"I didn't want to blow my asshole out\" (I'm also a critical care care and crude but whatever). Shit can go down regardless of pushing a baby out of your cooch or getting him cut out. ", "controversiality": 0, "created_utc": 1415767770, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm049di", "link_id": "t3_2lytcj", "parent_id": "t1_clzydm2", "retrieved_on": 1426067530, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "feefio", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah.... It was not fun AT ALL. ", "controversiality": 0, "created_utc": 1415769449, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm04yyr", "link_id": "t3_2lytcj", "parent_id": "t1_clzyzez", "retrieved_on": 1426067198, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CompanionCone", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh I am so with you. I really tried to like Jezebel but I just can't. I've read one too many of their whiny \"omg look how this photo is shopped it is SOOOO bad for women's self image waaah\" articles. ", "controversiality": 0, "created_utc": 1415786658, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm09b6d", "link_id": "t3_2lytcj", "parent_id": "t1_clzglz1", "retrieved_on": 1426065104, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CompanionCone", "author_flair_css_class": null, "author_flair_text": null, "body": "The internet is not real life. I too have never experienced any negative response to any decision or opinion I've had about my own pregnancy and birth, in real life. What people online say or think does not affect me and is irrelevant.", "controversiality": 0, "created_utc": 1415786845, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm09cc6", "link_id": "t3_2lytcj", "parent_id": "t1_clzr8ql", "retrieved_on": 1426065090, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fireash", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, she went in to have a second by planned c-section several years later due to the type of previous incision.  ", "controversiality": 0, "created_utc": 1415792789, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0aezn", "link_id": "t3_2lytcj", "parent_id": "t1_clzwnqu", "retrieved_on": 1426064588, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "I have noticed that codes happen more frequently with section babies. Some of this is of course confounding factors, but I'm not the only person to see this as a trend. I was just speaking with a Pediatrician on my caseload and we believe it's due to the loss of the squeezing of the vaginal walls on the baby's lungs. The amniotic fluid trapped their from being in utero causes breathing difficulties. Even with suctioning after delivery it is difficult to get to the deep lung bases. \n\nAgain, you didn't have an elective section. It looks like your water broke and you didn't go into labor. People are misunderstanding the term elective section...\n\n", "controversiality": 0, "created_utc": 1415794866, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0av5g", "link_id": "t3_2lytcj", "parent_id": "t1_cm045p9", "retrieved_on": 1426064378, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "I don't by any means thing a c-section is the easy way out. Like I said before, it's major abdominal surgery - the OB/Gyn opens up your abdomen and plops your uterus up on the sterile field. You and your SO can't see that and that's why they put that curtain up. There's a reason why vaginal deliveries warrant 2 days in the hospital and a c-section gets 3. The blood loss in a vaginal delivery is also a lot lower. None of these facts are my anecdotal stories. You can ask any L/D nurse and they will confirm the blood loss bit. We have to estimate blood loss with every delivery in our charting.", "controversiality": 0, "created_utc": 1415795463, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0b0b0", "link_id": "t3_2lytcj", "parent_id": "t1_clzydm2", "retrieved_on": 1426064312, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "[Here's](http://www.ncbi.nlm.nih.gov/pubmed/19461417) a study that shows 41.5% vs. 23.2% rate of delivery room oxygen resuscitation after elective c-section vs. VBAC. \n\n[This](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2453515/) study goes into excruciating detail about the hypothesis many of my peers subscribe to in regards to neonatal codes after c-section. I can keep going if you like.\n\n [ACOG](http://www.acog.org/Resources-And-Publications/Committee-Opinions/Committee-on-Obstetric-Practice/Cesarean-Delivery-on-Maternal-Request) has a formal opinion on this that negates the short term percieved benefits of c-section over vaginal birth. Also, simply carrying a pregnancy to term increases your risk of vaginal prolapse, cystocele, and/or rectocele. Menopause is another risk for pelvic floor dysfunction. Even nuns develop these issues sometimes because menopause causes a loss of estrogen - estrogen is needed to keep the collagen matrix of the the pelvic floor healthy. \n\n* Handa VL, Nygaard I, Kenton K, Cundiff GW, Ghetti C, Ye W, Richter HE. Pelvic organ support among women in the first year after childbirth. Int Urogynecol J (2009)1407-1411.\n\nEdit: The above study goes over why c-section is not protective against pelvic floor dysfunction. 1/5 of the study participants that had a c-section developed a stage 2 uterine prolapse. Of course the risk of a vaginal tear and \"blowing your asshole out\" is lower, but the weight of the pregnant uterus is going to stretch ligaments and muscles around the pelvic floor. Convenience CAN cause negative things.", "controversiality": 0, "created_utc": 1415804128, "distinguished": null, "downs": 0, "edited": 1415804682, "gilded": 0, "id": "cm0duwl", "link_id": "t3_2lytcj", "parent_id": "t1_cm045p9", "retrieved_on": 1426062982, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dropdeadred", "author_flair_css_class": null, "author_flair_text": null, "body": "No, it was totally elective. My water broke and I said \"cut me open\" and didn't even give labor a chance.  I had one good, strong contraction before I got my spinal. I opted the fuck out of labor\nMy actual surgery date was scheduled for 39 weeks (the earliest they allowed me to schedule) and my water broke a week early from a stomach bug (3 days of nonstop retching and pooping and I popped)", "controversiality": 0, "created_utc": 1415804303, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0dxmo", "link_id": "t3_2lytcj", "parent_id": "t1_cm0av5g", "retrieved_on": 1426062947, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "See, this is where I get pissed at some OB/Gyn's. It's not your fault because you trust them to do the right thing and have your best interest at heart. I used to audit charts for a local hospital because they wanted to see why their section rate was so high (close to 45% of births). You should not be induced unless several things fall into place: baby is low in the birth canal, you are 3 or more cm dilated, your cervix is soft and decently effaced (30 to 50%), you are 39 or more weeks pregnant. If you aren't \"ripe\" the induction is going to be a disaster and might end in a section. Then you're going to have all these unpleasant memories that aren't necessary. I don't know if that's how it was for you, but that's generally what I saw in the charts: 38 weeks pregnant, cervix is firm and not dilated/effaced, OB throws some Cytotec and Pitocin in there and hopes for the best, \"emergency section\" happens 3 days later. I'm not being judgmental when I state this hypothetical scenerio - this is why the Bishops score was initiated. Other OB/Gyn's look down on this type of behavior. I'm not some hippy nurse railing against doctors.\n\n", "controversiality": 0, "created_utc": 1415806898, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0f6kd", "link_id": "t3_2lytcj", "parent_id": "t1_cm015vt", "retrieved_on": 1426062364, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "I totally agree that shit can go down. Birth is something \"natural\" that happens every day, but it can also get messy. I had a gnarly hemorrhage with my 2nd and I'm glad that I was in a hospital. I had a nurse midwife, but there was also a full medical team there to keep me from bleeding out and dying. Before I had my boys I thought about home birth, but then I got into L/D and decided it wasn't a good option for me. I think that it's a beautiful thing when well done, but I'm too paranoid. As a nurse I've seen too much shit go down and I don't want to die in my house. That's why home births need to be well vetted. Are you pre-eclamptic? No home birth for you. Did your water break 3 days ago? Go to the damn hospital!", "controversiality": 0, "created_utc": 1415807400, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0ffyh", "link_id": "t3_2lytcj", "parent_id": "t1_cm049di", "retrieved_on": 1426062227, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Emeryn", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a c-section with my son. I was told something similar by a woman who gave vaginal birth- \"Oh, you're so lucky to have not had to try to push.\"\n\nI snapped at her that I was in back labor for thirty fucking hours, dilated to a full 10 cm, and then instead of getting to push, I had an emergency c-section because my son's heart rate dropped and wouldn't go back up. And then after the c-section, my heart rate dropped a lot. How the flying fuck was that lucky?!", "controversiality": 0, "created_utc": 1415820279, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm0mnqr", "link_id": "t3_2lytcj", "parent_id": "t1_clzyzez", "retrieved_on": 1426058790, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "I think if you have a c-section you will most likely always have a one.", "controversiality": 0, "created_utc": 1415845755, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm104l0", "link_id": "t3_2lytcj", "parent_id": "t1_cm0aezn", "retrieved_on": 1426052315, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fireash", "author_flair_css_class": null, "author_flair_text": null, "body": "Most of the time, but there are a few women who do vbac. (Vaginal birth after cesarean). It helps if the doctors cut the muscles a certain way. It reduces the risks of rupture.", "controversiality": 0, "created_utc": 1415877336, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm19t7w", "link_id": "t3_2lytcj", "parent_id": "t1_cm104l0", "retrieved_on": 1426047734, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "loki93009", "author_flair_css_class": "purple", "author_flair_text": "3.5 years old", "body": "interesting.", "controversiality": 0, "created_utc": 1415916764, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm1rpl5", "link_id": "t3_2lytcj", "parent_id": "t1_cm19t7w", "retrieved_on": 1426039003, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ferngullyfreak", "author_flair_css_class": null, "author_flair_text": null, "body": "You see, that is part and parcel of giving natural birth.  \nYou're nether region's are being stretched to further than they should be,  \n    \nA button sized hole has to stretch to the size of a cookie tin, And no one plan's complication's, but they do happen .  \n  \nIt will hurt.  ", "controversiality": 0, "created_utc": 1415965483, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2942p", "link_id": "t3_2lytcj", "parent_id": "t1_clztko4", "retrieved_on": 1426030742, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "Fine, all those things are very probable. That's not what I'm talking about, and your dismissive attitude is exactly what I'm referring to. I was violated. I had procedures done to my body without my consent or even knowledge. That's illegal where I'm from. All my injuries and mental distress were entirely preventable because very few of my interventions were medically necessary. All the nurses and doctors who saw me after were part of the same medical team at that hospital, so of course they dismissed everything that happened to me and how terrible I felt after. I didn't know enough to go elsewhere. I ended up with diagnosed PTSD and a fourth degree tear from this, so one can tell me that it's just what happens, or \"part of the parcel\" and imply I shouldn't feel the way I do. That attitude is exactly what we need to get rid of. We need to support mothers, especially after such a life changing event. ", "controversiality": 0, "created_utc": 1415970122, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2a5q5", "link_id": "t3_2lytcj", "parent_id": "t1_cm2942p", "retrieved_on": 1426030254, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ferngullyfreak", "author_flair_css_class": null, "author_flair_text": null, "body": "You ended up with a tear because the baby was big.   \nDid you take time to speak with the doctor as to why he chose to do some of the medical intervention's and proceedures he did?  \nIn some cases it is life saving.  \nThat is why they encourage going to the hospital to diliver, over home birth's.  \nBecause if you get sick, the chemical's and equiptment you need are a mere feet away, and timing can be literally life or death.  \n  \nI have friend's who tore as well. There was one of them from Jamaica I knew, and she ended up getting what is called Stiches.  \n  \nBut, here's the thing about giving birth. Some times you have to abandon the plan, if you want to see you'r babies first birthday.  \n  \n**Every single vaginal birth is new uncharted water.** And sometimes thing's dont go as the doctor him self planned.  \nI'm sorry about your illness.  \n  \nThank's for writing back respectfully. It mean's a lot to me and it means you're a cut above the other redditor's.  \nHere's a tip in the end that my mother tell's me. If your tearstill hurt's try soaking in a pool/ bath tub ect.  \nIt help's the pain. ", "controversiality": 0, "created_utc": 1415984378, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2g96q", "link_id": "t3_2lytcj", "parent_id": "t1_cm2a5q5", "retrieved_on": 1426027340, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the tip. I didn't discuss it with my OB because I can't trust her, but my family doctor requested my charts and discussed it with me. She found no emergency that warranted the extent of the interventions performed. \n\nRegardless, my OB had no right to perform any procedure on my body without my knowledge or consent unless I am unable to consent, which I very much was. \n\nI had no expectations that my birth plan be honoured if there was an emergency. There was no emergency. Even if there were signs that an emergency might be imminent, she was legally obligated to discuss options with me, even if it was to say \"we have to vacuum your baby out\" so that I knew it was happening. I knew before hand that every birth presents a chance for severe tearing and bodily harm. I wasn't unprepared. \n\nThe doctor was in the wrong here. I shouldn't be told that \"that's life\" and that it meant nothing. Shit happens, yes, but it shouldn't have happened in the way it did. \n\n\nI'm not sure what you're arguing.. Are you trying to help me feel better about it, or convince me that my feelings are unwarranted? I'm entitled to feel however I want about my birth experience.. I don't know what you're trying to accomplish by implying I shouldn't feel the way I do.. They are very valid feelings about a real situation I was in. ", "controversiality": 0, "created_utc": 1415985790, "distinguished": null, "downs": 0, "edited": 1415986036, "gilded": 0, "id": "cm2h1nj", "link_id": "t3_2lytcj", "parent_id": "t1_cm2g96q", "retrieved_on": 1426026971, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ferngullyfreak", "author_flair_css_class": null, "author_flair_text": null, "body": "Are you sure they didn't indicate to you at all what they were doing, but you didn't get it because you were distracted by the pains?  \nThat really doesn't sound like most doctors I know  \n  \nI'm letting you know that no birth goes 100% according to plan.  \nYes it is sad, but you are not alone.  \nAnd you know what? while i'm waiting to post this to you, lemmie brighten your day, Look at this pretty boy who didn't get a perm.  \n  \nPal you might get hooked on his vlog chanel. But it's a good thing (:  \nLike 90's musical's?  \n(https://www.youtube.com/watch?v=bU7xUkWVVMs ", "controversiality": 0, "created_utc": 1415987302, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2hw6e", "link_id": "t3_2lytcj", "parent_id": "t1_cm2h1nj", "retrieved_on": 1426026576, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an epidural, so no pain. It's not like most doctors, but it happened. My husband confirmed that he didn't hear anything either and only figured something was up when he saw the equipment AFTER it had been done. I've gone over it many times and tried to imagine every scenario to see if it's possible that I'm remembering wrong, but all the facts add up to the way I remember. I know I'm not alone, which sucks even more. I guess that's why I'm making such a big deal here. Women shouldn't be told not feel a certain way, or to get over it because that's life. It sucks and women in this situation will likely need support instead of criticism. It's not hard to say \"I'm so sorry\" and keep opinions to ourselves. \n\nI'll check out that vlog, I love musicals. Lol. I'm sorry if I'm sounding like an ass, it's just a topic that's clearly very close to my heart. ", "controversiality": 0, "created_utc": 1415989845, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2jb30", "link_id": "t3_2lytcj", "parent_id": "t1_cm2hw6e", "retrieved_on": 1426025916, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ferngullyfreak", "author_flair_css_class": null, "author_flair_text": null, "body": "It's okay.  I guess you're right. I fall into the catigory of trying to make you feel better.  \nYou gonna love that Vlogger hunty. Wait till I link you him in an African pow wow basically (:  \nAlso about epidural's. Back in maybe 2002, I told my daughter, some pain is so bad, pain killers do nothing to touch it.  \n  \n(:     \n", "controversiality": 0, "created_utc": 1415990187, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2ji5w", "link_id": "t3_2lytcj", "parent_id": "t1_cm2jb30", "retrieved_on": 1426025754, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for trying. I'm at a point where I'm not really upset by it anymore. I've come to peace with the fact that it happened and I'm mostly healed. I still feel strongly about it, but it doesn't make me feel as emotional. Does that make sense? I'm pregnant and planning my second delivery, and everyone is telling me my choices aren't smart, or saying I should get over my first delivery and it's a ridiculous thing to tell a woman.", "controversiality": 0, "created_utc": 1415992256, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2ko4x", "link_id": "t3_2lytcj", "parent_id": "t1_cm2ji5w", "retrieved_on": 1426025210, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ferngullyfreak", "author_flair_css_class": null, "author_flair_text": null, "body": "Okay. be careful.  \nYou answer fast for a Pregnant woman (:  ", "controversiality": 0, "created_utc": 1415992968, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2l1rm", "link_id": "t3_2lytcj", "parent_id": "t1_cm2ko4x", "retrieved_on": 1426025033, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "For the most part I agreed with the article. I get irritated though with the whole blaming men thing. \n\nI believe women should have options for how they birth. That unless emergencies strike the birth plan should be followed. I choose home birth for myself and my babies. It is how I feel the safest. It also makes it easier for me to go without pain meds.\n\nI believe that in this modern day women should also be allowed to have elective c-sections. A friend of mine did after traumatic vaginal birth. (Severe shoulder distocia, huge episiotomy, vaccume extraction and weeks in the nicu) It was the right choice for her.\n\nMy friend's sister had a V-bac recently. She'd had an emergency c-section after her cervix swelled and she couldn't push her baby out. She was very glad to have her vaginal birth and not have to recover from major surgery.\n\nA friend of mine has had 5 home births. She has huge babies. She felt that she'd get pressured for c-sections at a hospital because she has big babies. But she also has had no trouble getting them out. She also tries to live a more natural and clean life. For her that also means avoiding pain meds.\n\nAnother friend of mine has had vaginal births in the hospital with epidural. She is very thankful for the pain meds. She also tends to have complications (high blood pressure and pre eclampsia) so she's very glad to have the support of doctors.\n\nMost women will do what they think is best for themselves and their babies. If I am low risk in future pregnancies I will do home births. If I end up high risk I will birth where I need to ensure our safety. (That'd probably be in a hospital and with an induction because I have fast labors.)", "controversiality": 0, "created_utc": 1416000243, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2p176", "link_id": "t3_2lytcj", "parent_id": "t3_2lytcj", "retrieved_on": 1426023174, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "jessimacar", "author_flair_css_class": null, "author_flair_text": null, "body": "Lol thanks? I'm on my phone, so I always have it with me. And I love your username, btw. I must've watched that movie a hundred times growing up.", "controversiality": 0, "created_utc": 1416004574, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2r8y8", "link_id": "t3_2lytcj", "parent_id": "t1_cm2l1rm", "retrieved_on": 1426022091, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ferngullyfreak", "author_flair_css_class": null, "author_flair_text": null, "body": "My baby daughter is named Crystal. (:  ", "controversiality": 0, "created_utc": 1416018840, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm2xjgs", "link_id": "t3_2lytcj", "parent_id": "t1_cm2r8y8", "retrieved_on": 1426018862, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "NinjaGinny", "author_flair_css_class": null, "author_flair_text": null, "body": "I was 42 weeks at the time. I was 1cm dilated but I don't remember how effaced. There weren't really any other options. They were already predicting a big baby and didn't want to let me go longer. I also think it would have gone better had she not flipped sunny side up sometime after we started the induction.", "controversiality": 0, "created_utc": 1416026133, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cm30ett", "link_id": "t3_2lytcj", "parent_id": "t1_cm0f6kd", "retrieved_on": 1426017517, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}