{"submission": {"author": "Kiwihousewife", "author_created_utc": 1420327174, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_khn4b", "created_utc": 1420641490, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/2rmq3a/taking_two_babies_on_a_plane_by_myself_help/", "gilded": 0, "id": "2rmq3a", "is_self": true, "media_embed": {}, "num_comments": 89, "over_18": false, "permalink": "/r/Mommit/comments/2rmq3a/taking_two_babies_on_a_plane_by_myself_help/", "retrieved_on": 1440980174, "score": 34, "secure_media_embed": {}, "selftext": "In one month I am taking my girls (5 months and 18 months old) on a 12 hour flight (just saying that gives me anxiety). I have booked a flight that leaves at 7pm. I figure this will give me time to get the toddler settled in and fed then *hopefully* she falls asleep for a bulk of the time.\n\nAny tips for making it through this with my sanity in check?", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Taking two babies on a plane by myself. Help! Suggestions of how to get through this without going insane please?", "url": "http://www.reddit.com/r/Mommit/comments/2rmq3a/taking_two_babies_on_a_plane_by_myself_help/"}, "comments": [{"archived": false, "author": "Beamme_up", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Hannah (2007) and Calvin (2013)", "body": "Get them their own seats for sure, it's safer and saner (is that the correct word?)\nWhen I took my 18 month old on a flight, I brought a bunch of small dollar store toys (age appropriate) that she hadn't seen before. I would give her one at a time, when she was bored with one I would swap them out. \nI also brought lots of snacks, and her favorite blanket. Her having her OWN seat with her car seat in it was the best decision I made though. \nHave a good trip!!", "controversiality": 0, "created_utc": 1420643388, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhaa3z", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425011006, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "A_Yeti", "author_flair_css_class": null, "author_flair_text": null, "body": "I admire your bravery! I can barely take my 20mnth old to Target without going insane. ", "controversiality": 0, "created_utc": 1420645189, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhb6oz", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425010583, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "OK my suggestion would be to put the 5 month old in a carrier, the toddler in a stroller, and a book bag on your back. The stroller should be an umbrella stroller. You will gate check that. Your book bag is your diaper bag. In that you have plenty of diapers/wipes, formula if you formula feed, snacks for your toddler, an empty sippy cup for your toddler (you will buy juice/milk after you get through security), a few small toys, and an extra outfit for everyone, including yourself. \n\nThe airline will offer you to be the first to board the plane. No. You want to be the last to board the plane. You don't want to make your 18 month old sit on the plane for 1 second longer than necessary. Let her play and run around in a corner while you wait to board. Then, after at the last boarding call, get on the plane. Put the toddler in her seat, and have on hand a tablet with a movie, a baggie of her favorite snacks, a cup of her favorite drink, and her favorite lovie and blanket. If all goes well she will fall asleep.\n\nYour five month old is far easier. All you need to do is keep her in her carrier (I'm making the assumption you purchased two seats for this flight and the baby will be sitting with you) and feed her at take off and landing (plus whenever she gets hungry in between. If she gets to sleep on you I presume she will be a happy camper. \n\nIdeally your toddler will sleep for a large portion of the flight, but let's be honest, she won't sleep for the whole thing and she won't want to sit still for even 1 hour of awake time. So don't be afraid to take a walk up and down the aisle every once in a while to let her boredom out. \n\nDon't be afraid to buy a few drinks during the flight for yourself as well :-) \n\nGood luck! ", "controversiality": 0, "created_utc": 1420645357, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhb9u2", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425010542, "score": 36, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "albeaner", "author_flair_css_class": null, "author_flair_text": null, "body": "Stash some M&amp;Ms or a lollipop for the landing. The last time I flew with kids was when my oldest was 18mo; we spent the entire time sitting on the ground by the bathrooms (the flight attendants were very nice). The descent was the hardest part because he was irritable and uncomfortable, so having the candy was a special treat.\n\nBring at least a couple thin blankets - one to line the carseat in case the 5mo has a poop explosion or vomits, another for the 18mo should she want to sleep across the seats. Also, bring a change of clothes for you (I'd wear a dress or tunic with leggings so you can easily change your top if it gets barfed on.)\n\nHonestly I'd also ask your pediatrician if there is a sedative you could give the 18mo if needed. My 4yo has sometimes severe eczema and the allergist gave me a sedating antihistamine I can give at night if he stays awake scratching. (I know I'll get flamed for this, but my point is, it might be an option.) Of course you know your kids best, and maybe they don't freak out like mine do when tired/uncomfortable :) \n\nDo you have a small tablet or smart phone? You can load interactive kids books - so when the toddler touches things, they move/explode/etc. Heck you could probably work on her fruit ninja skills, or Toddler Lock...alternately, you can take videos of her, then play them back, or just put the camera on so it's like a mirror. Toddlers LOVE themselves. I also read a tip somewhere to bring a roll of blue painting tape, it's very sensory and fun for toddlers, plus the toddler can roll it/chase it in the airport.", "controversiality": 0, "created_utc": 1420646101, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhboa8", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425010354, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kmfoh", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd definitely check with the doctor about dosage for Dramamine, specifically because the side effects are drowsiness. Overall, I think it would be healthier to give my kid the proper amount of something that will help them sleep rather than have them up all night on a plane. \n\nSo I guess we'll suffer the down votes together. I vote having a backup plan that includes drugs. ", "controversiality": 0, "created_utc": 1420646640, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhbyxd", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhboa8", "retrieved_on": 1425010217, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "schadenfreude13", "author_flair_css_class": null, "author_flair_text": null, "body": "Make sure you book a bassinet seat for the infant! It's a huge help having somewhere to put her during the flight. Call now. They book up quickly. Then she should be fine - the airplane noise will help her sleep. Mine just hit a cycle of sleep, nurse, play with a toy, sleep, nurse, play with a toy. Also, I preferred changing her diapers while in the bassinet vs. wrangling with the tiny airplane bathroom.\n\nThe toddler will need a lot of entertainment. Get her used to headphones now, so she can watch movies/cartoons/iPad during the flight. Get a bunch of never before seen toys - sheets of stickers, a new coloring book, new large triangle shaped crayons (the tiny ones will roll around and disappear), and new iPad games. Almost anything by SagoSago is great for that age, especially Forest Flyer, Ocean Swimmer, Space Explorer. Endless Alphabet is also a favorite. Tons of snacks that are usually forbidden like mini wrapped chocolates and cookies. Healthier snacks like boxes of raisins, fruit bars, crackers, etc. And their favorite water bottle.\n\nAlso, try to board super early and talk to a stewardess about needing an extra pair of hands during the flight like when you have to go to the bathroom, or change one diaper while someone watches the other kid. Also maybe clearing your food tray asap or just giving you the individual dishes so you're not trapped or deal with balancing a baby on your lap while not knocking anything over.\n\nPack a small medical kit for sanity - thermometer, tylenol, saline nasal spray, booger sucker, diaper rash cream. Pack two extra onesies and two extra sets of clothes. I always bring 1 diaper for every 2 hours but have never come close to needing that many. It's also the only time I use sanitizing hand gel like a madwoman.\n\nOh, and when you pack, use a small rolling case for the emergency/long term stuff like extra clothes, extra diapers, big stash of snacks, and emergency kits. Then a large purse to keep at your feet for things to have at hand - a couple diapers, sanitizer, small snack. If you put everything up top, it'll be a huge pain getting it up and down and finding somewhere to open it and dig for stuff. Have the toddler carry her own little backpack with her lovey, some stickers and pens, and snacks. Even if she doesn't carry it, it will help compartmentalize the stuff so you aren't hunting in the dark.\n\nSource: two kids and regularly take 16 hour flights.", "controversiality": 0, "created_utc": 1420646874, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhc3hp", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425010157, "score": 11, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AmyinIndiana", "author_flair_css_class": null, "author_flair_text": null, "body": "There is nowhere on this earth that I want to go that badly.  Good luck.", "controversiality": 0, "created_utc": 1420647794, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhcm73", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425009915, "score": 18, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Gandalverine", "author_flair_css_class": null, "author_flair_text": null, "body": "This was amazing advice. I don't have two kids yet and I'm not sure about traveling but I am saving this info fir if I ever do.  ", "controversiality": 0, "created_utc": 1420648310, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhcwzf", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhc3hp", "retrieved_on": 1425009775, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "acisnot", "author_flair_css_class": "blue", "author_flair_text": "hola.", "body": "If you're worried about motion sickness, sit near the middle of the plane.  It will experience the least amount of movement.", "controversiality": 0, "created_utc": 1420648559, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd28d", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425009708, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "acisnot", "author_flair_css_class": "blue", "author_flair_text": "hola.", "body": "Also, pack your carry on as though you are stranded for 24 hours.  10 diapers for each kid, wipes, a change of clothes for everyone and large ziplock bags.  Airports do not carry diapers.", "controversiality": 0, "created_utc": 1420648640, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd3xo", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425009686, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah it took a lot of convincing from my mother. My brother is getting married and she really wants me to be there. ", "controversiality": 0, "created_utc": 1420648777, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd6vz", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhcm73", "retrieved_on": 1425009648, "score": 10, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Meilikah", "author_flair_css_class": "purple", "author_flair_text": "16.5 mo old", "body": "If anyone feels like helping me too! I will be traveling with a 2 mon old and a 2 yr 1mon old in May. I am worried about making it to the gate with 2 car seats, stroller, baby in carrier, suitcase, backpack diaper bag, then wrangling kiddos on actual plane. So question is rent carseats from a random rental car agency or bring own and do what? I heard gate checking is best or how do you keep them from being damaged? I can't afford new ones if they break! \n\nEdit: Is keeping 2 yr old in a car seat on the plane actually better than letting him sit in a seat and color on the tray table or something. ", "controversiality": 0, "created_utc": 1420648799, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd7d5", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425009640, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "Second this as a frequent traveller with my 3 yo and 1yo (2-3 times a year). I often fly alone with them and it would suck without their seats to keep them in. It's somewhere familiar to them and keeps them from trying to escape into the cabin. Not to mention it's safer and keeps my arms and lap free :)", "controversiality": 0, "created_utc": 1420648804, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd7h2", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhaa3z", "retrieved_on": 1425009640, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Very good tip thank you! We cloth diaper but will be taking a bunch of disposables for travel (definitely not dealing with cloth diapers on a plane, lol)", "controversiality": 0, "created_utc": 1420648823, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd7v8", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd3xo", "retrieved_on": 1425009634, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "swimminginvinegar", "author_flair_css_class": "orange", "author_flair_text": "4yo and 2yo boys", "body": "This is great advice.  Extra set of clothes for all 3 of you.  And I took my 5 month old on a flight and he ended up angry and teething so bring something just in case it starts.\n\nAsking for help ahead of time so you can pee is crucial.\n\nDollar store toys are great.  Electronics are your friend.  Get the kid hooked on an ipad and you are good for awhile.  Sadly 18 months is too young for movies usually but games are good.  TocaBoca also has good games.  And DisneyJr app.\n\nGood luck!  I try to think about flying solo as bad but finite.  At least you know that the flight ends at a certain time.  ", "controversiality": 0, "created_utc": 1420648855, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhd8la", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhc3hp", "retrieved_on": 1425009625, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Good luck!!", "controversiality": 0, "created_utc": 1420648951, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdanx", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd7d5", "retrieved_on": 1425009599, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for your reply, nice and detailed!!\nFantastic point about the headphones, I didn't even think of that, I'm going to order some toddler headphones on amazon right now and get her used to them :) \n\nAnd I called the airline about bassinet seats. I chose a bassinet seat on the seat select but they told me that it's not guaranteed and the younger the baby is the higher priority it has. So I figure at least my baby baby will get one. \n\nMy toddler actually got a cute little backpack for xmas so I'll be sure to pack that with some fun things for her to play with :) \n\nI'm starting to think this is doable :P Thank you", "controversiality": 0, "created_utc": 1420649173, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdfgv", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhc3hp", "retrieved_on": 1425009536, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Fantastic idea to bring lollipops. It'll help her ears on the descent too I bet.\n\nAlso your outfit suggestion for me is exactly what I'm planning :) I found a great tunic type shirt that will make breastfeeding super easy to access (I hope I'm sitting by someone who isn't squicked out by all that, but I'll be as discrete as I can).\n\nHahah they definitely do love looking at themselves. Very good idea to put the tablet on mirror mode. She would love that!!\n\nThank you for your suggestions! I'm writing a list of all these tips ", "controversiality": 0, "created_utc": 1420649360, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdjii", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhboa8", "retrieved_on": 1425009484, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Love the last tip especially ;) But I can't because I'm still breastfeeding :( \n\nThank you so much for your tips! ", "controversiality": 0, "created_utc": 1420649498, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdmfy", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhb9u2", "retrieved_on": 1425009446, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah just getting them passport photos was a struggle. Lol", "controversiality": 0, "created_utc": 1420649541, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdnd0", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhb6oz", "retrieved_on": 1425009434, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Meilikah", "author_flair_css_class": "purple", "author_flair_text": "16.5 mo old", "body": "Thanks. I am sure you have in worse though. I second the advice about the dollar store toys. They helped us so much last time with then 19 mon old. We got some crayons, a pad of paper, some cars, a tic tac toe game (he like spinning the options- not actually playing it), we also had a mini magna doodle in case crayons got lost he could still color, lots of snacks, ", "controversiality": 0, "created_utc": 1420649556, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdnoc", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdanx", "retrieved_on": 1425009430, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "The 18 month old will have her own seat, and hopefully the baby will have a bassinet seat (if all goes to plan). Should I bring the 18 month olds car seat? I wasn't planning on it as I didn't want to have to lug it through security and all that. I'm hoping she will be able to fall asleep fine just in the airplane seat.", "controversiality": 0, "created_utc": 1420649644, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdpnc", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhaa3z", "retrieved_on": 1425009404, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "I will look at the dollar store for things that she won't just throw around (she's in the throwing stage right now)", "controversiality": 0, "created_utc": 1420649799, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhdszf", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdnoc", "retrieved_on": 1425009361, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cal9687", "author_flair_css_class": null, "author_flair_text": null, "body": "Not sure about the states but in Canada you can bring liquids through security as long as they are for a child under 2 so you can have stuff in the dippy cup already.", "controversiality": 0, "created_utc": 1420650475, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhe7cg", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhb9u2", "retrieved_on": 1425009175, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AmyinIndiana", "author_flair_css_class": null, "author_flair_text": null, "body": "Too bad she can't fly with you and help!", "controversiality": 0, "created_utc": 1420650588, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhe9ub", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd6vz", "retrieved_on": 1425009143, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "You can drink and breastfeed! Just don't get drunk! Rule of thumb is that if you could drive, you can feed. No need to pump and dump or anything like that. So long as you feel sober you are fine to feed :-)\n\nRegardless, breastfeeding will be very useful during your flight! You won't need to carry bottles or formula on the plane, and you can feed easily during takeoff and landing.", "controversiality": 0, "created_utc": 1420650720, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhecsn", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdmfy", "retrieved_on": 1425009104, "score": 46, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "That may very well be the case, but if it is something I can easily get after security, like milk, water, or juice, I'd just buy it after so as not to deal with the TSA. They tend to be a hassle and not know all of their own rules, so I just wouldn't bother with trying to bring liquids unless it was breastmilk or formula or some other special liquid. Just less stressful in my opinion. ", "controversiality": 0, "created_utc": 1420650903, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhegub", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhe7cg", "retrieved_on": 1425009052, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Meilikah", "author_flair_css_class": "purple", "author_flair_text": "16.5 mo old", "body": "OOh also mine loved to hold books too. so we had a couple different books with us. I think a touch and feel one, one with animals or whatever they are interested in.", "controversiality": 0, "created_utc": 1420651204, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhend9", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdszf", "retrieved_on": 1425008967, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Black_limo", "author_flair_css_class": null, "author_flair_text": null, "body": "I recently went on an 8-hour plane ride with my 15 month old. I was so stressed about it and he was amazing!  We had a night flight on the way there and he slept almost the whole time. My main concern was my day time flight on the way home. I had an abundance of snacks including a few new things he had never tried (with ingredients I knew he wasn't allergic to!). I bought a few new toys and books that he had never seen before. I also brought my iPad which he is never allowed to use, as a last resort. It was a god send!  I downloaded a few movies and it held his attention for a long while. Again, it's not something he's ever allowed to do so that was a big treat (and a lifesaver!).  As far as getting around the airport, my Ergo carrier was so handy. I had our passports in the front pocket so they were easy to get to!  Good luck with your travelling!  I'm sure it will go much better than your imagining it to!", "controversiality": 0, "created_utc": 1420651445, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhesld", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425008900, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "SugarandSass", "author_flair_css_class": null, "author_flair_text": null, "body": "The airports I visited a few months ago did have diapers, but it was only in little individual travel packs with like 2 diapers and a small pack of wipes. And expensive, obviously. ", "controversiality": 0, "created_utc": 1420651600, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhevz2", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd3xo", "retrieved_on": 1425008856, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "SugarandSass", "author_flair_css_class": null, "author_flair_text": null, "body": "Speaking of diapers on a plane, none of the planes we've been on with my daughter had changing tables in the bathrooms. Sucked.", "controversiality": 0, "created_utc": 1420651673, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhexla", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd7v8", "retrieved_on": 1425008835, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "tddawg", "author_flair_css_class": null, "author_flair_text": null, "body": "I flew a lot with my daughter when she was itty. Breastfeeding on take off and landing helped with the pressure changes.\n\nI second running the toddler ragged before boarding. After take off, hopefully the white noise will knock her out.\n\nAlso, tons of good vibes coming your way! You can do this!", "controversiality": 0, "created_utc": 1420653835, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhg9bq", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdmfy", "retrieved_on": 1425008165, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Ophelia42", "author_flair_css_class": "lightcoral", "author_flair_text": "11 Month Old + 5 Year Old Twins", "body": "You won't need it at the other end?\n\nthe carseat is good because they are (hopefully) used to staying put in the car - especially with shoulder harnesses - just a lap belt allows a toddler to wiggle around a lot.\n\n", "controversiality": 0, "created_utc": 1420654241, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhgibe", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1425008049, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Ophelia42", "author_flair_css_class": "lightcoral", "author_flair_text": "11 Month Old + 5 Year Old Twins", "body": "Honestly, I'd just risk checking the carseats at the check in counter rather than try to lug all that through security and on to the plane (I probably wouldn't use rental carseats).  I've never had mine broken, but that's pretty useless anecdata... it only takes one broken carseat...\n\nAs I said above, I prefer toddlers in carseats, if possible - the carseat is good because they are (hopefully) used to staying put in the car - especially with shoulder harnesses - just a lap belt allows a toddler to wiggle around a lot.", "controversiality": 0, "created_utc": 1420654451, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhgmyz", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd7d5", "retrieved_on": 1425007988, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Meilikah", "author_flair_css_class": "purple", "author_flair_text": "16.5 mo old", "body": "I wasn't sure if convenience of checking seats immediately or having toddler strapped down on the plan in harness would be better. I can always check the infant seat and somehow bring the toddler seat (maybe borrow one of the roller things for carseats and ditch the stroller) ", "controversiality": 0, "created_utc": 1420654921, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhgxpy", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhgmyz", "retrieved_on": 1425007849, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "snuggleslut", "author_flair_css_class": null, "author_flair_text": null, "body": "If you can manage it, I would bring the car seat. It is, of course, safer, but also provides a more reliable way of keeping your 18 month old in her seat than the the lap seat belt that she'll probably be able to squirm out of. This is particularly important for you since you'll have your hands full with the infant.  ", "controversiality": 0, "created_utc": 1420654995, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhgzg5", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1425007827, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Ophelia42", "author_flair_css_class": "lightcoral", "author_flair_text": "11 Month Old + 5 Year Old Twins", "body": "I think that's exactly what I'd do - if you can't swing the roller thing for carseats (I've never had one that I could borrow), you can usually jerry rig something where you can use the top tether and/or latch straps on the carseat to tie IT to your roller suitcase and drag them both together!\n\nGood luck!", "controversiality": 0, "created_utc": 1420655983, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhhm0g", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhgxpy", "retrieved_on": 1425007490, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "plasticcastle", "author_flair_css_class": null, "author_flair_text": null, "body": "Just a thought: some (many) airlines will not permit one adult to travel alone with two lap-sized children, even if one child is in a seat. Would it be worth emailing to be sure? ", "controversiality": 0, "created_utc": 1420656371, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhhv26", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425007374, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "rabbetpennwarren", "author_flair_css_class": null, "author_flair_text": null, "body": "I think there is now an FAA approved harness for flights. It supposedly is quite light and rolls up. It is supposed to be as good/safe as a car seat, keeps kids in place, and weighs less than a pound. I came across this a while ago and don't have all the details since my kid is too young for it. So this comment could be entirely unhelpful. But it might be an option if you want to check the car seats but have the safety of it. I think it was about 60-70 dollars. ", "controversiality": 0, "created_utc": 1420658936, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhjj1g", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhgxpy", "retrieved_on": 1425006596, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Force_burgers", "author_flair_css_class": null, "author_flair_text": null, "body": "You can't fly with two lap babies so in the second seat bring on your car seat for the 18mth old. She will be much more comfortable in her car seat. My son slept I every flight with his seat and I'll never fly without it again. ", "controversiality": 0, "created_utc": 1420661003, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhkvrz", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425005963, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dudeism42", "author_flair_css_class": null, "author_flair_text": null, "body": "Dear god YES bring the car seat.  Not only because it's safer but you're really going to need to strap her down if she gets unruly, especially since you have a baby to tend to.  I would not count on her staying put on her own.", "controversiality": 0, "created_utc": 1420661003, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhkvs5", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1425005963, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "sockmonkey08", "author_flair_css_class": null, "author_flair_text": null, "body": "This! ^^^ Everything about this is truth! Good luck! ", "controversiality": 0, "created_utc": 1420661724, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhlcux", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhecsn", "retrieved_on": 1425005743, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "ej531", "author_flair_css_class": "blue", "author_flair_text": "Elliot born 9/29", "body": "If you are flying United, they no longer allow families with little children to board first. Other airlines still do, though.", "controversiality": 0, "created_utc": 1420662033, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhlk6q", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdmfy", "retrieved_on": 1425005648, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "FeatofClay", "author_flair_css_class": null, "author_flair_text": null, "body": "This is excellent advice and I will emphasize that the ideal snacks are the ones that are time-consuming to eat (like cheerios or little crackers).\n\nIf either of them uses a pacifier, clip it to their clothes.  Once stuff drops on the plane it is such a pain to find and pick up again.\n\nI've seen little \"forgive us our sins in advance\" baggies with earplugs that families have handed out to seatmates.  In your case maybe that's more stuff to carry, which is the last thing you need.  However, you might consider some candy for the flight attendants.  I hear they adore bribes &amp; small gestures like that!\n", "controversiality": 0, "created_utc": 1420665365, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhnpw8", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhc3hp", "retrieved_on": 1425004641, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Darbzor", "author_flair_css_class": "black", "author_flair_text": "DS 08/08", "body": "All of what was said above!! LOAD a tablet with movies and games. I'm sure she will sleep, but that tablet will be a lifesaver. We regulate screen time in our home, but the time we flew w.the kiddo all that went out the window :)\n\nYou can TOTALLY have a drink whiile nursing! Maybe try not to nurse and drink at the same time....I've got the stink eye from nosey nelly for doing that before :P", "controversiality": 0, "created_utc": 1420666198, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnho9bm", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdmfy", "retrieved_on": 1425004390, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "sevin711", "author_flair_css_class": null, "author_flair_text": null, "body": "I hand out little care packages to the other passengers. Earplugs and a treat. I get anxious when I disturb others, this makes me feel a little more calm. Also - I try to have no expectations of things going smoothly. I try to accept that it's going to be difficult. I think of it as an adventure. ", "controversiality": 0, "created_utc": 1420666970, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhor1v", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425004159, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey! Flight attendant and Mama here! If you know which airline you are travelling with maybe I can help you look up the rules for travel and help you troubleshoot.", "controversiality": 0, "created_utc": 1420669108, "distinguished": null, "downs": 0, "edited": 1420669336, "gilded": 0, "id": "cnhq36w", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425003486, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1420669251, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhq6fv", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdmfy", "retrieved_on": 1425003446, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kiln", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I just got TSA Pre-check.  You pay $85 for a background check and then you get to go to the TSA Pre-check line which is fast (no waiting) and you don't have to take off shoes or coats or take laptops out of your bag, etc... It lasts for 5 yrs, I believe.  You can fill out the info at the airport and get finger printed (at least a month before your needed flight - results are online as soon as a week after, though) or there are some standalone offices (what I did).  It is AWESOME. I just traveled solo with my 3 yr old and 8 mo old and security was a breeze because of it.  Worth every penny.  http://www.tsa.gov/tsa-precheck", "controversiality": 0, "created_utc": 1420670160, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhqq5o", "link_id": "t3_2rmq3a", "parent_id": "t3_2rmq3a", "retrieved_on": 1425003190, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fightms", "author_flair_css_class": null, "author_flair_text": null, "body": "As someone that regularly has boobs at the ready on flights, have no shame! :)", "controversiality": 0, "created_utc": 1420670429, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhqw33", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdjii", "retrieved_on": 1425003113, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Air new Zealand. I haven't traveled with them with kids yet, but every time I've been on my own they've been fantastic!", "controversiality": 0, "created_utc": 1420672976, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhsen2", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhq36w", "retrieved_on": 1425002302, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Very interesting. Thank you so much!!", "controversiality": 0, "created_utc": 1420673018, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhsfjd", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhqq5o", "retrieved_on": 1425002291, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "When I booked the tickets it did say that you can't travel with two lap sized children unless you book one a seat (which of course I would do, lol) but I think I will double check on that :) ", "controversiality": 0, "created_utc": 1420673190, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhsj7t", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhhv26", "retrieved_on": 1425002241, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "No my mum runs a daycare and has many car seats so I won't need it but definitely considering it to keep her in properly. Its just that her car seat is very big. I dread lugging it thru the airport", "controversiality": 0, "created_utc": 1420673269, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhskwr", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhgibe", "retrieved_on": 1425002221, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CleoMom", "author_flair_css_class": null, "author_flair_text": null, "body": "Not to mention the relaxing benefits of a drink to help stay calm!", "controversiality": 0, "created_utc": 1420673989, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhszzs", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhecsn", "retrieved_on": 1425002024, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "CleoMom", "author_flair_css_class": null, "author_flair_text": null, "body": "What about a [portable booster seat]( https://www.amazon.com/dp/B00CSAWIOQ/ref=cm_sw_r_awd_hzCRub0Y12TD0) instead?  Could strap it to the seat, and kiddo could be strapped down with a tray to play on.", "controversiality": 0, "created_utc": 1420674753, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhtfmx", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhskwr", "retrieved_on": 1425001821, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "You need to bring a carseat or CARES device, Kiwihousewife!  \n\n|If you are the only adult travelling with more than one infant you will need to reserve a seat for the additional infant and pay a child's fare... **The additional infant must be restrained in an approved infant car seat, which you must provide...An alternative to using a car seat inflight is the CARES child restraint system.** CARES has been approved for use on Air New Zealand flights by the New Zealand CAA\n\n[Direct link to Air New Zealand's 'Traveling with Infant(s)' Policies](http://www.airnewzealand.co.nz/infants-car-seats)\n\nHahahaahaha, WHAT!  a 5-month old, an 18-month old, a diaper bag AND **a carseat**?!  NOPE!  [I researched the CARES device for you.](http://kidsflysafe.com/buy-now/) \n\n* How much does your daughter weigh? If she's over 22lbs you can use the CARES device!\n* You won't have to carry a carseat!\n* It will fit in your carry-on! \n* You can keep you 18-month old still and safe for the critical phases of flight + turbulence (which is required by Air New Zealand and most international airlines)\n\nIt's $75.\n\n\n\n\n\n\n", "controversiality": 0, "created_utc": 1420676519, "distinguished": null, "downs": 0, "edited": 1420676767, "gilded": 0, "id": "cnhuf51", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhsen2", "retrieved_on": 1425001363, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Pro-tips for getting the best help from airline crew.\n\nCheck-in agents, gate agents and cabin crew seldom (if ever) see someone travelling alone with two infants.  (You can do it, supermom!)  the more you can communicate your situation in advance, the BETTER!\n\n1) [Give the airline a heads up in advance](https://airnz.custhelp.com/app/answers/detail/a_id/981/p/53)  by [calling Air New Zealand](http://www.airnewzealand.co.nz/phone-numbers).  Explain that you are travelling with two infants and ask that the make a note on the \"Passenger Manifest\". Mention if you are bringing a CARES device or carseat.  :)\n\n* They can give you any salient information before the flight.  You'll feel more relaxed knowing that you've touched base with Air New Zealand.\n\n* If they can make a note on the Passenger Manifest, the flight crew will already know that you are travelling with two infants!  This is important.  You want the flight attendants to be your helpful friends!  Catching them unawares with two infants might send them running to their flight attendant manuals to figure out the rules here (ensuring that you CAN in fact have both little ones under your care!) Also, it gives the crew a chance to talk about carseats or the CARES device before the flight (meaning they can better help you!)\n\n2) **Talk to the gate agents before boarding starts.**   You've gotten through security! You've found your gate and you are ready to board. Before boarding starts, swing by the desk and introduce yourself :)   The gate agents can give the flight crew the heads up that you have your two little ones.  The advance notice will have the crew ready to help!\n\n\n3) **Pre-board!  I know that the top post here recommends boarding last**  And, you know what, travelling with a child aged 3+, I agree with this. I do it ALL the time myself.  But, quite frankly, waiting until the last minute to board is going to stress out your flight attendants. For children under two we must give you a briefing.  (On time performance is SO important and Flight Attendants are not paid until the doors close.)   Showing up at the last minute and needing to set up a car seat/CARES device, settle in, receive a briefing is a LOT of time and it risks delaying the flight.  Even a 5minute delay causes the flight to lose it's place in queue for takeoff.   **Please do not board last! You have two infants and you NEED the time to settle in!  You'll feel so much more relaxed** and you'll have a chance to make friends with the Flight Attendants :D", "controversiality": 0, "created_utc": 1420677819, "distinguished": null, "downs": 0, "edited": 1420678303, "gilded": 0, "id": "cnhv5f8", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhsen2", "retrieved_on": 1425001020, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "asymptotex", "author_flair_css_class": null, "author_flair_text": null, "body": "Usually they have a fold down tray over the toilet seat for changing, but it's not always marked well. ", "controversiality": 0, "created_utc": 1420678606, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhvle9", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhexla", "retrieved_on": 1425000813, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Most importantly - you can do this!  Seriously.  You can!  You don't need any advice from me or anybody because when it comes down to it you'll probably put on your \"Mom\" hat, roll with the punches, have a great time at your destination and have an awesome story for later :D!\n\nIn case you want any more ideas, here are two links to my youtube channel where I vlogged about this topic:\n\n[3 Tips for Flying with a Toddler](https://www.youtube.com/watch?v=RMQ1VCj68-M&amp;list=UUHgrOO8egXNpt7qVhjN6Gcg) and [\"Carry-On Bag. Tips from a Flight Attendant for Flying with an Infant\"](https://www.youtube.com/watch?v=AX_hl6Gxyq0&amp;list=UUHgrOO8egXNpt7qVhjN6Gcg)", "controversiality": 0, "created_utc": 1420678620, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhvlov", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhsen2", "retrieved_on": 1425000810, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Top 4 things I tell fellow parents travelling with infants:\n\n1) **Don't worry about \"what people think\".**  Most people in the world have been/are parents! They get it.  They empathize.  They want you to be comfortable and are silently rooting for you!  People love to bitch about any travel inconveniences as if it's some huge ordeal but, seriously think about your own experience: I'm sure you've complained about a baby AFTER the flight but, during the flight felt SYMPATHY towards the parents. Right?\n\n2) **Babies LOVE flying!**  Seriously!  I've only ONCE knowing a child to cry all flight.  99% of infants/babies are smiling, contented and chill.  The soothing white noise of the engine and bumps of flight are like being in the womb! :) \n\n3) **Babies just hate take off and landing** because they have to be held in the burping position or otherwise restrained.  It sucks for them.  Also, their little ears hurt :(\n\n4) **The best way I know of for babies to clear their ears is for them to CRY.**    Us adults? We yawn, chew gum, sip a drink, laugh, blow our nose, shake our heads (ha) - we do all KINDS of things to alleviate the sinus pressure of altitude.    Infants can't - they can help themselves by crying.   Don't feel apologetic about it, let 'em cry! It'll clear their ears and then your girls can enjoy themselves :)", "controversiality": 0, "created_utc": 1420679033, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhvtzs", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhsen2", "retrieved_on": 1425000702, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "clevvvergirl", "author_flair_css_class": null, "author_flair_text": null, "body": "I know you can drink and breastfeed but can you imagine all of the evil glares you would get on a plane full of people who most likely think you need to pump and dump? Makes me giggle. ", "controversiality": 0, "created_utc": 1420679050, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhvubm", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhecsn", "retrieved_on": 1425000698, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "[A CARES device is $75](http://kidsflysafe.com/buy-now/)  Ask your Mom to buy it for you since she wants you to come out so badly (haha)!\n\n* You won't have to carry your carseat, TWO girls + carry-on.\n* It fits IN your carry-on\n* [You must bring a carseat or CARES device to fly Air New Zealand](http://www.airnewzealand.ca/infants-car-seats) so the CARES device will be a HELL of a lot easier for you!\n\nSource: I am a flight attendant and Mama :)", "controversiality": 0, "created_utc": 1420679319, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhvzq4", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1425000628, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "This is my favourite string of advice in the whole thread.   Albeaner should have a blog on \"real mom advice\".\n\nPeople can be as perfect a parents as they like day-to-day but, desperate times call for desperate measures and a little screen time and sweets to distract are going to go a LONG way to make your day easier.   Plus, a dose of Tyelnol will pre-emptively help with the ear pressure.", "controversiality": 0, "created_utc": 1420679538, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhw3zt", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhboa8", "retrieved_on": 1425000572, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": " I hope this insight will help! (I'm a flight attendant and Mama)\n\n1) **Re: gate checking.** When you gate check, your car seat will be hand carried from the bridge to the hold.   One individual person will make that short walk down the stairs and directly to the plane!  Your carseats won't have to go through all kinds of baggage-adventure in the airport :)\n\n2) **Carseat on board or gatechecked for your two year old?**\n\n|Is keeping 2 yr old in a car seat on the plane actually better than letting him sit in a seat and color on the tray table or something.**\n\nHere's an idea for you:\n\nYou could bring your carseat to keep him still for take-off/turbulence/landing but, let him out to play/colour/be happy on the plane on your laps!   I flew with my 20month old on my lap for 5hrs and no extra seat!  You know what, it worked surprisingly well! \n\n3) I spent an hour typing/editing/formatting advice for flying with a toddler in this thread. Check it out :)  Some of it might be helpful for you :) You can do it!\n", "controversiality": 0, "created_utc": 1420680010, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhwd3q", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhd7d5", "retrieved_on": 1425000454, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "SugarandSass", "author_flair_css_class": null, "author_flair_text": null, "body": "Not on these planes. We were on 4, in varying sizes, and flight attendants confirmed they didn't have them after our searches were fruitless. Super sucked. :(", "controversiality": 0, "created_utc": 1420680299, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhwita", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhvle9", "retrieved_on": 1425000381, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AnnieOnAMoosePuppett", "author_flair_css_class": "orange", "author_flair_text": "11yo girl 7yo boy 5yo boy", "body": "Your 18 month old should be allowed to have her own bag as well.  I'm not 100% sure on the airlines rules for carry-on bags, but I can't see them denying her a small backpack. Maybe fill up this bag with new cheap toys and a change of clothes for her. Save it all for the trip. Mine all liked to have their own bag for treasures.   I wish you luck on your trip!", "controversiality": 0, "created_utc": 1420680976, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhwvzf", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdmfy", "retrieved_on": 1425000211, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dinsette", "author_flair_css_class": null, "author_flair_text": null, "body": "I definitely recommend bringing the car seat. As someone else noted, your kiddo is used to sitting still in a car seat, so it will probably make for an easier flight. At least, that was my experience when I flew with my two small kids last year. To transport it across the airport, I attached it to a stroller with a bungee cord (strollers don't count as a carry-on item! Yay!), which was nice because then I also had a device for transporting all the other carry-on stuff.\n\n\nThe one upside to lugging two kids and all the paraphernalia through the airport is that security will take one look at you and send you on the fast track through the scanners.", "controversiality": 0, "created_utc": 1420683680, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhycjm", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1424999528, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "Rock it! ", "controversiality": 0, "created_utc": 1420683939, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhyho0", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhvubm", "retrieved_on": 1424999462, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "A_Stinky_Wicket", "author_flair_css_class": null, "author_flair_text": null, "body": "I just flew 6 hours with a 2 year old and 5 month old and we had planned on taking the toddlers car seat (as he had his own seat and we thought it would make him more comfortable).  We even squeezed the seat down the aisle and wrangled it into his airplane seat, sat down, and promptly gate checked his car seat.  I don't know who you're flying with but those seats are narrow and when my toddler got squirmy, it was helpful for him to have more room to wiggle in his seat.  This was super key for us.  \n\nGod you are super woman.  Good luck!", "controversiality": 0, "created_utc": 1420683997, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhyit6", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1424999447, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kelmit", "author_flair_css_class": null, "author_flair_text": null, "body": "I love your tone. I was half expecting to find directions to a bomb that someone must then defuse by following your instructions. ", "controversiality": 0, "created_utc": 1420685528, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhzcta", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhb9u2", "retrieved_on": 1424999058, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "clevvvergirl", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd just wink at everyone, lol.", "controversiality": 0, "created_utc": 1420686167, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhzp4l", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhyho0", "retrieved_on": 1424998886, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "I will give it a go. I checked the size of the seats and it says 17 inches (argh so narrow) her carseat is a tiny bit wider than that but it'd be great if I can squeeze it in.\n", "controversiality": 0, "created_utc": 1420686192, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhzpm5", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhyit6", "retrieved_on": 1424998880, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you think she will be able to sleep okay with the cares device?\n\nSince we have bassinet seating the arm chairs don't lift on those seats so she won't be able to lean on me to sleep, so I worry that she won't be able to sleep sitting up with only the harness. ", "controversiality": 0, "created_utc": 1420686309, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhzruy", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhvzq4", "retrieved_on": 1424998850, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Also I measured her car seat (couldn't figure out if it was airline approved or not) an it's about 3/4 inch wider than the seating chart shows the seat is. As an air hostess I thought you may know if its possible to still squish it in? :/ I don't want to buy a new car seat\n", "controversiality": 0, "created_utc": 1420686410, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhztvp", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhvzq4", "retrieved_on": 1424998824, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "Very very helpful!! thank you. I will definitely keep number 4 in mind", "controversiality": 0, "created_utc": 1420686449, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhzukv", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhvtzs", "retrieved_on": 1424998816, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "You are infinitely helpful!", "controversiality": 0, "created_utc": 1420686524, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnhzw1v", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhuf51", "retrieved_on": 1424998796, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "A_Stinky_Wicket", "author_flair_css_class": null, "author_flair_text": null, "body": "Ours also fit but it placed her feet in perfect kicking distance of the seat in front of hers and made my seat feel more cramped, that's why we opted to checkit.  For a long flight having a comfortable place for her to sleep is ideal but when she's up that space will be pretty unusable as she'll be wanting a new position or stir crazy with her seat.  I hope your family appreciates your effort to get to the wedding and offer you plenty of free child care when you arrive so you can decompress and then gear up for the return flight.  \n\nI wonder if a regular older child's booster seat would work on a long flight.  It wouldn't need to be appropriate for the road, since your mom has that covered.  I feel like they tend to be a little lighter and more bare bones.  It'd give your toddler a safe place to sleep but also might be small enough to be tucked into an overhead bin if you decide you don't need it during certain parts of the flight.  ", "controversiality": 0, "created_utc": 1420688635, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni10po", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhzpm5", "retrieved_on": 1424998269, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "shaynami", "author_flair_css_class": null, "author_flair_text": null, "body": "Actually,  drinking while nursing is the BEST way to do it because the alcohol has the most amount of time to get out of your system before the next nurse. Drink up,  mama. The other passengers don't care what you do as long as you are trying. If anyone says anything at all to you,  just say,  maybe you'd like to give me a hand,  then? And hand them a book to read to your toddler. It's like,  it's not reasonable to expect families to drive these long distances,  so you have to fly. So people have to deal with the realities of children. It's not a library. Hang in there,  mom. \n\nI suggest that every 4 hours you take ten minutes to yourself and just totally ignore your kids even if they are screaming their heads off,  and then jump back in the ring. ", "controversiality": 0, "created_utc": 1420688969, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni179a", "link_id": "t3_2rmq3a", "parent_id": "t1_cnho9bm", "retrieved_on": 1424998184, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "shaynami", "author_flair_css_class": null, "author_flair_text": null, "body": "You must not be from the USA,  where they do not have bassinet seats. It would be nice though. ", "controversiality": 0, "created_utc": 1420689051, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni18wi", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhc3hp", "retrieved_on": 1424998163, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "We will be in a row without seats in front of us (as they have a row of bassinets for the little babies) so won't need to worry too much about leg room or her kicking the people in front. But yes definitely will be a worry with her having wiggle room for her awake hours. So we'll see how it goes. I've been informed that the airline does not allow booster seats and I will definitely need her in a car seat (unfortunately might need to purchase a new one as ours is too wide by 3/4\" :( )", "controversiality": 0, "created_utc": 1420689169, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni1b6n", "link_id": "t3_2rmq3a", "parent_id": "t1_cni10po", "retrieved_on": 1424998133, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "1) The Air New Zealand website had a bunch of symbols on the \"car seat\" page.  Check it out and maybe also ask Air New Zealand?  Example things required for other countries:\n\n*Canada: manufactured after January 21st, 1981 and sticker with \"CMVSS:213\" or 213.1.\n\n* US: manufactured after the same date but 1ith FVMSS213.1 or, after February something,1981 with \"This carseat is safe for airplanes\" \n\nI'm going off memory but, basically the don't want the carseat to be 40years old and unsafe for air travel, lol.  I imagine there are some similar parameters in NZ?\n\n2) Re: seating chart.   As long as the armrests go up I can't see this being a serious problem :) There are lots of bigger people that 'make it work' just fine.    This sounds bad but, if I were you I'd only ask if the armrests go up and down and, if they do, then go ahead and bring the carseat :)  The carseat has to go at the window spot anyways so it won't obstruct the aisle :)", "controversiality": 0, "created_utc": 1420690371, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni1ykd", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhztvp", "retrieved_on": 1424997830, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Ohhh good point.   Hm.  Well for starters, now you may want to ask the airline about the carseat fitting if the armrests don't go up.  They may have an idea.   The carseat would obviously be better for sleeping.  Hm.\n\nMaybe check out a pic of the CARES device and see if you think your little girl could sleep in it? Sorry I'm not sure!", "controversiality": 0, "created_utc": 1420690492, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni20qa", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhzruy", "retrieved_on": 1424997802, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Kiwihousewife", "author_flair_css_class": null, "author_flair_text": null, "body": "The arm rests don't go up on the bassinet row. I think I might just buy another car seat. Better safe than sorry right? \n", "controversiality": 0, "created_utc": 1420691089, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni2bnj", "link_id": "t3_2rmq3a", "parent_id": "t1_cni1ykd", "retrieved_on": 1424997661, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, a 5minute phone call might help you out! There is a little space between the plane wall and the seats, depends on the aircraft.  Just call an ask.\n", "controversiality": 0, "created_utc": 1420691203, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni2dph", "link_id": "t3_2rmq3a", "parent_id": "t1_cni2bnj", "retrieved_on": 1424997634, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "p_iynx", "author_flair_css_class": null, "author_flair_text": null, "body": "If she has her own seat, she could actually have two bags (a \"personal\" bag like a backpack and a small suitcase). :)", "controversiality": 0, "created_utc": 1420693352, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni3fxf", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhwvzf", "retrieved_on": 1424997139, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "schadenfreude13", "author_flair_css_class": null, "author_flair_text": null, "body": "Actually I am and I know domestic flights/planes generally suck balls with amenities, but she mentioned a 12-hour flight which is obviously international and the majority of ex-US flights have bulkhead bassinets. They're not built in, but are clipped on after take-off. Such a relief! ", "controversiality": 0, "created_utc": 1420705138, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni7nfb", "link_id": "t3_2rmq3a", "parent_id": "t1_cni18wi", "retrieved_on": 1424995104, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "schadenfreude13", "author_flair_css_class": null, "author_flair_text": null, "body": "Call first! My airline also said to bring a car seat on board but when pressed, said it wasn't mandatory but advisable. I opted for no. My kid has no issues with her car seat but I wasn't about to start some by strapping her in it for 12 hours. She wouldn't be able to use the little table to color. She wouldn't have freedom to move around during seatbelt off times. Just standing at my feet seemed to be fun for her at times. Also, I wasn't about to lug it onboard and install it while alone. The CARES seems the best option if you're particularly worried about safety. \n\nThat said, I do check a car seat with luggage because renting one is like $9 a day. And car seats/strollers do not count towards luggage limits. ", "controversiality": 0, "created_utc": 1420705887, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cni7u4i", "link_id": "t3_2rmq3a", "parent_id": "t1_cni2bnj", "retrieved_on": 1424995018, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "albeaner", "author_flair_css_class": null, "author_flair_text": null, "body": "Aww thank you! :) ", "controversiality": 0, "created_utc": 1420730967, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnif0r1", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhw3zt", "retrieved_on": 1424991619, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Beamme_up", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Hannah (2007) and Calvin (2013)", "body": "I would, even if it's just a Cosco scerena (They are super light and you can grab a airplane bag for not that much).\nEven with just a little turbulence, a child that small becomes a projectile :(\nhttp://www.faa.gov/passengers/fly_children/\n\nYou can also get a cares vest for about $75, that way you don't have to carry around a seat. ", "controversiality": 0, "created_utc": 1420808714, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cnjf1vu", "link_id": "t3_2rmq3a", "parent_id": "t1_cnhdpnc", "retrieved_on": 1424973197, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}