{"submission": {"author": "11Petrichor", "author_created_utc": 1335482564, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_7kfh5", "created_utc": 1424377257, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/2wgu3e/hello_moms_can_i_pick_your_brains_little_ones_and/", "gilded": 0, "id": "2wgu3e", "is_self": true, "media_embed": {}, "num_comments": 62, "over_18": false, "permalink": "/r/Mommit/comments/2wgu3e/hello_moms_can_i_pick_your_brains_little_ones_and/", "retrieved_on": 1440897857, "score": 20, "secure_media_embed": {}, "selftext": "Not a mom, but I figured you guys might be a great resource for me with this problem. I'm having a wedding in 6 months, and at first I wanted to have an adult only event because I feel with my group of friends and flowing booze, my wedding would be about as far from an appropriate place for kids as you could get without nudity. But then once we made our guest list, we realized that 90% of our guests were traveling, and it was entirely unfair to ask them to leave the smaller kids at home. \n\nAs a compromise, we've rented out our local zoo for the night as our venue. This was for a few reasons, mostly because there is stuff to entertain the kids if they get bored, and also so there is enough room to easily whisk them away from any inappropriate behavior that may (and most likely will) occur. \n\nBut we have decided to have a cut off age for ceremony attendees. The ceremony and reception are both at the zoo, and the ceremony area is adjacent to the children's learning center. I'm going to be hiring a nanny or several (depending on need) for the 20-30 minutes of the ceremony and requesting that the younger kids be brought there.\n\nWhat is the best way to address this with the parents we know? I know I will never make everyone happy, but I am open to hearing any and all suggestions and would really appreciate your perspective on this. Thank you! ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Hello Moms! Can I pick your brains? (Little ones and weddings)", "url": "http://www.reddit.com/r/Mommit/comments/2wgu3e/hello_moms_can_i_pick_your_brains_little_ones_and/"}, "comments": [{"archived": false, "author": "Bnewhook", "author_flair_css_class": null, "author_flair_text": null, "body": "It's amazing you have thought to hire a nanny for the ceremony and I think parents will absolutely LOVE you for it :) \nIn general, with the weddings I've been to kids (3+) have SO much fun dancing and eating that it's usually more fun with them there! Teens will stick to themselves and stay on their phones/iPads/gameboys (do those still exist? Haha you know what I mean anyway) so they shouldn't be a problem. And babies, well if parents have to bring them they'll fall asleep there or the parents will have to leave early. So I wouldn't worry too much about the reception, plus you have picked a place where kids can go have their own fun! Great!! \nHave you sent the invitations yet? If not, include a note in the package stating that you would prefer no children at the ceremony and for that you have hired a nanny(s) for the duration so parents can leave their children with them to watch. But make sure you include they are welcome at the reception (as long as they are.. It is YOUR day so you could not have children, although it will make it harder for people to attend). If you have sent invitations, do you have a wedding website you can post it on? Or you may have to touch base with everyone individually which would be a bit of a pain. Sending a memo with the invitations would be easiest on you! \nI think this is perfectly reasonable. If parents are upset about the ceremony thing (which is completely unreasonable since you are providing a suitable sitter) then they can choose to skip it and just do the reception. Honestly I would be psyched about the sitter during the ceremony, worrying about kids making noise is a little stressful for me as a parent at a wedding! \nYou are a very thoughtful person, I hope your wedding day is everything you dreamed:) ", "controversiality": 0, "created_utc": 1424378523, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqpr3b", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424682069, "score": 17, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "becausefrog", "author_flair_css_class": null, "author_flair_text": null, "body": "This is wonderful. If they don't appreciate it, you don't want them there. There is nothing I dread more than my kids being expected to attend weddings. If they were all like this, I think I'd weep for joy.", "controversiality": 0, "created_utc": 1424379074, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqq51n", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424682249, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Someone had suggested that if I didn't include their kid at the ceremony they would just skip that part of the wedding. Personally, I'm pretty offended by that because the ceremony is the entire point of the night right? So now I'm all worried (plus you know all the horror stories about some entitled moms just bucking the rules and bringing teething kids anyway) that I'm either going to offend someone, or this whole thing is going to blow up in my face. \n\nAny suggestions on the wording of this? Also any idea for that cutoff age? I've randomly picked 6, but have no idea the difference between a 6 year old and an 8 year old behavior wise. lol ", "controversiality": 0, "created_utc": 1424379735, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqqldx", "link_id": "t3_2wgu3e", "parent_id": "t1_coqpr3b", "retrieved_on": 1424682461, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "You are the type of mom I want to be friends with. I'm pretty sure none of his cousins or my cousins kids care at all about the ceremony. My niece is SUPER PUMPED to be a flower girl, but that's because she has a job. I'm 29 and barely have the attention span for wedding ceremonies, I can't imagine these poor kids care at all. Haha", "controversiality": 0, "created_utc": 1424379841, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqqnt4", "link_id": "t3_2wgu3e", "parent_id": "t1_coqq51n", "retrieved_on": 1424682493, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "becausefrog", "author_flair_css_class": null, "author_flair_text": null, "body": "Weddings are a nightmare for kids! The last one we went to, before I vowed NEVER AGAIN, they handed out bubbles as we walked in - gave them to my kids before I knew what was going on - then told them not to use them until the end. My jaw dropped to the floor - you've got to be F*in kidding me! 6 and 2 and you think you can just hand them bubbles and tell them they can't use them?!? We had to leave, for which we were berated. Same thing at the reception, when they decided to do staged dancing photos right away before everyone got drunk and looked horrid, so they turn on the disco lights and the music, insist that everyone (especially the 2 year old!) go out and dance while they take pictures - for exactly 2 minutes. Lights back on, music off, please clear the floor so we can have dinner - yeah right! We left, screaming toddler in tow, and were chastised for not eating the dinner they had paid for. Did I mention we drove across three states to attend this wedding? Never, never, never again.", "controversiality": 0, "created_utc": 1424380555, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqr54n", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqnt4", "retrieved_on": 1424682717, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Naturespocket", "author_flair_css_class": null, "author_flair_text": null, "body": "I think your nanny idea for the ceremony is awesome! My (4 y old) daughter would have a hard time sitting quietly for the ceremony but would LOVE the reception with dancing (and the zoo!).  I would totally appreciate the 30 minutes of child-free time to enjoy the ceremony without having to constantly be on \"quiet the kid\" patrol. \n\nBe aware, no matter what you do there will be people who completely ignore your wishes. My cousin's wedding was requested child-free. I left my daughter with my husband at home and went with my mom as my \"date\". I offered for my husband to watch my (&amp;lt;1 y o) nephew but my sister was offended that he wasn't invited and brought him anyway (much to my horror). People do what they want but don't let it ruin/detract from your day!\n\nEdit: grammar!", "controversiality": 0, "created_utc": 1424380702, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqr8ns", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424682763, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my good lord. I'm gonna come clean here, I'm one of those nasty childfree folks. But christ, even I wouldn't be so unobservant about kids like that. You give the bubbles to the PARENTS. Adults can follow directions. Children, not always. And that picture scenario just seems like a nightmare kids or not. \n\nI'm so sorry someone put you through that!", "controversiality": 0, "created_utc": 1424380820, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrbdl", "link_id": "t3_2wgu3e", "parent_id": "t1_coqr54n", "retrieved_on": 1424682798, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "becausefrog", "author_flair_css_class": null, "author_flair_text": null, "body": "It wouldn't have made me so furious (people do make mistakes) except that that insisted that my children attend - made a huge deal out of it in spite of our protests - and when we got there we quickly realized they were the only children there out of about 200 people. \n\nNow we just send our regrets and a gift if they accept our absence gracefully.", "controversiality": 0, "created_utc": 1424381015, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrg5z", "link_id": "t3_2wgu3e", "parent_id": "t1_coqrbdl", "retrieved_on": 1424682860, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, I will have enforcers. Two of the groomsmen are very large dudes and will be enforcing rules for me so I can have an easy day. I don't understand why people do that though. I already have people telling me they're bringing dates when their save the dates do not anywhere say \"and guest\". And these are adults. I just don't get it. ", "controversiality": 0, "created_utc": 1424381042, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrgto", "link_id": "t3_2wgu3e", "parent_id": "t1_coqr8ns", "retrieved_on": 1424682869, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Bnewhook", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow that is terrible!!!! Hopefully that is only the thoughts of one person. Personally I would be thrilled at the idea of having a sitter  provided for any part of the day/evening! \nFor the wording, to make it more personal to the people you are inviting with children young enough a hand written note will probably be the warmest. Could say something like \"Heather &amp; Greg, we have hired nannies for the ceremony portion of the day because we know young children will likely be bored with sitting through the ceremony. Could you let us know if you will be bringing jimmy and Mary so we can ensure we have enough nannies on hand for all the small children. We cannot wait to celebrate our special day with you, and hope you all will be able to make it.\" \nI don't think there is a way to say you HAVE to leave your kid with the nanny without being impolite but I think people will get the point &amp; will oblige (and be THRILLED to). \nAs for the cut off, it really depends on the child. My son was 11months at his last wedding and I sat in the last row so I could make a quick exit (it was outdoors so not like I was actually leaving a building). At my own wedding there was a three year old &amp; she was perfect throughout the whole evening. To be safe I would say 6 is good, but if the family has an older child they may want to go with the other kids as well. But by 7/8 you should be able to sit still for 20-30mins! ", "controversiality": 0, "created_utc": 1424381153, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrjil", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424682903, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah I'm basing the age on my niece and nephew. She is 9, he is 6. She can sit still and be quiet when need be, but my nephew can barely sit still for 30 seconds. Maybe I'll up it to 10 to be safe. ", "controversiality": 0, "created_utc": 1424381309, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrn9d", "link_id": "t3_2wgu3e", "parent_id": "t1_coqrjil", "retrieved_on": 1424682952, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Naturespocket", "author_flair_css_class": null, "author_flair_text": null, "body": "It amazes me too! I emailed my cousin to make certain (my daughter wasn't on the invite, 15 years ago that was the \"unwritten\" request but I wanted to double check). When he said the venue (which was a historic building near a lake) wasn't kid-friendly I honored that.  I was so embarrassed that my sister - who clearly knew from me - took the baby.  \n\nPeople can be so rude! I hope it all goes smoothly for you! \n", "controversiality": 0, "created_utc": 1424381566, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrtcr", "link_id": "t3_2wgu3e", "parent_id": "t1_coqrgto", "retrieved_on": 1424683031, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much! I really appreciate the input!", "controversiality": 0, "created_utc": 1424381691, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqrwcg", "link_id": "t3_2wgu3e", "parent_id": "t1_coqrtcr", "retrieved_on": 1424683070, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh come on. If someone tells me they're not bringing their kid, I'm gonna trust them. Unless it's the kid's surprise birthday, I'm pretty sure a parent knows better than I if their kid needs to stay home. ", "controversiality": 0, "created_utc": 1424381762, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqry28", "link_id": "t3_2wgu3e", "parent_id": "t1_coqrg5z", "retrieved_on": 1424683092, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "donnamatrix79", "author_flair_css_class": null, "author_flair_text": null, "body": "Consider that some parents CANT leave their kids -- mine is only 2 months old, and nursing on demand. I'm not leaving him with a stranger, I'm barely comfortable leaving him with my mom for half an hour. If I wasn't able to bring him to a ceremony, I would have to skip it. Of course, I would also sit near the exit and duck out if he made noise if I had him at a ceremony too. \n\nI wouldn't be offended by it, some people have different requirements. But right now, anywhere that my kid can't go is somewhere I can't go. \n", "controversiality": 0, "created_utc": 1424383057, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqssh7", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424683556, "score": 27, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Chouette4u", "author_flair_css_class": "purple", "author_flair_text": "8-year-old and 3-year-old", "body": "&gt;But we have decided to have a cut off age for ceremony attendees.\n\nSo what is the cut-off?  And what happens with families who have children both above and below your cut-off?  Little Sister Cindy has to go to the play area but Big Brother Bobby is allowed to stay with mom and dad and go to the big ceremony that everyone is excited and dressed up for?  Some kids will have no problems going off to play with the nannies, and other kids will be terrified of leaving their parents, especially if they have just traveled from out of town.  \n\nI think you should make everyone aware of the option beforehand and maybe send them a link to the children's learning center so they can talk about it with their kids ahead of time.  Then leave it up to the parents to know their kids best.  Some kids will have a meltdown if you try to drop them off with a stranger but won't make a peep sitting at the ceremony and vice versa.  \n\nI think you need to decide if kids truly are invited or not....there is no middle ground.  You can invite the kids and provide an alternative if the parents/kids want it, or you can invite the parents only and provide childcare for the kids.  Having these weird cut-offs for the ceremony only and kids only being quasi-welcome is, to be frank, not very polite and will put cause more hurt feelings than just making a real decision about who is and is not invited to the wedding.\n\nAs for letting parents know about your plans, put all of the info on your wedding website and reach out to the families are you close to via phone or email and explain the situation so they can plan accordingly.", "controversiality": 0, "created_utc": 1424383351, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqszfp", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424683645, "score": 7, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "pollygolightly", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd just say to make it explicit that kids will not be allowed at the ceremony, and that they will go with the nannies you'll have on site. ", "controversiality": 0, "created_utc": 1424383627, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqt5u1", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424683729, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Bnewhook", "author_flair_css_class": null, "author_flair_text": null, "body": "10 sounds great! ", "controversiality": 0, "created_utc": 1424384236, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqtjgz", "link_id": "t3_2wgu3e", "parent_id": "t1_coqrn9d", "retrieved_on": 1424683906, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "We were thinking roughly 6ish (still a little up in the air though) for a mandatory cut off, but will allow all kids at the learning center if they want to go. Unfortunately there is no link to the learning center (just a building at the zoo), but there will be the general link to the zoo on the website. \n\nIf we were doing two locations, I'd definitely do an adults only ceremony and all ages reception, but there's very little time between the two (maybe 10 minutes?) so this was the best we could come up with. \n\nBut it's also not really an option. The ceremony is going to be flat out no small children. It's a small space, no microphones, and very important to not be interrupted. I might see if I can set up a zoo tour or something, but really I doubt they will have the time to do so since it will be a short ceremony. ", "controversiality": 0, "created_utc": 1424384687, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqtth3", "link_id": "t3_2wgu3e", "parent_id": "t1_coqszfp", "retrieved_on": 1424684036, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Awesome! I will bring it up with the mister and see what he says. Thank you for all of your help!! ", "controversiality": 0, "created_utc": 1424384754, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqtuza", "link_id": "t3_2wgu3e", "parent_id": "t1_coqtjgz", "retrieved_on": 1424684054, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Cherry_bomb_pompom", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, such a great idea!  It sounds to me like you've planned thoughtfully to ensure everyone enjoys the day.  I had a \"no kids\" policy at my wedding with the exception of two nieces who I'm very close with and were in my wedding party, both were taken home early.  Some people were upset, but it really wasn't a venue or event appropriate for children (at night, basically in a hotel bar) so we did what we wanted, it was our party.  Your wedding sounds just amazing, and as a parent I would LOVE to know that I could enjoy the ceremony without worrying that my toddler would make a scene.  If there parents aren't comfortable one of them can stay with their child and miss the ceremony, that's the compromise of being a parent, I think.  You could include a note in your invite, or even send out a group email explaining your plans.  It's your day, you're paying for it, you go ahead and do what you feel is right for you.  Best of luck, and well done!", "controversiality": 0, "created_utc": 1424385460, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coquac0", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424684254, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "becausefrog", "author_flair_css_class": null, "author_flair_text": null, "body": "You'd think it was that simple, eh? Unfortunately, not for some. I don't know why, but sometimes people are very insistent. It makes absolutely no sense to me, but now I know enough to firmly decline.", "controversiality": 0, "created_utc": 1424385704, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqufqs", "link_id": "t3_2wgu3e", "parent_id": "t1_coqry28", "retrieved_on": 1424684324, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Would you accept if someone had made arrangements for your wee ones like I am? Or would it make no difference? ", "controversiality": 0, "created_utc": 1424385829, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coquiff", "link_id": "t3_2wgu3e", "parent_id": "t1_coqufqs", "retrieved_on": 1424684359, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angryherbivore", "author_flair_css_class": null, "author_flair_text": null, "body": "I would give parents some leeway because situations are different for everyone and can be stressful for the parents.  If someone is telling you they can't leave their kid, trust them that they *can't* leave their kid, not that they just don't want to.  They're not doing it to be an asshole to you (believe me when I tell you we pretty much would all prefer to leave our kids for things like wedding ceremonies).  A couple reasons why they might feel like they can't leave their kid with a stranger: Their kid is high-need autistic.  My friend has a kid like this.  He can't leave his son with a nanny because his son might become violent, hit the nanny, hit other kids, etc.  When he takes his kid with him places, or skips things because of the kid, believe me when I tell you it's not because he wants to.  Another example -- a woman with a young infant.  She may be breastfeeding, she may be worried about her not-yet-immunized baby being around a bunch of other germy kids she doesn't know, etc.  Her baby will likely nurse or sleep during the ceremony.  Just make it clear that she needs to leave if baby starts to fuss.\n\nI was EXACTLY like you for my wedding, except less nice about it.  I banned kids entirely (evening wedding, black-tie, in NYC at a formal venue).  I didn't think they would be appropriate at my wedding, and frankly, I fucking hated kids and didn't want to have to deal with them.  My husband's cousin brought her 18 month old anyway.  It was delightful.  He was quiet and sweet during the ceremony, and a ball during the reception.  I know you're concerned, and I think it's a great idea to have a kid-check, but if someone is telling you it's not an option for them, have a discussion with them about why and try to figure out whether it might be ok to make an exception for that particular kid.  They want to come to your wedding ceremony -- they're just telling you they can't do it on the terms you're setting.", "controversiality": 0, "created_utc": 1424386015, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqumfv", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424684411, "score": 13, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "This is an AWESOME idea and you are wonderful friends for making this available even though this is for your special night. \n\nIf I were you, Id include a little note card with your invite that says something like \"while we enjoy the presence of you and your little ones at our reception, we kindly ask that for a quieter and more intimate ceremony, they join our wonderful and fun nannies at suchandsuch location. afterwards, feel free to have them join us again for the food and fun festivities.\" \n\nI wouldn't be offended if I received something like that. It'd be great to have my kids close enough to attend to their needs during the wedding ceremony or reception but still be able to play grown up and participate in the fun adult activities. \n", "controversiality": 0, "created_utc": 1424386111, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coquokg", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424684439, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "becausefrog", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, absolutely! No one I know ever does, though! Even if you just arranged childcare at a friend/relative's house in town with enough sitters for the kids, boardgames, movies, or crafts and pizza, would be awesome and we'd totally be on board.\n\nWhat you are doing is magical, and goes way beyond expectation! Unless someone has a child with special needs, I don't see how anyone could complain.", "controversiality": 0, "created_utc": 1424386389, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coquuma", "link_id": "t3_2wgu3e", "parent_id": "t1_coquiff", "retrieved_on": 1424684517, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "Let me just preface this by saying that I think what you have done is great, and it's smart to keep kids out of a ceremony where most will be bored to tears: at best fidgety, at worst disruptive.\n\n&gt; Personally, I'm pretty offended by that because the ceremony is the entire point of the night right?\n\nHonestly, this is where you have to realise that much as your friends love you, no one really cares about the \"meaning\" of your wedding except you.\n\nIf you start getting \"offended\" you'll just ruin your own happiness and peace of mind. Just breeze this stuff off and enjoy it for your sake. The only people who need to be there are you and your affianced.  Everything else is just bonus.\n\nI share your concerns about people bringing disruptive kids in regardless, and for that you need to have someone play bouncer/door security.  Given the arrangements you have made, for someone to make a scene at the ceremony would be so breathtakingly rude that frankly they're not a friend worth keeping.  (One of my relatives was this breathtakingly rude at another relative's wedding, and years later, she is still not redeemed in everyone's eyes. Partly because she has done nothing to redeem herself, but still. The resentment lingers).", "controversiality": 0, "created_utc": 1424386425, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coquvea", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424684527, "score": 9, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Entirely unrelated, did you end up having kids and if not, why are you on mommit? Just personal curiosity. lol \n\nAnd maybe I'm thick, but how if someone is concerned about an unimmunized baby being around 10 or so kids, why bring it to a wedding of 200 attendees and a whole zoo of animals? What am I missing? ", "controversiality": 0, "created_utc": 1424386781, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqv33z", "link_id": "t3_2wgu3e", "parent_id": "t1_coqumfv", "retrieved_on": 1424684627, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "That's probably the most perfect wording I've come across yet. Thank you! ", "controversiality": 0, "created_utc": 1424386850, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqv4lq", "link_id": "t3_2wgu3e", "parent_id": "t1_coquokg", "retrieved_on": 1424684646, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah I get your point but I pretty much get one day to be selfish right? So I'm taking it. lol \n\nThe bouncer's might be necessary, and probably make the entire thing happen a lot more smoothly than without. ", "controversiality": 0, "created_utc": 1424387058, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqv935", "link_id": "t3_2wgu3e", "parent_id": "t1_coquvea", "retrieved_on": 1424684705, "score": 0, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "MomOfTaz", "author_flair_css_class": null, "author_flair_text": null, "body": "My toddler is going though the no stranger stage so I may need to skip the ceremony if he won't go with the nanny. Otherwise I think you've thought of everything! ", "controversiality": 0, "created_utc": 1424387864, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqvq3p", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424684925, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dalikin", "author_flair_css_class": null, "author_flair_text": null, "body": "If they have a small baby (e.g. under 6 months), the baby comes with them, and they can't just leave baby with a nanny for lots of reasons. Babies are on a vaccination schedule so they may have received some vaccinations so far but not others. There's a big difference between being generally around people like at a wedding, and being in a daycare partially unsupervised environment (because 1 Mum to 1 baby is a far better ratio than 2 nannies to 15 kids) - lack of crazy hardcore direct supervision = baby putting something in mouth that germy other kid has just sucked on ... = sickness transferred.\n\nIf you want your friends with young babies to attend, you might need to accept that either they need to bring the kid to the ceremony, or they can't come. We took our 8 week old to a wedding and she slept through the entire ceremony and dinner. Not a peep out of her. If somebody has a fussing child at the ceremony, they will just.. take the child and leave the ceremony so as not to interrupt your special day.", "controversiality": 0, "created_utc": 1424387930, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqvris", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv33z", "retrieved_on": 1424684943, "score": 8, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dalikin", "author_flair_css_class": null, "author_flair_text": null, "body": "If you want to spend your one day kid-free and avoid being \"offended\" by kids in your ceremony, tell the guests with children that children are not welcome in the ceremony and let the guests decide whether or not they still want to attend your wedding without the kids. You may find that many people do not come (particularly those with smaller kids).", "controversiality": 0, "created_utc": 1424387990, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqvsrh", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv935", "retrieved_on": 1424684960, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dalikin", "author_flair_css_class": null, "author_flair_text": null, "body": "With the zoo tour, who is going to be carrying the smaller children/pushing them in prams/holding their hands? Your guests, most likely. Heh.\n\nI'm also a bit confused because some of the very small children won't be able to go to the learning centre. A 2 year old might be excited about the learning centre, but a 0-12 month child doesn't give a shit really, they probably just want to be with their parents. So your cut-off would have to be 1-6 year olds at the learning centre, anyone older than that at the ceremony, and if your child is under 1 year old do not bring them or don't come.", "controversiality": 0, "created_utc": 1424388068, "distinguished": null, "downs": 0, "edited": 1424388249, "gilded": 0, "id": "coqvue4", "link_id": "t3_2wgu3e", "parent_id": "t1_coqtth3", "retrieved_on": 1424684981, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Ahhhh. Yeah I have zero knowledge when it comes to small kids so to me it seemed odd that 200+ people and wild animals are totally cool, but 10 other kids were not. ", "controversiality": 0, "created_utc": 1424388130, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqvvnt", "link_id": "t3_2wgu3e", "parent_id": "t1_coqvris", "retrieved_on": 1424684997, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "I dunno, zoo employees? Hahaha haven't gotten that far. ", "controversiality": 0, "created_utc": 1424388246, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqvy2k", "link_id": "t3_2wgu3e", "parent_id": "t1_coqvue4", "retrieved_on": 1424685029, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dalikin", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha yeah fair enough!! I think it's just tricky to have strict rules for very small children. Personally, I have a 4 month old who is VERY well behaved, never really cries, etc. But she won't take a bottle. She will only breastfeed. Believe me, we have tried the bottle 1 billion times. So if your cutoff was 6 years old, I wouldn't be able to attend your ceremony or wedding because I wouldn't be able to bring my baby OR leave my baby with anyone haha.\n\nLike the other poster said as well, the age of the child does not necessarily speak volumes about their maturity. A very quiet, 5 year old is better than a psycho 10 year old at a wedding any day! ", "controversiality": 0, "created_utc": 1424388394, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqw120", "link_id": "t3_2wgu3e", "parent_id": "t1_coqvvnt", "retrieved_on": 1424685067, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angryherbivore", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, have a toddler. My baby is awesome. I probably still wouldn't like yours ;)\n\nAs for immunizations, my approach when my son was little was that I could minimize contact, but not eliminate it. Like I said, I live in nyc. There are people fucking everywhere. Not having your baby \"around\"others is impossible. But you can keep other kids from touching your baby. You can limit the number of grubby handed adults who hold him or her. It won't be perfect, but it's better than leaving baby alone in a nursery full of unknown kids. And if you're nursing, regular nursing can help reduce the chance of disease communication and bolster immune system. So that helps. ", "controversiality": 0, "created_utc": 1424388431, "distinguished": null, "downs": 0, "edited": 1424468318, "gilded": 0, "id": "coqw1u6", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv33z", "retrieved_on": 1424685077, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "dalikin", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha hire at least 1 zoo employee per 2 children if you go down that route! Don't want the kiddies getting into the lion cages!", "controversiality": 0, "created_utc": 1424388463, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqw2h5", "link_id": "t3_2wgu3e", "parent_id": "t1_coqvy2k", "retrieved_on": 1424685085, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "No - you misunderstand - you totally get one day to be \"selfish\". It's YOUR day.  I 100% think you are doing the right thing with kids (those kids would hugely thank you, if they could!)\n\nJust don't waste emotion by being upset that others don't revere the importance of the ceremony in the same way that you do.  There are two kinds of wedding in this world in most people's perception. There is \"their own wedding\".  Then there are \"other people's weddings\" which generally meld into a homogenous, vaguely-remembered blur of white dresses/cakes/flowers/drunken guests.\n\nSo if people get pissy, or decline to attend, just don't sweat it.  Just think about yourself, and your immediate family, and your own happiness.", "controversiality": 0, "created_utc": 1424389414, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqwltx", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv935", "retrieved_on": 1424685336, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "krsdean", "author_flair_css_class": null, "author_flair_text": null, "body": "It's going to be boring for any child from 2-15.. I'd simply add something along the lines of  - please be sure to check your child in at the child learning center 15th minutes (or however much time you think is appropriate) prior to the ceremony, where we have provided a nanny service as to not bore your child to death!! ", "controversiality": 0, "created_utc": 1424389428, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqwm3x", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424685340, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "Doththecrocodile", "author_flair_css_class": null, "author_flair_text": null, "body": "I like your solution! I have a clingy toddler, so I'd probably stay with him and the rest of the kids while my husband sat in on the ceremony (or vice versa if he didn't know you well and I did). I love when I can share life experiences and my friends with my kid, but a wedding ceremony being quiet should certainly be respected. \n\nKids can be unpredictable. Most ppl in my circles take noisy young ones out of the service if they're too loud- so I've never seen it be an issue. \n\nBut if you were my friend, I wouldn't be offended. Make sure it's very clear, so there are no surprised parents (toddlers don't handle surprises well either!). It sounds like you've given it a lot of thought and consideration to others. ", "controversiality": 0, "created_utc": 1424394163, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coqz9bf", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424686574, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "megalynn44", "author_flair_css_class": null, "author_flair_text": null, "body": "Our wedding wasn't too huge, around 80 people or so, so we had basically a table's worth of kids at our wedding. All of them relatives. In our case we didn't have to talk to anyone really. We did hire some sitters (trusted teenagers from one of my relatuve's church) to basically man the kids table and assist with watching kids throughout the party. We even decorated the kids table entirely different from the rest of the tables. Extra candy and pinwheels and color. It was fun!\n\n\nBut I think the simplest thing to do is to request in your invitation to specify the ages of any kids when they RSVP to help you have enough childcare on hand for the day.", "controversiality": 0, "created_utc": 1424396384, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor0i30", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424687224, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "megalynn44", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't speak for everyone, but I wouldnt bring a baby that young to a wedding. I would miss before bringing it. I also don't think it's out of line to request no kids at the ceremony. It's a pretty common thing these days.", "controversiality": 0, "created_utc": 1424396605, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor0ml1", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv33z", "retrieved_on": 1424687282, "score": 4, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "Your venue is a zoo and you are hiring a nanny?   Petrichor, this is going to be the best news a parent gets \"broken to them\" all year!  You ROCK!   Everyone is going to have a killer time at your wedding, way to go.   \n\nSpecific answers:  \"We want you and your little ones to have a fantastic time at our wedding. Little ones aged ___ will be invited to the adjacent learning centre and cared for by nannies for the 20-30 adults-only ceremony.\"\n\nThis explanation is:\n* Kid-centred - yay! Learning centre! Nannies! Woooo!\n* Clearly states the the ceremony is adults-only. No confusion here.\n* Provides specific information about who, what, when, for how long, where.\n\nOh my god your wedding is at a Zoo, this is so cool.", "controversiality": 0, "created_utc": 1424398403, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor1mm0", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424687749, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "angedefeu", "author_flair_css_class": null, "author_flair_text": null, "body": "* Once kids hit the age of reason (google this for the target age) they are better at staying put for formal stuff.    My nephew is 6, I wouldn't trust him to sit through a ceremony.  \n\n* Breastfeeding Moms and Moms with kids under 2-3 may not be comfortable leaving their child with a stranger.   It'll be super helpful if you can just roll with things if they skip your ceremony.  It's not that they don't love you.  It's just really, really hard to leave a tiny one with strangers.    Other parents (with 2+ kids) will probably be dropping them off at any age ASAP, haha.\n\n* Have designated people available to ENFORCE the no kids at the ceremony. This is not rude to do.   Just have a designated ceremony usher/ushers at the back who you trust to tactfully remind parents of where children can be during the ceremony  ie: NOT HERE! :D", "controversiality": 0, "created_utc": 1424398652, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor1rmw", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424687814, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "annaswims", "author_flair_css_class": null, "author_flair_text": null, "body": "I'd say you're offended because you have no understanding of what life with a young child is like.  It's unreasonable to insist a parent to leave an infant with a stranger and a bunch of kids.  It's nice of you to offer, but completely unreasonable for you to get bent out of shape if the don't feel comfortable with your arrangement", "controversiality": 0, "created_utc": 1424399660, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor2byk", "link_id": "t3_2wgu3e", "parent_id": "t1_coqqldx", "retrieved_on": 1424688077, "score": 6, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "annaswims", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't tell you how much I hate the idea that a bride is entitled to be selfish at her wedding.  It's about your relationship and new family and community. Nobody wants to travel just to watch you be selfish in ways that are difficult and stressful for them. Consider being a gracious host", "controversiality": 0, "created_utc": 1424400159, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor2mb0", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv935", "retrieved_on": 1424688269, "score": 5, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "fuss_bucket", "author_flair_css_class": null, "author_flair_text": null, "body": "Preach. ", "controversiality": 0, "created_utc": 1424400895, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor312v", "link_id": "t3_2wgu3e", "parent_id": "t1_cor2byk", "retrieved_on": 1424688458, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "knittybynature", "author_flair_css_class": null, "author_flair_text": null, "body": "I probably would not leave my infant with a nanny. I'd leave my 3 year old. I would be wary of how many children the nanny had to care for to adequately watch an infant. Either my husband or I would go to the ceremony and the other would stay with the baby. I cant tell if you're joking butalso think it's strange you think you need big men to enforce this rule. You want to intimate your family and friends?", "controversiality": 0, "created_utc": 1424401992, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor3msa", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424688740, "score": 3, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "Simply put, those adults most likely have their vaccines up to date. Because children get certain vaccines at certain times a two year old may not be fully vaccinated and therefore more likely to pass on something to a small infant than an adult would. \n\nI take my 7 mo to church with me and keep her in a carrier where I can control what she touches and keep random people from touching her. This is much better than sticking her in the child care provided with lots of other children who may or may not be vaccinated and they just share everything including bodily fluids. ", "controversiality": 0, "created_utc": 1424404693, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor52ek", "link_id": "t3_2wgu3e", "parent_id": "t1_coqvvnt", "retrieved_on": 1424689409, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "granolamom", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish you guys a wonderful wedding. And don't forget, this is indeed your day. You might offend a few but just having this as an option is incredibly thoughtful. This really does allow for more of your family and friends to spend time with you on this special day. And believe me when I say, they want to be their with you but when kids are involved, sometimes we parents have to make tough decisions and not go, but this helps for more to have an opportunity to attend. \n\nI have a 7 month old who would do great in a carrier in your ceremony and be quiet as a mouse. My 2.5 year old is high needs and difficult to leave with others for long periods of time. I would love it as a mom if my friend/family provided this set up at a wedding. I would be happy to leave him for the duration of a ceremony but be so glad to be able to have him join me for the reception. ", "controversiality": 0, "created_utc": 1424404953, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cor577e", "link_id": "t3_2wgu3e", "parent_id": "t1_coqv4lq", "retrieved_on": 1424689471, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Well I hate having to cater to all these kids so I'm sure we're even. But thanks for your helpful input on telling parents about providing childcare! It was so helpful! ", "controversiality": 0, "created_utc": 1424435238, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "corea0t", "link_id": "t3_2wgu3e", "parent_id": "t1_cor2mb0", "retrieved_on": 1424693717, "score": -1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly it'll probably be a nanny or several depending on the amount of kids. ", "controversiality": 0, "created_utc": 1424435328, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "coreaw7", "link_id": "t3_2wgu3e", "parent_id": "t1_coqw2h5", "retrieved_on": 1424693729, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "gladiolas", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, awesome with the zoo and such!  \nI would recommend your cut-off age is 10. That makes it very clear that young children are not welcome. You might even up it to 11 or 12. Kids younger than 12 would have fun at the zoo if you group the kids by age. The cut-off age you give is a very clear message about \"no kids allowed.\" I think if your cut off is 6 then parents with a 4 or 5 year old who feel their kid is very mature and quiet will try to sneak in their \"6 year old.\" But you can't pass a 4 year old off as a 12 year old. I'd up the cut off.  \n\nAs for the wording, I'd make it as short and sweet as possible so there's no grey area. People will interpret it however they want. You may have difficulties with very young babies who are in that clingy stage and don't want to be separated, or newborns, etc.  \n\nYou kind of have to pick your approach and go with it.  \nI see two options: 1) Come off as kind of bossy but get what you want, 2) Come off as nice and accommodating and risk being irritated that people take advantage. \n\nI say it's your wedding, it's your day, be bossy.", "controversiality": 0, "created_utc": 1424510197, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cosdbl6", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424710444, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "LRonHummer", "author_flair_css_class": null, "author_flair_text": null, "body": "Not sure how many of your friends have tiny little ones, but mine is under a year, so I wouldn't feel comfortable leaving her with a stranger who is trying to wrangle who knows how many other kids. I'd probably decline the invite, to be honest. \n\nEdit:  I just realized you said your guests would have to travel for most part. In that case, I would definitely 100% decline. ", "controversiality": 0, "created_utc": 1424527150, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cosgmmp", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1424711987, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "11Petrichor", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, I'm not entirely inept, if be getting a head count of kids prior and hiring the appropriate number of people. ", "controversiality": 0, "created_utc": 1424527255, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cosgnpe", "link_id": "t3_2wgu3e", "parent_id": "t1_cosgmmp", "retrieved_on": 1424712001, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "LRonHummer", "author_flair_css_class": null, "author_flair_text": null, "body": "Chill. I didn't say you were inept. These are things that parents of infants have to consider with childcare. \n\nIn my state, the law is a maximum of 4 children per childcare provider.  Would this person be responsible for no more than 3 other children?  Would I have the opportunity to meet and approve this person?  Would this person be trained to handle an emergency medical situation? Are all of the other children in the space healthy and vaccinated?  Does the facility have clean and safe spaces for children to sleep, eat, and be changed?\n\nThese are things that I know about and are controlled in my daughter's daycare. That's why it would probably be easier for me to just send my regrets. It wouldn't be anything personal, it's just that infants are difficult to care for, and with the added stress of traveling it would just be too much for us. ", "controversiality": 0, "created_utc": 1424528484, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cosh0ou", "link_id": "t3_2wgu3e", "parent_id": "t1_cosgnpe", "retrieved_on": 1424712169, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AstridLael", "author_flair_css_class": null, "author_flair_text": null, "body": "I can guarantee my little girl is cuter and more likable than yours ;)", "controversiality": 0, "created_utc": 1424667327, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cou69u5", "link_id": "t3_2wgu3e", "parent_id": "t1_coqw1u6", "retrieved_on": 1424749090, "score": 2, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "AstridLael", "author_flair_css_class": null, "author_flair_text": null, "body": "Teens should be able to sit and be quiet and patient for the length of a wedding . 8 and up should be able to be quiet and respectful . Pretty pathetic if you think 15 year Olds can't handle going to a wedding . ", "controversiality": 0, "created_utc": 1424668023, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cou6lad", "link_id": "t3_2wgu3e", "parent_id": "t1_coqwm3x", "retrieved_on": 1424749235, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "krsdean", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, I didnt say they Couldn't... I said they'd be bored.", "controversiality": 0, "created_utc": 1424705801, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "couhr6f", "link_id": "t3_2wgu3e", "parent_id": "t1_cou6lad", "retrieved_on": 1424754934, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"archived": false, "author": "kking0411", "author_flair_css_class": null, "author_flair_text": null, "body": "My SIL had her wedding at a fancy hotel and the ceremony was no kids as well. She also hired a sitter to watch the kids during that time. For dinner she offered smaller kids options and said the kids could eat with the adults or the parents could go to a different room with their children to be served there if that was more comfortable. Then for the reception it was all ages but the sitter was still around for parents that wanted to utilize it. \n\nI think it's very thoughtful to provide childcare. I understand not wanting kids at the ceremony, but under 2 might be tricky to manage for guests because of breast feeding. I wouldn't be offended by anyone with a small child skipping the ceremony because they might just be worried about a crying baby interrupting and not want to leave such a young child alone. ", "controversiality": 0, "created_utc": 1425165361, "distinguished": null, "downs": 0, "edited": false, "gilded": 0, "id": "cp0bir6", "link_id": "t3_2wgu3e", "parent_id": "t3_2wgu3e", "retrieved_on": 1427509727, "score": 1, "score_hidden": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}