{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1442118719, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/3kqyag/new_baby_relationship_hell/", "gilded": 0, "id": "3kqyag", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 77, "over_18": false, "permalink": "/r/Mommit/comments/3kqyag/new_baby_relationship_hell/", "retrieved_on": 1450800112, "score": 43, "secure_media_embed": {}, "selftext": "\nI have a history of \"playing victim\" or maybe just getting really fed up when I get shit that I don't think is acceptable but am not quite ready to leave. My husband and I are at a football game today and we are walking to the stadium after paying $20 to park. I have our ten week old baby strapped to me. He's sarcastically telling me to walk faster, saying all these people are passing me, etc. he's basically just miserable to be with, we can't just chill out. He's like \"I would rather b in the stadium!\" Etc. Turns out he led us in the opposite direction of the stadium for 15 minutes. So the stadium is over a mile away. He calls me a cunt when I told him to walk on the inside with our son and pulled him in that direction. He said I shoved him toward other people.\n\n\nThen, we are in the game and it's TOO loud for an infant. I did all this googling beforehand to try and determine if it would be. It was too loud because we got 5th row seats in the endzone. So I'm trying to get the baby out of there and I said I don't need the diaper bag or something and he goes \"don't shout in my ear\" and I said \"then help me! Instead of just telling me what to do\" and he says \"shut the fuck up\". In front of his sister. I said \"oh shut the fuck up?!\" And I stormed out. \n\nI Walked a mile with our baby and no baby carrier Back to our vehicle and had our baby nap and eat. My marriage is the bigger concern. I hate doing anything anymore cause of his Moods. We are in counseling and he has a drinking problem and has stopped drinking.\nI should add that when I was mad I texted him \"go drink\" &amp; he said that really hurt his feelings.\nI don't Know what to do. His dad treats his mom like this. He says there's a problem with how harshly I react to him pushing my buttons and being downright rude. I say: Don't do it in the first place!\nI feel alone as a mother. I'm a stay at home mom and he works. I'm a farm wife so I pay all of our bills, cook, clean, take care of the baby, make marketing decisions for the farm, etc. he does not ever take out the garbage, vacuum, do laundry, etc. He just throws things on the floor. He works 10 hour days in the off season and about 26 hour days during planting and harvest. So I know everything house related is my duty then. But even weekends. I'm with our son 80% of the time.\nWe just got married in January and met not even a year before that. I don't know what to do. The way we communicate is so toxic.\n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "New baby; relationship hell", "url": "https://www.reddit.com/r/Mommit/comments/3kqyag/new_baby_relationship_hell/"}, "comments": [{"author": "wildbluyawnder", "author_flair_css_class": null, "author_flair_text": null, "body": "You married a boy. He needs to grow up. ", "controversiality": 0, "created_utc": 1442121745, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzrinz", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444330286, "score": 13, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iloveBillMurray", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry I have no advice for you, but he should never talk to his wife like that. I hope you guys figure it out, and I'm sorry you have to go through this. ", "controversiality": 0, "created_utc": 1442121884, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzrkj7", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444330311, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "youllneverguesswhat", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, I'm so sorry you are going through this. It sounds really tough and your husband sounds like a real jackass. I realize that as a SAHM you may feel like you have no options other than to stay in a shitty relationship since he is supporting you and your child, but certainly there must be something you could do. If his father treats his mother the same way he treats you then you can guess pretty well what your own future will look like staying in this marriage. \nI guess my only real advice would be to find a way to get out of this toxic relationship ASAP. No one deserves to be spoken to and treated the way he has with you. Good luck, and I hope you and your child can find the happiness you deserve. You are stronger than you know and more capable than you think, you can do it!", "controversiality": 0, "created_utc": 1442122493, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzrsne", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444330461, "score": 21, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mrsmeowma", "author_flair_css_class": null, "author_flair_text": null, "body": "If he saw his father treat his mother like this, do you want your child to learn this behavior as well. If you have a son, he might think its ok to treat his future girlfriends/wife like this or if you have a daughter, she might think this is acceptable behavior from a man. Just food for thought.", "controversiality": 0, "created_utc": 1442125069, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzsoxy", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444330883, "score": 51, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gwenami", "author_flair_css_class": null, "author_flair_text": null, "body": "Your husband is a fucking tool.", "controversiality": 0, "created_utc": 1442126994, "distinguished": null, "edited": false, "gilded": 0, "id": "cuztacs", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444331164, "score": 22, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Leaving is so daunting especially with a newborn and knowing his family is ruthless and will attack me legally and try and take my child :(", "controversiality": 0, "created_utc": 1442136869, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzvohz", "link_id": "t3_3kqyag", "parent_id": "t1_cuzrsne", "retrieved_on": 1444332291, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a son. I agree. ", "controversiality": 0, "created_utc": 1442136890, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzvonx", "link_id": "t3_3kqyag", "parent_id": "t1_cuzsoxy", "retrieved_on": 1444332293, "score": 8, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nattommy", "author_flair_css_class": null, "author_flair_text": null, "body": "They can try all they want. Courts aren't going to take a newborn away from its mother. Unless you are an insane drug addict and even then, I've seen the court side with be mother. \n\nAre you breastfeeding? Especially then they will not. Leave his ass before your kid things this is how you treat a partner. ", "controversiality": 0, "created_utc": 1442137341, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzvs45", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvohz", "retrieved_on": 1444332338, "score": 16, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DisneyWench", "author_flair_css_class": null, "author_flair_text": null, "body": "Girl, I'm with you. Currently have been staying at my parents house because I had enough of his shit. It's daunting knowing I need to move on from him because I know it will never get better (moved out 2 times with promises of him trying to be better) but I surely don't want my son learning this from his father and treating people or his future wife like this or worse let himself get treated like this and think it's ok.\nOnly advice, try to make it work, but know when it's enough and if he evens means it/trys.\nOh and don't get pregnant again my mistake now here I am with two kids. ", "controversiality": 0, "created_utc": 1442138004, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzvx0l", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444332403, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Yea I'm breastfeeding.  ", "controversiality": 0, "created_utc": 1442138202, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzvygv", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvs45", "retrieved_on": 1444332421, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "So here's the thing about relationships...the most important element isn't love, it's respect. It doesn't sound like either of you really respect the other and that's a problem. Can you bring this up in counseling? Even if you do respect each other, the way he communicates is disrespectful and your text to him was as well.\n\nWe can only control our own actions and reactions but you don't have to and should not be a verbal punching bag. Perhaps you can work on a way to call him out on his behaviors without disrespecting him as a person? (Ex. \"That's a really disrespectful way to treat me. I'm carrying our son and can't walk any faster.\") Ultimately he has to change his behavior because it's not right how he talks to you but you can't change him yourself, only he can do that. If he doesn't or seems unwilling to try, it's time to move on. And you have the opportunity to work on your own issue of communicating when angry as well. I don't think you're unjustified in being angry (in fact, I think you're quite justified) with him but lashing out at him clearly isn't getting you the right reaction from him either. You both have to be willing communicate better if you hope to make it work.", "controversiality": 0, "created_utc": 1442138359, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzvzm5", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444332436, "score": 36, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "OrganizedSprinkles", "author_flair_css_class": null, "author_flair_text": null, "body": "The first year with a baby is the hardest on even the strongest relationships. Just make sure you are communicating and listening. Panicking situations like when you were trying to leave the game is where tempers will flair. You have an entirely new situation and its stressful. Make sure you both are taking and you are telling him how to help you. Guys have no clue what to do and need to be told explicit directions, possibly with diagrams. Good luck.", "controversiality": 0, "created_utc": 1442145967, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzxnwl", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444333226, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ScienceNerdGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Your situation sounds eerily similar to mine. Most days I'd prefer to be alone and far away from my husband than anywhere near him. He says I'm the problem all the time and maybe I am but when your spouse would rather be alone than with you maybe it's time to take a look at yourself. I don't really have any advice but just wanted to let you know that you aren't alone. Good luck!", "controversiality": 0, "created_utc": 1442147049, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzxybl", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvohz", "retrieved_on": 1444333363, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MrsCrapnapkin", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree what with a commenter said about the first year being the hardest on even strong relationships.  Did you have a strong relationship before baby?  If so it is time to sit down and communicate with him about how to get back to that place.  I have felt so frustrated at times with feeling like I do more than my fair share with our new baby, and sitting down and talking about how each other feels and coming up with a new plan of attack has helped sooo much.  \n\nI also agree with what another poster said about the most important thing in a relationship being respect.  The name calling must stop and is something you should bring up in counseling.", "controversiality": 0, "created_utc": 1442149273, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzyltx", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444333670, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lupisluna", "author_flair_css_class": null, "author_flair_text": null, "body": "Get some recordings of the things he says and leave. My husband worked really hard to overcome his anger issues... And then life got hard again and he backslid back into verbal abuse. We are splitting up now. Get some evidence in place to protect yourself and get away from this vile behavior. Life gets so much easier when you can just live without all that shit.", "controversiality": 0, "created_utc": 1442150098, "distinguished": null, "edited": false, "gilded": 0, "id": "cuzyvrl", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444333800, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. Yes, I am in playing with our baby and he's sitting on the couch doing nothing. And I would rather it this way. ", "controversiality": 0, "created_utc": 1442153300, "distinguished": null, "edited": false, "gilded": 0, "id": "cv002c4", "link_id": "t3_3kqyag", "parent_id": "t1_cuzxybl", "retrieved_on": 1444334364, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I will bring it up in counseling tomorrow. I am fearful we are past the point of return. ", "controversiality": 0, "created_utc": 1442153324, "distinguished": null, "edited": false, "gilded": 0, "id": "cv002p0", "link_id": "t3_3kqyag", "parent_id": "t1_cuzyltx", "retrieved_on": 1444334368, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "It's so hard. I am glad to hear you're happy. ", "controversiality": 0, "created_utc": 1442153351, "distinguished": null, "edited": false, "gilded": 0, "id": "cv00348", "link_id": "t3_3kqyag", "parent_id": "t1_cuzyvrl", "retrieved_on": 1444334374, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like everything has been rushed with you. Having a child drastically changes a relationship. Not always for negative but it changes the priorities of everyone. \n\nHis manner of communicating is unacceptable. Your manner of communicating is unacceptable. \n\n(I am not saying this is your fault, I am saying lead by example and see how that goes) \n\nIt's hard but I suggest you being the driving factor in changing the dynamic that has been created. When he talks to you like this call him on it. Maybe just a phrase like 'you are breaking the rules of communication'. Don't insult back. You will be angry about his actions but cannot feel bad about your own actions. It won't feed his fire. And he may begin to react appropriately. Just keep calling him out on his behavior but in a mature way. Saying fuck you back doesn't make the situation any better. \n\nLife changes after a baby. It doesn't have to become living hell. \n\nKeep going to counseling. Call him on his bs. ", "controversiality": 0, "created_utc": 1442153467, "distinguished": null, "edited": false, "gilded": 0, "id": "cv004x0", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444334397, "score": 11, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WaffleFoxes", "author_flair_css_class": null, "author_flair_text": null, "body": "You are so right about the most important element being respect.\n\nFeeling \"in love\" is fleeting- you can be pissed off at your partner and emotions just aren't a good solid foundation on which to build.\n\nRespect however is being polite even when you're upset.  I've never once called my husband a bad name in the 8 years we've been together, nor he I.\n\nI wouldn't even know what to do if he called me a cunt.", "controversiality": 0, "created_utc": 1442154050, "distinguished": null, "edited": false, "gilded": 0, "id": "cv00duk", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvzm5", "retrieved_on": 1444334515, "score": 10, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "exposeyourself2art", "author_flair_css_class": null, "author_flair_text": null, "body": "Can I PM you? My situation isn't nearly as bad as OP's but our strong marriage has started to suffer since having LO 4 months ago. I just need a stranger to talk to.", "controversiality": 0, "created_utc": 1442155145, "distinguished": null, "edited": false, "gilded": 0, "id": "cv00v30", "link_id": "t3_3kqyag", "parent_id": "t1_cuzxnwl", "retrieved_on": 1444334739, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "Just wanted to say that you should be proud you're already in counseling! I hope it can help you guys out. \n\nYou both will have to work hard on how to communicate. You guys have a lot on your plates and it's gonna suck to slog through the work of counseling and setting aside any time to practice communication skills.\n\nI saw you say in a comment you fear you're past the point of return; if you are still choosing to love him, I hope it works out for you guys. If you decide it's best to split, I wish you the strength and hope to do it! ", "controversiality": 0, "created_utc": 1442156879, "distinguished": null, "edited": false, "gilded": 0, "id": "cv01opa", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444335128, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I believe this is an incredibly accurate depiction of what's going on and what needs to happen. I will try and implement it. ", "controversiality": 0, "created_utc": 1442157335, "distinguished": null, "edited": false, "gilded": 0, "id": "cv01wsz", "link_id": "t3_3kqyag", "parent_id": "t1_cv004x0", "retrieved_on": 1444335234, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree. He is a farmer, though, and once harvest starts he won't be able to go. Unless it rains. ", "controversiality": 0, "created_utc": 1442157522, "distinguished": null, "edited": false, "gilded": 0, "id": "cv02096", "link_id": "t3_3kqyag", "parent_id": "t1_cv01opa", "retrieved_on": 1444335279, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mudkipmurron", "author_flair_css_class": null, "author_flair_text": null, "body": "My advice is to record your husbands verbal attacks on you , that way if counseling doesn't work you have protection from his family doing this. ", "controversiality": 0, "created_utc": 1442159261, "distinguished": null, "edited": false, "gilded": 0, "id": "cv02x92", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvohz", "retrieved_on": 1444335711, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BeardedNoOne", "author_flair_css_class": null, "author_flair_text": null, "body": "Would suggest sitting down quietly when/if everyone has cooled off/ is on the same page and laying some ground rules (for both)nor the future:\n1) no swearing \n2) no sarcasm\n3) give each other the benefit of the doubt - assume each is trying their best for their spouse \n4) spend time each day reiterating when each of you followed 1-3, and review when and why you didn't \n5) spend time talking - have him tell you one thing that went well with his day and one thing that went badly. You can share likewise with him as well. \n\nI believe this method may help you as it seems your husband seems to lack the ability to explain his emotions and instead just turn them into a anger.  \n\nThis is a daily thing. Sit down with him and explain your position. Try to keep the emotional side out. Some days will be better than others. This will only work if both parties agree to it and/or want it. Good luck", "controversiality": 0, "created_utc": 1442162377, "distinguished": null, "edited": false, "gilded": 0, "id": "cv04o3y", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444336534, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "The fact that he treats you that way in front of other people tells me that things are on the verge of getting out of control. \n\nLeave him.", "controversiality": 0, "created_utc": 1442166751, "distinguished": null, "edited": false, "gilded": 0, "id": "cv07j29", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444337947, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tabathafortis", "author_flair_css_class": null, "author_flair_text": null, "body": "Recording someone without their permission is very, very rarely admissible in court because it's entrapment.", "controversiality": 0, "created_utc": 1442167489, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0812x", "link_id": "t3_3kqyag", "parent_id": "t1_cuzyvrl", "retrieved_on": 1444338220, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lupisluna", "author_flair_css_class": null, "author_flair_text": null, "body": "It IS hard. But honestly, it was harder for me to decide to leave than deal with the fallout of leaving. I didn't mean to make it sound easy; I was writing that message after a night of no sleep caring for my infant. But it's still easier caring for her alone than it is trying to get him to help, fighting all the time, and doing it myself anyway. He's actually a better father now that we're split. I don't know if that will work out like that for you. I can't promise that it will be automatically better. But I've been with my husband for nine years, watched him get more and more abusive to me, and constantly critical and angry at his older kids from a previous marriage (they all live with me now). We did counseling, we laid down so many ground rules, I tried so many things. It only gets better when and if they choose to. \n\nI will stress again, get some evidence first, something that you can show a court as to why you need to maintain a little more control than split custody. Cover your ass. My husband and his ex had a terrible divorce, and his kids ended up being badly abused by their stepdad for nearly a year before we could overturn the custody arrangement because we couldn't get enough evidence together until then. \n\nYou deserve better than you're getting. Your son deserves better than he's getting. Don't wait for him to change because all it will do is put your son at the mercy of such behavior. He'll either change or he won't but at least that constant stress won't be a part of your lives. ", "controversiality": 0, "created_utc": 1442167853, "distinguished": null, "edited": 1442168362, "gilded": 0, "id": "cv08a25", "link_id": "t3_3kqyag", "parent_id": "t1_cv00348", "retrieved_on": 1444338337, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lupisluna", "author_flair_css_class": null, "author_flair_text": null, "body": "Depends on the state. Each state is different, but you're right, in my state what I suggested would be illegal. So get some other evidence then. Witnesses, any angry texts, anything. ", "controversiality": 0, "created_utc": 1442168025, "distinguished": null, "edited": false, "gilded": 0, "id": "cv08ecv", "link_id": "t3_3kqyag", "parent_id": "t1_cv0812x", "retrieved_on": 1444338393, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "storeboughtmama", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh man. You guys barely had time to know eachother abd now you're living a very stressful situation that can really bring out the worst in people. I would suggest that your couselor helps teach you guys how to communicate with eachother and how to not lash out at eachother. And you need to find a way to not hate eachother because its easy to grow to despise or resent your partner. My husband acted similarly when we met and the only thing that helped him was time, the older he got the more mature and respectful. But I warn you, its been a long decade and I don't recommend the wait and see approach.", "controversiality": 0, "created_utc": 1442168285, "distinguished": null, "edited": false, "gilded": 0, "id": "cv08krx", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444338477, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "misstrouble", "author_flair_css_class": null, "author_flair_text": null, "body": "That's emotional abuse. You need counciling asap if you want to save your marriage. If it's even save able. He doesn't respect you and you are teaching your baby that it's ok to be an abusive POS. ", "controversiality": 0, "created_utc": 1442170315, "distinguished": null, "edited": false, "gilded": 0, "id": "cv09xpo", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444339119, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "acisnot", "author_flair_css_class": "blue", "author_flair_text": "hola.", "body": "In addition to your couple's counseling, I would strongly suggest individual counseling.   You're both in the wrong.", "controversiality": 0, "created_utc": 1442172401, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0bc7o", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444339779, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DieSchadenfreude", "author_flair_css_class": null, "author_flair_text": null, "body": "If my husband did this to me, and refused to change, the relationship would be over. I know you're not totally innocent either, but there is no reason to call the mother of your 10week old baby a cunt in front of your two children. None at all. Your children deserve better, and so do you. If you want to try and fix things, and you think that is possible, maybe try going to therapy? Or tell him you both need to sit down and agree on how you are going to talk to each other. Ask him what you do that bothers him that you could improve upon. Then tell him some of your requests. Take this seriously, and take trying to change seriously. If you don't you can't expect him to take it seriously either. If he fails to recognize the seriousness of the situation, and the need behind it, you may have to consider leaving. Unless of course you are fine with living like that the rest of your life, and having your kids learn that is the way they should live as well and communicate with others.", "controversiality": 0, "created_utc": 1442172664, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0bin7", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444339866, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "leftwinglovechild", "author_flair_css_class": null, "author_flair_text": null, "body": "You need some professional help, you both sound like you don't know how to communicate without swearing or attacking.\n\nBut I will say this, any man who can call the mother of his a child a cunt while his son is strapped to your chest is not worth your time. ", "controversiality": 0, "created_utc": 1442175086, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0d6wn", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444340652, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lutheranian", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree that you should be in therapy. I know you feel alone, but I want to offer one dissenting thing about everyone saying things about him not helping you out around the house:\n\nBeing a farmer's wife is a completely different culture because of the back breaking work that is involved, especially during harvest season. Do you think it would help if during the off season he took over everything involving the farm? Marketing and paying the bills, and you pick up the slack only when he's working the long days during the harvest? The farm is HIS business and by you doing things like marketing and bill paying you are essentially being a SAHM and a part time employee. \n\nAs for the communication, you both need to work on how you communicate with each other, because it's your way of showing how you respect one another. If you can't get that worked out you will end up just like your MIL unless you decide to leave. ", "controversiality": 0, "created_utc": 1442175137, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0d86h", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444340669, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "Communication is key.  You really need to work on how you communicate and how you fight.  You might want to start small.  Try to get both of you to promise not to name call or curse.  It takes a long time to figure out how to be together as a couple.  If you want to be with him and he wants to be with you, you need to be nice to each other.", "controversiality": 0, "created_utc": 1442176391, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0e2rz", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444341134, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wasH2SO4", "author_flair_css_class": null, "author_flair_text": null, "body": "If I were you, I'd get a divorce and sue for alimony and child support. If he really is treating you this way, he poses a danger to both you and your child. Even emotional abuse is still abuse.", "controversiality": 0, "created_utc": 1442177450, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0et8x", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444341480, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sofapenny", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh sweetie, This fucking sucks. I'm terribly sorry:( this is how my (in the process of becoming my) ex husband would treat me all the time. I finally just had enough. I hope Counseling helps:( ", "controversiality": 0, "created_utc": 1442179223, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0fyji", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444342021, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dallasdarling", "author_flair_css_class": "green", "author_flair_text": "one, more coming maybe?", "body": "Why in the world would you go to this thing anyway? What possible fun could you possibly have? Let him go to the game and you can stay home. And next time you want to go do something, he can stay home with the baby. You are parents with a newborn, you can't (and really, the baby's sake, you shouldn't) live like you before. \n\nThat said - he's being an asshole and taking out his anger and impatience in you is immature. He should know better and learn to control himself. If this is behaviour he learned from his parents, then the cycle needs to stop with him or your son will learn it from him. You don't want that. And don't back down on your expectation that he treat you respectfully. He can't just push your buttons and belittle ans abuse you when he's pissed off because it helps him blow off steam. Taking your anger out on other people is inappropriate and he is an adult. ", "controversiality": 0, "created_utc": 1442180819, "distinguished": null, "edited": 1442181096, "gilded": 0, "id": "cv0gygv", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444342491, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree and plan on it. It's hard to get to two counsellors a week with a newborn! Ah. ", "controversiality": 0, "created_utc": 1442183908, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0itin", "link_id": "t3_3kqyag", "parent_id": "t1_cv0bc7o", "retrieved_on": 1444343369, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "After each of our children we had tough periods of time. My expectations and needs changed just as his when we became parents. And we had a good ten years before having any children. \n\nThe first year you are still in the 'honeymoon' phase. \n\nI'd recommend the five love languages. It's a great read to help couples communicate. ", "controversiality": 0, "created_utc": 1442186013, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0k12i", "link_id": "t3_3kqyag", "parent_id": "t1_cv01wsz", "retrieved_on": 1444343939, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "airyesmad", "author_flair_css_class": null, "author_flair_text": null, "body": "I had this problem for a long time actually. My boyfriends empathy switch would immediately go into off position and he would say the most awful things. It was really, really bad. After 3 years of increasing severity, it was triggering childhood PTSD and I started getting violent. After that, I was ready to leave. I sat down and explained to him that I didn't like who I was and I didn't like who I was becoming. I told him that I didn't feel emotionally safe because he was purposely pushing my buttons with zero regard to how I felt, and that him not respecting my boundaries turned me into a monster. What made it worse was that he knew he was crossing the line and I was letting him for so long. I told him I felt that our relationship was toxic for the both of us and we agreed on a timetable that I would move out by the end of summer. He started taking medication that drastically improved his stability, and we both started seeing counselors on a weekly basis. Neither one of us actually wanted to end the relationship and we decided to try to make it work. If he takes something too far, I tell him he is \"crossing the line\" which signals to him that he needs to give me space and shut the fuck up. We have both been good about apologizing when we know we were out of line. We write notes for each other to take to counseling. We still have issues, believe me, but I don't feel like I'm living in hell. ", "controversiality": 0, "created_utc": 1442186106, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0k2x9", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444343964, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Krackersnacks", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel you so much on this. Although my husband and I don't speak as harshly to each other we were stuck in a bad cycle of communication that was really tough on our relationship. A lot of things sound familiar to me. My therapist recommended this book and it changed so much about how I think about things and how we communicate. I highly recommend it. Like, really. If you do one thing, please read this - it applies so much to your situation I can't even express the words for it. If I had your address I would send it to you - I feel that strongly about you needing this book.\n\n[Dance of Anger: A Woman's Guide to Changing the Patterns of Intimate Relationships] (http://www.amazon.com/Dance-Anger-Changing-Patterns-Relationships/dp/0062319043/ref=sr_1_1?ie=UTF8&amp;qid=1442186523&amp;sr=8-1&amp;keywords=dance+with+anger)\n\nIt's about how you'll never, ever be able to change him but you can change your reaction to him which can have the effect of breaking the cycle and also of giving you more control over your life and how you allow people to treat you.\n\nIt doesn't sound from my description like it would super fix things but it really, really does. By giving yourself permission to have power and by recognizing the cycle you are in with your husband *you* can change things. Nothing you say to him about his behavior will ever really make him change because you can't make another person change. You just can't. But, you *can* change how you react which over time will change the way he reacts to you. It will also give you control because you no longer worry about what his reaction is going to be to what you do. You do what you want, what makes you happy and don't worry about what he does. You have to do what *you* need to do and he does what he needs to do and you will start building a space in the middle for your relationship and communication. \n\nUg. The book is so much better than all of that. Please, please read it. ", "controversiality": 0, "created_utc": 1442187036, "distinguished": null, "edited": 1442188972, "gilded": 0, "id": "cv0kldt", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444344205, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Krackersnacks", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree about their mutual respect being so important. Although his language to her is unacceptable, it seems like her treatment of him is possibly just as terrible. They're both wrong and they're stuck. I don't think calling him out will fix it though, it will probably just make it worse since she also has a hand in their bad communication. \n\nShe needs to change the way she speaks to him - and more importantly - change the way she thinks about the situation entirely. She needs to take control over her life and her feelings about the situation rather than engaging in an escalating battle of nitpicking and disrespect. Just stop playing the game. By stopping the the cycle his behavior should change. (If it doesn't that's something else entirely, like abuse, but it seems like from above he feels that she's baiting him) They have a negative feedback loop happening and one of them is going to have to break it before they can communicate well with each other. There might actually be a lot of love, just a lot of frustration and very hurtful habits in how they communicate their anger with each other. By backing out of the cycle altogether (but not sitting back and just taking it) she takes control of the cycle and stops it on her own terms. \n\ni.e. If he's being obnoxious about her walking slow she'd be better to just say 'you go ahead and we'll meet you there' and keep her cool. She gets to do what she wants (walk slow) and he has the choice to go ahead or walk with her. He can't complain anymore and she shouldn't engage with him if he does. Just keep going at her pace and saying 'you're more than welcome to go on'. \n\n", "controversiality": 0, "created_utc": 1442187825, "distinguished": null, "edited": 1442189553, "gilded": 0, "id": "cv0l0fu", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvzm5", "retrieved_on": 1444344402, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "I totally agree with what you wrote", "controversiality": 0, "created_utc": 1442193401, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0o187", "link_id": "t3_3kqyag", "parent_id": "t1_cv0l0fu", "retrieved_on": 1444345895, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Just downloaded it onto my kindle and am reading while breastfeeding. Thank you!!!", "controversiality": 0, "created_utc": 1442201357, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0sfsj", "link_id": "t3_3kqyag", "parent_id": "t1_cv0kldt", "retrieved_on": 1444348003, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I absolutely agree. I didn't know what it would be like as I had never been but there was an air conditioned lounge area that I could've hung out in had we not had a blowout fight. It actually would've been fine. Not fun, but fine. Neither of us were really gung ho about it. \nWe are going to counseling tomorro and I'm going to bring up all of this. Thank you. ", "controversiality": 0, "created_utc": 1442201889, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0spwn", "link_id": "t3_3kqyag", "parent_id": "t1_cv0gygv", "retrieved_on": 1444348136, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I really hope so too because in my heart of hearts I believe he is a kind soul. ", "controversiality": 0, "created_utc": 1442201921, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0sqj8", "link_id": "t3_3kqyag", "parent_id": "t1_cv0fyji", "retrieved_on": 1444348144, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm no angel. I'm not excusing his behavior but my reactions can get pretty harsh. I want to try counseling as we both have major issues but made vows to each other and we have a child that I would rather raise together. ", "controversiality": 0, "created_utc": 1442201992, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0srvf", "link_id": "t3_3kqyag", "parent_id": "t1_cv0et8x", "retrieved_on": 1444348162, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "We just made this pact because of your post. Thank you. ", "controversiality": 0, "created_utc": 1442202018, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0sse5", "link_id": "t3_3kqyag", "parent_id": "t1_cv0e2rz", "retrieved_on": 1444348168, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Farming is a different WORLD that I had no idea about until I married into it. \nEven during the off season he is working 10 hour days, cleaning machinery and the grain setup, etc. This is a whole other battle. \nHe expects me to do it all. I understand he's working hard but I would almost rather us each work 9-5's than this. ", "controversiality": 0, "created_utc": 1442202151, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0sve0", "link_id": "t3_3kqyag", "parent_id": "t1_cv0d86h", "retrieved_on": 1444348207, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "We are going to couples counseling tomorrow and I am seeking individual counseling. \n\nI said, almost verbatim, the second part of your post to him tonight. He has a desire to Change and is apologetic. We will see. ", "controversiality": 0, "created_utc": 1442202234, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0sx2v", "link_id": "t3_3kqyag", "parent_id": "t1_cv0d6wn", "retrieved_on": 1444348230, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't know if I phrased something wrong but we only have one child. If nothing changes the marriage will be dust. Neither of us can live like this. We have therapy tomorrow. ", "controversiality": 0, "created_utc": 1442202316, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0synw", "link_id": "t3_3kqyag", "parent_id": "t1_cv0bin7", "retrieved_on": 1444348251, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree - I'm seeking individual counseling. ", "controversiality": 0, "created_utc": 1442202345, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0sz9c", "link_id": "t3_3kqyag", "parent_id": "t1_cv0bc7o", "retrieved_on": 1444348258, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "We are going to counseling to see what We can work out. ", "controversiality": 0, "created_utc": 1442202398, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0t08v", "link_id": "t3_3kqyag", "parent_id": "t1_cv08krx", "retrieved_on": 1444348271, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. We both have A LOT to work through. ", "controversiality": 0, "created_utc": 1442202484, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0t1wq", "link_id": "t3_3kqyag", "parent_id": "t1_cv01opa", "retrieved_on": 1444348293, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. This is the plan. ", "controversiality": 0, "created_utc": 1442202509, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0t2eb", "link_id": "t3_3kqyag", "parent_id": "t1_cv004x0", "retrieved_on": 1444348300, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Leaving would be really complicated with his newborn and me not having family or friends in this state. I have an honest desire to give it a go and see if we can make headway in counseling. ", "controversiality": 0, "created_utc": 1442202559, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0t3dr", "link_id": "t3_3kqyag", "parent_id": "t1_cuzyvrl", "retrieved_on": 1444348313, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "We had a strong relationship but were in the honeymoon stage. We did not know each other for long before getting married. We have counseling tomorrow and I'm bringing up everything. ", "controversiality": 0, "created_utc": 1442202636, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0t4sr", "link_id": "t3_3kqyag", "parent_id": "t1_cuzyltx", "retrieved_on": 1444348331, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hilarymeggin", "author_flair_css_class": null, "author_flair_text": null, "body": "Or just tell him you're recording. If he stops the verbal abuse, so much the better!", "controversiality": 0, "created_utc": 1442202975, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0tavt", "link_id": "t3_3kqyag", "parent_id": "t1_cv08ecv", "retrieved_on": 1444348412, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hilarymeggin", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not 100% sure, but I think keeping a written log of what he says to you may also be evidence. ", "controversiality": 0, "created_utc": 1442203116, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0tddr", "link_id": "t3_3kqyag", "parent_id": "t1_cv08a25", "retrieved_on": 1444348443, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hilarymeggin", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so sorry. It sounds just awful. \nI'm no angel either. I get nasty in fights. I get it. \nI just want to share some perspectives from my own experience:\n1. Communication and respect can get better, but slowly, with therapy, a lot of work on both sides, and a lot of talking,  over a long time. \n2. I don't think you can improve communication when you have a new baby, or during harvest time. That's a long time to live with the kind of communication you're describing. \n3. We were married for several years before having kids, and we got to go to counseling for years and make a lot of progress on communication. Once we had a baby, things still got really bad. But there was a foundation in there somewhere to build on. You had a baby really soon after you got married!\n4. FWIW, I've learned that my husband *really* hates if I push or pull or lead him anywhere, no matter how gently or subtly. It's a total trigger for him. \n5. Whatever he calls you when he gets mad at you is what your kids will call you when they get mad at you. Can you imagine that sweet  baby you're nursing calling you a cunt and telling you to shut the fuck up? Because that's what's coming on your current path. \n\n6. You guys are routinely treating each other with contempt. There's a really good book called the Seven Secrets of Making Marriage Work, and it identifies contempt as one of the \"4 horsemen of the apocalypse\" - the quickest way to destroy a marriage, and a predictor for all kinds of terrible things, including divorce, cheating, violence, illness and even STDs. \n\n7. Your kids get their foundation in relationships from ages 0-5 years old. If they are in a home with contempt, strife, despair and depression, that becomes their starting point in all of their future relationships. \n\nI'm sorry I don't have a comprehensive answer for you. If my husband treated me that way, I'd be out if the house the same day.  I'd take the kids to my sister's. \n\nI agree that change is possible in your marriage, but I know that's a matter of years.  I don't think you should be living with him in the meantime, with two children who need you and a happy home. \n\n", "controversiality": 0, "created_utc": 1442204615, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0u2dn", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444348792, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I only have one child, I don't know if I mistyped something because someone else said two children. Anyways.  I feel wimpy for \"not being out of the house the same day\" but I am not ready to throw in the towel.  We made vows and have a newborn who I so want to grow up with two happy healthy parents. \n\nI know I only have control over half of that. He's 11 weeks old and I don't want him to learn any bad behavior but I hope we have a little time to work on things before he is learning language, etc. \n\nHowever this may sound, I know my kid needs me A LOT and right now I am a stay at home mom and dad isn't around about 5 months out of the year. If I leave, I'll be working full time, run ragged and living in a different state shuffling him around for custody visits with his dad. That's not the life I want for him. It's a very hard decision. I want to give it a little time but also fear that change might take too long. ", "controversiality": 0, "created_utc": 1442206934, "distinguished": null, "edited": false, "gilded": 0, "id": "cv0v0np", "link_id": "t3_3kqyag", "parent_id": "t1_cv0u2dn", "retrieved_on": 1444349242, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lutheranian", "author_flair_css_class": null, "author_flair_text": null, "body": "Does the farm do well enough to where he could hire some part time help to do the things that he's having you do for the farm?  This might be something you need to bring up in therapy.", "controversiality": 0, "created_utc": 1442237296, "distinguished": null, "edited": false, "gilded": 0, "id": "cv13ou8", "link_id": "t3_3kqyag", "parent_id": "t1_cv0sve0", "retrieved_on": 1444353377, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hilarymeggin", "author_flair_css_class": null, "author_flair_text": null, "body": "Whatever you decide to do, I just wanted to let you know that I hear you, and I care, and I'm on your side. :-)\n\nI hope it's okay if I clarify one small point though: everything I've read and learned says that babies start forming the foundation for their future relationships based on their environment beginning at age 0, not when they begin to understand words, or speak themselves. I think they understand it the way a dog understands it: somebody's yelling, the vibe is tense, it doesn't feel safe any more. Both of our kids have totally picked up on it when we were exchanging words, even as newborns. \n\nOne other point: are you assuming too much when you assume that you would have to work full time and be away from your baby? Do you have family or friends who might help or support you? Is it possible your husband might voluntarily pay support for you and your child even before you have a court order? \n\nYou just sound so unhappy. I know there are a lot of good reasons to stay. But you may decide it would be healthiest for you and the baby to go, even for a little while, and it may not have to be as black and white as you're thinking right now. Whatever you decide to do, you have options that might not be immediately apparent.\n\nI'm wishing you my very best, and sending hugs and prayers. \n\n", "controversiality": 0, "created_utc": 1442238750, "distinguished": null, "edited": false, "gilded": 0, "id": "cv14dy3", "link_id": "t3_3kqyag", "parent_id": "t1_cv0v0np", "retrieved_on": 1444353706, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "13goingon30", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like you rushed into things but that's in the past. I just wanted to point that out so the next time you will be more aware of a situation you could get into should you make hasty decisions. Especially now that you had a kid. \n\n\n\n\nWith that said, IMO, calling someone the 'C' word is the ultimate, most disrespectful. disgusting thing you could say to someone you supposedly love so please take this as a sign that this relationship is over. As frustrated as my SO gets with me, which isn't very often, he would NEVER tell me to \"shut the fuck up\" OR call me the 'C' word. In fact, we have talked about this and agreed that a relationship is pretty bad when you call someone that. As frustrated as I get with him, I am very aware of how I talk to him in public. We have both been in awful relationships where his partner emasculated him by talking down to him or being rude in public and I have also emasculated my partner by yelling at him in public or being rude. This comes with maturity and learning how things affect the other person (empathy.) It doesn't sound like your husband is improving from therapy. This would be very concerning to me. ESPECIALLY in front of my kid or other family members.\n\n\n\n\nAs hard as it is, I would think about leaving him. It's only going to get worse and if he starts drinking, that makes for a very violent situation. Get out now while it's easy and you can get a Summary Dissolution divorce. Draft up and ironclad custody agreement and move on. As many relationships as I have been in, I would NEVER allow someone to treat me like this, especially in front of my child and even left my ex husband because we had the same relationship where he called me names and called me a cunt once. Thank GOD we didn't have kids! Good luck and know that you have so much support. That's all it takes. The rest is up to you and the life you want to give your baby.", "controversiality": 0, "created_utc": 1442257783, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1g802", "link_id": "t3_3kqyag", "parent_id": "t3_3kqyag", "retrieved_on": 1444359971, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "13goingon30", "author_flair_css_class": null, "author_flair_text": null, "body": "They can NOT take your child away. Start getting evidence against your SO to show he's the one that's unfit. Document any abuse and call the cops every time a fight escalates. Get it in writing so you can use this in court. trust me it's a HUGE help. You have so many rights as a mother in a possibly abusive relationship. The state sides with you so much. Take advantage of that and don't be afraid of your in laws. ", "controversiality": 0, "created_utc": 1442257912, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1gb3e", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvohz", "retrieved_on": 1444360011, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "13goingon30", "author_flair_css_class": null, "author_flair_text": null, "body": "Continue breast feeding as long as you can. If you can't anymore, fake it until your court hearings are over. Nattommy is right, they will NOT take a child away from a mother that is breastfeeding. The same thing happened to my SO where the mother was abusive towards him and their son but she got way more rights than she deserved because she was breastfeeding and the court felt that a child has to be near the mother consistently AT LEAST the first 3 years.\n\n\n\nNever let your guard down. You already know this relationship is over. Start building your case now.", "controversiality": 0, "created_utc": 1442258063, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1gep7", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvygv", "retrieved_on": 1444360058, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "13goingon30", "author_flair_css_class": null, "author_flair_text": null, "body": "Well said. Agree 100%. Call him out as much as you can, especially via text. \"What you said was really disrespectful and didn't make me feel good.\" Etc.", "controversiality": 0, "created_utc": 1442258148, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1ggqg", "link_id": "t3_3kqyag", "parent_id": "t1_cuzvzm5", "retrieved_on": 1444360085, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "No, we are flat broke and the price of corn is shit right now. ", "controversiality": 0, "created_utc": 1442260506, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1i0u6", "link_id": "t3_3kqyag", "parent_id": "t1_cv13ou8", "retrieved_on": 1444360819, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. It's very hard and especially hard now that things are \"back to normal\". When things are good they're really good but when they're bad they're terrible. ", "controversiality": 0, "created_utc": 1442260777, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1i7cj", "link_id": "t3_3kqyag", "parent_id": "t1_cv14dy3", "retrieved_on": 1444360904, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "It's so hard to consider leaving since I love him and want my baby to know his dad. Ugh. I agree the \"c\" Word is the most disrespectful thing you can call someone.", "controversiality": 0, "created_utc": 1442260924, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1iava", "link_id": "t3_3kqyag", "parent_id": "t1_cv1g802", "retrieved_on": 1444360950, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I'm pretty confident I can prove I am the sole parent that is responsible. Plus the breastfeeding thing. ", "controversiality": 0, "created_utc": 1442260978, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1ic5w", "link_id": "t3_3kqyag", "parent_id": "t1_cv1gb3e", "retrieved_on": 1444360967, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "You're welcome.  Good luck!", "controversiality": 0, "created_utc": 1442261338, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1ikql", "link_id": "t3_3kqyag", "parent_id": "t1_cv0sse5", "retrieved_on": 1444361079, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wasH2SO4", "author_flair_css_class": null, "author_flair_text": null, "body": "I understand how you feel completely, though I'm not sure I would personally feel obliged to tolerate that particular type of hurdle exactly because I grew up watching my parents do that. \n\nDid things get a lot worse when the baby was born? Has he said anything about where his behavior comes from besides seeing his parents treat each other that way? I'm just wondering; does he think it's normal or is he stressed by some other factor? It's hard to imagine any child growing up wanting to repeat that kind of thing.", "controversiality": 0, "created_utc": 1442264166, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1kfwh", "link_id": "t3_3kqyag", "parent_id": "t1_cv0srvf", "retrieved_on": 1444362024, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "leftwinglovechild", "author_flair_css_class": null, "author_flair_text": null, "body": "Best of luck to you!", "controversiality": 0, "created_utc": 1442266126, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1lope", "link_id": "t3_3kqyag", "parent_id": "t1_cv0sx2v", "retrieved_on": 1444362611, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "He is stressed by work and his family (the same thing). His parents own a large farm. ", "controversiality": 0, "created_utc": 1442267112, "distinguished": null, "edited": false, "gilded": 0, "id": "cv1may6", "link_id": "t3_3kqyag", "parent_id": "t1_cv1kfwh", "retrieved_on": 1444362901, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}