{"submission": {"author": "DorkothyParker", "author_created_utc": 1309601980, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_5gjb7", "created_utc": 1445017691, "domain": "nytimes.com", "full_link": "https://www.reddit.com/r/Mommit/comments/3p0le5/overselling_breastfeeding/", "gilded": 0, "id": "3p0le5", "is_self": false, "locked": false, "media_embed": {}, "num_comments": 76, "over_18": false, "permalink": "/r/Mommit/comments/3p0le5/overselling_breastfeeding/", "retrieved_on": 1450727013, "score": 25, "secure_media_embed": {}, "selftext": "", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "default", "title": "Overselling Breastfeeding", "url": "http://www.nytimes.com/2015/10/18/opinion/sunday/overselling-breast-feeding.html?mwrsm=Reddit"}, "comments": [{"author": "adoreandu", "author_flair_css_class": null, "author_flair_text": null, "body": "Some really excellent points, thank you.", "controversiality": 0, "created_utc": 1445020090, "distinguished": null, "edited": false, "gilded": 0, "id": "cw24bt2", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447010619, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I totally agree that how we \"sell\" breastfeeding is pretty screwed up. If our society really wanted improvements in breastfeeding rates, then women would be paid for pumping breaks, they wouldn't be forced to come back to work so early, there would be better breastfeeding education (less \"breastfeed because it's healthy and you're a bad mom if you don't\" and more \"here's how to breastfeed\", \"here are common issues and how to troubleshoot/fix them\", \"this is what's normal\", and \"here are some common myths dispelled\") and they wouldn't be guilted into breastfeeding out of fear of judgement or that their child would be unhealthy if he/she ate formula. There would be significantly better treatment of women post-partum, instead of asking them to be \"back to normal\" basically right after birth. ", "controversiality": 0, "created_utc": 1445022514, "distinguished": null, "edited": false, "gilded": 0, "id": "cw25y8z", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447011385, "score": 43, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "almost665evil", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing! I was told from the day my son was born that exclusively breastfeeding would not be easy/possible for me. It wasn't even something I thought about while pregnant. I figured, if I could, great! If not, that's okay. Everything changed once my son was born. I felt like I didn't get a choice. They threw a nipple shield at me, lactation consultants paraded in and out of my recovery room and were poking at me and my son for days. Ultimately, he never latched and I have been exclusively pumping (and supplementing once a day). My son is happy and healthy at 3 months, but I struggle with feeling like a good mom whenever I have to supplement. It is so hard to find peace with decisions we have to make (or want to for that matter). And I am tired of having to justify formula when I am trying my hardest (including waking up at 3AM every night to pump when my son has slept through the night for weeks).\n", "controversiality": 0, "created_utc": 1445024267, "distinguished": null, "edited": false, "gilded": 0, "id": "cw274gf", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447011937, "score": 11, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "spinzard", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;Parents on the Christian right might see breast-feeding as a sign of the rightness of heterosexual marriage, with different roles for men and women, and some feminists believe it is an emblem of female empowerment and the life-sustaining force of female bodies.\n\noh, please. this article is awful. Hand-picking research that supports your cause, claiming that breastfeeding accessories are \"big business\" as much as formula, boohooing about poor women not getting WIC as long if they breastfeed, when formula is, in fact, provided, this article is just ridiculous. I'll tell you the truths about breastfeeding, and they are not in this article:\n\n1. Breastfeeding is better for both mom and baby\n2. almost every woman can breastfeed with the right information and support (which many don't have)\n3. there is a ton of misinformation about breastfeeding in America and it causes a lot of failure \n4. it would be better for breastfeeding if women in America got longer maternity leave\n\nthe rest of this article is garbage.", "controversiality": 1, "created_utc": 1445025996, "distinguished": null, "edited": false, "gilded": 0, "id": "cw289xr", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447012479, "score": 12, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "beckolyn", "author_flair_css_class": "green", "author_flair_text": "Sabina (2/2012)", "body": "My daughter never latched properly. I pumped exclusively for 5 months and then I supplemented my milk with formula as she was eating more than I could pump. At 6 months I had to have a surgery that had a long recovery time and wouldn't allow me to pump anymore, so at that point my daughter went fully on formula. It's more important that a mother be healthy and sane to take care of her child than for that child to be exclusively breastfed. ", "controversiality": 0, "created_utc": 1445026211, "distinguished": null, "edited": false, "gilded": 0, "id": "cw28f2l", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447012547, "score": 17, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "AMerrickanGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "If we really cared about breastfeeding, the hospitals and doctors would be much more supportive in helping new parents learn how to do it and be successful. Many maternity wards just aren't set up to properly launch breastfeeding. It's all well and good to guilt a mother into feeling bad about breastfeeding when you haven't actually provided her with the tools and the time to actually do it.", "controversiality": 0, "created_utc": 1445029557, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2alji", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447013639, "score": 8, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaiserverbalbyrnes", "author_flair_css_class": null, "author_flair_text": null, "body": "You have a good point. I had my son on a Saturday and he was in the NICU for 3 months. The lactation consultant was there Monday through Friday during business hours. I learned how to pump from busy nurses. The consultant finally visited me the day I was going home. Also I went back to work right away so I would visit my son evening and weekends. There was never a lactation consultant available during those times. Thank goodness for the wonderful NICU nurses who helped me get everything figured out. While everything worked out, I can't say the lactation consultant had much to do with the success.", "controversiality": 0, "created_utc": 1445030433, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2b4ly", "link_id": "t3_3p0le5", "parent_id": "t1_cw2alji", "retrieved_on": 1447013888, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meanenoughworld", "author_flair_css_class": null, "author_flair_text": null, "body": "I have four children. The one that nursed the longest has the worst health of all of them by a wide margin. The one that nursed the shortest is the most artistic. The one that nursed the second longest is probably the smartest, however you want to measure that. The one that nursed the second shortest is the most compassionate.\n\nBreastfeeding is great, but in the end, the things that are going to give your child the best outcomes are financial and social stability.", "controversiality": 0, "created_utc": 1445030877, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2bed3", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447014015, "score": 20, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oatroot", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed women need less pressure to breastfeed and more ACTUAL support and help. Laws that support them to breastfeed their children (allowing them to stay home longer/nurse in public etc), better educated doctors and lactation consultants etc. \n", "controversiality": 0, "created_utc": 1445031141, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2bk3l", "link_id": "t3_3p0le5", "parent_id": "t1_cw25y8z", "retrieved_on": 1447014091, "score": 11, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bonjourtabby", "author_flair_css_class": null, "author_flair_text": null, "body": "The misinformation and lack of societal support are such big issues. I am lucky to be home with my 10 month old son, but if I'd had to return to a job at 6 weeks like so many American women, I would be shocked if we were still breastfeeding. And the misinformation unfortunately comes from trusted sources like our doctors. If I'd listened to my son's pediatrician I would have started spacing his feeds at 1 month old and who knows if we'd still be breastfeeding after that. \n\nIt makes me sad to think there are woman who wanted to breastfeed and didn't get to because they were told wrong information, or couldn't make it work with their work schedule.", "controversiality": 0, "created_utc": 1445031996, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2c2bs", "link_id": "t3_3p0le5", "parent_id": "t1_cw289xr", "retrieved_on": 1447014330, "score": 10, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bonjourtabby", "author_flair_css_class": null, "author_flair_text": null, "body": "At the hospital I was pretty much only shown how to latch my baby. So many common questions and myths could be addressed in a simple pamphlet, I don't understand why they don't have something like that. \n\nIt would have saved me so much worrying even if someone had just said to me \"it's totally normal for your baby to want to nurse a ton sometimes,\" but instead I was told \"don't feed him too often or he'll learn bad habits!\" ", "controversiality": 0, "created_utc": 1445032275, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2c87b", "link_id": "t3_3p0le5", "parent_id": "t1_cw25y8z", "retrieved_on": 1447014406, "score": 12, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "veronicasch", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously. Even with all my preparation and reading I had no idea what thrush was when I got it, so I spent all this time trying to fix baby's latch thinking that was causing my pain.. Obviously that did nothing and the pain got worse.\n\nThere is so much focus on getting a good latch, which is important, but I really wish they gave out broader information on breastfeeding.", "controversiality": 0, "created_utc": 1445033642, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2d0jx", "link_id": "t3_3p0le5", "parent_id": "t1_cw2c87b", "retrieved_on": 1447014777, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "That's unfortunate.  While I believe that every woman should at least try to breastfeed (as long as health issues are not present), no one should feel bad about their decisions.  My goal is to give as much info as possible so that families can make as an informed a decision as possible.  Unfortunately, I still struggle with those that choose to not even try, but that is my issue that I need to over come.  I think my biggest problem is I don't think people do their research plus they get bad advice from authority figures they trust.  I'm so sorry you feel like less of a mother because you obviously greatly care about your child and are trying so hard.", "controversiality": 0, "created_utc": 1445040204, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2gjie", "link_id": "t3_3p0le5", "parent_id": "t1_cw274gf", "retrieved_on": 1447016439, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "That's ridiculous.  And I assume that a lot of people can't afford to hire a private consultant or there isn't one.", "controversiality": 0, "created_utc": 1445040526, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2gpkf", "link_id": "t3_3p0le5", "parent_id": "t1_cw2b4ly", "retrieved_on": 1447016518, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "Upvote upvote upvote! I'm all for breast feeding, however, I am completely appalled by what I perceive as shaming women about our bodies and choices when it comes to feeding our babies.  And women aren't idiots! We don't need \"Breast is best\" stamped all over every package of formula like we're going to forget... Guess what-- some women make the conscious decision to formula feed--and that is their right, while others medically and/or situationally have no choice. \n\nEducating women and lobbying for better family leave is one thing, but the current campaign is downright hurtful when you are a mom just trying to do your best.  Formula is not baby junk food. I'm not debating the differences, but let's not exaggerate them. Babies live and thrive on formula, too. I breast fed for 3 months until going back to work and my health made it nearly impossible. Still angry about the time I spent lamenting my body's failings because of all the EBF propaganda out there making me feel like a shit mom.  The whole campaign needs a revamp. It's alienating and not helpful.", "controversiality": 0, "created_utc": 1445042180, "distinguished": null, "edited": 1445123508, "gilded": 0, "id": "cw2hjqg", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447016919, "score": 8, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "Hospitals are moving that direction. Most doctors don't know much about breastfeeding either. You really depend on your nurses at this point. I hate when people say \"if we really cared\" because there is a huge amount of OB nurses who DO care and have been trying to really implement these changes. The community just doesn't see this because a lot of the time it's happening behind closed doors. Many hospitals are moving \"baby friendly\" to create an environment that is essential to breastfeeding support.", "controversiality": 0, "created_utc": 1445043080, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2i0hv", "link_id": "t3_3p0le5", "parent_id": "t1_cw2alji", "retrieved_on": 1447017139, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree. The statistics and many claims this article states are inaccurate. Just another piece to ruffle the feathers of many moms out there. ", "controversiality": 1, "created_utc": 1445043448, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2i75v", "link_id": "t3_3p0le5", "parent_id": "t1_cw289xr", "retrieved_on": 1447017226, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Hebm317", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm honestly really happy with my decision to not breastfeed. My son would match just fine but wouldn't suck. I tried poking at him and undressing him but he just wouldn't suck. I also tried with and without a nipple shield. When I asked the nurse for a bottle she wouldn't bring him one. She said he still had some time left to produce a dirty diaper. My mom finally was the one to get her to bring me one. He drank from it with no problem. I continued to try for the next three weeks. I also tried pumping. To me it was just not worth it. I also like that he isn't attached to my body 24/7. If and when I have another one I don't think I will breastfeed. ", "controversiality": 0, "created_utc": 1445043503, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2i88g", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447017240, "score": 9, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "Excellent article, thank you for sharing! ", "controversiality": 0, "created_utc": 1445043630, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2iaj5", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447017270, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "random_phd", "author_flair_css_class": null, "author_flair_text": null, "body": "Most lactation consultant visits are covered by insurance.", "controversiality": 0, "created_utc": 1445047399, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2k6lf", "link_id": "t3_3p0le5", "parent_id": "t1_cw2gpkf", "retrieved_on": 1447018161, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fernyfantastic", "author_flair_css_class": null, "author_flair_text": null, "body": "The point about promoting \"breast pumping\" is really interesting. I had my daughter in Australia and am now living in NZ. Pumping as a normal, everyday part of breastfeeding is really unusual in both counties. Sure, occasionally pumping a bottle or two to leave with a carer to have a night out or using a pump to relieve engorgement or to provide for a preemie baby is common. But the public health system doesn't cover them (outside hospitals) and they aren't considered as much of a \"must have\" item as they seem to be in the US. \n\nIt is quite rare for women to feed their own babies a pumped bottle of their own breast milk while out in public too. Maybe acceptance - and legal protection of - breastfeeding in public helps with this. I've also only known one mother who exclusively pumped, and she had a baby with a cleft palate who needed a custom bottle nipple.", "controversiality": 0, "created_utc": 1445049453, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2l6xl", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447018637, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jules0072", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt this way at first but the guilt dissipated after a few weeks. I only pump 4-5 times a day now and supplement 20%. My partner works out of town, so I am alone with my 2 month old M-F. My sleep is more important to her than my boob juice. Since I don't get a break, I realized about a month ago that I can only do so much on my own before risking her safety. The exhaustion. I couldn't keep up. \n\nBut I hear you on the struggle within yourself. Hang in there, do what you feel is the right thing!", "controversiality": 0, "created_utc": 1445052767, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2ms54", "link_id": "t3_3p0le5", "parent_id": "t1_cw274gf", "retrieved_on": 1447019386, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "troublewithphysics", "author_flair_css_class": null, "author_flair_text": null, "body": "pumping is profitable. selling and renting machines for the companies and hospitals is a business. Yes, insurance companies pay the bill but someone made a profit which is why it is encouraged as a regular part of bf.", "controversiality": 0, "created_utc": 1445067903, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2rnmy", "link_id": "t3_3p0le5", "parent_id": "t1_cw2l6xl", "retrieved_on": 1447021747, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "AMerrickanGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Things haven't changed that much since I had my kids in the late 80s though. They were \"moving in that direction\" then too. It's going kinda slow. ", "controversiality": 0, "created_utc": 1445081643, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2ufbd", "link_id": "t3_3p0le5", "parent_id": "t1_cw2i0hv", "retrieved_on": 1447023053, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "And part of the problem is that's it's very dependent on where you give birth. My hospitals provided tons of resources for me.", "controversiality": 0, "created_utc": 1445084731, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2v6jc", "link_id": "t3_3p0le5", "parent_id": "t1_cw2c87b", "retrieved_on": 1447023409, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "That's good to know!", "controversiality": 0, "created_utc": 1445089791, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2wu2h", "link_id": "t3_3p0le5", "parent_id": "t1_cw2k6lf", "retrieved_on": 1447024254, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Psalm11814", "author_flair_css_class": null, "author_flair_text": null, "body": "Many women choose to not breastfeed, and that is absolutely fine with me.  There are many reasons why women choose not to breastfeed.  I breastfed all my children for at least a year.  But it wasn't always easy.  With some of my children, I had latching problems and it would be painful when I would nurse my child.  I don't know if lactation consultants are readily available everywhere, but that's who I contacted when things didn't seem to work.  Meeting with a lactation consultant worked wonders, and it truly helped.  She did it for free, and she offered to meet at my house or in her office.", "controversiality": 0, "created_utc": 1445091452, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2xi8q", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447024570, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Psalm11814", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel the same way.  I think women should at least try if there are no underlying health issues, but I feel like saying \"Why not?\" when they don't even give it a chance.  That's one of the reasons I would like to become a lactation consultant.  I want to be able to educate women on proper techniques on how to nurse their children.  I've nursed all my children, but there were times I had to use a LC, and I'm glad I did!", "controversiality": 0, "created_utc": 1445092342, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2xwem", "link_id": "t3_3p0le5", "parent_id": "t1_cw2gjie", "retrieved_on": 1447024756, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Psalm11814", "author_flair_css_class": null, "author_flair_text": null, "body": "Because of my job situation, I pumped with my first and second children.  My firstborn would only drink out of a bottle for a few months and then refused.  My second one refused from the beginning.  I'm just thankful that my job allowed me to be with my children and were very flexible with me.", "controversiality": 0, "created_utc": 1445092657, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2y1gd", "link_id": "t3_3p0le5", "parent_id": "t1_cw2l6xl", "retrieved_on": 1447024821, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DieSchadenfreude", "author_flair_css_class": null, "author_flair_text": null, "body": "Although breastfeeding is undoubtedly better for the baby, I agree with this article too. It's pushed a bit too much. I thought it would be easy to breastfeed my baby too....it's fucking not. It's pretty hard. I eventually quit at about 6 months because it was taking sooo much time between pumping and actual feedings. It was also making me exhausted; and no I wasn't anemic. Because if you want to take a nap while a helper cares for the baby (you are exhausted), you have to pump milk for the kid in advance. Well then your boobs are a little off because by the time baby is hungry next you will likely be a little overfull. This can then pace your production wrong. So unless you are there ALL THE TIME, your production can be off. Nipple confusion can also be an issue if you use a bottle for feeding sometimes too. Eventually my baby boycotted my nipples so I had to pump all the time. It felt like my entire life revolved around pumping. My life got instantly easier when we switched to formula at 6 months. There are good things about it don't get me wrong. The health benefits, feeling close, and of course helping with weight loss after birth. If our society was structured differently it might be a lot easier for women to breastfeed too. Traditionally in most cultures new mothers would not be expected to do much else but breastfeed, sleep and be brought food. Relatives and neighbors would be around to help. Most developed nations don't live like that anymore. A mother is often expected to return to work before she is even healed (depending on social/economic status). Then she has to find the time to pump at work, which is a HUGE physical drain....AND work. More than likely her baby is in daycare, with a relative if she's lucky.\n\nMy husband and I are lucky enough that we can afford for me to be a stay at home mom while our kids are little, but I still found breastfeeding complicating. I'll do it again....but likely not for more than 6 months. We don't have any helpers or family around us, so it was just us. I thought taking care of a baby and living place when my husband was working would be the easiest job ever; it's not. It gets easier AFTER breastfeeding is over.\n\nSo I guess while I'm still pro-breastfeeding, I really feel like people shouldn't pretend it's the easiest thing in the world. Admit it's hard already medical profession! Admit that in some cases the drains of breastfeeding are not outweighed by the benefits! And the new mother is the best person to decide that. I guess more than anything, I wish someone would make a decent formula. Even the organic stuff does not have the milk fat a baby is used to, but a plant based fat reintroduced to skimmed milk. As far as I can tell there is no actual reason for this production-wise, other than producers take the good parts of the milk to make cheese, cream, etc. It would be nice to find one honest formula that keeps with animal based fats.\n\nSorry for the rant....I feel better. ", "controversiality": 0, "created_utc": 1445096622, "distinguished": null, "edited": false, "gilded": 0, "id": "cw2zzrp", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447025741, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "raging_conch", "author_flair_css_class": null, "author_flair_text": null, "body": "I now EP , but the fervor around breastfeeding made me feel like a failure as a FTM. Logically it's basically the same thing but the deilvery is different. However, I still felt like crap when I couldn't get her to latch properly. Everyone simply insisted that we'll learn in 6-8 weeks (are you fucking kidding me) and that the intense pain was \"normal.\"  That I just needed to power through it and it would be SOOOOO worth it. I got so depressed with LCs and people telling me the same advice over and over and nothing working. I must have been a failure, everyone was telling me the same stuff and I clearly wasn't doing it right. No one told me that maybe I should switch to formula or do EP. Actual, no one even entertained the idea that breastfeeding wasn't working except my husband, ob and pedi. All the LCs and nurses simply said \"to keep working at it\" to the expense of my own sanity and I became depressed. I decided on my own to EP. I personally have found the EP community far more supportive than breastfeeding. In my experience, the breastfeeding community will consistently try and convince you to continue; they had a response for every issue I had. I felt like although they meant well, they were nudging me closer and closer off the ledge. ", "controversiality": 0, "created_utc": 1445098957, "distinguished": null, "edited": false, "gilded": 0, "id": "cw317ej", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447026313, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess it depends which hospitals you go to. Most of the hospitals in my area, including the one I work at are huge on breastfeeding support including putting their nursing staff through breastfeeding support education. We don't accept or give out formula samples or advertisements, and if the parents want formula because of troubles breastfeeding, someone sits down with them and tries to troubleshoot the problem. While OBs will probably never be breastfeeding savvy, and pediatricians are hit and miss, nurses nowadays are really pressured to be competent with helping moms start out and continue breastfeeding. ", "controversiality": 0, "created_utc": 1445099520, "distinguished": null, "edited": false, "gilded": 0, "id": "cw31iea", "link_id": "t3_3p0le5", "parent_id": "t1_cw2ufbd", "retrieved_on": 1447026456, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I think women should at least try if there are no underlying health issues, but I feel like saying \"Why not?\" when they don't even give it a chance. \n\nWhy? Not wanting to is just as valid as not being able to. And it's not really your business either way.", "controversiality": 0, "created_utc": 1445117145, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3bdor", "link_id": "t3_3p0le5", "parent_id": "t1_cw2xwem", "retrieved_on": 1447031174, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "I hate how formula is touted as almost poisonous. We've forgotten what used to happen to babies who had trouble breastfeeding--they died or became very ill due to failure to thrive. Formula is wonderful, convenient in its own way, not nearly as expensive as feared (unless baby has special needs but most don't), and--most importantly imo--allows moms *choice*. We remove that choice by coercing women into making the choice \"we\" think it best for her and her baby. Fed is best.\n\nI too stressed way too much about my supply and adding formula to our feeding. Combo feeding has made me a happier, more present mom (no pumping between feedings, etc). That's better than being a data point for someone else's cause.", "controversiality": 0, "created_utc": 1445118185, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3byfs", "link_id": "t3_3p0le5", "parent_id": "t1_cw2hjqg", "retrieved_on": 1447031510, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "It's encouraged because there's no paid maternity leave in the US. If there were, pumping wouldn't be as necessary because moms could stay home and breastfeed directly for however long they were allowed or desired. But as it is now, if you want to continue breastfeeding after you return to work, you have to pump. Companies make a profit because they correctly identified the need created by the confluence of breastfeeding propaganda and a lack of maternity leave in the US. ", "controversiality": 0, "created_utc": 1445118399, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3c2yv", "link_id": "t3_3p0le5", "parent_id": "t1_cw2rnmy", "retrieved_on": 1447031569, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you! We're so lucky to have choice in the realm of feeding our babies!! Formula is an important part of that.", "controversiality": 0, "created_utc": 1445118493, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3c4vx", "link_id": "t3_3p0le5", "parent_id": "t1_cw2i88g", "retrieved_on": 1447031595, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Psalm11814", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't ask women why they don't choose to breastfeed, and I don't ask women what their reason is to choose formula.  I have friends who breastfeed and those who don't.  For my friends that use formula, I try to help them out by giving them any coupons or whatever else.  And if my friends come to me about my opinion, then I'll share my experience with them.  If they try breastfeeding and it doesn't work out, I don't shame them for not breastfeeding.  I was just agreeing with the comment above mine, so I don't why you decided to comment on mine with a bit of hostility (I apologize if I'm just misunderstanding the tone of your post).\nWhat's wrong with naturally being able to produce nourishment for your baby?  If it works, then more power to mom.  If it doesn't,  I'm okay with that too. ", "controversiality": 0, "created_utc": 1445118755, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3ca8k", "link_id": "t3_3p0le5", "parent_id": "t1_cw3bdor", "retrieved_on": 1447031665, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1445119063, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3cgjl", "link_id": "t3_3p0le5", "parent_id": "t1_cw2gjie", "retrieved_on": 1447031747, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1445119292, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3cl62", "link_id": "t3_3p0le5", "parent_id": "t1_cw2gjie", "retrieved_on": 1447031807, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "I appreciate that you acknowledge that your own opinion about other women's bodily autonomy is something to overcome. It's definitely a start. ", "controversiality": 0, "created_utc": 1445119480, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3cp12", "link_id": "t3_3p0le5", "parent_id": "t1_cw2gjie", "retrieved_on": 1447031858, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "The language we use to frame this is shaming. \"Baby friendly\" because feeding formula is what...\"Baby hostile\"? Just say exactly what it is: hospitals that educate about breastfeeding. What's wrong with that? It's neutral language.  Instead, it becomes a judgement.", "controversiality": 0, "created_utc": 1445119760, "distinguished": null, "edited": 1445119947, "gilded": 0, "id": "cw3cumz", "link_id": "t3_3p0le5", "parent_id": "t1_cw2i0hv", "retrieved_on": 1447031932, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "I was responding to your desire to ask why. It's good that you don't, though. We're judged enough as moms, we don't need other avenues for perceived judgement, even if it is asked as curiosity.\n\nAnd I'm sorry if I was a bit hostile. I think women should do whatever they want in order to feed their babies...even if that means they never try to breastfeed despite being perfectly healthy and able. I don't like the attitude that they should at least try because it still comes off as knowing better/being coercive.", "controversiality": 0, "created_utc": 1445119873, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3cwta", "link_id": "t3_3p0le5", "parent_id": "t1_cw3ca8k", "retrieved_on": 1447031960, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "This isn't support. It's pressure. It is taking a woman's right of choice away from her. If a woman wants support, she should be free to ask for it. If she does not, why do we need to pressure her into doing what we feel is right? Again, acting like the alternative to breast feeding is giving poison. How dangerous is formula? How can it possibly be legal to use OTC without a prescription if its so unsafe to a baby that hospital staff have to refuse her formula and insist she \"trouble shoot\" to avoid it? ", "controversiality": 0, "created_utc": 1445120161, "distinguished": null, "edited": 1445120920, "gilded": 0, "id": "cw3d2qe", "link_id": "t3_3p0le5", "parent_id": "t1_cw31iea", "retrieved_on": 1447032038, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "What is the family leave like there? Because in the US, it doesn't exist for the majority of families... That means, working moms have no choice here but to pump if they want to EBF. In the US, we would apparently rather pay for breast pumps than family leave for a mother to focus on EBF. ", "controversiality": 0, "created_utc": 1445120430, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3d8bz", "link_id": "t3_3p0le5", "parent_id": "t1_cw2l6xl", "retrieved_on": 1447032110, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with you. I cringed when I read this:\n\n&gt;if the parents want formula because of troubles breastfeeding, someone sits down with them and tries to troubleshoot the problem.\n\nHow terribly condescending that must feel.", "controversiality": 0, "created_utc": 1445120703, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3de0c", "link_id": "t3_3p0le5", "parent_id": "t1_cw3d2qe", "retrieved_on": 1447032185, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Psalm11814", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok, I understand.  That's just my immediate thought process, but I don't dwell on it and hopefully, I'm not perceived as knowing better or being coercive.  I think because I'm enthusiastic or passionate about something, I can oftentimes come off as thinking my way is better.  But as long as baby is healthy and getting nourishment, I trust the mom is doing what's best.  Anyway, thank you for being gracious.", "controversiality": 0, "created_utc": 1445121532, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3dux8", "link_id": "t3_3p0le5", "parent_id": "t1_cw3cwta", "retrieved_on": 1447032406, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fernyfantastic", "author_flair_css_class": null, "author_flair_text": null, "body": "Minimum is 18 weeks state paid leave (at min wage, around $600 per week) but most employers give an additional couple months at some level of pay and allow up to a year with the remainder unpaid. Most women (who aren't self-employed or contractors) will take the full year or close to it. I'm particularly fortunate as a public school teacher to be able to take up ro 3 additional years of leave without pay after my 1 year of parental leave is up, but this is rare. \n\nSo yes, if you want to BF for a year here, you can do it without needing to pump. I realise the US still has a log way to go to support families having babies. I don't know how you guys do it. ", "controversiality": 0, "created_utc": 1445123573, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3f0s2", "link_id": "t3_3p0le5", "parent_id": "t1_cw3d8bz", "retrieved_on": 1447032955, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fernyfantastic", "author_flair_css_class": null, "author_flair_text": null, "body": "I hadn't thought of that aspect of it. How depressing!", "controversiality": 0, "created_utc": 1445123619, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3f1pl", "link_id": "t3_3p0le5", "parent_id": "t1_cw2rnmy", "retrieved_on": 1447032967, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "That is your own opinion. I never force, pressure or shame moms into breastfeeding. By trouble shooting I mean assessing why someone who wanted to breastfeed exclusively is now frustrated and asking for formula? Many times moms feel they \"have no milk\" or now their nipples are sore and they need help getting a better latch. I focus my care around what the mom wants. If she wants to breastfeed exclusively then I am going to educate her on evidence based practices that will help her reach her goal. If she wants to supplement and still breastfeed on the side, I will help her reach that goal. If she wants to use formula exclusively, I will educate her on best practice bottle feeding. The reason we call doctors to get a written order for formula is because there have been many cases nationwide of nurses feeding babies formula without parental consent, or parents over feeding their newborns and causing medical problems. For us, it's our way of documenting and tracking which employee gave what mom formula  and was she educated on feeding amounts, bottle hygiene, etc. there are MANY moms out there who wanted to breastfeed exclusively yet someone in the hospital has given their baby a bottle and made their breastfeeding relationship more complicated. I was one of those moms and after being fed two bottles behind my back, it took weeks to fix the nipple confusion and relearn how to latch. Instead of attacking those who try and support breastfeeding in the hospital, try and see it from another perspective. There are always bad eggs the that ruin it for everyone and give us bad name. Those so called \"boob nazis\" are out of line and I'm sorry that is how you feel. ", "controversiality": 0, "created_utc": 1445141470, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3odtk", "link_id": "t3_3p0le5", "parent_id": "t1_cw3d2qe", "retrieved_on": 1447037432, "score": -1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Baby friendly\" isn't solely about breastfeeding. In fact it also supports formula feeding. It's not a term I made up, it's a \"standard of care\" that a hospital has to go through with initial training and continued education. The hospital has to make a whole new policy about practices focused around family friendly and baby centered care. This involves supporting BOTH formula and breastfeeding moms. We are taught to educate about breastfeeding, and address the concerns if there are any, educate on bottle feeding techniques and appropriate feeding per child's age. \"Baby friendly\" has helped our hospital implement skin to skin (especially in the OR) regardless of feeding choice, helping our moms who choose formula realize that are not missing out on bonding because they chose to bottle feed, implementing an uninterrupted 90 minutes after birth (no shots, no taking baby from mom for assessment, etc). I'm sorry you took my comment so offensively.", "controversiality": 0, "created_utc": 1445141988, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3om3b", "link_id": "t3_3p0le5", "parent_id": "t1_cw3cumz", "retrieved_on": 1447037540, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't mean it condescendingly. If someone doesn't want to breastfeed, I'm all about that and support them. However, if a mom who was so set on breastfeeding exclusively becomes frustrated and requests formula because she may feel she has no milk, or isn't getting baby latched on well, or doesn't know how to tell if baby is transferring milk or not, etc. I will help them figure out what is going on and try my best for mom's to reach their goal.", "controversiality": 0, "created_utc": 1445142915, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3p0jf", "link_id": "t3_3p0le5", "parent_id": "t1_cw3de0c", "retrieved_on": 1447037729, "score": -1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1445178670, "distinguished": null, "edited": 1445179364, "gilded": 0, "id": "cw3z0nv", "link_id": "t3_3p0le5", "parent_id": "t1_cw3odtk", "retrieved_on": 1447042514, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1445179251, "distinguished": null, "edited": false, "gilded": 0, "id": "cw3zb6r", "link_id": "t3_3p0le5", "parent_id": "t1_cw3om3b", "retrieved_on": 1447042652, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "I was not being serious about getting a prescription for formula! That's very strange that there is such a widespread problem of nurses not respecting patients rights. I'll just share that I had a great experience at the hospital where we were, and ran into no boob Nazis there. I was offered choice and support with those choices. But I responded as such to your comment because it sounded like formula is made difficult for moms to access from the get-go. It seemed like restricting patients choice to an alternative that poses no actual danger. I'm not attacking people who support breastfeeding, I was responding to what sounded like those who pressure moms about EBF. ", "controversiality": 0, "created_utc": 1445181286, "distinguished": null, "edited": false, "gilded": 0, "id": "cw40csv", "link_id": "t3_3p0le5", "parent_id": "t1_cw3odtk", "retrieved_on": 1447043144, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "troublewithphysics", "author_flair_css_class": null, "author_flair_text": null, "body": "Canada has paid maternity leave yet pumping is very much encouraged and normalized as part of breastfeeding. ", "controversiality": 0, "created_utc": 1445189195, "distinguished": null, "edited": false, "gilded": 0, "id": "cw454xm", "link_id": "t3_3p0le5", "parent_id": "t1_cw3c2yv", "retrieved_on": 1447045397, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; If our society really wanted improvements in breastfeeding rates, then women would be paid for pumping breaks,\n\nAnd WIC or other programs that provide free formula should provide free breastfeeding/pumping supplies as well. I'm not advocating getting rid of the free formula, but it's no wonder many low-income women choose to formula feed when that's free, whereas pumping would require a neverending cost for storage supplies and breastfeeding requires nursing bras and breast pads. Because they're related to motherhood and babies, those things are expensive.", "controversiality": 0, "created_utc": 1445229609, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4uqd6", "link_id": "t3_3p0le5", "parent_id": "t1_cw25y8z", "retrieved_on": 1447057719, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;  I figured, if I could, great! If not, that's okay. Everything changed once my son was born. I felt like I didn't get a choice.\n\nI remember how every time I was asked during pregnancy how I intended to feed my kid, I'd reply that I wasn't sure, but when writing notes my providers would always write \"Breastfeeding\" under postpartum planning.", "controversiality": 0, "created_utc": 1445229829, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4utsm", "link_id": "t3_3p0le5", "parent_id": "t1_cw274gf", "retrieved_on": 1447057764, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "Rooming-in was the main perk I liked about \"baby-friendly.\" It wasn't so much because I was afraid of child abductions, but moreso that all newborns kind of looked the same to me, so I wouldn't even be able to tell if someone switched mine out for a different baby of the same race and approximate size.", "controversiality": 0, "created_utc": 1445229950, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4uvoz", "link_id": "t3_3p0le5", "parent_id": "t1_cw3om3b", "retrieved_on": 1447057790, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; However, if a mom who was so set on breastfeeding exclusively becomes frustrated and requests formula because she may feel she has no milk\n\nNext time around, I still intend to breastfeed, but I also intend to supplement with formula. While the medical community may say it's ok for a baby to lose 10% of their body weight, my crying and hungry baby disagrees. The nurses that we had also said that supplementation in the first few days does not negatively affect the baby's ability to latch and nurse.", "controversiality": 0, "created_utc": 1445230054, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4ux8j", "link_id": "t3_3p0le5", "parent_id": "t1_cw3p0jf", "retrieved_on": 1447057809, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Pumping as a normal, everyday part of breastfeeding is really unusual in both counties.\n\nI don't see how it's possible to not pump if you're a working mom who breastfeeds almost exclusively and doesn't work from home. I get that the US has relatively crappy maternity leave, but I'd also like the option to go back to work and not have to take maternity leave for the entire 1+ years that a child is breastfed.", "controversiality": 0, "created_utc": 1445230290, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4v0tb", "link_id": "t3_3p0le5", "parent_id": "t1_cw2l6xl", "retrieved_on": 1447057856, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "With WIC, it costs more to breastfeed than to feed formula-- WIC provides free formula, but doesn't help cover the costs of breastfeeding necessities (ie- storage bags or bottles, nursing pads, etc). Plus, pump breaks often affect job stability or the amount of paid time spent at work.", "controversiality": 0, "created_utc": 1445230595, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4v56g", "link_id": "t3_3p0le5", "parent_id": "t1_cw289xr", "retrieved_on": 1447057913, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "babblybrook", "author_flair_css_class": null, "author_flair_text": null, "body": "Trying to BF was too exhausting for me, since I never seemed to make enough for my baby. She could nurse for an hour and drain a full bottle of formula right after. I could barely get an ounce every time I pumped. I wanted to try to BF but I didn't have anything against FF, so it wasn't too hard on me emotionally to switch. I am not completely sold on the whole \"Breast Is Best\" slogan either, it just sounds like if you don't BF you are not doing the best you can. It doesn't work for everyone for various reasons.", "controversiality": 0, "created_utc": 1445233629, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4wa3f", "link_id": "t3_3p0le5", "parent_id": "t3_3p0le5", "retrieved_on": 1447058449, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "Such a scary thought! I always wonder how often that kind of stuff happened decades ago. ", "controversiality": 0, "created_utc": 1445240335, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4y7mh", "link_id": "t3_3p0le5", "parent_id": "t1_cw4uvoz", "retrieved_on": 1447059359, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kat5412", "author_flair_css_class": null, "author_flair_text": null, "body": "When you think about it...everything comes down to money. It's sad but true. ", "controversiality": 0, "created_utc": 1445252528, "distinguished": null, "edited": false, "gilded": 0, "id": "cw50xxt", "link_id": "t3_3p0le5", "parent_id": "t1_cw3f1pl", "retrieved_on": 1447060711, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kat5412", "author_flair_css_class": null, "author_flair_text": null, "body": "Even though I don't really need it right now, I applied for Wic bc I will be attempting to BF but with my first I had production issues so I ended up FF and I'm trying to be realistic about feeding with #2.\n\nWhen I told the nurse I was planning to BF but would probly end up FF she pushed BF so hard and just didn't listen to me. It was basically like \"I understand you want to FF, but BF is REALLY the best thing for baby...so here's a packet on BF and a bag that says breast is best on it and we'll just pretend like you didn't say those evil things.\" I was seriously offended. \n\nAnd honestly, I'm all for what's best for baby...but what about what's best for mommy? Don't I get any consideration? ", "controversiality": 0, "created_utc": 1445253005, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5127k", "link_id": "t3_3p0le5", "parent_id": "t1_cw2hjqg", "retrieved_on": 1447060767, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "At some level I agree, but until society makes it significantly easier for women in WIC to breastfeed, I would never suggest that WIC start taking away formula. In fact, I'm not sure that I would ever advocate that WIC take away formula. Just because I breastfeed doesn't mean that someone else should. All I want is for our society to fully accept breastfeeding, and make it easier on new moms to do so. I think from there breastfeeding rates will increase on their own. It's not my goal to eliminate formula, or to reduce it to only \"special cases.\" Of a woman doesn't want to breastfeed, regardless of whether or not she is on WIC, then I WANT her to have judgement free access to formula. It's not my place to judge.", "controversiality": 0, "created_utc": 1445256487, "distinguished": null, "edited": false, "gilded": 0, "id": "cw522f6", "link_id": "t3_3p0le5", "parent_id": "t1_cw4uqd6", "retrieved_on": 1447061241, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "OK, I didn't read your comment thoroughly enough. Yes, WIC should provide more breastfeeding supplies. They generally provide a pump but not storage bags, nursing bras, breast pads, etc. How is a working mom who is shoved back into the workplace at 6 weeks supposed to afford all of those things, if she qualifies for WIC in the first place!", "controversiality": 0, "created_utc": 1445256612, "distinguished": null, "edited": false, "gilded": 0, "id": "cw523yi", "link_id": "t3_3p0le5", "parent_id": "t1_cw4uqd6", "retrieved_on": 1447061261, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "Quite frankly, if a woman is low income, she probably has more shit to deal with than maintaining breastfeeding through stressful situations that those of us with food and financial security can't really imagine. I'm glad formula is free through WIC. I'm glad low income women have the choice to breastfeed or formula feed. I recognize that it's probably, more often than not, still not really a choice, because low income women tend to work the kinds of jobs that don't provide opportunities for pumping, etc. I think the lack of paid maternity leave and support for families in the US is appalling. But I'm glad WIC provides free formula. I'm glad it can eliminate at least one point of stress for low income families.", "controversiality": 0, "created_utc": 1445261628, "distinguished": null, "edited": false, "gilded": 0, "id": "cw542k8", "link_id": "t3_3p0le5", "parent_id": "t1_cw4uqd6", "retrieved_on": 1447062185, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;  Don't I get any consideration?\n\nOf course not. Moo. /s\n\nI'm currently pumping right now, lol ;)", "controversiality": 0, "created_utc": 1445261829, "distinguished": null, "edited": false, "gilded": 0, "id": "cw545xn", "link_id": "t3_3p0le5", "parent_id": "t1_cw5127k", "retrieved_on": 1447062230, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kat5412", "author_flair_css_class": null, "author_flair_text": null, "body": "Lmao. That made me smile. :)", "controversiality": 0, "created_utc": 1445261979, "distinguished": null, "edited": false, "gilded": 0, "id": "cw548kv", "link_id": "t3_3p0le5", "parent_id": "t1_cw545xn", "retrieved_on": 1447062265, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "Some of us low-incomers do breastfeed, y'know... And we would appreciate having subsidized supplies.", "controversiality": 0, "created_utc": 1445262963, "distinguished": null, "edited": false, "gilded": 0, "id": "cw54q3u", "link_id": "t3_3p0le5", "parent_id": "t1_cw542k8", "retrieved_on": 1447062493, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "It's great that you breastfeed! If it's your choice, then that is wonderful and I think you should be supported in that choice. I think women who choose to formula feed should feel supported too, and it seems like formula moms get shit on a lot for making that choice, whatever their reason.\n\nI grew up poor so I know how stressful it can be, even from my child-aged perspective. I can only imagine how stressful it is as a parent. So if free formula from WIC can decrease that stress in someone's life, then I am overjoyed it's offered.\n\nUnfortunately, much how things like paper towels and toilet paper are not provided through SNAP, I doubt material breastfeeding supplies (storage bags, etc) will ever be provided through WIC :(", "controversiality": 0, "created_utc": 1445265655, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5667u", "link_id": "t3_3p0le5", "parent_id": "t1_cw54q3u", "retrieved_on": 1447063176, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iamafish", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly, it's a bit similar to an addiction in the sense that once started, I can't easily stop. I don't want to risk mastitis with trying to stop (that would match withdrawal in the analogy here), so I just keep going... which then tells my body to keep making milk.\n\nNot that I want to stop now either, but it doesn't seem like an option for me to stop lactating. The lactational amenorrhea is pretty nice too.", "controversiality": 0, "created_utc": 1445266412, "distinguished": null, "edited": false, "gilded": 0, "id": "cw56mcu", "link_id": "t3_3p0le5", "parent_id": "t1_cw5667u", "retrieved_on": 1447063387, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SundaesAreHappiness", "author_flair_css_class": null, "author_flair_text": null, "body": "I am in the EXACT SAME place! I kinda want to stop and kinda don't. I've gotten used to it, and at this point, it seems easier to just keep going than to stop.\n\nI've started to not pay attention to my supply in hopes it will drop off on its own in time. I still pump at work because my son may as well benefit from me having gotten the flu shot, at least until he can get his own. But we've been supplementing with formula for over a month now and it's taken so much pressure off of me, it's wonderful. The more bottles my kid gets and the more interested in the world around him he is, the less he wants to breastfeed so that will help in time too, I think.", "controversiality": 0, "created_utc": 1445269563, "distinguished": null, "edited": false, "gilded": 0, "id": "cw58lsb", "link_id": "t3_3p0le5", "parent_id": "t1_cw56mcu", "retrieved_on": 1447064327, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "I gave birth in a baby friendly hospital and received zero advice about formula feeding despite all my forms said I'd be exclusively formula feeding. \nAll I got from the nurses was various-are you sure you don't want to try?-  -you could just do it for a few days- and a visit from a pushy lactation consultant who my husband had to firmly ask to leave. \nThe only people who were helpful and provided information were my OB and the pediatrician. \n\nIn general I was extremely disappointed since I believe it would be great to help women implement their feeding choices in the easiest and safest way possible without judging them. Alas the baby friendly initiative doesn't seem to be doing that. ", "controversiality": 0, "created_utc": 1445278765, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5esfx", "link_id": "t3_3p0le5", "parent_id": "t1_cw3om3b", "retrieved_on": 1447067242, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. That is terrible. I'm so sorry! I guess different hospitals implement it differently. We definitely encourage breastfeeding but if a mom comes in and says she wants to formula feed only, we try and only ask why once, (could be medically, such as breast cancer, medications, or abuse, personal preference, etc) It's a shame you didn't receive the support you deserve. May I ask what region you live in? ", "controversiality": 0, "created_utc": 1445282234, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5h57t", "link_id": "t3_3p0le5", "parent_id": "t1_cw5esfx", "retrieved_on": 1447068418, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "See I don't think the nurses should ask why a woman doesn't want to breastfeed (unless there is a medical condition they should be aware of). It's honestly none of their business and by the time she's given birth she has had nine months to think about how she will feed the baby and probably thought an it very carefully I don't think she owes anyone an explanation. \nI'm in a big city in the south of the US but I'm originally from Europe. ", "controversiality": 0, "created_utc": 1445282903, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5hlw0", "link_id": "t3_3p0le5", "parent_id": "t1_cw5h57t", "retrieved_on": 1447068636, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "I can only speak for myself and a few of my coworkers, but I am not poking and prodding to figure out your preferences and get in your business, I am assessing for any unmentioned medical conditions and for misconceptions about breastfeeding. Not only do many mom's with a medical reason not say anything up front, but sometimes there are misconceptions that we can help. More than you'd realize, I actually encounter mom's saying things like: \"My mother/sister couldn't breastfeed and they told me that I shouldn't even try, it runs in our family\", \"I wish I could, but my breasts are not large enough to breastfeed\" or last week I heard \"I have to get the MMR vaccine after birth. I thought I wasn't allowed to get the MMR and be breastfeeding at the same time?\". In 99% of those situations, mom's have been elated when I've explained that they had information that wasn't evidence based and could give it a try if they'd like. To me, I would rather ask that question and accidently offend someone than miss the chance to help someone out who wanted to breastfeed in the first place. I work with a population that has a higher rate underprivileged and uneducated people though, so it may be different in other areas where it maybe safe to assume people have researched and really thought about decisions like that.", "controversiality": 0, "created_utc": 1445289109, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5lsm5", "link_id": "t3_3p0le5", "parent_id": "t1_cw5hlw0", "retrieved_on": 1447070609, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1445290311, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5mkqi", "link_id": "t3_3p0le5", "parent_id": "t1_cw5hlw0", "retrieved_on": 1447070978, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "I still don't think it's the nurse's role to be honest. \nI made a birth plan with my OB. We discussed many topics including feeding methods. I decided not to breastfeed for a variety of reasons and was very confident in my choice but if for example I decided not to breastfeed because of past abuse it's definitely something I'd rather discuss with my OB who I've known for years as opposed to a someone I've never seen before, also I'd rather discuss it before hand rather than spoil a happy occasion such as the birth of my child with having to answer questions from a stranger that remind of something so painful. It's not a question of offending it's more about by asking you might be upsetting someone on a very special day of their lives. \n\nI'm rather confused though as to why someone who is very keen on the idea of breastfeeding doesn't just ask their doctor or indeed ask one of the nurses if they have any doubts like the ones you mentioned. \nIt would make everything easier. \n", "controversiality": 0, "created_utc": 1445291835, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5njbg", "link_id": "t3_3p0le5", "parent_id": "t1_cw5lsm5", "retrieved_on": 1447071436, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "The question is asked upon admission on our triage assessment questionnaire, not at birth. Even if the provider has discussed it with the patient, we don't see that unfortunately unless they have a paper birth plan they bring in. We hardly ever see a birth plan, and many don't even have a clue what they want to do for pain control when they come in. Probably just a difference in the patient population. Our providers may stop by if the patient is laboring for a while, but most of the time it's just a phone call to them to let them know what's going on. I push with my patients until it's time to literally have the baby. I wish my patients had more provider support like yours! ", "controversiality": 0, "created_utc": 1445292441, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5nwpr", "link_id": "t3_3p0le5", "parent_id": "t1_cw5njbg", "retrieved_on": 1447071612, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "christinecatherine", "author_flair_css_class": null, "author_flair_text": null, "body": "Not like in the US. I'm Canadian and most people don't get pumps through insurance and I've never known anyone to pump at work (I work in a healthcare which is mainly women). Myself and most other moms I know only have single pumps and pump occasionally.", "controversiality": 0, "created_utc": 1445295131, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5pi52", "link_id": "t3_3p0le5", "parent_id": "t1_cw454xm", "retrieved_on": 1447072364, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}