{"submission": {"author": "randomom", "author_created_utc": 1279596698, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_471mq", "created_utc": 1445181507, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/3p8gb1/i_cant_keep_my_toddler_safe/", "gilded": 0, "id": "3p8gb1", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 63, "over_18": false, "permalink": "/r/Mommit/comments/3p8gb1/i_cant_keep_my_toddler_safe/", "retrieved_on": 1450723275, "score": 56, "secure_media_embed": {}, "selftext": "I try so hard to baby proof. I try to think of everything. I'm not new at this. I have four kids and I have been a mom for over 15 years. I just feel like crying right now. It doesn't help that I'm pregnant and my hormones are a mess. If there is a penny somewhere in the house my toddler will find it. One second he is under my kitchen chairs taking the nuts and bolts off of the legs (choking hazard) and the next second he is in a corner playing with a spider. As I am writing this he has found his brother's mardi gras beads from a birthday party yesterday and he is putting them around his neck. He is constantly doing really dangerous things. I feel guilty. I watch him all day. People say I'm very protective and a good mom. Now he has an outlet cover and is trying to find an outlet to stick it in. I don't even know where he got it. I don't think that anyone realizes how many close calls I have had with him. I have pulled screws out of his mouth. I have caught him taking outlet covers out. He dissects the carpet  edges and plays with the carpet tack strips underneath. I have caught him attempting to plug things into various computer ports. I can't keep everything away from him. He has a metal play yard but he can climb out. I have multiple baby gates to create corridors in my house and he is learning to open them. I follow him around. I can't look away for a second. I can't sit down. I can't use the bathroom without him. He never stops climbing. He never stops falling. All day every single day. I am so exhausted. Why does he have so many instincts to kill himself? Why can't he enjoy toys as much as sharp pointy or tiny objects? He runs FAST in public. He will find stickers on shopping carts and try to eat them while we are shopping. He grabs cans off of shelves and knocks them down if I get close enough to reach myself something from a shelf. As I wrote this previous sentence I looked down. He just had something small in his hand. It's a tiny screw! NO! It's from what is supposed to be a baby safe helicopter toy. He has manged to get the screw out! I don't even know how! I can't believe I was just writing about this and he did exactly what I was writing about! Like I said I can't look away for a second. There is no point in writing. I'm just venting. I love my little boy and I can't lose him. I'm trying so hard to keep him safe but I am no match for him. I wish we had a designated room with no furniture or outlets and every toy in plain sight in a circle around me. I would shut us into the room and then he would be safe as long as we were in there.  ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I can't keep my toddler safe", "url": "https://www.reddit.com/r/Mommit/comments/3p8gb1/i_cant_keep_my_toddler_safe/"}, "comments": [{"author": "tkdbbelt", "author_flair_css_class": null, "author_flair_text": null, "body": "Welcome to motherhood. It's tough! I have two little boys...I've wanted so badly to wrap them in bubble wrap in a safe room. I dread the tree climbing days, the day they are allowed to walk to a friend's house alone, etc. Be strong momma. We can do it :)", "controversiality": 1, "created_utc": 1445181796, "distinguished": null, "edited": false, "gilded": 0, "id": "cw40myy", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447043277, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Hopecat", "author_flair_css_class": "purple", "author_flair_text": "B/G twins", "body": "Is it possible you have anxiety? It's pretty common for kids to get into things like you're describing. While not ideal, eating a screw will not cause you to \"lose him\". \n\nOn the other hand, you need to be able to let your guard down. Do you have a spot in your house you could create a room like you're describing? ", "controversiality": 0, "created_utc": 1445182243, "distinguished": null, "edited": false, "gilded": 0, "id": "cw40vrm", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447043392, "score": 28, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "happenstanced", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey. If it helps any, I noticed you said \"close calls.\"\n\nIt means you're watching him. It means you're aware. It means you're doing a good job. \n\nToddlers are the BEST at finding the WORST things to play with, sometimes. (I caught mine headed to the outlet with a key to \"unlock it.\" SCARY.) We do the best we can to childproof and it's an ever-changing situation. Every situation is an opportunity for a learning experience - for them AND us.)\n\nKeep on doing your best. There will be times you'll catch them with things in their mouth (read: fucking stupid Barbie toys, etc.) and just know it happens. \n\nTake a deep breath, realize you're being a great mom because your so concerned and keep an eye out for what he goes after, so you can do your best to either dissuade him or remove it, completely. Also, maybe try different toys, if you can. Sometimes, mine goes after dumb shit when she's bored with the selection. \n\nBest of luck to you. ", "controversiality": 0, "created_utc": 1445182635, "distinguished": null, "edited": false, "gilded": 0, "id": "cw413p4", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447043496, "score": 40, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "Kids get into stuff all the time. I ate a necklace AND hair gel as a toddler (according to my mother. We still have that necklace somewhere), and that's just the stuff my parents remember/caught me eating. I'm now a happy, healthy adult. No harm done. Relax, kids get into stuff, but most things won't kill them. Just put the really dangerous stuff well out of reach and chill.", "controversiality": 0, "created_utc": 1445183920, "distinguished": null, "edited": false, "gilded": 0, "id": "cw41ta3", "link_id": "t3_3p8gb1", "parent_id": "t1_cw413p4", "retrieved_on": 1447043831, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "saraoflaherty", "author_flair_css_class": null, "author_flair_text": null, "body": "90% of what you mentioned won't actually kill him, so there's that :) I have a kid exactly like you describe, he's #4 of 5 and the only one with a death wish. Just remember you want to keep him away from things that can actually kill him, like the electrical outlets, but things like climbing? He will do it, and he will hurt himself, and that's how eventually he will learn what should or shouldn't be climbed. He's 26 months now and I'm just shocked we haven't had an ER visit yet.", "controversiality": 0, "created_utc": 1445184243, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4203k", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447043920, "score": 8, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pinkfatticorn", "author_flair_css_class": null, "author_flair_text": null, "body": "My youngest is like this and I swear she gave me several grey hairs. I once found her on top of the fridge after I went to the bathroom one day. Another time she managed to get out of her baby proofed bedroom to climb on top of the counter and grab my meat cleaver. She then ran with the cleaver and then swung it down and it stuck into the linoleum in the kitchen. \n\nThere is only so much you can do really. You can baby proof, watch the kid as much as possible too, but sometimes theyre just insane little suicide monsters. It sounds like youre doing your best and that is all you can do really. Take a breath. ", "controversiality": 0, "created_utc": 1445185775, "distinguished": null, "edited": false, "gilded": 0, "id": "cw42xzd", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447044364, "score": 20, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pandadipose", "author_flair_css_class": null, "author_flair_text": null, "body": "2 days ago I was actively watching my almost 15mo as she was running around the room. In a split second she tripped and hit her nose on the tv stand, there were tears and blood everywhere....and a black eye. I felt like the WORST mom ever. HOW did it happen, I was watching her! It's just kids being kids, they get hurt and it kills us a little. Just keep an eye on him, keep the area tidy and make sure you know what to do if something happens (choking, CPR, numbers to call etc) I find being prepared for the worst helps be deal with things better :)", "controversiality": 0, "created_utc": 1445185879, "distinguished": null, "edited": false, "gilded": 0, "id": "cw430bm", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447044394, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MomSaysNo", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Insane little suicide monsters\". LOL. Sounds like my two year old. ", "controversiality": 0, "created_utc": 1445186456, "distinguished": null, "edited": false, "gilded": 0, "id": "cw43d79", "link_id": "t3_3p8gb1", "parent_id": "t1_cw42xzd", "retrieved_on": 1447044563, "score": 9, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "You poor mama! A meat cleaver! I feel for you!", "controversiality": 0, "created_utc": 1445187540, "distinguished": null, "edited": false, "gilded": 0, "id": "cw441oe", "link_id": "t3_3p8gb1", "parent_id": "t1_cw42xzd", "retrieved_on": 1447044883, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Prettyundead", "author_flair_css_class": null, "author_flair_text": null, "body": "I know it's hard to see the positives here, but it's the way I got through that stage. As we put it, our son had no sense of self preservation. Climbing, tumbling, disassembling, and eating everything. He was constantly getting I to everything, he was so curious and determined. But because of my vigilance, and because of YOUR vigilance, he'll be fine.\n\nIt's stressful, and I understand that. But think of that fantastic curious mind he has. He's a problem solver, a questioning builder. He wants to take it all apart and put it back together again and understand why it works. He wants to know why things fall down instead of up, and what sounds different objects make on every kind of floor. He discovering and he's devouring information from the world around him. Remind yourself of that next time you're having a breakdown over him eating your deodorant or trying to plug a phone charger into his ear or defying all forms of childlocks. \n\nMy son is five now and is still that kid. I can't leave him alone for too long, he is just as curious as he always was but now far more capable of trouble. BUT he also understands boundaries and rules now, which is a relief. He's just so bright, and eager to learn and be independent. He wants to know how to make his own noodles and wants to help change the tires on the cars. His mind is always working, it's my favorite thing about him. That's not to say that I don't still find him with foreign objects in his mouth or playing with bugs or peeling paint off the walls. I still have to watch him like crazy because he's curious and constantly needing stimulation. \n\nIt'll get better as he gets more communicative and receptive to instruction. Being pregnant makes it all seem so much more hopeless, I know. I'm 28 weeks now myself, and I go through my bouts of frustration and self doubt practically every other hour. Just take some time to watch that beautiful mind work and you'll come to see it as the positive that it is, that definitely takes the edge of some of frustration. ", "controversiality": 0, "created_utc": 1445187594, "distinguished": null, "edited": false, "gilded": 0, "id": "cw442zv", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447044900, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine is also 4 of soon to be 5 children. The idea of having a toddler and a newborn has been really stressing me out. Maybe I'm just too old for this stuff now. All of my other kids were spaced farther apart. Also I have an older son with ADHD and he is constantly leaving dangerous things down where the baby can reach. I feel like I'm constantly chasing after him too. I am so tired from this pregnancy and so overwhelmed. Also my husband doesn't help because he is always too tired from work and I have no one else to help me. I need a break! Good luck to you too. I know how hard it is to juggle things with many children. ", "controversiality": 0, "created_utc": 1445187944, "distinguished": null, "edited": false, "gilded": 0, "id": "cw44aue", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4203k", "retrieved_on": 1447045003, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank-you! ", "controversiality": 0, "created_utc": 1445187990, "distinguished": null, "edited": false, "gilded": 0, "id": "cw44bxk", "link_id": "t3_3p8gb1", "parent_id": "t1_cw413p4", "retrieved_on": 1447045018, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Lots of anxiety!  I have started seeing a therapist since I found out I am having a fifth child! I am going to have a newborn, a toddler, a young child with ADHD, a pre-teen with a temper, and a moody teen. It's overwhelming. As I was writing to you my toddler found a small plastic hook inside a toy and he knocked over a floor lamp btw. No room for a safe room. I wish. ", "controversiality": 0, "created_utc": 1445188260, "distinguished": null, "edited": false, "gilded": 0, "id": "cw44iaq", "link_id": "t3_3p8gb1", "parent_id": "t1_cw40vrm", "retrieved_on": 1447045101, "score": 13, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Iwearacape", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like you have one super smart little one there. The smartest ones are the most work. My youngest is just this way too, seriously. It's exhausting. I marvel at how much he is learning. His dexterity is phenomenal he can unscrew things under the chairs and such too. Yesterday I saw him with something in his mouth and when he gave it to me it was a 2 inch bold he took off, I don't know what. It's sitting in a cup waiting for me to stand on or sit on something that falls apart so I can replace it. \n\nSo you have a future engineer, or like in my case future stunt double. We call ours cute names Danger Mouse, Prince Precarious, OMG GET DOWN, because he has that thrill seeking gene. \n\nAll we can do is keep them as mental stimulated as possible, keep smart kid proofing, and hope we are there when he does something dangerous. I'm thinking I am going to take him to the Circus Arts place as soon as he is old enough, to give him a safe outlet for this energy. Also, we give him a lot of non toy things. Some of them work out great like old keyboards and mice and flashlights. We also let him have high chair time with things that need more supervision like the real computer keyboard and mouse. He has a piano keyboard he plays and lot of musical instruments. It's loud, but safer. ", "controversiality": 0, "created_utc": 1445188682, "distinguished": null, "edited": false, "gilded": 0, "id": "cw44smi", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447045237, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Limberpuppy", "author_flair_css_class": null, "author_flair_text": null, "body": "My 2 year old got ahold of a knife yesterday. I still can't figure out where he got it from. Of course when I asked for the knife he ran. Five minutes to get the knife away for him. My days are filled with a series of small heart attacks.", "controversiality": 0, "created_utc": 1445188855, "distinguished": null, "edited": false, "gilded": 0, "id": "cw44wup", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447045291, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pinkfatticorn", "author_flair_css_class": null, "author_flair_text": null, "body": "It was around 11pm when she got out and I was coming inside from letting the dog out. After I got her back to bed I just sat down and cried for about half an hour. I dont even want to think about if I had been a minute later coming inside. Thankfully she is 5 now and less insane, but still pretty fearless. ", "controversiality": 0, "created_utc": 1445189120, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4534p", "link_id": "t3_3p8gb1", "parent_id": "t1_cw441oe", "retrieved_on": 1447045374, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "You just need to get a sitter (teaching/early childhood education students from the local university are generally good candidates for this) and go sit at a cafe or bookstore, go get a massage, sit on a park bench, something to get you out of the house and away from the chaos.", "controversiality": 0, "created_utc": 1445193037, "distinguished": null, "edited": false, "gilded": 0, "id": "cw47pul", "link_id": "t3_3p8gb1", "parent_id": "t1_cw44aue", "retrieved_on": 1447046679, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Bette21", "author_flair_css_class": null, "author_flair_text": null, "body": "This sounds like my daughter. She's 21 months old and she fucking climbs everywhere. She got behind the tv, removed her nappy, pissed on a live extension lead. I don't know how she is alive. Literally every time I leave the room at the moment, she climbs something. I'm going insane. \n\nSo thank you for this. It's nice to know it's not just my daughter with a death wish.", "controversiality": 0, "created_utc": 1445193488, "distinguished": null, "edited": false, "gilded": 0, "id": "cw480ub", "link_id": "t3_3p8gb1", "parent_id": "t1_cw42xzd", "retrieved_on": 1447046824, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Feet2Big", "author_flair_css_class": null, "author_flair_text": null, "body": "[You're not alone with these problems.](http://www.smbc-comics.com/?id=3613)", "controversiality": 0, "created_utc": 1445194193, "distinguished": null, "edited": false, "gilded": 0, "id": "cw48h9u", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447047039, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Loriloo", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel for you mama. I have a feeling I'm headed there myself, with this rambunctious can't-please-her 6 month old. You're doing a good job. One thing that I could suggest, and its only a tiny thing but it might help make life a bit easier, is that I saw these plug covers that replace the entire assembly. You have to partially plug in whatever it is you're plugging in and then move it to the side. Like the face slides so that when nothing is plugged in, nothing can be stuck in there. I hope I'm explaining that okay. \nHang in there though. He will grow and get older and be interested in new things instead of constantly trying to put himself in the hospital.", "controversiality": 0, "created_utc": 1445194349, "distinguished": null, "edited": false, "gilded": 0, "id": "cw48l3c", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447047088, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "I have thought about getting those. It's just that there are so many outlets here. Money is an issue. I probably will be doing that next though. ", "controversiality": 0, "created_utc": 1445207573, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4hf5c", "link_id": "t3_3p8gb1", "parent_id": "t1_cw48l3c", "retrieved_on": 1447051317, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds nice! If only I had the money! I never get a break.", "controversiality": 0, "created_utc": 1445207690, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4hhsk", "link_id": "t3_3p8gb1", "parent_id": "t1_cw47pul", "retrieved_on": 1447051352, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "I know what you mean about small heart attacks. It's quite draining!", "controversiality": 0, "created_utc": 1445207759, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4hj9f", "link_id": "t3_3p8gb1", "parent_id": "t1_cw44wup", "retrieved_on": 1447051371, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Yours sounds just like mine. He has never seen anyone use a screwdriver and yet he has used \"tools\" to attempt to get screws out of things. He is way more advanced than his brother was at this age. He has some serious fine motor control. He also has come up with some complex ways to climb things. Too smart for his own good and fearless! I try to keep him busy with new things to try but he gets bored quickly.", "controversiality": 0, "created_utc": 1445208139, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4hrkl", "link_id": "t3_3p8gb1", "parent_id": "t1_cw44smi", "retrieved_on": 1447051479, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thatonegirl7878", "author_flair_css_class": null, "author_flair_text": null, "body": "You cant baby proof the world sometimes they just have to be taught ..", "controversiality": 0, "created_utc": 1445208395, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4hx90", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447051554, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "Got any mom friends? Maybe y'all could do a sitting swap, like they watch your kids for a day, you watch hers for a day, just so you can both get a break.", "controversiality": 0, "created_utc": 1445208497, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4hzgx", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4hhsk", "retrieved_on": 1447051583, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for reminding me that he has an amazing mind. He really does impress me. I hate to compare but honestly he is much more advanced than his older brother was at this age. He never stops exploring and testing and investigating. When he isn't trying to kill himself he just fills me with pride! Pregnancy is wearing me down. Sometimes I just feel so guilty for having another. I want to be able to give my son all of the attention he deserves. I know I will do my best but it's hard for now because the future is unknown. Good luck to you too!", "controversiality": 0, "created_utc": 1445208580, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4i1cv", "link_id": "t3_3p8gb1", "parent_id": "t1_cw442zv", "retrieved_on": 1447051607, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crazy_cat_broad", "author_flair_css_class": null, "author_flair_text": null, "body": "One of my nieces is/was like this. So many family photos where Hailey has a fat lip or a black eye or a chunk of her hair missing (the only one that was all about haircuts). Some kids are just that way I guess!", "controversiality": 0, "created_utc": 1445213436, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4l0ub", "link_id": "t3_3p8gb1", "parent_id": "t1_cw430bm", "retrieved_on": 1447053014, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like he loves building and taking things apart. Does he have any Duplo?", "controversiality": 0, "created_utc": 1445214351, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4lkao", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447053334, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kellaorion", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is exactly like that too! I don't have as much experience as you do, but I swear if I gave him a room full of toys he wok I'll seek out the most dangerous thing in the room to kill him.", "controversiality": 0, "created_utc": 1445215007, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4lyt8", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447053524, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BatShatCrazy", "author_flair_css_class": null, "author_flair_text": null, "body": "List of things I have found in my toddlers poop:\n\nA penny.\nA Lego head. \nA piece of plastic. \nA chunk of dog toy. \nA ring. \nA glow in the dark star.\n\nList of poetential death hazards I have found hidden in his room:\n\nA steak knife. \nA screwdriver. \nA corkscrew.\nA hacksaw. \nA broken frame. \n\nList of death defying acts he has committed in the past 6 months:\n\nClimbed the curtains like a rope. \n\nUnbuckled his belt in the store and jumped on the conveyor belt.\n\nUnbuckled his car seat while I was going 70 mph. Showed up in the middle of the front seats and said \"Wee!\"\n\nJumped off of the top of the slide. \n\nStole a bottle of lighter fluid from the store shelf and popped it open with his teeth before I noticed. \n\nFigured out how to unlock, open, and escape the back door. \n\nThose are all I can remember at this moment. Not even close to all that has happened. \n\nI have a 17 year old who has turned out great. I raised my sisters kids into adulthood. They are now parents themselves and are great.\n\nThis child is the most curious, active, and insane baby I have ever had. \n\nThings happen. The best you can do is make sure you are doing your best to ensure their safety. Some kids are just a bigger handful than others. Hang in there mom. :)", "controversiality": 0, "created_utc": 1445215548, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4mb77", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447053686, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Throwaway_Omegler", "author_flair_css_class": null, "author_flair_text": null, "body": "Just steer clear of MegaBlox!", "controversiality": 0, "created_utc": 1445223569, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4rfpn", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4lkao", "retrieved_on": 1447056101, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "zombriz", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my god, your child sounds amazing. And you made me feel a little guilty for being overwhelmed by my slightly less daredevil-ish, knife-obsessed 2 year old. ", "controversiality": 0, "created_utc": 1445224277, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4rwhy", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4mb77", "retrieved_on": 1447056321, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Wienderful", "author_flair_css_class": "lightcoral", "author_flair_text": "Livia, July 2014", "body": "I think it's great you're seeing a therapist.  I have anxiety problems that really spiked when I had my (first, and so far only) kid, who is now 15 months.  I'm also a therapist myself.  \n\nFrom your post, I see a lot of the following:  (i) feeling tired and overwhelmed now, (ii) overestimation of risk to your kiddo from these things, as most of them are not anywhere near fatal, and (iii) anticipation that it will only get harder when the 5th baby comes.  These are all great reasons to see a therapist!  I hope for you that you can (i) find a way, through friends or relatives, to get some time to rest and take a break for yourself, (ii) find a way to let the smaller issues (a screw, knocking over a lamp) go and only feel the need to focus on the big issues (putting things in electrical sockets), and (iii) find a way to stay in the moment bc we don't know what the future brings, and your toddler may mellow out soon or even change his behavior with the intro of a new baby, or not (the point is, we don't know!).\n\nTake care of yourself, mama.  ", "controversiality": 0, "created_utc": 1445230243, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4v02z", "link_id": "t3_3p8gb1", "parent_id": "t1_cw44iaq", "retrieved_on": 1447057847, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nakamura_branchevska", "author_flair_css_class": null, "author_flair_text": null, "body": "On the bright side, it sounds like you have a kid with an extra helping of smarts, initiative, and curiosity.  That's exactly the type of person you want around to help you in your old age :)", "controversiality": 0, "created_utc": 1445235187, "distinguished": null, "edited": false, "gilded": 0, "id": "cw4ws69", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447058686, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes he does and when he's not throwing them he does actually enjoy building. His favorite is a car you can put the blocks on.", "controversiality": 0, "created_utc": 1445268728, "distinguished": null, "edited": false, "gilded": 0, "id": "cw5827c", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4lkao", "retrieved_on": 1447064066, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "The only mom friend I stay in touch with has 7 kids! She works and her mom babysits. I couldn't handle her kids! Everyone I know works full time so no-one helps me. I do everything completely by myself and I always have. I have wished many times for a break. I have never had one. I have never had a massage or a vacation. I haven't gone out socially since a night in 2008 and that was when I just had the two older kids. ", "controversiality": 0, "created_utc": 1445269072, "distinguished": null, "edited": false, "gilded": 0, "id": "cw58a8x", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4hzgx", "retrieved_on": 1447064177, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Indeed. LOTS of redirecting!", "controversiality": 0, "created_utc": 1445269096, "distinguished": null, "edited": false, "gilded": 0, "id": "cw58atf", "link_id": "t3_3p8gb1", "parent_id": "t1_cw4hx90", "retrieved_on": 1447064184, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "Iirc one of your older kids is a teenager. Could they be trusted to babysit? Or your kids' school friends, maybe see if one of their moms (or the friend themselves) could babysit? Or if you have out of state family maybe send them off for a week with grandma? I know my boyfriend's parents put him on a plane to his grandparents on more than one occasion. Do you have a gym membership? A lot of gyms have childcare on site for members while they work out (my mom did this) and if you have a YMCA near you they run on a sliding fee scale iirc. You can drop off the tots and then go for a swim or take a class just to get some you time.\n\nEDIT: are you a member of a church? A lot have \"parents night out\" where they watch the kids/do bible study while the parents can go out and relax.", "controversiality": 0, "created_utc": 1445275199, "distinguished": null, "edited": 1445275443, "gilded": 0, "id": "cw5cdba", "link_id": "t3_3p8gb1", "parent_id": "t1_cw58a8x", "retrieved_on": 1447066102, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghastlycitrus", "author_flair_css_class": null, "author_flair_text": null, "body": "My grandmother called me \"miss fiddle fingers' because I was able to make trouble out of seemingly safe objects. I once opened her locked china cabinet while she watched and she still has no idea how I got it open.\n\nMy sister could get out of any 'safe' situation. Fenced in? She climbed it. Locked in? She found a way out.\n\nMy husband was so incredibly prone to bumps and bruises that his parents were always worried someone would call child services. \n\nSome kids are just trouble. Doesn't make us any less awesome.\n\nI am, however, *already* tearing my hair out trying to keep my own miss fiddle fingers out of things!", "controversiality": 0, "created_utc": 1445342411, "distinguished": null, "edited": false, "gilded": 0, "id": "cw69t80", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447082064, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "I would never trust teenagers with a baby. Their brains aren't finished completing pathways to the frontal cortex which is very important for making safe decisions. My oldest watches the baby for a few minutes at a time but no more than that. My mom is the only person I have as an optional sitter in an emergency but she works full time and is too tired to help me. The only childcare here is expensive and we are all the working poor here. I can't afford that luxury. I don't go to churches. I prefer educational learning for kids and adults. If I was rich or at least middle class I would hire a nanny! That would be awesome!", "controversiality": 0, "created_utc": 1445368267, "distinguished": null, "edited": false, "gilded": 0, "id": "cw6phaa", "link_id": "t3_3p8gb1", "parent_id": "t1_cw5cdba", "retrieved_on": 1447089579, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for your response. So my toddler fell into the corner of the wall today and cut his head badly. It took me one second to turn around and he was covered in blood. There was so much I couldn't tell where it was coming from at first. I applied pressure and ice for 15 minutes. It's quite deep but not very long so it looks like it won't need stitches. I just used a butterfly to close it. He has a big bruise though and it looks just awful. Just a normal day for me (sigh). ", "controversiality": 0, "created_utc": 1445368545, "distinguished": null, "edited": false, "gilded": 0, "id": "cw6pokw", "link_id": "t3_3p8gb1", "parent_id": "t1_cw69t80", "retrieved_on": 1447089739, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "Teenagers have been babysitting since the dawn of time. Their brains might not be \"done\" yet (a process that takes until age 25 I might add) they can follow directions. Surely you can trust them with say, him when he's asleep long enough to take a jog (my cousin trusted me with her kids at that age, one was younger than your youngest and nothing went wrong).\n\nSee if any churches have that though, and if they accept kids of non-members. Even if you aren't religious the much needed break would be worth it. Or could your mom take them on her off days? Even for just a couple hours. Or a trusted neighbor? You NEED a break. Plus you said you're seeing a therapist, who watches the kids during appointments? Could they watch them? Ask your therapist if they have any ideas. See if your town has some options for people who are lower income who need childcare. Just look around.\n\nEdit: also the connections are all there, the brain just hasn't finished a process called \"myelination,\" which basically is the neurons being insulated, increasing efficiency. So their frontal lobe is in fact connected to the rest of their brain or else they wouldn't be capable of things like speech.", "controversiality": 0, "created_utc": 1445375340, "distinguished": null, "edited": 1445375949, "gilded": 0, "id": "cw6unq4", "link_id": "t3_3p8gb1", "parent_id": "t1_cw6phaa", "retrieved_on": 1447092084, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "If my tot is asleep I'm asleep! I don't jog. I do take my little guy for stroller rides outside as long as it's not too hot or cold. I just can't do the church thing. I would be very uncomfortable and I wouldn't trust their judgement with my child. My mom will not take my kids at all even on her off days. No-one watches the kids during my appointments. The older kids are in school. My toddler comes to all of my appointments. This is why I can't make a dentist's appointment. My town/county does not have low income childcare. There is a program for working parents that discounts childcare but we can't afford that. By connections I did in fact mean myelination but I didn't mention it because a lot of people don't know what that is and I didn't want to sound pretentious. Still though the lack of maturation and experience in a teen is enough for me not to trust one with my son's life. Like I said I don't mind letting my daughter watch my son for little things like when I take the dog out, or need to unload the laundry, or water my garden. I just wouldn't leave her alone and go to a store or leave her for an extended period like an hour. She has watched one of the older kids for an hour max a couple of times but they require much less supervision. ", "controversiality": 0, "created_utc": 1445380220, "distinguished": null, "edited": false, "gilded": 0, "id": "cw6xvht", "link_id": "t3_3p8gb1", "parent_id": "t1_cw6unq4", "retrieved_on": 1447093606, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;Still though the lack of maturation and experience in a teen is enough for me not to trust one with my son's life.\n\nHow old is she? Seriously, I've babysat before as a teenager, and with kids about your son's age (my cousin's children) while my cousin and mom ran to gran lunch (this was maybe 30 minute total) and the worst that happened was her son sneezed and scared himself (and these children are into EVERYTHING... even now that they're older). You have GOT to relax, he is not going to die if you aren't there. Teenagers babysit ALL the time, hell my school library in middle AND high school had \"How To Babysit\" books students could check out. He's not a newborn, and if you go out after his bedtime (which I assume is rather early) then he'll be asleep the entire time. If there is one thing you really can't screw up is watching a sleeping toddler (I have done this, if your son is anything like my cousin's child, wear him out and he'll sleep through Armageddon).\n\n&gt; I don't jog.\n\nWhat about my suggestion of the YMCA? You bring in some proof of income and then they work with you on the membership costs iirc (one of my coworkers was talking about this) and they have childcare on the premises while you take a class (yoga, zumba, what have you), go for a swim (every YMCA I've been to has an indoor pool since it's getting cooler) with people who are trained to watch children, and the YMCA can SURELY afford really high tech childproofing (plus no overly sharp things in the room with the children). You don't have to jog.\n\n&gt;I just can't do the church thing. I would be very uncomfortable and I wouldn't trust their judgement with my child. \n\nWhy not? As a person who WAS one of those kids who got dropped off at \"parent's night out\" a few times, it's done by the Sunday School Teachers who watch children all the time. If it's because you aren't religious, neither am I in any meaningful way I'm just trying to find a way that you can get a breather from your toddler so you can, you know, breathe for 5 seconds. Or discuss with your therapist why you are SO AFRAID to leave him with another human being.", "controversiality": 0, "created_utc": 1445385221, "distinguished": null, "edited": false, "gilded": 0, "id": "cw70xvc", "link_id": "t3_3p8gb1", "parent_id": "t1_cw6xvht", "retrieved_on": 1447095050, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghastlycitrus", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh dear! Poor you!\n\nJust this morning my little girl was using the table to stand up, tried to sit down, then WHAM! Busted lip.", "controversiality": 0, "created_utc": 1445387812, "distinguished": null, "edited": false, "gilded": 0, "id": "cw72hwv", "link_id": "t3_3p8gb1", "parent_id": "t1_cw6pokw", "retrieved_on": 1447095783, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cl3ffa", "author_flair_css_class": null, "author_flair_text": null, "body": "i agree with most of whats been said here. I dont know how to say this in a non offensive way? but why are you having more kids if you're overwhelmed and can't even afford childcare for the ones you have?", "controversiality": 0, "created_utc": 1445436222, "distinguished": null, "edited": false, "gilded": 0, "id": "cw7lcyq", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447104809, "score": 8, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Why do I choose to have one/some/any/all of my children? For the same exact reason as everyone else. I was poor before I had kids. I have been poor my entire life. Us poor people aren't supposed to do the same things that the privileged do. We certainly aren't supposed to breed. It's sad that this is now the norm in Amercica. But I think I deserve my life to be fulfilled just as much as anyone else and the fact is no-one NEEDS kids. We want them. We want them despite health risks and financial situations. We sacrifice because we want them so badly. People even put themselves into poverty trying to have a baby with fertility treatments. I didn't choose to be poor. My mom worked hard full time to raise me. She still works very hard full time. My husband works very hard full time. He has always worked hard. We can't even afford one child honestly. Not many people can these days. Eventually I suppose only rich people will be allowed to have kids. Or instead people could try to understand poverty better and fight for the rights of the working poor. Anyway people with one child here can't afford childcare unless they are really well off. That's just reality. ", "controversiality": 0, "created_utc": 1445453982, "distinguished": null, "edited": false, "gilded": 0, "id": "cw7xhez", "link_id": "t3_3p8gb1", "parent_id": "t1_cw7lcyq", "retrieved_on": 1447110587, "score": -6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is 15. She is not ready to baby-sit a toddler. She knows she isn't ready and doesn't even want to. She zones out and makes dangerous mistakes sometimes which is fine but my toddler is a real human life and not a learning experiment for my teen. She is trying to learn and mature. I am proud of her. When she is ready for the responsibility I will let her baby-sit. She isn't ready yet. She is already going to be my birth coach. That's one heck of a privilege and responsibility. She is taking parenting classes next semester at her school too. She will be ready when she is ready. \n\nWe have no YMCA anywhere near us. I have only ever heard of YMCA in movies/television. \n\nWe don't have Sunday school teachers that babysit here. This is a small town. If you are a member of a church they have babysitting while you are in services. I'm not going to church. That would be torture not a break.\n\nI'm not afraid to leave my my son with another human being. I would leave my son with my mom but she won't do it. I have no other adult family members that can watch him. My grandma is in a rehab center. She can't even take care of herself or walk. I have some extended family that I never see. I have no siblings. My few adult friends work full time and are unable and unwilling to babysit. I would leave my son at a good daycare or with a nanny if I could afford one but I can't because I am not wealthy. I am afraid to leave my son with a stranger or an irresponsible teenager. I'm not sure where \"no to teens\" got confused with \"no to all human beings\" but this isn't the case. Not everyone has family, help, and resources. ", "controversiality": 0, "created_utc": 1445455175, "distinguished": null, "edited": false, "gilded": 0, "id": "cw7ycaa", "link_id": "t3_3p8gb1", "parent_id": "t1_cw70xvc", "retrieved_on": 1447110991, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "I was just trying to suggest some alternatives and it came off like they were available and you didn't trust them in your replies. Not having them is different. I was just trying to help because you sounded so overwhelmed and stressed. I wish you the best of luck and shall never bother you again.", "controversiality": 0, "created_utc": 1445462981, "distinguished": null, "edited": false, "gilded": 0, "id": "cw83xrb", "link_id": "t3_3p8gb1", "parent_id": "t1_cw7ycaa", "retrieved_on": 1447113634, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Seventh_Letter", "author_flair_css_class": null, "author_flair_text": null, "body": "I thought it odd you said \"i can't lose him\"...why would you lose him? I think you need some rest :)", "controversiality": 0, "created_utc": 1445490912, "distinguished": null, "edited": false, "gilded": 0, "id": "cw8jte4", "link_id": "t3_3p8gb1", "parent_id": "t3_3p8gb1", "retrieved_on": 1447121188, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't want him to die from ingesting a thumbtack or from falling from the top of the refrigerator. I dearly love him and I would not want to live anymore if I lost him. He is so dangerous. Two days after writing this topic he ran into a wall and cut his head badly. Within the two seconds it took to come to him his entire face was drenched with blood to the point where I had no idea where the cut was. Heads bleed a lot. It was deep enough for stitches but short enough that I decided on a butterfly band-aid. It took 15 minutes of pressure to stop the bleeding. It didn't help my morning sickness either. This is just a typical day. It's certainly exhausting. ", "controversiality": 0, "created_utc": 1445518859, "distinguished": null, "edited": false, "gilded": 0, "id": "cw8rt1s", "link_id": "t3_3p8gb1", "parent_id": "t1_cw8jte4", "retrieved_on": 1447125018, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cl3ffa", "author_flair_css_class": null, "author_flair_text": null, "body": "Well for the sake of your other kids please get some contraception after this one and focus on them. ", "controversiality": 0, "created_utc": 1445567321, "distinguished": null, "edited": false, "gilded": 0, "id": "cw9mp16", "link_id": "t3_3p8gb1", "parent_id": "t1_cw7xhez", "retrieved_on": 1447141484, "score": 8, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "That is an incredibly rude thing to say. I think ignorant people who don't understand the financial state of this country and the working poor shouldn't have children. Just because someone is poor doesn't mean they don't deserve the exact same fulfillment of family that some stuck up, snobby little smart ass thinks they are more entitled to. Just so you know most working poor people have college degrees and/or have served in the military. You are passing judgement on a large population of this country that have families, feelings, and value as human beings. Don't talk to me like I am some animal who needs to be spayed. Don't tell me how many children I should have. You need to be educated at the very least. I came here for support. You are despicable. ", "controversiality": 0, "created_utc": 1445614856, "distinguished": null, "edited": false, "gilded": 0, "id": "cwa4x69", "link_id": "t3_3p8gb1", "parent_id": "t1_cw9mp16", "retrieved_on": 1447150208, "score": -4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Also my daughter wanted me to tell you that I am a great mom even though we aren't rich. She said she would rather have an intelligent mom like me than an airhead like you. She said that you are just a bully and probably insecure. My kids and I have very open communication and a very close relationship. I may be a tired and overwhelmed mom but I'm also a very caring, supportive, and attentive mom. I listen to my children. I advocate for my children. They trust me and they are proud of me. They are well cared for and educated. They are talented and driven. Just because I can't afford daycare or a nanny doesn't mean I shouldn't have kids and my kids think so too!", "controversiality": 0, "created_utc": 1445617026, "distinguished": null, "edited": false, "gilded": 0, "id": "cwa6dcv", "link_id": "t3_3p8gb1", "parent_id": "t1_cw9mp16", "retrieved_on": 1447150890, "score": -5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cl3ffa", "author_flair_css_class": null, "author_flair_text": null, "body": "Not rude at all - I'm broke too and I wouldn't want my kids to live with it. I don't doubt you're a good mother but why put even more into the mix when you already have that many kids. Just unnecessary ", "controversiality": 0, "created_utc": 1445644969, "distinguished": null, "edited": false, "gilded": 0, "id": "cwanngc", "link_id": "t3_3p8gb1", "parent_id": "t1_cwa4x69", "retrieved_on": 1447159105, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "You assume that my kids are suffering simply because I can't afford the luxury of a daycare or a nanny? That IS rude. You are trying to tell me how many kids I \"should\" have? That's crazy! Just because I cannot afford luxuries doesn't mean my kids go without. I am a stay at home mom and my kids have ME raising them instead of strangers. Their needs are met! There is no aspect of their care that I neglect. This is my last baby due to my age but really that's none of your business. Don't tell me that my kids aren't necessary. You don't have the right to say how many lives are necessary. One can be too many and for some people a large family makes them happy. There is nothing wrong with that. I don't judge people based on how many kids I think they should or shouldn't have. I DO judge based on the stupid things some people say. I think people like you are unnecessary. ", "controversiality": 0, "created_utc": 1445645556, "distinguished": null, "edited": false, "gilded": 0, "id": "cwany6b", "link_id": "t3_3p8gb1", "parent_id": "t1_cwanngc", "retrieved_on": 1447159245, "score": -1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cl3ffa", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you're obviously insecure if you're getting so opinionated about a conversation on reddit. \n\nAnd if you're so stressed out about your damn toddler then maybe get off the Internet and actually look after him. ", "controversiality": 0, "created_utc": 1445649010, "distinguished": null, "edited": false, "gilded": 0, "id": "cwapr9h", "link_id": "t3_3p8gb1", "parent_id": "t1_cwany6b", "retrieved_on": 1447160097, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "You were the one that got opinionated. You commented rudely in the first place while other normal people were understanding. I'm not insecure I'm defensive and rightfully so. I can't believe you literally told me to use contraception! Don't you dare ever tell me what I should do with my reproductive rights. Don't you dare judge me as a mother or by the number of children I have. Don't you dare assume that my lack of wealth means my children are somehow neglected. I can watch my toddler and go on Reddit. It's easy to divide my attention because Reddit doesn't require sustained attention. Tons of moms are on here doing the same thing. You are just a nasty troll. You know nothing about me other than I worry about my child that I love tremendously and that I get overwhelmed wanting to keep him safe. ALL mothers, even mothers with only one child say the same thing. Well maybe not people like you. If you have children I feel sorry for them. I say that with no insecurity :)", "controversiality": 0, "created_utc": 1445650679, "distinguished": null, "edited": false, "gilded": 0, "id": "cwaqmmi", "link_id": "t3_3p8gb1", "parent_id": "t1_cwapr9h", "retrieved_on": 1447160508, "score": -6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cl3ffa", "author_flair_css_class": null, "author_flair_text": null, "body": "Cute \n\nEveryone here is thinking the same thing as me. Have a nice day. ", "controversiality": 0, "created_utc": 1445650843, "distinguished": null, "edited": false, "gilded": 0, "id": "cwaqpm7", "link_id": "t3_3p8gb1", "parent_id": "t1_cwaqmmi", "retrieved_on": 1447160547, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah I'm so sure the people here with big families or that want lots of children are thinking like you. You are so dense. I think you must have some kind of mental disorder. Who the hell reads a topic about how a mom worries about her toddler's safety and tries so hard to keep him safe and offers the advice of don't have more kids? It's just crazy and you know it. If moms with one child have the same concerns obviously it has nothing to do with numbers of children. It has to do with LOVE. Apparently this is something you wouldn't understand which is quite concerning considering you have children. ", "controversiality": 0, "created_utc": 1445692177, "distinguished": null, "edited": 1445692508, "gilded": 0, "id": "cwb3usy", "link_id": "t3_3p8gb1", "parent_id": "t1_cwaqpm7", "retrieved_on": 1447166873, "score": -7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Liuer_ck", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, I just read all the comments, and cannot believe my eyes. Someone cared about your situation, and you went all nasty. She stated simple truth. Having more children will make it worse if you're already physically and financially stressed, for you and your children, not for others. No one is going to stop you having more kids. No one said you were a bad mum and no one was judging you. It is your life. Looking at all the accusation you made towards the other person, funny enough, cannot apply to her, even a tiny bit, but perfect to yourself. So please do not use contraception, and go ahead and have as many kids as you like without daycare or babysitters and  while doing that stop ranting.", "controversiality": 0, "created_utc": 1446290843, "distinguished": null, "edited": 1446300291, "gilded": 0, "id": "cwjcrx9", "link_id": "t3_3p8gb1", "parent_id": "t1_cw7xhez", "retrieved_on": 1447312340, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "randomom", "author_flair_css_class": null, "author_flair_text": null, "body": "What the other NORMAL moms said was caring. We all worry about our children getting hurt and want to keep them safe. What she said was not caring. You are wrong about that completely. I don't believe you could have possibly read the comments and interpreted it that way. It's just impossible. You are either really bad at understanding what you read or you are just crazy. What she said was really screwed up. If you don't think so too then you are screwed up. All parents rant and worry. Parents that have one child, parents that don't have babysitters, parents that cannot afford daycare. ALL parents. There is nothing wrong with me worrying about my child. The number of children I have, my financial status, and my options for babysitting do not determine whether I have permission to \"rant\". To say otherwise IS judgmental and gives me every right to defend myself. I'm not going to tolerate you being wrong so don't expect me to think your words are anything but ignorant garbage. There's no way I can respect you when you can't recognize such obvious wrong on her part. Shame on you.", "controversiality": 0, "created_utc": 1446345174, "distinguished": null, "edited": 1446346006, "gilded": 0, "id": "cwk2i11", "link_id": "t3_3p8gb1", "parent_id": "t1_cwjcrx9", "retrieved_on": 1447324659, "score": 0, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}