{"submission": {"author": "nomad891", "author_created_utc": 1444526789, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_r36vt", "created_utc": 1446058051, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/3qlh7k/having_a_kid_is_a_game_changer/", "gilded": 0, "id": "3qlh7k", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 70, "over_18": false, "permalink": "/r/Mommit/comments/3qlh7k/having_a_kid_is_a_game_changer/", "retrieved_on": 1450700039, "score": 81, "secure_media_embed": {}, "selftext": "I thought I was ready for this but I was so blindsided. \n\nI thought 'we won't have sleep problems if she sleeps in the bed with me, babies like to be close to you.' I thought 'she won't need to cry if we meet all her needs'. Etc., etc. I thought we could handle this. I thought we could do it well and love her and be there for her in a way we never experienced with our own parents. I never knew how hard it was, how much it eats you up, and how it's the best thing in the world as well as the worst.\n\nI've been breastfeeding for 3 months, since she was born. That's getting up multiple times a night to feed her and rock her back to sleep. I'm there for her every moment of every day, playing, singing, rocking, bouncing, feeding, laughing, crying, changing, you name it. In these first months she's cried for weeks when we didn't know why, eventually to figure it out. Sometimes not. For the first month or two it's a thankless job, there is no emotional response on their part. Then they start to smile and laugh, and that makes 70-80% of the shitstorm better. She cries in the car seat and she cries in the stroller and she cries in the carrier. She won't sleep if you put her down so she's perpetually in my arms. It's beautiful and wonderful and so so hard. I eat with her sleeping in my arms, half my food ending up on her clothes. Sometimes it's funny, sometimes frustrating. She wakes up at night needing to be fed and I used to be able to put her down and she'd fall right asleep but now she needs to be rocked back to sleep for an hour. Sometimes you go a week and things seem awesome, she's calm and happy and sleeps well. Then you hit a growth spurt and all hell breaks loose. There are growth spurts and teething and sleep regressions and developmental things, some you don't know anything about and other instances that have no name. It's like groping your way through a dark hallway for months with no end in sight. Sometimes I feel like my life is over, I never have time for yoga again, never time for a hot bath. I won't be able to go out or even go for a stroller walk, and any sense of me has pretty much evaporated once she arrived. Everything is on her schedule and according to her needs, like a beautiful beloved tiny dictator. I spend hours rocking her, trying to get her to sleep, coffee gets cold (if I even get to it). Once she falls asleep, bam, she's up in half an hour, tired, but she wants to play. Go figure. Husband has to work nights because he wants to be there for us in the day. We don't go to sleep together anymore because he helps put us to bed and goes to his office to make up his missed hours. We give each other an hour break daily and I get anxiety about trying to fit my needs within that time. Shower? Nap? Shit just spent 10 minutes trying to decide what to do, 50 minutes left. Need to make dinner, ah a 'break' from the boob monster but wait, she wants to suck so I drop everything and hubby has to take over. I have to rock her for an hour again. She falls asleep, and wakes up once food is ready. We eat for 10-15 minutes while she's on the playmat (if she'll have it) and then it's back to rocking her to sleep again. You lay down to sleep yourself and she's up in two hours. Rinse, repeat. The dogs don't get much attention anymore which makes us feel like terrible people. I'm terrified I'll not sleep for the next 3 years and then have another kid so add on to that. Feels like my basic needs are of least priority now. And I'm lucky, I have a wonderful baby who isn't any sort of especially difficult and a husband who is super involved and supportive.\n\nBut it's also probably the biggest and best investment I'll ever work my ass off for. She will have had parents who were truly there for her, nurtured her. Hearing her first cry was incredible even though my birth sucked majorly. Seeing her look at me first thing in the morning and smile, priceless. Hearing her giggle, seeing her gaze at you lovingly, watching her be content with her life, her need for you as her comfort. I've never loved like that. She's my insides, my whole heart. \n\nIt's so, so incredibly hard and such a big jump, at least for me. It's a lot of doing what's best for her, and not much of doing things that you need to or may want to do. It's her 24/7 if you're home with them. I thought I knew so much, I never realized the astounding enormity of their newfound presence in your life. You can't go back, but you also don't want to. I'd love to just bunch up under my covers and hibernate for the next week. But even as I write this, little lady is on the boob, sleeping. It's overwhelming and depressing, it's beautiful and incredible. It's the best and worst thing you'll ever do. \n\nEnd rant. Thanks for hearing me out.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Having a kid is a game changer", "url": "https://www.reddit.com/r/Mommit/comments/3qlh7k/having_a_kid_is_a_game_changer/"}, "comments": [{"author": "AzumiChan31", "author_flair_css_class": null, "author_flair_text": null, "body": "Every baby is different. My first kid I was alone. She was a perfect sleeper, she didn't demand all of my attention, and was the happiest of babies.\n\nMy 2nd was a whole other ballgame. I breastfeed her for 2yrs. She wouldn't sleep alone, demanded boobs and attention 24hrs, doesn't like to be left alone (seriously no more private time in the bathroom) But she's amazingly smart!\n\nThank you for sharing your story. It gets better and when it does, I wouldn't be surprised if you want to do it all over again! Lol", "controversiality": 0, "created_utc": 1446058677, "distinguished": null, "edited": false, "gilded": 0, "id": "cwg7ab4", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447257999, "score": 13, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HISTORYBLAST", "author_flair_css_class": null, "author_flair_text": null, "body": "You should take her horseback riding.", "controversiality": 0, "created_utc": 1446061863, "distinguished": null, "edited": false, "gilded": 0, "id": "cwg9lwi", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447259094, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SiaMaya", "author_flair_css_class": "green", "author_flair_text": "2 year old girl", "body": "This is the truth of the early days. I think it's not talked about enough. I think it sets a lot of new parents up to feel like they are somehow failing. They aren't, of course. It's just really REALLY hard to usher life into this world and then help it stay alive and meet its needs before it figures out WTH is going on.\n\nIt gets better. I promise, it gets better. You are so close to being out of the weeds.\n\nMy daughter was an insanely high-needs baby. I literally could not ever put her down. I would sometimes go days without showers. My husband was blindsided and had no idea how to support me. He just worked and cooked and cleaned all the time. (Not to say that wasn't helpful! lol!) None of my friends had kids yet. I felt very alone. I found solace in other moms on the internet. I read all the books. I thanked the gods for Netflix and a paid maternity leave. Our whole lives got turned upside down and nothing will ever be the same. It's a big shock. It takes some acclimating and letting go of what once was. And then, they'll start crawling, and smiling more, and interacting with you, and walking, and running, and saying words, and before you know it you just can't imagine life any other way. You got this. Just keep swimming. It gets so much easier and more joyful as time goes on and their personalities emerge.", "controversiality": 0, "created_utc": 1446062181, "distinguished": null, "edited": false, "gilded": 0, "id": "cwg9ua4", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447259203, "score": 13, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Brandonite", "author_flair_css_class": "green", "author_flair_text": "DJ 29/09/2012", "body": "This sounds like me three years ago. Completely blindsided. My friend just had her first and when de was pregnant I was brutally honest with her and now she's doing an amazing job. Maybe she has an awesome baby or maybe just maybe she was mentally prepared. Either way I'm two weeks away from number two arriving and I'm at least prepared for the unexpected and the idea that things will get bad before they get good. ", "controversiality": 0, "created_utc": 1446063571, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgauu3", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447259682, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "peacelovinhippy", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is 8 weeks and I feel like you just wrote the story of my new life. We're incredibly fortunate in that our baby is easy and chill (as far as newborns go) and we both work part time. And even though we're so lucky, there's laundry thrown across my living room right now waiting to be folded, I ate a banana for dinner last night, and I haven't slept next to my husband in our bed for 2 months (I sleep on the couch, baby sleeps in crib next to me). \n\nI knew it would be hard, but nothing anyone tells you can prepare you for your new life. I couldn't ever have imagined how hard it would be, how selfless I'd have to learn to be, or the overwhelming love I would have for this tiny little person. It sucks and it's the greatest thing on earth. \n\nI'm deliriously tired and in tears now while I'm hooked to my breast pump lol. ", "controversiality": 0, "created_utc": 1446064102, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgb8w8", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447259866, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "EFIW1560", "author_flair_css_class": null, "author_flair_text": null, "body": "This is word for word how I feel, and how my baby is. Not particularly difficult or colicky, but still so challenging and amazing all at once. Thanks for writing this, it is 100% true for me. You took the words from my mouth.", "controversiality": 0, "created_utc": 1446065978, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgcmst", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447260584, "score": 9, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "antoninj", "author_flair_css_class": null, "author_flair_text": null, "body": "how does that help? it sounds like fun though", "controversiality": 0, "created_utc": 1446066607, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgd2wn", "link_id": "t3_3qlh7k", "parent_id": "t1_cwg9lwi", "retrieved_on": 1447260795, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "It's really nice to feel like I'm not alone in feeling this way. A lot of being a new parent is feeling so isolated, at least for me. I have some friends and acquaintances with kids but everyone just posts pics of their smiling babies (myself included) and no one talks about the dirty stuff.", "controversiality": 0, "created_utc": 1446066713, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgd5k1", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgcmst", "retrieved_on": 1447260830, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "EFIW1560", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! I think you're me lol", "controversiality": 0, "created_utc": 1446066890, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgd9yz", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgd5k1", "retrieved_on": 1447260887, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a friend coming to meet the baby tomorrow and we've been trying to get the kitchen clean for like two weeks now. I have at least 10 fruit flies flying around my living room and kitchen and there's enough food and dirt on the floors to feed an army. And I also pump for another baby, so I have to find time for that twice a day. The hardest is the nighttime and lack of sleep. I feel like it's never going to get better. I have to keep digging at the bottom of a dry well, hoping for more patience and more energy.", "controversiality": 0, "created_utc": 1446067011, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdd36", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgb8w8", "retrieved_on": 1447260929, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ChainsawJane", "author_flair_css_class": null, "author_flair_text": null, "body": "I know how you feel, I was there about a year ago. But in my case lets subtract the support and involvement from daddy.... I mean he stuck around, but he didn't really do anything to help out around the house, just went to work and came home to basically ignore us or leave for the gym to get away from the noise. It was pretty depressing. I finally got up one day and realized that I need to research, or something ,to lift my spirits a little... Found some good advice online about setting up consistent eat/play/sleep routines. I was able to go back to yoga, something you are feeling concerned about among many others, during her naps which I got down to consistent times of day. Was even able to shower and start planning meals a little better around her routine so that I could finally eat hot food again. The first few months are hard, teething and growth spurts are hard, *babies* are hard! But we love them. You are doing a great job.  Once your little angel starts being a little more playful you are going to have a blast I promise! And when she's old enough to start some baby cereals she's going to sleep better too. Hang in there, you got this! ", "controversiality": 0, "created_utc": 1446067057, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgde8i", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447260944, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm terrified at the prospect of another child. They are so worth it but I'm not sure I can make the conscious decision to 'lets have another!' anytime soon. I've heard the second is easier, but I can't imagine having what I have now plus a toddler..", "controversiality": 0, "created_utc": 1446067117, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdfqy", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgauu3", "retrieved_on": 1447260964, "score": 5, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "We just moved to a new state, too, about 6 months ago so I basically have no friends here. Netflix is a lifesaver for us too, though I often feel guilty for watching so much of it. We brought down the tv to the basement a long time ago in hopes of focusing more on life than getting caught up in shows, and I didn't want to end up having a tv kid, but now we watch on my laptop instead. I had so much time to myself before and now not a second. Even when my husband gives me a break with her, I feel like it doesn't help whatsoever. She's super cheery though, I adore the little beastie.", "controversiality": 0, "created_utc": 1446067267, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdjie", "link_id": "t3_3qlh7k", "parent_id": "t1_cwg9ua4", "retrieved_on": 1447261013, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! I will try to hang in there. The nights are the hardest, especially when you're already exhausted from prior lack of sleep and when you juuuuuust drifted off. God help me if I want to do it again anytime soon.. haha!", "controversiality": 0, "created_utc": 1446067340, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdlb2", "link_id": "t3_3qlh7k", "parent_id": "t1_cwg7ab4", "retrieved_on": 1447261036, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! I can't imagine how hard that must have been for you, seriously. I can't imagine having to do it all alone and then having your partner distance themselves. I hope you gave him a proper talk. We are about to start trying to implement some sort of schedule in hopes that it will help. She's a super smart, happy, playful, and lovely child all around. We're the ones who just are not used to keeping another human alive!", "controversiality": 0, "created_utc": 1446067509, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdpnw", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgde8i", "retrieved_on": 1447261094, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Glad I'm not alone! Not that I want other parents to suffer and all..", "controversiality": 0, "created_utc": 1446067568, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdr5s", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgd9yz", "retrieved_on": 1447261113, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SiaMaya", "author_flair_css_class": "green", "author_flair_text": "2 year old girl", "body": "I promise that watching Netflix while your kiddo is so young is not going to be detrimental to her, nor should it even count as screen time for the kiddo unless you're propping her up to stare at the tv for hours on end :)\n\nIt's just something to pass the time while you're stuck on the couch nursing on end.\n\nIt really does get better with time. Each stage has its new set of challenges, sure, but once they are moving around on their own and have a little more independence, you are going to start feeling your sanity return to you. Just gotta make it a few more months :)", "controversiality": 0, "created_utc": 1446067652, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdtdf", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdjie", "retrieved_on": 1447261142, "score": 7, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "EFIW1560", "author_flair_css_class": null, "author_flair_text": null, "body": "No but I totally get what you mean!! I'm here if you Wanna chat!", "controversiality": 0, "created_utc": 1446067909, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgdzvn", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdr5s", "retrieved_on": 1447261228, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks a lot!", "controversiality": 0, "created_utc": 1446068121, "distinguished": null, "edited": false, "gilded": 0, "id": "cwge57j", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdtdf", "retrieved_on": 1447261296, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!!", "controversiality": 0, "created_utc": 1446068136, "distinguished": null, "edited": false, "gilded": 0, "id": "cwge5lx", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdzvn", "retrieved_on": 1447261301, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ChainsawJane", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha yeah being responsible for someone's survival outside yourself is a trip. The routine is going to help you a lot I promise :) and your little ones old enough now that she can definitely handle it. It might even help her reduce any tired/cranky tantrums :) good luck friend", "controversiality": 0, "created_utc": 1446068557, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgeg3w", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdpnw", "retrieved_on": 1447261439, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Dartmouthy", "author_flair_css_class": null, "author_flair_text": null, "body": "THIS! 100% all of this. At 4.5 months now and this fully encapsulates the first 3 months. Thank you for writing it down so succinctly.", "controversiality": 0, "created_utc": 1446068779, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgelq9", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447261513, "score": 6, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "random_phd", "author_flair_css_class": null, "author_flair_text": null, "body": "Having a young kid is the best way to meet people in the same situation as you! Do you have a baby yoga or any other new moms programs in your town??", "controversiality": 0, "created_utc": 1446070551, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgfs7y", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdjie", "retrieved_on": 1447262069, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, but my baby hates the car seat. Screams like all hell broke loose, daddy tired out all efforts to keep her calm with her back there. But we did start a meetup group for our area and hoping to maybe take some first steps back to humanity that way. ", "controversiality": 0, "created_utc": 1446071056, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgg4ej", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgfs7y", "retrieved_on": 1447262229, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "controversiality": 0, "created_utc": 1446071070, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgg4rz", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgelq9", "retrieved_on": 1447262234, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks a lot!", "controversiality": 0, "created_utc": 1446071099, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgg5h4", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgeg3w", "retrieved_on": 1447262243, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1446071107, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgg5ny", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgeg3w", "retrieved_on": 1447262245, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Brandonite", "author_flair_css_class": "green", "author_flair_text": "DJ 29/09/2012", "body": "We hadn't decided until earlier this year. Now that my son is three he is more mature and will actually be able to help. Plus I'm used to  being at home and needed 24/7 now (took a long time to get used to that). It'll still be difficult but once they get old enough you realize how it usually gets better if you just wait a week.  I can't imagine multiples under 2 though!", "controversiality": 0, "created_utc": 1446073235, "distinguished": null, "edited": false, "gilded": 0, "id": "cwghkl9", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdfqy", "retrieved_on": 1447262912, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Roostergoat", "author_flair_css_class": null, "author_flair_text": null, "body": "My first was exactly this!! I was terrified to have another but my husband and I have always wanted a big family. My second is almost 4 months now and a completely different baby!! He hardly ever cries, he smiles and coos and loves his big sister so much. A lot of the time the two of them entertain each other and I just sit back and watch. He only nurses when he's hungry and sleeps just about anywhere. I didn't DO anything different this time around, its just all about the little personalities they're born with. ", "controversiality": 0, "created_utc": 1446073683, "distinguished": null, "edited": false, "gilded": 0, "id": "cwghuqk", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447263045, "score": 4, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "That's good to hear! My girl is pretty great, I just worry what my second one will bring lol.", "controversiality": 0, "created_utc": 1446075028, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgioxb", "link_id": "t3_3qlh7k", "parent_id": "t1_cwghuqk", "retrieved_on": 1447263440, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like your kiddos were timed well! I always wonder if it would be better to have them closer together and get the messy parts over with, or to wait until one is a bit older. We haven't quite figured out which would be better for us just yet, but I can't even think about getting pregnant again just yet. According to the state I live in, because I had an emergency csec with my first, my kiddos would have to be at least 18mths apart for me to be able to have a vbac (my preferred option). So as far as that goes, that decision was made for me (thanks, Obama). ", "controversiality": 0, "created_utc": 1446075213, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgit2b", "link_id": "t3_3qlh7k", "parent_id": "t1_cwghkl9", "retrieved_on": 1447263494, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "GneissGinger", "author_flair_css_class": null, "author_flair_text": null, "body": "I love this and feel the exact same way. I go back and forth between \"I regret everything that lead to his birth\" and \"he's the best thing that has ever happened to me ever\" . It's amazing how you don't expect to feel anything near how you feel. Thank you for sharing how so many of us feel!   ", "controversiality": 0, "created_utc": 1446075262, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgiu8g", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447263510, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Brandonite", "author_flair_css_class": "green", "author_flair_text": "DJ 29/09/2012", "body": "That's interesting. Well you'll know when you're ready if that's what you choose:)", "controversiality": 0, "created_utc": 1446075495, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgizob", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgit2b", "retrieved_on": 1447263580, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!!", "controversiality": 0, "created_utc": 1446075629, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgj2r3", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgiu8g", "retrieved_on": 1447263620, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alwaystryharder", "author_flair_css_class": null, "author_flair_text": null, "body": "Is it a bucket seat? Sometimes babies seem to like convertible car seats better... I'm sorry :(", "controversiality": 0, "created_utc": 1446077734, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgkg8e", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgg4ej", "retrieved_on": 1447264333, "score": 3, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alwaystryharder", "author_flair_css_class": null, "author_flair_text": null, "body": "Absolutely 100% how I feel. My little guy is only a month old. I'm writing this while hooked up to the pump for the 7th time today. It's exhausting and amazing at the same time. I was talking to a relative about it the other day and was talking about night times. It's soo exhausting to have to change him, feed him, get him to sleep and then pump. I get maybe an hour to two hours of sleep and then have to start it all over again. But when I'm feeding him and he looks up at me and just stares at my face and is like scanning me... It's amazing. I cannot wait till he starts smiling... Like that seriously is going to be even more amazing. Parenting is the toughest but most rewarding thing I've ever experienced and nobody. Nobody. Prepared me for it.", "controversiality": 0, "created_utc": 1446078158, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgkqky", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447264468, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nilbogresident", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh yes this was me in the first year! It gets better, I promise. My kids are 5 and 20 months. I now have time for yoga, showers, a semi-clean home, and semi-homemade meals. Just remember that every time in your life has a purpose, and right now that purpose for you is to ensure the baby's survival. It's a beautiful thing!", "controversiality": 0, "created_utc": 1446079150, "distinguished": null, "edited": false, "gilded": 0, "id": "cwglfk9", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447264796, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm afraid it's going to take 5 years until it gets better for me and until I have time for those things again. That would be awful. It is absolutely beautiful, however it's incredibly horrific at times as well.", "controversiality": 0, "created_utc": 1446083173, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgo5d3", "link_id": "t3_3qlh7k", "parent_id": "t1_cwglfk9", "retrieved_on": 1447266076, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eks", "author_flair_css_class": null, "author_flair_text": null, "body": "I was once told that parenting is \"agonizing in paradise\" (loosely translated to English). It's true. You/we are not alone:\n\nhttp://www.fowllanguagecomics.com/comic/welcome-to-parenting/\n\nBut the first years are the most problematic. I think. Or I hope. (Says a father of a 4y and a 1y).", "controversiality": 0, "created_utc": 1446083435, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgobro", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447266160, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "For us the hardest times were the first two months, then it got better. It's still really hard at times but it is definitely way better. After the smiles kicked in, there were a lot of them, and she was much happier most of the time. But during that first month or two there were some intensely hellish days and nights. All we could do was do our best, stay calm, and watch netflix when we could. If your baby is fine with it, put him in a carrier and go for a walk outside. Just keep your sights on the fact that this is going to be an awesome full sized human one day, and that this is a (terrible) investment into them being healthy and happy. That keeps me going. Fortunately Mother Nature gave us some instincts, so I'm thankful for those as well.", "controversiality": 0, "created_utc": 1446083559, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgoest", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgkqky", "retrieved_on": 1447266199, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Not sure what a bucket seat is. We have the maxi cosi.", "controversiality": 0, "created_utc": 1446083687, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgoi0z", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgkg8e", "retrieved_on": 1447266242, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "So funny, I just posted that same cartoon to my mommy blog yesterday. It's pretty much how I describe parenting to my kidless friends. Thanks, here's hoping.", "controversiality": 0, "created_utc": 1446083905, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgonhk", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgobro", "retrieved_on": 1447266314, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ridethelemniscate", "author_flair_css_class": null, "author_flair_text": null, "body": "You really summed it up..... I hope we survive this with some sense of selfhood intact! But also I cant stop thinking about her when I do get a break. I think the most ridiculous part is how you never sleep. But by the time the baby goes to bed you are like \"sleep? nah I'll stay up forever.\" And so you basically become some kind of walking zombie half human all the time and your sleep becomes super weird with crazy condensed dreams", "controversiality": 0, "created_utc": 1446083937, "distinguished": null, "edited": 1446084118, "gilded": 0, "id": "cwgoo9c", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447266324, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "PunkNPuss", "author_flair_css_class": null, "author_flair_text": null, "body": "I have two boys. One is 12 the other is almost 3 months. Based on this fact I may be crazy, but read on and take what you need and leave what you don't.\n\nMy oldest was the easiest baby. The youngest? A completely different ballgame. He is fussy and needy and I feel like nothing gets done sometimes.\n\nWear him/her. I bought a Baby K'Tan and I swear I can get things done when he wants to be held and loved on and I need to do things with my oldest. Within minutes he is out and I am able to do things. \n\nThe second thing I found out that totally makes sense with my son is The Wonder Weeks. Seriously, look this up. Every so many weeks your child may get fussy/needy/etc and it is due to them going through developmental periods. I checked in to this once my youngest just didn't seem to stop crying unless he was held for a solid week of me losing my mind. Thankfully a friend told me about this. Now I am paying it forward to you.\n\nThe last piece of advice. Put her down. Let her cry. Yes, it sucks, but as long as she is in a safe place, take a minute to brew yourself a cup of tea or take a hot shower and seriously just stand there. Just take deep breaths. It calms down... Sooner or later. I'm still waiting for the calm to come, but we have good days and days where he fights sleep... Omg the fighting of the sleep. \n\nYou are doing your best as long as you are good (I would say at your best, but who has time for that these days?). Hang in there momma! You've got this!", "controversiality": 0, "created_utc": 1446088600, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgro89", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447267802, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "greensthecolor", "author_flair_css_class": null, "author_flair_text": null, "body": "It really was a shock to me too. People always tell you what you're in for but I always figured they were exaggerating - I guess there's just no way to say it without sounding hyperbolius.\nMy son is now 14 months and I still haven't gotten back to the gym on a consistent basis, but we've been fine-tuning our routine and I'm having much more fun being a mommy now. He's freakin hilarious and snuggly and sweet and can entertain himself for the most part. Though I'm still breastfeeding/pumping at work,  I sleep through the night again, I eat dinner and pack lunch, I have sex regularly! I even picked up a novel and started reading again recently. Now I'm starting to wonder if we're crazy for thinking of baby # 2 already or if it wil be easier the second time around. It has to be - right?? I knew nothing about babies or what to expect a year ago. I've learned so much since then. It really does get easier and more FUN! All of your hard work and dedication will pay off a million fold, just keep at it! And don't sweat the small stuff!", "controversiality": 0, "created_utc": 1446089570, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgs7kb", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447268056, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LAG83", "author_flair_css_class": null, "author_flair_text": null, "body": "You are not alone. It gets better. I sometimes resented my husband because I was the one breastfeeding and he became too use to handing her off when she cried that I had to regulate a bit. She's 17 months old and I still breastfeed and it got SO MUCH EASIER. The bigger they get the bigger their bellies are and the longer they stay full. That goes for momma milk, formula and food. We're all here for you. I really loved the rock and play and swing. Everyday is different too so one day she liked the swing and the next she hated it. So just keep trying different things. Best of luck!!", "controversiality": 0, "created_utc": 1446091485, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgt5zw", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447268506, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alwaystryharder", "author_flair_css_class": null, "author_flair_text": null, "body": "An infant seat with a removable base. Sometimes babies just don't like the angle.", "controversiality": 0, "created_utc": 1446106240, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgy5op", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgoi0z", "retrieved_on": 1447270859, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alwaystryharder", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, it's funny how Mother Nature pushes you so far and then all of a sudden bam baby smile. Even if it's from gas or whatever I still love it.\n\nYesterday he barely slept all day long. He was super cranky all day because he was over tired. When he did sleep he slept in little cat naps and had to be held. Google tells me that it's probably a growth spurt... I hope so! I want my super easy going baby back from last week!", "controversiality": 0, "created_utc": 1446106414, "distinguished": null, "edited": false, "gilded": 0, "id": "cwgy72r", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgoest", "retrieved_on": 1447270876, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "missamberlee", "author_flair_css_class": null, "author_flair_text": null, "body": "My mother thinks I have the easiest, happiest baby because I only post smiling pictures and I don't tell her about the bad days. In fact, I have a picture of my daughter with the most enthusiastic grin on her face right after she had a poop blowout on my lap. Looks can be deceiving. :p", "controversiality": 0, "created_utc": 1446124083, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh37ai", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgd5k1", "retrieved_on": 1447273241, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "controversiality": 0, "created_utc": 1446130464, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh6rzr", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgro89", "retrieved_on": 1447274991, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "That's what worries me, that it will take SO long to get my life back, at least some of it. I've always had time to take care of myself and now I feel like I can't do that. I keep hearing that about #2 also, but it's kind of terrifying. What if it's not easier? I shudder to think.", "controversiality": 0, "created_utc": 1446130590, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh6ut7", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgs7kb", "retrieved_on": 1447275028, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks a lot!!", "controversiality": 0, "created_utc": 1446130616, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh6vfz", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgt5zw", "retrieved_on": 1447275037, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "aviendha36", "author_flair_css_class": null, "author_flair_text": null, "body": "It gets soooo much better. My LO is almost 11mo, and he's a busy little guy, exploring everything, getting into things, etc. Its great, and so much fun.  its such night and day. And you will miss things about the early days. I remember wishing him to get mobile - now sometimes I wish he would just stay where I put him! And he used to sleep on my chest all the time - he just doesn't really want to anymore, which was so cuddly - but now we cuddle in different ways. \n\nAnd don't get me wrong - its a HUGE adjustment! I used to wish to get back to work - so I had an identity outside of being \"Alex's mom.\" It took a while, but now I'm really starting to balance those sides of me. It takes time, its hard, but believe me, it gets sooooo much better. What I would recommend is get your hubby or your mom or your MIL or just hire a sitter - take a few hours off. If you're a SAHM, its not uncommon to put baby in daycare for a day/wk or hire a \"Mommy's helper\" for a few hours a week just so you can get away and have a break. ", "controversiality": 0, "created_utc": 1446130943, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh72w9", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447275133, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kfpirate", "author_flair_css_class": null, "author_flair_text": null, "body": "My first (so far only) kid turns 2 next week. Reading this reminds me of how completely insane the first three months of his life were. It felt like someone had just come through and burned my life to the ground and I was trying to put it back together while also learning how the hell to take care of a newborn. Every day had the highs and lows of an opera, except that I was actually experiencing them instead of just watching them.\n\nPeople told me this and it helped, even if I knew there was a chance they were wrong: it will get easier from here out. Not easy, mind you, but easier. \n\nAt some point you'll get an hour more of sleep than you had been, and at some other point you'll have time for a yoga class, and then, mark my words, you and your husband WILL eventually leave the house without your daughter, and it will probably feel really weird, like you forgot your head on the sofa, but hopefully also really great. You'll be glad to discover that you're still in there, after all. \n\n", "controversiality": 0, "created_utc": 1446131766, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh7lw6", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447275383, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dinahsaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey, I know how it goes with unsolicited advice, but I didn't see it mentioned anywhere - have you tried side laying nursing and not changing diapers at night? That was a game changer for me, just roll over, pop a boob in, and fall back asleep.  You can also try getting one of those angelheart monitors and putting her to sleep on her belly in a crib, I've heard that works for finicky sleepers.  Either way, she'll outgrow it, I promise!", "controversiality": 0, "created_utc": 1446133629, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh8uv5", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447275971, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "grumpycat11", "author_flair_css_class": null, "author_flair_text": null, "body": "it will get better!!  Do you have the baby on any type of schedule?  I was not getting any sleep, but then entered the magic merlin suit + babywise schedule, and it slowly worked!  I also use bio gaia drops... worth trying some of these things?  \n\n", "controversiality": 0, "created_utc": 1446134117, "distinguished": null, "edited": false, "gilded": 0, "id": "cwh96zj", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgdd36", "retrieved_on": 1447276130, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Trying to get her on a schedule. Magic merlin suit? Drops for what? ", "controversiality": 0, "created_utc": 1446141318, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhe8e1", "link_id": "t3_3qlh7k", "parent_id": "t1_cwh96zj", "retrieved_on": 1447278570, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "I did try nursing her on my side but I have a pretty intense letdown so that only chokes her. Same reason that I can't put her on her stomach, she sleeps on her side. I have to keep her somewhat upright, so I have to pick her up. We don't change her diaper until the morning. She used to sleep just fine this way, would eat and fall asleep right away no problems. It's recently that she is up the second I put her down. Thanks!", "controversiality": 0, "created_utc": 1446141452, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhec0f", "link_id": "t3_3qlh7k", "parent_id": "t1_cwh8uv5", "retrieved_on": 1447278617, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! How is it after the first 3 months, was there a change for you? Did it feel easier? Are the first 3 months an exceptional time?", "controversiality": 0, "created_utc": 1446141524, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhedvk", "link_id": "t3_3qlh7k", "parent_id": "t1_cwh7lw6", "retrieved_on": 1447278642, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! My hubby does help half the time and we do give each other an hour break every day but it doesn't seem to cover the amount of sanity time I need to recover from the daily shenanigans. Our moms live in different states and we don't really have friends here yet (just moved recently) and don't feel comfortable leaving her with a stranger. I'd literally freak out. Same goes for daycare. I'm more of an attachment parenting gal, which in turn does make it a bit more difficult by choice.", "controversiality": 0, "created_utc": 1446141762, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhek1v", "link_id": "t3_3qlh7k", "parent_id": "t1_cwh72w9", "retrieved_on": 1447278723, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nilbogresident", "author_flair_css_class": null, "author_flair_text": null, "body": "You know, I quit breastfeeding my second at nine months. The reason I did that is because I really, really needed my life back. I was a slave to the breastfeeding!  With a little bit of guilt, I switched to formula and life became happier for all of us. Now, I'm not advocating anyone giving up breastfeeding before they have to, I'm just saying that when you're in the thick of it, it's hard to see the big picture sometimes. And the big picture is a happy home life, in my opinion. You are doing a great job mom, and I promise that you will figure it out!", "controversiality": 0, "created_utc": 1446142334, "distinguished": null, "edited": false, "gilded": 0, "id": "cwheymu", "link_id": "t3_3qlh7k", "parent_id": "t1_cwgo5d3", "retrieved_on": 1447278913, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dinahsaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "Yuck, I can tell you though that she will figure out the letdown soon, though! When she gets a little bigger, she'll be able to handle it and it will make nursing sessions so fast, the end is near!  Until then, there's the squirt yourself into a towel until the milk stops then latch on method, it's a huge help with overactive letdown.", "controversiality": 0, "created_utc": 1446145838, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhhhd3", "link_id": "t3_3qlh7k", "parent_id": "t1_cwhec0f", "retrieved_on": 1447280101, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! I've figured it out for the most part, so has she. Propping her up and burping her frequently helps the most.", "controversiality": 0, "created_utc": 1446157373, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhp98c", "link_id": "t3_3qlh7k", "parent_id": "t1_cwhhhd3", "retrieved_on": 1447283830, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "controversiality": 0, "created_utc": 1446157399, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhp9sb", "link_id": "t3_3qlh7k", "parent_id": "t1_cwheymu", "retrieved_on": 1447283837, "score": 2, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "aviendha36", "author_flair_css_class": null, "author_flair_text": null, "body": "I do attachment parenting too - but I also have to work. :) I've found in general they're not mutually exclusive ", "controversiality": 0, "created_utc": 1446173815, "distinguished": null, "edited": false, "gilded": 0, "id": "cwhz296", "link_id": "t3_3qlh7k", "parent_id": "t1_cwhek1v", "retrieved_on": 1447288516, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Very true!", "controversiality": 0, "created_utc": 1446218799, "distinguished": null, "edited": false, "gilded": 0, "id": "cwiflwy", "link_id": "t3_3qlh7k", "parent_id": "t1_cwhz296", "retrieved_on": 1447296444, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pure543", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly how I'm feeling. I have a 4 month old, also sleeping on my boob right now. High five momma. You're doing great. ", "controversiality": 0, "created_utc": 1446223896, "distinguished": null, "edited": false, "gilded": 0, "id": "cwiizc1", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1447298098, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meganmaxinenicole", "author_flair_css_class": "brown", "author_flair_text": "SingletonBOY&amp;TwinGIRLS", "body": "This is what our mom's failed to tell us about newborns and infants. It gets better! And if you decide to have another baby, I can promise you that it's not so frantic, because I can look at my 5 month old girls and when I'm at my wits end and feel like I'm going to run out of energy, I can just look at my two year old and remind myself on how much easier it got when he turned about 6 months old, and it was a breeze when he was 1 year old. It's so much easier, and so much more fun to play with him or feed him, or put him to sleep than it is my twins. Hang in there momma! I promise you're going to get there &lt;3 ", "controversiality": 0, "created_utc": 1446483725, "distinguished": null, "edited": false, "gilded": 0, "id": "cwlr0wt", "link_id": "t3_3qlh7k", "parent_id": "t3_3qlh7k", "retrieved_on": 1449550892, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks, I really appreciate it!", "controversiality": 0, "created_utc": 1446484658, "distinguished": null, "edited": false, "gilded": 0, "id": "cwlrnve", "link_id": "t3_3qlh7k", "parent_id": "t1_cwlr0wt", "retrieved_on": 1449551192, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "greensthecolor", "author_flair_css_class": null, "author_flair_text": null, "body": "Pregnancy will certainly be harder. I have a feeling I'm going to be exhausted. My first (and only so far) pregnancy was kind of a breeze. I even went to the gym several night a week up until I was 34 weeks! I'm scared I'm going to gain a ton of weight this time and not be able to lose it. AND that my body won't be able to handle it as well because I'm older and more out of shape. So scary.", "controversiality": 0, "created_utc": 1446687613, "distinguished": null, "edited": false, "gilded": 0, "id": "cwow6qe", "link_id": "t3_3qlh7k", "parent_id": "t1_cwh6ut7", "retrieved_on": 1449605139, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nomad891", "author_flair_css_class": null, "author_flair_text": null, "body": "My pregnancy was a breeze too. The only 'issue' that everyone made into an issue was my baby being breech. I'm not so much worried about the pregnancy as I am about the changes that come after!", "controversiality": 0, "created_utc": 1446760743, "distinguished": null, "edited": false, "gilded": 0, "id": "cwpwvjv", "link_id": "t3_3qlh7k", "parent_id": "t1_cwow6qe", "retrieved_on": 1449622757, "score": 1, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}