{"submission": {"author": "eastwoodhs", "author_created_utc": 1399393218, "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "author_fullname": "t2_ggc4y", "created_utc": 1452433457, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/40bc2c/he_doesnt_want_another_baby/", "gilded": 0, "id": "40bc2c", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 71, "over_18": false, "permalink": "/r/Mommit/comments/40bc2c/he_doesnt_want_another_baby/", "retrieved_on": 1454990701, "score": 34, "secure_media_embed": {}, "selftext": "My husband will be 40 this month, and his dad recently passed. I THINK this is what has caused him to start thinking about his mortality, death, etc.\n\nWhen we married he was mid 30s and we had agreed on 2-3 kids and waiting 2 years to start having kids. It was closer to 3 years, we now have a 10 month old. We had said we would try for baby #2 right after a year.\n\nI noticed he has been in a mood lately, and yesterday I agreed that if he told me, I would just listen and not respond (that was his request knowing I wouldn't like to hear what he had to say). So he told me he doesn't want another child because he doesn't want to be an old dad, because he doesn't want to be in poor health when the kid is in their 30s, because he would never meet his grandkids- just like his dad never met our son. I listened and asked if we could have a discussion on this next year. Because I'm also not ready for baby #2 right now - I've gotta lose the baby weight or I'll have an at-risk pregnancy. Plus, I had promised just to listen and not discuss. \n\nBut you guys- I'm heartbroken. We had even agreed that if baby #2 was a boy we would try a 3rd time for a girl. Now, the thought of having an only child makes me so sad! I realize we are blessed to even have this little guy, so please don't think I'm ungrateful. It is just such a change in what I had always envisioned as my family. \n\nAny thoughts/comments/suggestions?  Could this just be a mid life crisis thing where his fears of not being around for his kids, change later on? He is in excellent shape &amp; health.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "He doesn't want another baby", "url": "https://www.reddit.com/r/Mommit/comments/40bc2c/he_doesnt_want_another_baby/"}, "comments": [{"author": "MCFF", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh man, after my mom died (well before I met my now husband and had our first kid), I went off the rails for quite some time.  It was just such a shock to me that nothing made any sense for a really long time. So I could see where your husband might be having such grief that he truly feels he doesn't want any more kids. It's a control thing, I think- evidenced by his references to his health in his 70s etc...i.e. \"Why set myself and my family up for pain like I'm experiencing now?\" Midlife crisis/mortality is a big factor as well. \n\nIs he experiencing depression right now? Would he be open to grief counseling? I really believe that can help but not everyone feels that way. \n\nI think you did the right thing tabling the discussion for now. Hopefully as time goes by and healing happens, he will rethink his position on more kids. ", "controversiality": 0, "created_utc": 1452434988, "distinguished": null, "edited": false, "gilded": 0, "id": "cysv650", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454398779, "score": 14, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Platinumizemybody", "author_flair_css_class": null, "author_flair_text": null, "body": "You did the right thing. You don't need to make final decisions right now.  Ever heard the saying \"don't quit on a bad day\"?  He's probably just grieving.  I'd give him time and space for now.  Definitely don't agree to no more kids, but tell him you hear what he's saying and that you don't have to discuss it for awhile. Later down the road he might feel differently.  It just doesn't seem like the appropriate time to fight that battle.  ", "controversiality": 0, "created_utc": 1452435114, "distinguished": null, "edited": false, "gilded": 0, "id": "cysv7mz", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454398798, "score": 52, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adoreandu", "author_flair_css_class": null, "author_flair_text": null, "body": "Give him time. If he had never wanted more than one kid, it would be different, but this is a recent change of mind that could change back.", "controversiality": 0, "created_utc": 1452437747, "distinguished": null, "edited": false, "gilded": 0, "id": "cysw5l1", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454399243, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sipawhiskey", "author_flair_css_class": null, "author_flair_text": null, "body": "I know you are asking for help with your husband, but you sound like [me three months ago on reddit](https://www.reddit.com/r/oneanddone/comments/3l1nqq/accepting_that_were_one_and_done_finally/).  \n\nHonestly I grieved for a few days for the life that I thought I wanted. I was surprised that I became ok with this after a few weeks of being upset.  Of course, this might not be as ok for you as it became for me. I still feel lingering guilt over not having a sibling for my daughter.  edit: link fixing", "controversiality": 0, "created_utc": 1452441201, "distinguished": null, "edited": false, "gilded": 0, "id": "cysxn4x", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454399943, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gaiaofchaos", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with the posted comments, great job on asking for a renewed discussion for next year. Grief is a complicated process and everyone goes through it differently. If he is willing to do some counseling great, if not, give him some time. There isn't any need to pursue it further at this point until you are seeing that you are starting to be ready.", "controversiality": 0, "created_utc": 1452442455, "distinguished": null, "edited": false, "gilded": 0, "id": "cysy8zs", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454400229, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you, this was such an encouragement ", "controversiality": 0, "created_utc": 1452444523, "distinguished": null, "edited": false, "gilded": 0, "id": "cyszbia", "link_id": "t3_40bc2c", "parent_id": "t1_cysw5l1", "retrieved_on": 1454400734, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "If you bring it up to him again right now, it might just upset him and strengthen his resolve.  I wouldn't say anything about it, to anyone, for a few months. When someone asks, and your husband is in ear shot, just say, \"not right now, but we've agreed to re-open the discussion in the future.\" \n\nThen, after some time has passed and some wounds have healed, maybe ask him to listen to you without responding the way you did with him. Then open the discussion again when you are both not so emotional.\n\n\nHang in there, OP.  :) ", "controversiality": 0, "created_utc": 1452445631, "distinguished": null, "edited": false, "gilded": 0, "id": "cyszxqh", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454401025, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "melodic_motion", "author_flair_css_class": null, "author_flair_text": null, "body": "Be patient. He may change his mind in a few months. I was in a discussion about this same topic in a Facebook group a week ago. Several (at least 5) moms posted pictures of their \"we're not having any more kids\" kids. Did either of you grow up as an only child? I did, and it was lonely. Also, you already have one child. If they're only 2 years apart, what difference will having two instead of one make on his being an \"old dad\"? ", "controversiality": 0, "created_utc": 1452446128, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt07pm", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454401155, "score": -1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gabbiani", "author_flair_css_class": null, "author_flair_text": null, "body": "Besides letting everything have a chance to settle, please consider grief counseling for your husband if he doesn't seem to be able to return to a state of normalcy. \nShould things resolve where he really wouldn't like to have another baby, adoption or mentoring may be other options. \nI am sorry your family is going through a rough patch, but little by little you all will feel better :)", "controversiality": 0, "created_utc": 1452446344, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt0c3f", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454401213, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eliza-jay", "author_flair_css_class": null, "author_flair_text": null, "body": "I am in the opposite of your shoes. My husband and I had always planned on two kids, but as I sit here pregnant (39+5) the more I think about it, the more I only want one. \n\nMy husband and I talked about it, I laid out my reasons for feeling this way, he acknowledged my feelings and reiterated why he doesn't agree, but we  ultimately decided to shelf the discussion until the middle of next year because there's no reason to push ourselves to a resolution right now because neither of us is ready to DO anything about that choice just yet. \n\nMy advice to you would be to contemplate both options and think about the pros and cons, so when next year comes around, you're ready to discuss it without the strong emotional response you're feeling now. It could be this is a part of his grief cycle, but it could be a choice that's been brewing for a while and he's just now bringing it up, only time will tell. \n\nGood luck momma!", "controversiality": 0, "created_utc": 1452449416, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt24my", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454402129, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bunnny_ears", "author_flair_css_class": null, "author_flair_text": null, "body": "You did the right thing listening and saying maybe it'd be best to talk about it later. \n\nI am 31, and even at that age I wonder about ever getting the chance to meet my grandchildren. \n\nBut, when the topic is discussed again with your husband, mention to him that having children is not just about seeing your grandchildren - it's also just knowing that you are leaving grandchildren behind to live on and keep your memory alive. \n\nMy grandmother once sat in a room full of 50-something people and said, \"Wow, you are all here because of me.\" And it was true. A few years later, she passed away. But I'll remember that moment forever.\n\nHaving children (more than one) is also about having a sibling for your one child. To grow up with, to share memories with.\n\nIt's about THEM one day being an aunt or uncle and getting to experience how amazing it is to see their brother or sister have their first child, have a nephew or a niece to spoil and love. If your husband only has one child, they will never get to experience that. \n\nIt's about the nieces and nephews having COUSINS to get together with at family gatherings. To grow up with, and share more memories.\n\nSo it's not just about him getting to see his grandchildren. \n\nAlso, he is grieving right now and very sad that his dad did not get to see his firstborn. Totally heartbreaking and completely understandable but he is focused on that when there is so much more to it.\n\nHell I'm sad my grandmother will not get to see my fist born.\n\nDeath is never easy. He is grieving. In a year, he might also not feel the same about it but if he does, remind him of all the other reasons why you should have a second child.", "controversiality": 0, "created_utc": 1452457083, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt76j3", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454404567, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you, this makes sense. ", "controversiality": 0, "created_utc": 1452458110, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt7w86", "link_id": "t3_40bc2c", "parent_id": "t1_cysy8zs", "retrieved_on": 1454404904, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you- I believe it is the grief but I don't know how to help him. He shuts me out. We'd been fighting about precisely that, so last night he said he would open up if I would just listen. ", "controversiality": 0, "created_utc": 1452458248, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt7ztz", "link_id": "t3_40bc2c", "parent_id": "t1_cysv7mz", "retrieved_on": 1454404950, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you for your input! I have both my parents and &amp; I can't relate, and he doesn't want counseling. Any advice? ", "controversiality": 0, "created_utc": 1452458329, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt81vv", "link_id": "t3_40bc2c", "parent_id": "t1_cysv650", "retrieved_on": 1454404977, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "defguysezhuh", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 31 years old. I lost my father two years ago on January 6, 2014.  My wife and I have a four year old daughter now and I'm only just starting to come around to the idea of wanting another child.  In fact, we just started talking about the idea of adoption over more biological children.  Our original goal was to wait until our daughter was out of diapers to have another.  That was right around the time my dad died and I told my wife I didn't want another child.  My logic behind this was because that my father would never get to meet this new grandchild. I felt guilty that my dad would never get to hold another baby and play with another grandkid. I loved watching my dad play with his grandkids.  There was nothing better for me, so the idea that there would be a kid who never got to meet his grandfather and a grandfather who would never meet his new grandchild was devastating to me.  Perhaps your husband also feels somewhat like this?", "controversiality": 0, "created_utc": 1452459059, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt8jhq", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454405208, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thanks! I hadn't thought about that approach of asking him to reciprocate the listening. And thanks for the response for when folks ask about #2. I am pretty sure if someone had asked me today about #2 I would've broken down in tears!", "controversiality": 0, "created_utc": 1452459196, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt8mri", "link_id": "t3_40bc2c", "parent_id": "t1_cyszxqh", "retrieved_on": 1454405251, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "That's my thinking too! Like having a kid at 39 is not much different from having another at 41, you know? He comes from a big family, like 10 siblings. I just a have one brother and we have a fierce bond. It wasn't long ago, like 3 months ago maybe, when he was pushing me for #2 and I told him I couldn't right now until I dropped some weight. ", "controversiality": 0, "created_utc": 1452459318, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt8pvj", "link_id": "t3_40bc2c", "parent_id": "t1_cyt07pm", "retrieved_on": 1454405291, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you for this. This rough patch does suck. Our son was 2 weeks old when his dad passed, and it's been a crazy year adapting to our new roles as parents, and him a year without his dad. He doesn't want counseling. I suggested maybe visiting w our pastor instead. He seemed open to considering that, he said he would think about it. :-/", "controversiality": 0, "created_utc": 1452459486, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt8u8n", "link_id": "t3_40bc2c", "parent_id": "t1_cyt0c3f", "retrieved_on": 1454405348, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "I always envisioned myself having two kids. But now I have only one, and for the most part, I'm happy about it. \n\nBut u/Platinumizemybody gave you some really good advice. I'm a mom, and had my baby AT 40, so I am acutely aware of my own mortality. My father died at 49. I'm 46 now. While your husband is only 40, I think he's got a valid point in not wanting to bring a child into this world when he's much older. \n\nMy opinion is this: wait a while for the dust to settle. And whenever you guys do decide to talk about it, don't allow his unwillingness to have another child be a deal breaker for you. I would love to have been able to give my daughter a sibling, but at my age, I was just lucky to have one at all. (Peri-menopause!) \n\nRegardless of whether you give your son a sibling or not, he's going to have a great life with you and your husband. My daughter has tons of friends, tons of toys, her own bedroom and she has us all to herself. There are times when I wish we had one more, but I know in my heart we wouldn't be able to give her the life and attention that she's getting from being an only. \n\nGive your husband time to grieve and then talk. If he still feels this way, know that it's not the end of the world. And allow yourself to grieve, too. Good luck. ", "controversiality": 0, "created_utc": 1452459844, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt93ib", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454405471, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "I know I WANT to think this is new. Mid last year he was pushing to get cracking on #2 (same reason, because he would be turning 40) &amp; the reason I waited is because I want to breastfeed my son for a year. I wanted to try after a year, gives me time to lose weight &amp; meet my bfing goal. And so this came out of nowhere! And it seems like he is overwhelmed at the thought of being 40 and imagining his life ending. \n\nGood luck on your delivery!! I never had the craving to have kids, but once I had my little guy, I was totally dreaming of #2. Good luck to you and your spouse on your decision about #2. Year one of life with a baby is hectic, so once you guys have a few months under your belt, and little one is letting you sleep more, maybe then would be a good time to discuss #2.  In the beginning its like so overwhelming, that you absolutely have no idea how anyone with more than 1 kid survives!", "controversiality": 0, "created_utc": 1452459890, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt94hb", "link_id": "t3_40bc2c", "parent_id": "t1_cyt24my", "retrieved_on": 1454405482, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my only child three months after turning 40. The pregnancy nearly killed me in the end. I'm 46 now and in peri-menopause. I feel exactly as you do! Thankfully, my husband was on board with me. He told me, one's enough, two would be great, but not necessary. ", "controversiality": 0, "created_utc": 1452459989, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt96q4", "link_id": "t3_40bc2c", "parent_id": "t1_cyt24my", "retrieved_on": 1454405512, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you so so much! I agree on everything you said regarding reasons to have another. He grew up in a big family and was this traveling musician with no insurance or retirement plan or anything like that. When we began dating he knew it meant buckling down &amp; he immediately enrolled in school and life has really changed for him. Not at my pace, he wanted this life too. And I think he is having a moment where he is reflecting on what he has done in 40 years &amp; he is worrying- about saving money, about everything. And I think that plus the loss of his dad is what led him to say that. I guess it would've stung less if he had said \"I don't think having a 2nd child is a good idea...\" Because the word 'want' just cut me like a knife. Like, if we got pregnant he wouldn't want the baby, or he would want a vasectomy. That word \"want\" is what just crushed me. And maybe he used the wrong word. I hope :( ...because I definitely WANT #2, maybe even #3. But hell, I'd be happy with #2! And I don't want my son to have divorced parents. That wouldn't solve anything. :( also we aren't on BC, so I mean, should a condom fail, and I know i shouldn't worry about what ifs, but imagine that conversation? \"I know you don't want another kid, but I'm pregnant\". :( ugh. ", "controversiality": 0, "created_utc": 1452460427, "distinguished": null, "edited": false, "gilded": 0, "id": "cyt9icu", "link_id": "t3_40bc2c", "parent_id": "t1_cyt76j3", "retrieved_on": 1454405664, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MCFF", "author_flair_css_class": null, "author_flair_text": null, "body": "If he's ok with speaking to your pastor, like you mentioned in another comment, i would encourage that. Better than nothing! ", "controversiality": 0, "created_utc": 1452461926, "distinguished": null, "edited": false, "gilded": 0, "id": "cytahze", "link_id": "t3_40bc2c", "parent_id": "t1_cyt81vv", "retrieved_on": 1454406131, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ivysub", "author_flair_css_class": null, "author_flair_text": null, "body": "Husband and I had agreed on two. But after one I could not face the trauma of doing it again and was adamant we were sticking with just the one.\r\rGuess who's pregnant with number two about four years later? He was patient with me and let me take as much time as I needed. And never pressured me to have another. He wanted another, but he wanted our family to be happy more. And if having an only was what it took then that's what it took.\r\rHe also promised me an awful lot more support this time too, soo, that helped :p", "controversiality": 0, "created_utc": 1452462403, "distinguished": null, "edited": false, "gilded": 0, "id": "cytat70", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454406277, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eliza-jay", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;And it seems like he is overwhelmed at the thought of being 40 and imagining his life ending.\n\nMy husband did this when he turned 30 - seriously, you'd have thought he was still living in his parent's basement playing video games and surviving on cheetos and mountain dew for the way he lamented how he's accomplished nothing in life! I'm sure we'll go through it all over again when he hits 40. :-) \n\nWe decided when our little guy is 6 months old we'll begin the conversation again.  If we want to try when he's 1 yr, the process actually begins at 9 months for us because of infertility treatments, so that'll give us 3 months to weigh all of the options without the pressure of making a decision fast.  ", "controversiality": 0, "created_utc": 1452462784, "distinguished": null, "edited": false, "gilded": 0, "id": "cytb1xr", "link_id": "t3_40bc2c", "parent_id": "t1_cyt94hb", "retrieved_on": 1454406391, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eliza-jay", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine is open to the conversation of stopping at one, so we'll see how it goes.  Ultimately, it's my choice since we require infertility treatments to even *get* pregnant in the first place, so if I REALLY don't want to, it wont happen.  But I of course want him on board with that choice too! ", "controversiality": 0, "created_utc": 1452462874, "distinguished": null, "edited": false, "gilded": 0, "id": "cytb3zn", "link_id": "t3_40bc2c", "parent_id": "t1_cyt96q4", "retrieved_on": 1454406419, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "I hear you. It's painful when two people want different things and won't budge. I'm very lucky. ", "controversiality": 0, "created_utc": 1452463278, "distinguished": null, "edited": false, "gilded": 0, "id": "cytbduw", "link_id": "t3_40bc2c", "parent_id": "t1_cytb3zn", "retrieved_on": 1454406548, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "5quirtle", "author_flair_css_class": null, "author_flair_text": null, "body": "My dad started talking to one his old college friends in a kind of mentor/councillor way after his dad died and he hit a grief/midlife crisis mix. After a while the friend got him to go to a church grief group. He's not a big fan of counselling but it's really helping him. They give them flyers and readings and \"a grief cross\" and have discussions and sharing time. Maybe if your husband won't go to one, you can find a group and ask for materials to take home to him. Or maybe an online group wouldn't be so personal and hard for him. ", "controversiality": 0, "created_utc": 1452463345, "distinguished": null, "edited": false, "gilded": 0, "id": "cytbfji", "link_id": "t3_40bc2c", "parent_id": "t1_cyt81vv", "retrieved_on": 1454406570, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1452464668, "distinguished": null, "edited": false, "gilded": 0, "id": "cytcb2b", "link_id": "t3_40bc2c", "parent_id": "t1_cyt9icu", "retrieved_on": 1454407053, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Well that ship has sailed. He is going to be an older dad regardless. I would give it some time, and then discuss your side, so at least you feel heard.", "controversiality": 0, "created_utc": 1452465854, "distinguished": null, "edited": false, "gilded": 0, "id": "cytd3b1", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454407423, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "immortalyossarian", "author_flair_css_class": null, "author_flair_text": null, "body": "There's a lot of great advice in this thread, and I agree with other posters that your response was spot on. I just wanted to help allay your husband's fears. My dad was 40 when I was born, and i have two younger siblings as well. Growing up, I never felt that my dad was old, even though he was older than my friends' dads. He was always very active during my childhood, and I think having kids helped keep him young. His dad had died at the age of 54, and i know it was something he thought about at times. But my dad is now 70, he keeps himself active and healthy, and my son, the first grandchild, is a big part of his life. Being an older parent, doesn't necessarily mean that your husband won't be there for your kids or grandkids. There are lots of older parents out there. ", "controversiality": 0, "created_utc": 1452470176, "distinguished": null, "edited": false, "gilded": 0, "id": "cytfukj", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454408723, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I would give it a bit more time. Your son is only 10 months and many people don't feel ready yet. He'll also still be in shock from losing his own father.\n\nRe being an older father: that's a reason FOR having a second child, not a reason against it. Otherwise your existing child faces a lot longer, lonelier time caring for ageing parents (or losing them) with no family and support. My kid is in this position, as she's an only child and I had her \"late\" (past 35).\n\nIf you're younger, the child has time to start their own family etc (or become much more established with their own group of loved and dear friends, if they don't choose to have a family) before you die, which means they're not left \"alone in the world\".\n\nFar better to be a twenty-year-old orphan with a sibling than with no one.\n\nBut let's face it, your husband is likely to live to eighty. Unless something unexpected happens - and it could happen tomorrow just as it may happen in a few decades' time - he will see his kids grow up and probably see grandkids, if they have them.", "controversiality": 0, "created_utc": 1452470510, "distinguished": null, "edited": false, "gilded": 0, "id": "cytg2en", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454408825, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "That all sounds very nice but not all families are like that. \n\nYour children may be great friends and get together all the time even after you're gone and be excited about each other's children but they may also not.\n\nI know plenty of siblings who don't get along or are simply indifferent to each other so I'd say having a second child should be about whether the parents want to raise another child not about the bond these children will have since that's really a gamble. ", "controversiality": 0, "created_utc": 1452473329, "distinguished": null, "edited": false, "gilded": 0, "id": "cythvhh", "link_id": "t3_40bc2c", "parent_id": "t1_cyt76j3", "retrieved_on": 1454409677, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "He's still grieving. Give him some time to sort his feelings out, and take some time to get yourself into shape (I highly recommend lifting weight as a way to do so!! it'll whip you into fighting form and make you feel like a badass tiger mama!). Be heartbroken but don't give up hope...he may feel differently as the year goes by.", "controversiality": 0, "created_utc": 1452475008, "distinguished": null, "edited": false, "gilded": 0, "id": "cytiy2q", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454410182, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gabbiani", "author_flair_css_class": null, "author_flair_text": null, "body": "Another idea is that he may want to freeze a sample of his semen, in case he changes his mind later on, you will have multiple avenues to use. Although men don't have the same kind of genetic degradation women do at older ages. ", "controversiality": 0, "created_utc": 1452476479, "distinguished": null, "edited": false, "gilded": 0, "id": "cytjtgr", "link_id": "t3_40bc2c", "parent_id": "t1_cyt8u8n", "retrieved_on": 1454410594, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1452481943, "distinguished": null, "edited": false, "gilded": 0, "id": "cytmyoa", "link_id": "t3_40bc2c", "parent_id": "t1_cythvhh", "retrieved_on": 1454412145, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "honeycakes31", "author_flair_css_class": null, "author_flair_text": null, "body": "What? It's a gamble of course, but if that's your only reason to NOT have more children it's absurd (sorry). And OP's husband never said he did not want to raise more children. He's upset and grieving, and it's understandable, and he's worried he won't get to see his own grandchildren one day. I agree with all the reasons /u/bunnny_ears stated as to why OP's husband should move past that fear. ", "controversiality": 0, "created_utc": 1452482253, "distinguished": null, "edited": false, "gilded": 0, "id": "cytn4zc", "link_id": "t3_40bc2c", "parent_id": "t1_cythvhh", "retrieved_on": 1454412228, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "I was just pointing out to the poster above that using the relationship the children could have as one of the reasons to have more children is not always the best idea since it's not a given that the children will have a good relationship. ", "controversiality": 0, "created_utc": 1452482513, "distinguished": null, "edited": false, "gilded": 0, "id": "cytna7h", "link_id": "t3_40bc2c", "parent_id": "t1_cytn4zc", "retrieved_on": 1454412295, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wildbluyawnder", "author_flair_css_class": null, "author_flair_text": null, "body": "40 is not old. I agree with the fact that you may not want to burden your only child into looking after you in old age if they even want to. Plus, they hopefully won't be lonely and they will know how to share. Only children actually have more mental health problems later in life. \n\nI had a friend in college that was an only child. Total type A personality. She contantly freaked out that she would fail her parents and that she'd be screwed because she was the only child. ", "controversiality": 0, "created_utc": 1452489105, "distinguished": null, "edited": false, "gilded": 0, "id": "cytqopq", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454413900, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "milkysecret", "author_flair_css_class": null, "author_flair_text": null, "body": "My dad was an old dad and he died when I was 29. That was hard but I'm still glad he and my mom had me. I don't feel like I missed out. There was no other dad I could have had and I had him for as long as I could. ", "controversiality": 0, "created_utc": 1452502237, "distinguished": null, "edited": false, "gilded": 0, "id": "cytvc0z", "link_id": "t3_40bc2c", "parent_id": "t3_40bc2c", "retrieved_on": 1454416160, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Wow, that must have been tough.  I just think like, anything could happen.  He could be in a car accident and be gone tomorrow, you know?  So the mortality to me, is not reason enough to not have another child.  Of course, at the moment, I couldn't share my feelings because I'd promised to only listen.  :-/", "controversiality": 0, "created_utc": 1452531367, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu6izg", "link_id": "t3_40bc2c", "parent_id": "t1_cytvc0z", "retrieved_on": 1454421507, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "What's interesting is that I have a good friend who said that her whole reason for having a second child is so someone could grieve with her first child when she passes.  I'd NEVER thought of things like that, but it's really a good point.", "controversiality": 0, "created_utc": 1452531516, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu6mk9", "link_id": "t3_40bc2c", "parent_id": "t1_cytqopq", "retrieved_on": 1454421553, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "I am kind of glad he is terrible at making his doctor's appointments.  One thing we argue about is him making decisions without consulting me, so if he were great about his doctor's appointments I'd be concerned about him getting a vasectomy without me knowing.  So, that's my solace in this.  Him being terrible at all things doctors at insurance is to my advantage now.  But, should he ever mention wanting to get one done, I think THIS is a wonderful suggestion!", "controversiality": 0, "created_utc": 1452531636, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu6pck", "link_id": "t3_40bc2c", "parent_id": "t1_cytjtgr", "retrieved_on": 1454421590, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you!  I really do need to get in shape!  I've never been so out of shape in my life!  ", "controversiality": 0, "created_utc": 1452531732, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu6rjg", "link_id": "t3_40bc2c", "parent_id": "t1_cytiy2q", "retrieved_on": 1454421689, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Yessss, such a great point!  I've never lost someone close to me so I don't know what is enough time.  I do know that the holidays were tough and I really tried my best so he could you a glimmer of happiness in that these are all \"firsts\" for our son (happy moments), but I do know he was melancholic.\n\nAnd you're right, the burden of caring for an older parent is shared with another sibling.  ", "controversiality": 0, "created_utc": 1452532212, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu72xs", "link_id": "t3_40bc2c", "parent_id": "t1_cytg2en", "retrieved_on": 1454421837, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you for this, and for the encouragement. I was thinking I'd get beat up on here for not speaking up, but I really wanted to respect his wishes of just 'listening'.\n\nI'm so happy to hear that your dad having kids kept him young!  Kids do get you moving more than you'd like!  Our little guy wears me out!  \n\nI really hope that as the year goes by and he gets over (I don't know how better to phrase that) the mortality thing.  I'm truly hoping in my heart that this is just a temporary thing.", "controversiality": 0, "created_utc": 1452532656, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu7dfg", "link_id": "t3_40bc2c", "parent_id": "t1_cytfukj", "retrieved_on": 1454421975, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": ":)  exactly.  It's as if he suddenly woke up &amp; realized he's 40 and needs to get his act together (regarding savings).  And also I think he began to reflect on what he's accomplished and stuff.  He told me he never had like this life plan of what he wanted to do by a certain age.  Whereas women, at least most that I know, have like an idea (In my 20s I had a plan of being engaged at 25 and a baby by 30 - granted, it didn't happen like that, but after getting married at 28 my knew goal was to finish having kids by 35).  And we'd always kind of teased him about being an old dad and he's laugh about it, because he really does look very young.  And it never bothered him.  Suddenly now, it's like the reason for everything :(\n\n", "controversiality": 0, "created_utc": 1452532955, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu7krp", "link_id": "t3_40bc2c", "parent_id": "t1_cytd3b1", "retrieved_on": 1454422071, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "He won't go to counseling because if his job finds out he's in counseling it'll be taken into consideration when he is up for promotion.  He did say he'd think about talking to our Pastor (they have a good relationship).  I'm pretty sure, he won't read anything I bring him - though I appreciate the suggestion.  Though the online thing - I bet if there's like some app out there, he'd look at that for sure!  Time to google!", "controversiality": 0, "created_utc": 1452533162, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu7pso", "link_id": "t3_40bc2c", "parent_id": "t1_cytbfji", "retrieved_on": 1454422137, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": ":)  My closest friend is struggling with infertility so I appreciate you responding to this thread at all.  I'm grateful to come on here and be listened to anonymously because there'd be no way I'd call my friend up, who's tried so hard (unsuccessfully) for even just 1 baby, that I'm sad about not having another.  You know?  Good luck to you guys, whatever you all decide on :) ", "controversiality": 0, "created_utc": 1452533461, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu7x57", "link_id": "t3_40bc2c", "parent_id": "t1_cytb1xr", "retrieved_on": 1454422233, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "When I was pregnant and hunched over the porcelain throne I couldn't fathom why people put their body through this time &amp; again!  :)\n\nYou've got a great spouse!!  I hope to be that supportive.  I know for right now because of the weight I've got to lose, it  isn't pressing me to discuss because I wouldn't want to get pregnant today.  But should I lose weight in 9 months, maybe I'd want to bring it up then.  I asked to revisit in a year though, so my goal is to just keep my mouth shut for the next year.  That way, he can say something like you did about your spouse!  ", "controversiality": 0, "created_utc": 1452533649, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu81uh", "link_id": "t3_40bc2c", "parent_id": "t1_cytat70", "retrieved_on": 1454422295, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Yeah, there's hope!  He said \"let me think about that\" so, it wasn't a \"no\".  I think in a month I'll follow up to see what he decides, I don't want to push him.  I mean, I do, but I won't, lol.", "controversiality": 0, "created_utc": 1452533731, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu83ue", "link_id": "t3_40bc2c", "parent_id": "t1_cytahze", "retrieved_on": 1454422321, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you.  \n\nI know it sounds very selfish because this is about what I wanted, and about him changing the plan we had.  While I don't think it's fair he wants to change something we discussed prior to marriage, I don't think it's right to dismiss his feelings either.  It's just rocked me to my core, because in my entire life I'd always envisioned having more than 1.  I wanted 3, agreed to 2 with the exception that if it was the same gender we'd try a last time for #3.  He was 39 when our son was born, and never was concerned about being an old dad.  We'd bust his chops every now &amp; then, and he'd be fine with it because he looks really young &amp; is very healthy.  I guess, it just came out of nowhere and this is something I never pictured myself having to think about.  ", "controversiality": 0, "created_utc": 1452534134, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu8duz", "link_id": "t3_40bc2c", "parent_id": "t1_cyt93ib", "retrieved_on": 1454422451, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thanks for your input, and my goodness, this post is so close to the anniversary of your father's passing.  Thank you so much for responding!\n\nWhat was the best thing your wife did to support you during the past 2 years and through your stance of not wanting another.  What were things that would upset you, what were things that moved you, what were things that made you marvel at the goodness of your wife?  Had you asked for time to think about another child, were you adamant that you just never wanted another?  It's not an easy discussion, and it brings out heightened emotions, for sure, so I just kind of want to pick your brain so I can better navigate this year that I'm not supposed to talk about something that terrifies me.", "controversiality": 0, "created_utc": 1452534418, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu8ky3", "link_id": "t3_40bc2c", "parent_id": "t1_cyt8jhq", "retrieved_on": 1454422545, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "What's funny is I saw a similar post (not yours) maybe about two months back, and I just kept scrolling because I thought \"that will never apply to me\".  \n\nI've got a glimmer of hope deep down, and maybe I'm just delusional and don't want to accept the reality.  When I asked to discuss in a year I said \"Since I promised just to listen, can we talk about this in a year, because obviously you know I'm not in agreement &amp; I would like to discuss this\" and he responded \"absolutely\" - - that makes me HOPE that in a year we can have a discussion and make the decision TOGETHER.  Like, I hope that a discussion is the equivalent to negotiation.  If I lose hope now I'll be a basket case.  I'm not ready to accept this.  :(", "controversiality": 0, "created_utc": 1452534792, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu8ugy", "link_id": "t3_40bc2c", "parent_id": "t1_cysxn4x", "retrieved_on": 1454422670, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you for this.  :)", "controversiality": 0, "created_utc": 1452535086, "distinguished": null, "edited": false, "gilded": 0, "id": "cyu921i", "link_id": "t3_40bc2c", "parent_id": "t1_cytn4zc", "retrieved_on": 1454422768, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sipawhiskey", "author_flair_css_class": null, "author_flair_text": null, "body": "You have a 10 month old. A child so young takes a lot of work still. You still have time.  He's about to turn 40, he just lost a parent.  Don't lose hope. Just keep being an awesome mom and wife. Make him realize he'll be missing out on a larger family.", "controversiality": 0, "created_utc": 1452540261, "distinguished": null, "edited": false, "gilded": 0, "id": "cyucrar", "link_id": "t3_40bc2c", "parent_id": "t1_cyu8ugy", "retrieved_on": 1454424513, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you for this...love your username!", "controversiality": 0, "created_utc": 1452542503, "distinguished": null, "edited": false, "gilded": 0, "id": "cyuect9", "link_id": "t3_40bc2c", "parent_id": "t1_cyucrar", "retrieved_on": 1454425336, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "defguysezhuh", "author_flair_css_class": null, "author_flair_text": null, "body": "**TL;DR -** Be patient, remind him you’re there for him when he wants to talk, remind him how much you and your kids love him, and don’t give up on him.  I can’t say he’ll come around on the idea of having another kid only because of the age (the older you get, the harder it is to start over with kids), but I believe he will come around to being more open-minded to discussion at least.  Be willing to hear him out as well.  The long version is below.\n\n&gt;this post is so close to the anniversary of your father's passing.\n\nI think that’s why I decided to answer.  It hit close to home and is still fresh in some ways for me.\n\n&gt;What were things that would upset me?\n\nThe times when she would point out cute babies or baby clothes at the store, though I knew she wasn't doing it to hurt me.  I was angry over my dad's passing and, unfortunately, she would get the brunt of it by way of my refusal to talk.  I wasn't **adamant** about never having a child again, but I wasn't thrilled with talking about it either.  I did tell her I was not ready to talk about it.  If she started hinting at the topic later on, I typically would just change the subject when it came up, to which she would drop it for a while (usually a month or so).\n\n&gt;What made me marvel at the goodness of my wife?  What moved me?\n\nThe fact that she never gave up on me.  She reminded me she was there whenever I was ready to talk.  She’s Italian, so patience and calm demeanors are not her strong suit.  She’s used to facing problems head on and calling people on their shit.  She knew, however, I was already depressed because I hated my job where I’d worked for 5 years before my dad died.  Rather than face my grief, I threw myself into work and emotionally suppressed everything for a year.  I wouldn't talk to anyone if it had to do with my emotional well-being.  I shut my wife out and I barely played with our daughter except out of obligation.  She has the patience of a saint because anyone else would have left me and would have been right to do so.  \n\nAs time went by, the pressure from my job increased and so my depression became worse.  It got to the point I was working 60-75 hours a week, so I barely saw my family.  She still never gave up.  She still made sure we were taken care of and reminded me that she was still there whenever I was ready to talk.  13 months after my dad died (February 2015), I lost my job.  It was the best thing that ever happened to both of us.  The free time forced me to grieve the loss I ignored for so long, it forced me to realize how much I neglected my family, and it forced me to finally realize my wife has been trying to help all along.", "controversiality": 0, "created_utc": 1452552447, "distinguished": null, "edited": false, "gilded": 0, "id": "cyuld5s", "link_id": "t3_40bc2c", "parent_id": "t1_cyu8ky3", "retrieved_on": 1454428639, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "You can do it.   :)    There are a ton of awesome fitness subreddits, too, if you need advice or encouragement and support.", "controversiality": 0, "created_utc": 1452565680, "distinguished": null, "edited": false, "gilded": 0, "id": "cyutnz5", "link_id": "t3_40bc2c", "parent_id": "t1_cyu6rjg", "retrieved_on": 1454432631, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh...now my husband is saying \"This is the last one\" anytime the baby does something he doesnt like. Its like a little dagger in my heart each time. ", "controversiality": 0, "created_utc": 1452573256, "distinguished": null, "edited": false, "gilded": 0, "id": "cyuyjfl", "link_id": "t3_40bc2c", "parent_id": "t1_cyu7krp", "retrieved_on": 1454434928, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "I don't know why I'd never thought of looking up a fitness subreddit!!  I'm totally doing that today!", "controversiality": 0, "created_utc": 1452615792, "distinguished": null, "edited": false, "gilded": 0, "id": "cyvfjk0", "link_id": "t3_40bc2c", "parent_id": "t1_cyutnz5", "retrieved_on": 1454443132, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Your wife is amazing!  I know I haven't been as patient as your wife.  How old was your daughter when all of this happened?  \n\nMy husband has also suppressed his feelings for just as long as our son has been alive.  He just seems miserable and unhappy when he is home.  There's so much to be happy for, and I've encouraged him to take time off if that's what he needs (he has the vacation time to do it).  But he doesn't, so I just don't know how to help him - and I know he doesn't want my help either.\n\nI need to learn from your wife on this one.  She is a saint!  \n", "controversiality": 0, "created_utc": 1452616804, "distinguished": null, "edited": false, "gilded": 0, "id": "cyvg8lb", "link_id": "t3_40bc2c", "parent_id": "t1_cyuld5s", "retrieved_on": 1454443459, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Goodness, that's hard!  Do you think he means it?  ", "controversiality": 0, "created_utc": 1452617162, "distinguished": null, "edited": false, "gilded": 0, "id": "cyvghl0", "link_id": "t3_40bc2c", "parent_id": "t1_cyuyjfl", "retrieved_on": 1454443576, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes I think so. When I think about the short term, yes it would be nice to be done. But they are little for such a short time. I would like to have nice family gatherings, and lots of grandkids. So this is why I would like a third child. I would go an extra year of sleepless nights to get this. ", "controversiality": 0, "created_utc": 1452617340, "distinguished": null, "edited": false, "gilded": 0, "id": "cyvgm1f", "link_id": "t3_40bc2c", "parent_id": "t1_cyvghl0", "retrieved_on": 1454443635, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "I'm sorry :(  I bet it hurts every time it's mentioned.  I'd probably break down in tears every single time if I were you!  Are you planning on a future sit down, like a serious discussion where a final  decision is made?  ", "controversiality": 0, "created_utc": 1452617731, "distinguished": null, "edited": false, "gilded": 0, "id": "cyvgvsg", "link_id": "t3_40bc2c", "parent_id": "t1_cyvgm1f", "retrieved_on": 1454443762, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I think when baby turns one, the decision will be made. I am not 100% sure either, but the baby crying has nothing to do with me being on the fence about it. I know it goes by so fast. Our first is almost 8. ", "controversiality": 0, "created_utc": 1452617987, "distinguished": null, "edited": false, "gilded": 0, "id": "cyvh2b5", "link_id": "t3_40bc2c", "parent_id": "t1_cyvgvsg", "retrieved_on": 1454443848, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "defguysezhuh", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter was two when my dad passed away, which made it that much harder for me because I know she won't remember much, if anything, of him when she gets older.  We've got a picture of my dad holding her as a baby in her bedroom and she still talks about him from time to time, but it gets fewer and further between as time passes.", "controversiality": 0, "created_utc": 1452647597, "distinguished": null, "edited": false, "gilded": 0, "id": "cyw27j3", "link_id": "t3_40bc2c", "parent_id": "t1_cyvg8lb", "retrieved_on": 1454454022, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ivysub", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I feel like it's an issue that if it's not time sensitive, is going to be better to approach if the pressure is off a bit. If you force someone to give you an answer straight away while they're in the middle of feeling negatively about it then the likelihood of everything being resolved to everyone's satisfaction isn't great.\r\rI hope he calms down soon and you both feel ready to take the plunge. Good luck! ", "controversiality": 0, "created_utc": 1452679417, "distinguished": null, "edited": false, "gilded": 0, "id": "cywh1vq", "link_id": "t3_40bc2c", "parent_id": "t1_cyu81uh", "retrieved_on": 1454461099, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you for the encouragement, much appreciated!", "controversiality": 0, "created_utc": 1452894223, "distinguished": null, "edited": false, "gilded": 0, "id": "cyzpa59", "link_id": "t3_40bc2c", "parent_id": "t1_cywh1vq", "retrieved_on": 1454516925, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Our son was 2 weeks old when my FIL passed, he only saw our son through FaceTime.  I can try putting myself in my husband's shoes - I ADORE my dad &amp; thankfully I still have him around.  If my son didn't get to know him I'd absolutely be sad about it.  And I don't know how I would react because I've never lost a parent, so I don't pretend to know the depth of the pain he is going through.  I just am at a loss because he won't talk to me (or anyone) about it, he won't go to counseling.  He bottles it up and just lashes out in anger.  I don't think I've ever felt more lonely and just, unhappy.  And I know this isn't about ME, it's about us &amp; our family, so I don't mean to come across as like \"poor me\".  It just really sucks right now.  And really - any advice you have for me as a wife, or things I can suggest for him, are appreciated.  Thanks so much for opening up, I'm sure it wasn't at all easy to go back &amp; forth on such a sensitive topic.  Thank you thank you thank you", "controversiality": 0, "created_utc": 1452895212, "distinguished": null, "edited": false, "gilded": 0, "id": "cyzpygz", "link_id": "t3_40bc2c", "parent_id": "t1_cyw27j3", "retrieved_on": 1454517243, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "That's good - I'm glad to see you guys are going to revisit this later on.  ", "controversiality": 0, "created_utc": 1452895293, "distinguished": null, "edited": false, "gilded": 0, "id": "cyzq0hv", "link_id": "t3_40bc2c", "parent_id": "t1_cyvh2b5", "retrieved_on": 1454517270, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "defguysezhuh", "author_flair_css_class": null, "author_flair_text": null, "body": "My wife corrected me: my daughter kisses my father's portrait more than I realize and still talks about him (but more frequently when I'm not around, so I think the kid realizes it still hurts me sometimes).\n\nI showed my wife our chats and she says, one wife to another:\n\n&gt; \"You need to find something to throw yourself into that will let you separate yourself from it all once in a while.  Go on a girl's night out, read a book, watch a movie, anything that helps you distance yourself from time to time.  It doesn't solve the issue, but it does help give you time to focus on you, which is just as important, rather than put all of your energy and focus on your husband.  Most importantly, find someone you can confide in.  I started spending more time with my best friend and talking to her more frequently during this period, which helped me a lot.\"\n\nAs for me, I just want to address one part of your last comment:\n\n&gt; And I know this isn't about ME, it's about us &amp; our family, so I don't mean to come across as like \"poor me\".\n\nYou haven't come across that way at all, but don't ever let yourself think you're any less important because your husband is going through all of this.  That was the mistake I made.  I kept my wife and my daughter at arm's length for a little over a year because I didn't want to grieve or admit to my wife I needed help.  I was trying to tough it out when I really just needed to hold my family and be with them.  It's going to take time for him to grieve, but don't give up and don't let him put you or your son on an emotional back burner either.", "controversiality": 0, "created_utc": 1452908047, "distinguished": null, "edited": false, "gilded": 0, "id": "cyzxr7k", "link_id": "t3_40bc2c", "parent_id": "t1_cyzpygz", "retrieved_on": 1454520988, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eastwoodhs", "author_flair_css_class": "green", "author_flair_text": "FTM 3/13/15", "body": "Thank you - and your wife! Such great perspectives from each side. I really appreciate it. Here's to patience, and sensitivity, and hoping my husband comes around to the idea of getting some counseling for what he is going through. Thank you! Hopefully next year I will post better news. :)", "controversiality": 0, "created_utc": 1452956035, "distinguished": null, "edited": false, "gilded": 0, "id": "cz0ellb", "link_id": "t3_40bc2c", "parent_id": "t1_cyzxr7k", "retrieved_on": 1454529067, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}