{"submission": {"author": "theothergirlonreddit", "author_created_utc": 1351631972, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9ghj6", "created_utc": 1453563834, "domain": "self.Mommit", "edited": 1453569781, "full_link": "https://www.reddit.com/r/Mommit/comments/42bari/im_23_and_want_to_have_kids_young_how_long_should/", "gilded": 0, "id": "42bari", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 96, "over_18": false, "permalink": "/r/Mommit/comments/42bari/im_23_and_want_to_have_kids_young_how_long_should/", "retrieved_on": 1455024874, "score": 33, "secure_media_embed": {}, "selftext": "Some background on my current scenario: I'm 23, with a good job, annually about $50k, about $17k in student debt, with a boyfriend of about 3 years. Now, I always hear that you should wait and I'm definitely open to that especially if that will be best for future kids and myself. I know it's no cake walk. My few factors for wanting to start young is I want to be a mom, I want kids while I'm fit and healthy and can run around with them, I want to have a big family (3 min, 4 ideal), and I want to be a decently young grandparent. \n\nI've always been told there is no great time to have a kid. I want to travel, but every time I do, I feel like it's detracting away from what I actually want. I'd ask my mom what she thinks, but she died when I was 6 and she was 33. I was the youngest of 4. \n\nSo mommies of Reddit, when did you have your kids and how did it turn out? I'll answer any questions you may have if that I'll help give you advice.\n\nEdit: Wow, love the stories - keep them coming! All great things I want to hear and everyone so far has at least one nugget of wisdom.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "I'm 23 and want to have kids young... how long should I wait based off your experience?", "url": "https://www.reddit.com/r/Mommit/comments/42bari/im_23_and_want_to_have_kids_young_how_long_should/"}, "comments": [{"author": "fiveohhhstang", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I had twins when he was 21 and I was 23. We weren't married at that time, and I went back to finish college when the twins were 6 months old. We had another baby when the twins turned 3. \n\nI finished college and have a good job, my husband has a good job, we have a nice house and our kids have everything they need and lots of things they don't. \n\nMy point is that while it's ideal to wait until you are older because you are typically more settled in your life, you shouldn't base your decision soley on social norms. My husband and I are glad we had kids early because we will be in our early 40s when the kids are all out of the house and we will have lots of time for travel and to spend time with our kids and grandkids. Bottom line, you do YOU. If you want kids now, have kids now. ", "controversiality": 0, "created_utc": 1453565896, "distinguished": null, "edited": 1453566105, "gilded": 0, "id": "cz90ieb", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679274, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LilaFaith", "author_flair_css_class": null, "author_flair_text": null, "body": "We had a baby when I was 23 and my husband was 25. The pregnancy was \"ahead of schedule\" but we welcomed it and figured out a budget that works. I was lucky that I finished school before the baby was born and that my husband makes enough that I can stay home with the baby until she starts preschool. I bounced back physically pretty fast and found that the sleepless nights weren't *that* bad in the beginning. Idk, it's different for everyone.", "controversiality": 0, "created_utc": 1453566152, "distinguished": null, "edited": false, "gilded": 0, "id": "cz90ncc", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679339, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "body": "Here's what I tell my kids:  before you have kids of your own, it will be easiest if you have:\n\nA steady job (steady finances)\n\nA home of your own (not living with mom)\n\nTransportation \n\nPhone\n\nA committed partner. (I recommend being married)\n\nIt sounds like you're well on your way, if not already there.  Being \"ready\" has less to do with age and more to do with stability, IMHO", "controversiality": 0, "created_utc": 1453566240, "distinguished": null, "edited": false, "gilded": 0, "id": "cz90p1n", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679362, "score": 87, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunny_bell", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I want to travel, but every time I do, I feel like it's detracting away from what I actually want.\n\nYou can travel with a kid, just takes more planning. Friend of mine's sister got her daughter a passport before she was even a year old so they could travel with her. My parents traveled tons with me and my sister. Travel and munchkins are not mutually exclusive.", "controversiality": 0, "created_utc": 1453567420, "distinguished": null, "edited": false, "gilded": 0, "id": "cz91cuv", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679673, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ocipura", "author_flair_css_class": null, "author_flair_text": null, "body": "I was 27 when #1 was born, and I'm glad I didn't start earlier, though is always wanted to have kids young. There's really no rush. It changes your life forever, no way around it. Not saying that's bad, but it's good to appreciate each stage of life as you live it without longing for the next. \n\nIf you want to travel, do it now! Not casually, but make a plan and really do some serious, satisfying traveling, so later you can look back and remember that awesome time. Not that you can't travel with kids, but it's totally different! \n\nThat said, if you are financially stable and in a committed, healthy, stable, long term relationship (I, too, recommend marriage), there's no reason now couldn't be the right time for you to start having kids. If you both feel it's the right time. \n\nI Still say don't rush it, though. And that's coming from someone who definitely wanted to have kids before 25. Now I'm 28 with #2 on the way, and I am glad I had those child free years.", "controversiality": 0, "created_utc": 1453567456, "distinguished": null, "edited": false, "gilded": 0, "id": "cz91dmg", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679684, "score": 14, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "starburstjellybean", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 23 now with 2 kiddos, and I love it!! My advice based on the info you provided: it will help your life *immensely* to get married first and then give yourself some time as a married couple before you have kids. The first couple years of our marriage was somewhat hell-ish, and I think that's because we got pregnant first and only had six months between getting married and baby being born. And even now, coming up on five years, we still have a lot of past hurts we're working through, and thankfully we have some healthy communication tools that are really helpful, but I really wish I could have had that time to establish our marriage before kids. And that being not only for the sake of our marriage, but for the sake of our kids too. I want my kids to see their parents having a healthy, loving relationship, and that was a struggle to start out with. ", "controversiality": 0, "created_utc": 1453568092, "distinguished": null, "edited": false, "gilded": 0, "id": "cz91r6e", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679860, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MarianneDashwood", "author_flair_css_class": null, "author_flair_text": null, "body": "I got married at 19 and got pregnant a few months after I got married. I had six kids over the next nine years. After twelve years of marriage, I got divorced and coparent with my ex-husband and my new husband; we are all very close and maintain bonds as a family. The children live with my husband and me, but see their father every day (except for right now, as he is in another state wrapping up a business venture, but other than this, he's never been away from them, and we agreed to live within a mile of each other so that we always have access to the children). \n\nI am now 31 weeks pregnant with my seventh child, my first with my new husband; I'm 35 and a half. \n\nWith regard to the physical aspects-- being younger was a million times better. Pregnancy at 35 sucks so much. I remember when I was pregnant with my first, I was painting the living room at 35 weeks. Right now, a trip to the grocery store is too much for me. But this varies widely from woman to woman, so many other older moms have much different experiences than I do. \n\nWith regard to emotional/psychological/social impact on my life, I'm definitely much more patient and knowledgeable now than I was when I got married, but I was definitely an enthusiastic, hands-on, deeply attached parent. Because I was so young, I had a lot of energy to be really, really involved in every aspect of my older children's day. My oldest son's first sentence was \"Go away mom\" because I was constantly up in his grill, trying to make sure he knew the alphabet by the time he was one, and freaking out about every developmental milestone. I'm much, much more laid back now. \n\nFinancially, I have a lot more money now than I did when I had my first son. Financial worry comprised a huge portion of my stress in the first four years of parenthood for me. \n\nOne of the benefits of starting young, for me, is that I've done a lot of things in my thirties, now that my older kids are teenagers, that most women do in their twenties. So I didn't really miss out; I just did things in a different order, or, in the case of getting my masters, much more slowly and later. I never would have expected to be divorced and remarrying at 33, but now that I'm 35 and expecting a child with two teenagers, two preteens and two school aged kids, it's really fun and fascinating to watch them get so excited about a new sibling. \n\nAll that to say, no matter how you plan, it may not turn out as you expected, but if you're doing your best and pursuing what you think is best and making responsible choices, you probably won't have regret. \n\nAlso, having a baby, especially just one, does not need to curtail travel. We take our kids with us, and we start taking them to restaurants, theater, and live events at birth-- they quickly learn by example how to behave in a well-mannered way and enjoy adventure. ", "controversiality": 0, "created_utc": 1453568233, "distinguished": null, "edited": false, "gilded": 0, "id": "cz91uc3", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454679902, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "4ever2012", "author_flair_css_class": null, "author_flair_text": null, "body": "I wanted to start young, and I grew up religious so it's very common in my religion for girls to get married around 20 and have their first child by 21. I had a great career by 21 and was happily married. We went through infertility for 3 years and we adopted a baby 2 months ago. I'm 24 and my husband is 31. We are very financially stable and have a nice home. That being said, I agree with you that having a child young is nice when you have the energy, but the first week we had our son was so unbelievably difficult, I was so grateful for our years of infertility (I know that sounds bad) and the travel we had done. I love our son, but transition to mommyhood was SO much harder than I thought,  especially since we waited so long for him to come into our lives. In the years before though  We took a lot of amazing trips while we tried to get pregnant and those memories, the bonding time with my partner, I am so happy we were able to do that before our baby changed everything. So, you're right that as long as you're financially stable, independent, and in a happy and committed relationship there's no ideal age, but if you want to travel I think it's important to do that now, Im really happy we did before baby. Having more bonding time with my husband to explore and be on adventures together strengthened us for the task of being parents and I feel much more prepared to start this new chapter.  ", "controversiality": 0, "created_utc": 1453569232, "distinguished": null, "edited": false, "gilded": 0, "id": "cz92fi2", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454680178, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "moms_on_reddit", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my first one when I was 26 and she turned out very healthy.  I had my second one was I was 32 and he has had several health problems.  I'm a big fan of starting young, for all the reasons you mention.", "controversiality": 0, "created_utc": 1453569389, "distinguished": null, "edited": false, "gilded": 0, "id": "cz92isd", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454680222, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaBrats", "author_flair_css_class": null, "author_flair_text": null, "body": "Good advice but traveling now will only hurt your finances. If you want to be ready for kids, buckle down and save. Financial stability is huge. I wish I hadn't done as much \"fun stuff\" before having kids. I think of all the money and time I wasted. Not all fun is a waste but wish I wouldn't have done as much. Then we potentially would have had our house down  payment. We are now thinking of adopting one day and that makes us have to reevaluate our finances, again! ", "controversiality": 0, "created_utc": 1453569639, "distinguished": null, "edited": false, "gilded": 0, "id": "cz92o37", "link_id": "t3_42bari", "parent_id": "t1_cz91dmg", "retrieved_on": 1454680291, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothergirlonreddit", "author_flair_css_class": null, "author_flair_text": null, "body": "It's great to see some of this here! I still have fun, but since I'm planning to one day have children, so I'm trying to get my life and finances in order. So many people are telling me - do a two week trip to Europe it'll change your life, etc! I'm sure it will, but a road trip to a log cabin in the woods for 5 days for 1/8th of the cost is still really wonderful too!", "controversiality": 0, "created_utc": 1453569950, "distinguished": null, "edited": false, "gilded": 0, "id": "cz92uhx", "link_id": "t3_42bari", "parent_id": "t1_cz92o37", "retrieved_on": 1454680376, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MySOMadeMyAccount", "author_flair_css_class": null, "author_flair_text": null, "body": "Had mine at 23(planned) and she is 3 now! Since having her I have actually had the chance to travel the world with my little lady in tow and its amazing!!! Loved having her young, only downside is that I was literally the first so I had no \"oh let me tell you about that\" or awesome hand me downs/buy these products. I also had a bit of trouble with play dates, luckly when I moved overseas many people have kids my daughters age so it worked out! \nJust depends on what you want your experience to be!! Always willing to answer your questions if u need it when the time comes!!", "controversiality": 0, "created_utc": 1453572140, "distinguished": null, "edited": false, "gilded": 0, "id": "cz945wj", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454680995, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MySOMadeMyAccount", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter was 18 months when we moved overseas...been to 6 countries in the last year and a half!!! Don't stop doing what you love just because you have children, it can be done!!!", "controversiality": 0, "created_utc": 1453572333, "distinguished": null, "edited": false, "gilded": 0, "id": "cz94a5o", "link_id": "t3_42bari", "parent_id": "t1_cz91cuv", "retrieved_on": 1454681051, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "caitflorida", "author_flair_css_class": null, "author_flair_text": null, "body": "If you have a steady job, a home, a loving partner who is on the same page as you, I say go for it! ", "controversiality": 0, "created_utc": 1453573515, "distinguished": null, "edited": false, "gilded": 0, "id": "cz94zd8", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454681381, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "storeboughtmama", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my kid at 21/22. I wish I had waited to now, I'm 30. I knew *nothing* at 21 and although I had good intentions, I was not fit to be a parent. You are definately better off financially than I was at that age, but there's a lot to be said for life experience and wisdom that just comes with age. You will make different decisions for your family in your 30s than you would in your 20s. Mentally, emotionally, I think its better to wait. But that's my 2 cents. ", "controversiality": 0, "created_utc": 1453573652, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9528w", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454681418, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "storeboughtmama", "author_flair_css_class": null, "author_flair_text": null, "body": "Agree with this immensly, your life doesn't have to stop it just adapts", "controversiality": 0, "created_utc": 1453573792, "distinguished": null, "edited": false, "gilded": 0, "id": "cz95580", "link_id": "t3_42bari", "parent_id": "t1_cz94a5o", "retrieved_on": 1454681458, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "oh-bubbles", "author_flair_css_class": "lightcoral", "author_flair_text": "14 Feb 10 &amp; 3 Jun 12", "body": "Had my first at 22 second at 24. I'd do it again. My husband had a steady job but I didn't I was still in school and working full time at target but I have an awesome support system. So much more energy and pregnancy, delivery, recovery were easy peasy. I have so much fun at every step and really am still a kid myself at 28. I would really love to add 2 more to my family but we're not on the same page and I refuse to have kids after 30 so I'm also running out of time. \n\nMy family is one of those who had kids young but still have good careers. My grand parents are only 69 my mom just turned 50. So we have a generational component I wouldn't trade. ", "controversiality": 0, "created_utc": 1453574545, "distinguished": null, "edited": false, "gilded": 0, "id": "cz95lp7", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454681673, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Queenchoo", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my daughter at 23 and now I'm 32 and pregnant with my 3rd I totally agree that being younger and pregnant was so so much easier. Not only did I get my figure back much easier but I was still able to go out and enjoy myself both while pregnant and after. Having kids never stopped me from doing the things that I wanted and it gave me a great excuse to do all the silly kid things again. Yes I had no money, but my daughter had everything she needed and now she is older had more besides. Having her younger has given me the ability to space my pregnancies out and focus on each child when their demands were highest. \n", "controversiality": 0, "created_utc": 1453574684, "distinguished": null, "edited": false, "gilded": 0, "id": "cz95opf", "link_id": "t3_42bari", "parent_id": "t1_cz91uc3", "retrieved_on": 1454681713, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tkdbbelt", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I were 24 when our first was born. We were married at 21 and finished college before planning to start a family. We were broke but we knew we wanted to have as much time (years/future) as we could with our kids and that we would find ways to make it work. We are glad we didn't wait. When my oldest (now 4) was just 6mo old, my husband started suffering from an intestinal infection that lasted for months and left damage and pain. Then he survived a heart attack (genetic cholesterol disorder that we were unaware of since he was active and fit) when my youngest (now 3) was about 6mo old. We are still broke most of the time but get by. We wouldn't change anything about when we had our kids though. What if the heart attack scared us off of having kids? Or we decided it was going to be too much for us after that? Yes one now has the cholesterol disorder but we are well aware and can monitor and manage it. It has been rough but we love our little boys and the family we have created. Since we are still young, we have the energy to keep up with them and give them the attention they need. Our family is the perfect size for us and we do not have plans for any more babies (except if somehow accidental) because we have a lot going on as it is and we worry if we have a baby when older that we risk having one with special needs..which we would rather avoid happening with the current health issues we already have in the home. \n\nBut I wouldn't change anything. I think it depends on you and when you are ready. I am not a believer of trying to wait just so you can \"have fun\" and such, but if you are not comfortable having children when finances are a big struggle or you feel you could not properly provide, then I do recommend waiting. Marriage is always a great start as it shows you and your partner's commitment to each other. It will help when there's a fight or disagreement to help you push harder to solve it, which is important when looking out for your children since they see everything you do and learn from it.  ", "controversiality": 0, "created_utc": 1453574762, "distinguished": null, "edited": false, "gilded": 0, "id": "cz95qf2", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454681736, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothergirlonreddit", "author_flair_css_class": null, "author_flair_text": null, "body": "It's good to see the variety of opinions and thoughts. Most of my friends feel the way you do, but don't have kids! They just say kids ruin your life and that's it. It's good to see a mix of \"it's okay right now\" and \"I'd wait and here are the reasons why\" from actual moms", "controversiality": 0, "created_utc": 1453575514, "distinguished": null, "edited": false, "gilded": 0, "id": "cz966ut", "link_id": "t3_42bari", "parent_id": "t1_cz9528w", "retrieved_on": 1454681951, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ksz", "author_flair_css_class": null, "author_flair_text": null, "body": "Kids are awesome but they are stress embodied.  Life is just more full with a kid, and relationship problems tend to be revealed under stress.  So, I second this.", "controversiality": 0, "created_utc": 1453575875, "distinguished": null, "edited": false, "gilded": 0, "id": "cz96ew7", "link_id": "t3_42bari", "parent_id": "t1_cz91r6e", "retrieved_on": 1454682056, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "storeboughtmama", "author_flair_css_class": null, "author_flair_text": null, "body": "I definitely don't think kids ruin your life, I love my kid and think he's added a wondeful element to my life. But I worry more that I'm ruining *his* life and think I would have made a better mom for him if I had waited.", "controversiality": 0, "created_utc": 1453576359, "distinguished": null, "edited": false, "gilded": 0, "id": "cz96p98", "link_id": "t3_42bari", "parent_id": "t1_cz966ut", "retrieved_on": 1454682191, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ilovebreakfastallday", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree! Only you know when is right, but the biggest piece of advice I can give is to travel all you want now. Pregnancy, nursing, having multiples... You may not have a chance to travel again til retirement. ", "controversiality": 0, "created_utc": 1453576525, "distinguished": null, "edited": false, "gilded": 0, "id": "cz96svf", "link_id": "t3_42bari", "parent_id": "t1_cz91dmg", "retrieved_on": 1454682239, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "JoNightshade", "author_flair_css_class": null, "author_flair_text": null, "body": "You know, I went to college and traveled the world (did a London study, traveled in Italy, lived in China for a year), and I don't regret doing that. HOWEVER, as a mom of two small kids one of the things I look forward to the absolute most is traveling with my children when they get old enough to remember/understand. We do little trips around our area now and being able to experience the world with them is probably one of the highlights of my life. It's so much better than doing it on my own. ", "controversiality": 0, "created_utc": 1453578378, "distinguished": null, "edited": false, "gilded": 0, "id": "cz97wtx", "link_id": "t3_42bari", "parent_id": "t1_cz92uhx", "retrieved_on": 1454682762, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kams88", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 26 and just had my baby. I have been married 3 years and we live in a Townhome and have steady jobs (mine is a work from home job too). My husband is job hunting while working to get us out of this small town we hate. I decided it was time to have a baby when I started crying when I saw pregnant women. I live in Utah (in the us) and people have kids young here. My sister was 23 with her first and another sister got pregnant 2 months after getting married at 24 and both of those are somewhat old in Utah standards. I have many friends my same age with 2-3 kids. The less stable you are in your job and relationship the harder having a baby is going to be but if you have stable jobs and a stable relationship it makes it a little easier. \n\nI wanted I have a kid earlier than most people because my mom was old when she had me and I was #5. She didn't have enough time for all 7 of her kids and now her body is so destroyed from playing sports in college and age that she can't play with her grandchildren and I don't want that. I played sports too and my body is pretty destroyed so I figured whatever advantage I could get I was going to take. I want to be able to be energetic and have fun with my kids and my grandchildren if I have any. ", "controversiality": 0, "created_utc": 1453578397, "distinguished": null, "edited": false, "gilded": 0, "id": "cz97x7x", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454682767, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sortaplainnonjane", "author_flair_css_class": null, "author_flair_text": null, "body": "My best friend had her first kid at 18.  I had my first at 29.   She feels that she didn't get to do much like travel, but is happy her kids will be out of the house when she is a young 38.  I got to do a lot before having my daughter (travel, sports, grad school), but I'm also just starting my adult career and it's a rough transition.  I wish I had been more settled job-wise prior to getting pregnant.  \n\nReally, any time you have a kid you'll probably think, \"Oh, I could have waited or I wish I had done X first.\"  \n\nI guess what I didn't realize going from 0- 1 kid is that literally every single aspect of your life changes, and it begins with pregnancy.  I was exhausted.  (Still kinda am.)  Everything I ate, wore, and did was dictated by the fact that my kiddo was growing inside of me.  She's a toddler now, and her schedule still pretty much runs the show.  I can't just go grab a gallon of milk quickly.  Last night I was pondering going to the ER and wasn't excited about it since my husband would have had to drive me and that meant taking her with us.  You see?  I think people should have kids when they're fully prepared to put their lives on pause for a few years.  (And sure, there are tons of people who continue travel or start a PhD with newborns and stuff.  Go them!  But realistically, jobs, finances, being tired will all make that more a dream than doable.)  ", "controversiality": 0, "created_utc": 1453578413, "distinguished": null, "edited": false, "gilded": 0, "id": "cz97xli", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454682772, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IHaveAFunnyName", "author_flair_css_class": null, "author_flair_text": null, "body": "Unlikely but still possible is having a child with health problems. I'm 27 and healthy and so is my husband and my son was born 3 months early, and because of that has many complications. Our lives will be much different than expected. Obviously this can happen at any age, but to be 23 and have extra responsibilities and worries vs 32 ...it would vary for everyone I imagine. Just realize your life may change more than expected. ", "controversiality": 0, "created_utc": 1453578769, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9852m", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454682939, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "inahouse", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my kids at 35 and 38.  I've been financially ready to have kids since my mid to late twenties.  Mentally, I was ready to be a mom at 30, having traveled and made some strides in my career.\n\nI didn't find someone to have kids with until 30.  Due to some health problems, I had to wait a few years before trying to get pregnant.\n\nSo here I am at 38 with an infant and a three year old.  Both my pregnancies were easy.  I was carrying around my oldest the day I went into labor with my second, and I've had plenty of energy to play with the three year old.  At my age, I've had a ton of life experience and feel like I'm going to be a better teacher to my kids.\n\nBut man, the sleep deprivation with two kids is killing me right now, and I think I would be handling it better if I was younger.  Also, by the time I (hopefully) become a grandparent, I'm going to be really old, and that makes me feel bad.\n\nMy parents and sister both had kids around 30, and to me that is ideal.  You are old enough to know some things, and you'll still have energy when your grand kids come along.  This is just my opinion.  I wasn't ready to have kids at 23, and it sounds like you are!", "controversiality": 0, "created_utc": 1453579159, "distinguished": null, "edited": false, "gilded": 0, "id": "cz98dfd", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454683048, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1453579893, "distinguished": null, "edited": 1453584797, "gilded": 0, "id": "cz98t8a", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454683255, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Geldwyn", "author_flair_css_class": null, "author_flair_text": null, "body": "Im 34 and we just had our first. Ive been with my husband since i was 20 and i wanted to be a young mom for pretty much the same reasons.  However,  i have no regrets waiting as long as we did and here are some reasons why:\n\nWe have matured together as a couple and now bringing in a child i feel that we have been able to handle things much better due to the depth and comfort level of our bond.\nWe got to enjoy our 20s,  traveling!  Staying out late throwing lots of parties, gaming, etc!\nWe paid off all of our debt and bought a house.  We are way more financially secure now than we were ever before.  (Both of us have had major career changes in the last 10 years,  he decided to entirely change his career after a bad situation at a former employer and my department was eliminated so i was out of a job after almost 10 years with my company...shit happens even when its not your fault)\nWe were able to really plan things (about as much as you can) when we decided to start trying.\n\nAll in all im glad we waited.  I feel i have had so much more life experience than i would have if we had children earlier.  I also dont ever feel trapped or resentful (im a stay at home mom). I did the career bit, the partying bit,  the selfish bit...now i can focus just on my little one or ones( we plan to have more) and i dont feel like im missing out or have to sacrifice too much.", "controversiality": 0, "created_utc": 1453580089, "distinguished": null, "edited": false, "gilded": 0, "id": "cz98xcf", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454683309, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ur_favourite_psycho", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm gonna be truthful:  I wish I'd had kids sooner.  I had my son at 27 and I honestly wish I'd had him when I was younger.  ", "controversiality": 0, "created_utc": 1453581715, "distinguished": null, "edited": false, "gilded": 0, "id": "cz99uas", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454683740, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ground_hogs", "author_flair_css_class": "purple", "author_flair_text": "girl, born June 2015", "body": "Had my baby at 33 and am soooo glad I waited. My husband and I got to travel and see a lot of the world together. We both got to enjoy our 20s and grow up. We weren't sure we wanted any kids until around 30 and I don't think we were ready to give up our own hobbies and travels  earlier. My baby is just 7 months old and I now look forward to doing the things I love with her. It definitely changes your life dramatically. I barely have time to shower most days, much less paint or exercise or watch the shows I used to enjoy. I know it will change as she gets older and more independent, but it requires giving up a lot especially in the first year. \n\nI was in decent shape before pregnancy and did prenatal yoga throughout. My body bounced back pretty quickly. I don't know how it would have been when I was younger. I had horrible horrible \"morning\" (24/7) sickness until around 16 weeks, but after that pregnancy wasn't bad. I had a natural unmedicated labor and both baby and I were totally fine (I had minor tears and 3 stitches). \n\nIf you and your partner are both ready, go for it. For us, travel and experiencing different cultures is important, so we did as much as we could before trying to get pregnant. Now we can't wait to share future travels with our daughter. :)  I'd evaluate your priorities and do whatever makes the most sense and the most happiness for you. ", "controversiality": 0, "created_utc": 1453582573, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9acjm", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454683979, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 25 and I just had my 3rd son who's 3 weeks old. My older sons are 4 and 2. On one hand I wish we could have waited until my husband and I had been married for a few years so we could have gotten to know each other and travel as a couple first. I was 20 and he was 24 when we got married. I was already pregnant with our first son. We never got a honey moon and we've never vacationed together. But I'm also thankful because I've been able to bounce back faster physically and have more energy for my toddlers and the nighttime newborn feeds. ", "controversiality": 0, "created_utc": 1453583259, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9arfr", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454684174, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "On top of what others have said, I highly recommend having a lifestyle that an be supported on one income. It gives you extra money to play with or save and a safety net during bad economic times.", "controversiality": 0, "created_utc": 1453583554, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9axu9", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454684258, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1453584192, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9bb9q", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454684434, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Chloebean", "author_flair_css_class": null, "author_flair_text": null, "body": "I was 28 when I had my first (I'm now 30; he's 21 months). I think it will be hard for those of us who had kids older to truly know what it's like to be a young mom, so our opinions will be biased. I will say this -- among my friends (late 20s, early 30s, college educated, professionals), a few of us have kids and none of us regretted waiting until after our early/mid-20s. In fact, having my LO at 28, I kinda wish I had waited until 30 or so. That's not to say I regret having him then, I just didn't understand how much my life would change. \n\nAs you've heard, there is never a right time to have a child. But, there are times that make it easier -- DH told me that he wanted us to have a three-digit income before we had a kid (which is NOT necessary and may be out of reach for some, but we live in a high cost-of-living area) and I'm glad we waited until that point. I also agree with the person who says that being married is ideal -- there's just a bit more stability that's really important at the beginning when you're loving/resenting your partner. \n\nIf you have a strong support system and good finances, then traveling after kids isn't out of the question. We rented a house in the Outer Banks for a week in 2015 with kid (OK, domestic travel might not be what you're referring to) and are going to Jamaica sans kid this July. Sure, it's not Europe -- but I think we'll get there once he's a little older. \n\nWe still have a life. Don't let people tell you that your life ends when you have kids. We go out (babysitters!), we go to friends' houses and stay overnight (just be flexible!), we drink, we have fun, but we also love love love our little boy. ", "controversiality": 0, "created_utc": 1453585396, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9c056", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454684759, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "evilvegie", "author_flair_css_class": null, "author_flair_text": null, "body": "Agreed! Having a solid relationship with the commitment level that comes with marriage (usually) is crucial to so many different aspects of your kids wellbeing e.g. Feeling secure, feeling safe, having love role modeled for them on a daily basis... Have fun being newlyweds for a while before you jump in :) ", "controversiality": 0, "created_utc": 1453586214, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9cgyg", "link_id": "t3_42bari", "parent_id": "t1_cz91r6e", "retrieved_on": 1454684979, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "greeneyedgirl1", "author_flair_css_class": null, "author_flair_text": null, "body": "Why is that? I feel the same as OP. I will be 24 this year but I really want to start having kids soon. My husband will be graduating from college this May and I currently work full time as a teacher but my husband wants to wait until we are 27 :/", "controversiality": 0, "created_utc": 1453586726, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9cs12", "link_id": "t3_42bari", "parent_id": "t1_cz99uas", "retrieved_on": 1454685124, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Monsterandmayhem", "author_flair_css_class": null, "author_flair_text": null, "body": "It's weird. I started out as a 'younger' mom, and honestly I wish that we had started earlier, or been able to have more kids closer together. We are still pretty young though, but still I never wanted or planned to be pregnant after 30, so that really really sucks. \n\n\nI was 23 and my husband was 27 with our first! My husband owned our home, I had my bachelors, my husband had done 4 years active duty and was in the reserves, we had good jobs, benefits, and we both owned our own cars. We didn't rely on anyone or anything at the time we got pregnant, So we were in a better spot than most. My husband lost his parents as a teen, and mine live 4 hours away so we don't have that help and safety net that most people normally get. It's hard, it's amazing, it's exhausting, it's so much fun. We waited a year to have another baby, but we lost our daughter to Thanatoporic Dysplasia. Then we got pregnant again after her, and that baby is 5 months old. We were hoping to have 3 kids by 30, but life had other plans, we still hope we can have 3 or 4 kids total one day. My husband is a stay at home dad with the boys,  and they have so much fun together! \n\n\nOh, and my parents were older. They started having kids in their mid 30s. So now they are older grandparents, and my dad isn't healthy. It was also hard to see them be older parents growing up. I want my husband to coach the boys sports teams, I want the energy to be class mom, a scout leader, in the PTO and all that nonsense. I know age is a just a number, but i saw how it was different for my parents compared to my friends parents, so that's my frame of reference ", "controversiality": 0, "created_utc": 1453587768, "distinguished": null, "edited": 1453588814, "gilded": 0, "id": "cz9de1y", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454685413, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lovemesomebabies", "author_flair_css_class": null, "author_flair_text": null, "body": "When I was 23, we started trying for a baby for the same reasons you mentioned. I truly wanted to be a young mom. We later found out that my SO couldn't have kids and we are just starting fertility treatments. I'm 26 now. Maybe because I'm older I feel more ready now more then ever. But with that said I would have given anything to be pregnant at 23. Life doesn't always go the way you wanted it. \n\nDo what feels right for you. Only you know if you feel like your ready for a baby. Heck! Even teen mom's who are for sure not ready still come out fine in the end. ", "controversiality": 0, "created_utc": 1453587850, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9dfsn", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454685435, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Monsterandmayhem", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel the exact same way. I had my first young, but I wanted to have my kids be close together and be done by 30. I never anticipated fertility problems, or that one of our babies would die. Now I am facing being an older mom than I am comfortable with if I want to grow my family. I really regret all the waiting we did for the 'right' time", "controversiality": 0, "created_utc": 1453588395, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9dr3j", "link_id": "t3_42bari", "parent_id": "t1_cz99uas", "retrieved_on": 1454685583, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "notfrandrescher", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my first baby at 34 (husband was 33.)  I am SO incredibly glad we waited. \n\nFirst off I'll say: make sure your relationship is rock solid. Having a baby, even the easiest best sleeping baby ever born, is incredibly stressful on your relationship. There's a reason why they recently published a research article stating that the first year of your baby's life is often your most unhappiest.  \nMake sure you have someone by your side that's going to stick with you even when shit gets REALLY real. Also, is your partner someone that willingly helps with housework?  Cooks?  You're going to need him to step up and do both. \n\nWhy am I most happy I waited?!  Because we are financially stable. It's so cliche but holy shit is it true. I NEVER had to worry about paying for clothes, diapers, formula, etc. I never had to clip coupons or shop at 4 different places to make sure I got the cheapest price on everything. \nWhen our daughter was 2 weeks old she started showing signs of colic. Everyone said, \"get a swing.\"  Know what we did?  Bought a freaking $175 swing and had it overnighted to us, we didn't even blink an eye. \nThis year we're taking our toddler to Spain and Hawaii. These aren't trips we've saved years for, these are just our two big trips for the year.  Next year we're talking about doing a month long tour of the west coast. \nAre these things necessary to raise a happy, healthy child?  Absolutely not. But I can attest that it makes everything a lot freaking easier. \n\nLast, everyone who had kids young is right: you'll have more energy and you'll be able to travel in your 40's. Unfortunately, you're giving up the spontaneous things that make your childless 20's so fun: closing down a bar/restaurant with friends, staying up all night for any reason, piling a bunch of people in the car and taking a trip somewhere and staying in a cheap motel (trust me, shitty mattresses and bad backs become a thing in the future.) basically, you'll absolutely have your freedom in your 40's but you'll still be a parent and you'll still have your responsibilities. There's something very freeing about doing stuff in your 20's. I wouldn't give up that time I had for anything. \n\nAnyhoo. You make the decision that's best for you!  Either way, you're going to end up with a kiddo you love and adore!  ", "controversiality": 0, "created_utc": 1453588445, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9ds3p", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454685596, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Monsterandmayhem", "author_flair_css_class": null, "author_flair_text": null, "body": "At 19 I spent three weeks traveling in England, and at 21 I backpacked through Sweden for a month. Those trips were awesome and I'm glad I did them! But honestly they would be so much cooler now if I could take my husband and boys, and I think all the time about showing them all the cool stuff I saw and feeding them all the weird things I ate :P I wish I had waited and taken those trips with my family. Although at 23 before getting knocked up my husband and I spent a week in the DR and it was one of the highlights of my life :) wouldn't repeat that one with my kids!", "controversiality": 0, "created_utc": 1453589143, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9e6xt", "link_id": "t3_42bari", "parent_id": "t1_cz92uhx", "retrieved_on": 1454685790, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rc1965", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I met when I was 18, our first daughter was born just before my 24th birthday and our second will be born in a couple months shortly after my 26th. I always wanted kids, always wanted to start before 25. These were just things I wanted and we had a home, education, transportation, he has a great job so now I'm going to get my master's while staying home with the girls. I'm happy, I get the \"young mom\" bs when I mention my actual age but I really don't care, I'm happy and we were responsible and had our poop in a group.", "controversiality": 0, "created_utc": 1453593424, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9gm27", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454686942, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fuss_bucket", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 31, raising an almost-2-year-old, and have many times wished I'd had kids younger for the sole reason that I could operate on WAY less sleep than I need now. However, I was a hot mess psychologically at 23 and wouldn't have done well under the stress of new motherhood and parenting. My relationships wouldn't have withstood it either. It drops a bomb on your life, no joke. A good bomb, like a love bomb, but still. They don't ruin your life, they ruin your life as you know it. And you pick up the pieces and (hopefully) build something awesome. \n\nYou sound a lot more grounded and stable than I was at that age, and I think that's really what it boils down to. Yes, get your finances in order, but what kids really need is patience by the bucketful and a sense of physical and emotional security. (And love, obs). If you're in a good place to provide that, you're golden. If you'd like an outside perspective maybe you could speak to a therapist or counsellor to get some honest feedback on where you appear to be in your emotional development. \n", "controversiality": 0, "created_utc": 1453594224, "distinguished": null, "edited": 1453594500, "gilded": 0, "id": "cz9h1s4", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454687148, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "laidback_hoser", "author_flair_css_class": null, "author_flair_text": null, "body": "Stability and the ability to prioritize properly. Realize that there will be no more going out whenever you feel like it at the drop of a hat, you might have to go without sometimes because your kid needs something, etc.", "controversiality": 0, "created_utc": 1453594459, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9h6bf", "link_id": "t3_42bari", "parent_id": "t1_cz90p1n", "retrieved_on": 1454687207, "score": 18, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Eyeoo", "author_flair_css_class": null, "author_flair_text": null, "body": "Others have brought up all the good points already. I just want to reiterate a couple of things:\n\n1) Rock solid relationship. Soooooo important. I've seen so many break apart when a baby comes, even for people that have been married for 5+ years. Basically, if there's ANYTHING about him at all that irks you (and vice versa), it needs to be completely addressed. He's always leaving his dirty laundry on the floor and you resent him just a teeny bit for it? But you've been dealing with it for years and think it's no big deal? It'll blow up. I recommend marriage too, but more importantly really getting the hang of living together and doing things as a couple, to the point where it's as natural as just living by yourself. Only then can you add other family members. I only have a toddler right now, she was born on our second wedding anniversary. We dated for 5 years prior to that, and were friends for 2 years before dating. I knew him inside and out, and definitely worked hard to get to a point where I was completely comfortable living with him. I think the baby brought us together even more because we were already so in synch, but I can totally see how fragile it could make a relationship.\n\n2) Financial stability. No matter how well off you think you are, it's not enough with a kid. Let alone 4 kids. We're supposed to be quite well off, we both earn $100k+. Let me tell you, it does not feel that way at all. Running a house with kids can be insanely expensive. After mortgage, bills, cars, insurance, daycare, kids things etc that need constant updating, we barely have any to put away for a rainy day, or for big projects like finishing the basement. As your kids grow up, they'll have extracurricular activities that cost more money. Multiply that by multiple kids. I know a lot of kids grow up without all the extras, and most people with a lot lower income can manage, but my point is simply to be aware of all the extra expenses that are here to stay, and it will add strain to what you thought was a good financial situation.\n\nA little addendum. Health-wise, I was 31. I had a completely worry free pregnancy. Except for tiredness and loss of appetite at the beginning, I felt great all the way through. I won't go into details, but I had a c-section and recovery was a bitch. I'm left with problems in my knees (from overuse because my abs hurt like hell for a month), a mushroom-like body, extra fat that won't go away, also haven't been able to exercise for the longest time. My uterus still hurts on occasion. I think that if I were younger, the physical part could've been a lot easier. But overall I'm glad I was where I was - in my relationship, my education/career, the amount of $ I was bringing home, etc. I couldn't have been able to deal with a baby if any of those was compromised.\n\nAll this is just personal experience and opinion. I know people who are in a lot less ideal situations with kids that thrive. I just wouldn't be able to myself. Whatever you decide, good luck!", "controversiality": 0, "created_utc": 1453594978, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9hgjd", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454687341, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ur_favourite_psycho", "author_flair_css_class": null, "author_flair_text": null, "body": "I just wish I had more energy to do things with him.  I feel awful not being able to constantly run around with him and be playful :(", "controversiality": 0, "created_utc": 1453595247, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9hm0b", "link_id": "t3_42bari", "parent_id": "t1_cz9cs12", "retrieved_on": 1454687413, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonynomnom9", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, but the thing is, you can do a log cabin with kids. Not so much backpacking through Europe. All of this depends on your personality and finances, but I am SO glad my husband and I traveled a lot internationally and focused on our hobbies before kids, because I look back on those times so fondly and felt so ready to have kids.  I think seeing the world is really import t. But for some people that would not be a priority. I had my first at 30...", "controversiality": 0, "created_utc": 1453595546, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9hrxd", "link_id": "t3_42bari", "parent_id": "t1_cz92uhx", "retrieved_on": 1454687490, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonynomnom9", "author_flair_css_class": null, "author_flair_text": null, "body": "Kids don't ruin your life, but they do change it in ways you just can't imagine now. And once they are there, you can't go back. I LOVE my children immensely, but I'm very very glad I had \"me\" time and \"us@ time with my husband before we took the plunge. It may not feel like it, but you are still very young and have a lot of life, maturing, etc", "controversiality": 0, "created_utc": 1453595818, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9hxc9", "link_id": "t3_42bari", "parent_id": "t1_cz966ut", "retrieved_on": 1454687561, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KatBarre", "author_flair_css_class": null, "author_flair_text": null, "body": "I recommend getting married first, before kids. It isn't because I'm religious, I am not. It's because you need someone who can't just leave without a fight, and because insurance will be easier. Practical things. \n\nSecond, I had my daughter right before I turned 28. I live in West Los Angeles. I am the youngest mother in all the Mommy groups and all my \"friends\" before baby disappeared. My husband, same age as me, is an attorney. He had 2 weeks off from work (he only took 6 days, really) and that was all the help I had(figure our your allotted leave time, insurance, and hire help for sleep depreviation).My daughter had colic and had poor sleep habits until well past age 1. Childcare is expensive, as much as my job pays. I work from home now as an art broker, selling a relatively famous artist's work, but I last-minute landed that after my daughter was born. ", "controversiality": 0, "created_utc": 1453596561, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9ic3d", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454687754, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Acornkramer", "author_flair_css_class": null, "author_flair_text": null, "body": "I always say my baby came at a perfect time in my life and she could have come at a better time as well.  It's not supposed to make sense but it does. Planning a perfect life doesn't always go to plan, but I prefer surprises ", "controversiality": 0, "created_utc": 1453597484, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9iuwa", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454688001, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "luckysevensampson", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I want to be a mom, I want kids while I'm fit and healthy and can run around with them\n\nThis is kind of irrelevant. You're as fit and healthy as you want to be. I'm in my 40s with young kids, and I'm fitter than I've ever been. Age only slows people down when they get complacent about their health and fitness (or if they lose the genetic lottery).\n\n&gt; So mommies of Reddit, when did you have your kids and how did it turn out? I'll answer any questions you may have if that I'll help give you advice.\n\nI'm a proponent of waiting a bit to have kids, not necessarily as late as I did (I didn't meet my husband until I was 30) but at least until you've gotten a degree, had a bit of a career, and traveled internationally a few times. Lots of people who have kids young say \"I can travel when my kids are out of the house. I'll still be young enough to enjoy it.\" The thing is, though, that that often just doesn't happen, and when it does it's a totally different type of traveling that isn't half as adventurous. In addition, you're not anywhere near as decrepit in your 40s and 50s as you assume you'll be when you're younger, so there's no reason you can't travel both before and after having kids.\n\nI had my kids in my late 30s, and I honestly feel like if I died tomorrow, I would die content that I've lived a full and complete life. I've not only travelled but also lived in other countries, I've received a great education in a STEM field and have worked on really interesting projects that have taken me to incredible places. Now I have kids, and the foundation that my husband and I have set through our educations and careers allows us to travel internationally with our children every year (which is just as valuable to our children's education as any of the rest of their schooling). I eat healthy and take care of myself by running marathons, and this also teaches my children the importance of health and fitness.\n\nThere are lots of other very good ways to live your life, but I can definitely say, without a doubt, that the path my life has taken is good one, and I think my kids benefit from it as well. I'm definitely a far better parent to them than I could have been in my 20s, as I have become wiser in ways that wouldn't have occurred to me then and also have infinitely more patience. Life is good, and parenting is a breeze. Maybe I just got lucky with my kids, but I can't help but wonder if the ease of parenting has something to do with my age.", "controversiality": 0, "created_utc": 1453597926, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9j3rq", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454688116, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Chocobean", "author_flair_css_class": "lightcoral", "author_flair_text": "mom of a happy toddler", "body": "You sound very thoughtful :) you will be great. \n\nYou heard correctly that there is no perfect time: I will amend it slightly. There's no perfect time but there are much better times than others. \n\nYou want four, and you want to be young-ish and fit. You should probably start from age 35 and count backwards for number of kids you want and ideal spacing. Like, last of 4 at 35, #3 at 32, #2 at 30, #1 at 28, that kind of thing.  That's just for the physical part since 35 is a good down turn in fertility. \n\nMentally, you need to be HAPPY to be ready. If your relationship with life, work, god or alternative, family etc are happy, you will have so much more resources to pass on happiness to your dependents. It doesn't matter if you're rich or old or simple, as long as you are happy with who you are and what life is like you are ready. \n\n", "controversiality": 0, "created_utc": 1453598219, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9j9tf", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454688195, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "greeneyedgirl1", "author_flair_css_class": null, "author_flair_text": null, "body": "That's what I am afraid of too. I'm sorry you had to go through all of that.", "controversiality": 0, "created_utc": 1453599718, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9k3ki", "link_id": "t3_42bari", "parent_id": "t1_cz9dr3j", "retrieved_on": 1454688585, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "If you're ready, then go for it!\n\nYou can travel with a family, it's just a lot harder.", "controversiality": 0, "created_utc": 1453599839, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9k636", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454688618, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; A committed partner. (I recommend being married)\n\nOr a \"marriage like relationship\". In some countries, couples can't marry (eg gay couples) and others like me choose not to do it as an ideological choice.\n\nIf you're *stable and committed*, that's key.\n\nOr to flip it around, if you're living with someone, but there's a reason you haven't married *yet* - eg you one day intend to, but you're not there yet - then that's when you should wait to have kids.", "controversiality": 0, "created_utc": 1453600014, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9k9nv", "link_id": "t3_42bari", "parent_id": "t1_cz90p1n", "retrieved_on": 1454688665, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I believe at seven children you're a \"grand multipara\" (congratulations!) but that does come with some associated risks, so your latest pregnancy might not be so relevant to compare a first or second pregnancy to.\n\nMost women I've know who were pregnant in their mid-thirties were super active, if they had been before. That's key. If you were unfit and gasping when climbing stairs before conceiving, pregnancy will be tough.", "controversiality": 0, "created_utc": 1453600244, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9ke83", "link_id": "t3_42bari", "parent_id": "t1_cz91uc3", "retrieved_on": 1454688724, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mpp827", "author_flair_css_class": null, "author_flair_text": null, "body": "I say go for it if you're ready. I was broke as hell at your age,  didn't have a good job or a degree yet, nor did I have a suitable partner. If you think you and your boyfriend have lasting power, and you're in a stable situation and both want the same thing, I see no harm in doing it. I also don't think you have to get married if that's not something you want to do. \n\nI had mine at 32 and 37. I wish I'd had them younger in some ways, but I did have a ton of fun up until they came along. Kids are stressful. They're also awesome, but in no way easy. My pregnancies were also rough (maybe due to age?) and I wanted 3 kids but I'm stopping at two due to my age and finances. \n\nMy one suggestion would be to have nice age gaps between them. Love having 5 year between my kids. I couldn't handle two toddlers at 37, 27, or 17! lol. That's my main reason for wishing I'd started a little earlier, but all of the men I was with in my 20s were idiots, would not have made good fathers, and the relationships would not have lasted. Make sure you have kids with a man who helps without being asked and who has a kind heart! The partner is really the only factor that should matter, imho. I don't know a lot of 20 somethings who get married and stay married. ", "controversiality": 0, "created_utc": 1453600920, "distinguished": null, "edited": 1453601803, "gilded": 0, "id": "cz9kr1d", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454688892, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "joyousbrush", "author_flair_css_class": null, "author_flair_text": null, "body": "In regards to travel I'm 24, from the US and got pregnant with babe at 23.  I've been married for 3 years and bought a house right before we married.   We make about the same amount of money as you do although that's a guess based on your income.\n\nWe have traveled!  We had to save throughout the year and do one big vacation every other year but it's important to us to travel.  We actually went to England while I was pregnant and we have a cruise planned when babe is 11 months old.   I can't wait to take her to new places and explore. \n\nI wanted to be young when we had kids and while it is stressful and weird to have a newborn when my friends are still bar going and just settling down I wouldn't change it.   My mom was 21 when she had me and I admire her relationship with my dad and hope I can the same relationship with babe as what I have with my mom.   \nTo be fair it is hard on your relationship so be sure your relationship with your boyfriend can handle a lot of financial stress and just life stress. \n\nSorry this is so long", "controversiality": 0, "created_utc": 1453601992, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9lbmj", "link_id": "t3_42bari", "parent_id": "t1_cz92uhx", "retrieved_on": 1454689161, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Monsterandmayhem", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! Time helps. And a new healthy squishy baby helps :) pain like that becomes just another part of you, instead of defining you like it does at first. ", "controversiality": 0, "created_utc": 1453603245, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9lzy2", "link_id": "t3_42bari", "parent_id": "t1_cz9k3ki", "retrieved_on": 1454689480, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cal9687", "author_flair_css_class": null, "author_flair_text": null, "body": "I always said I wanted to wait so I could travel and all that. Honestly, I barely had vacation time, my husband either and we spent all our money on a house and maintaining it. Then I looked at my parents who had tons of freedom in their early 40s because me and my sister were old enough to take care of ourselves. They were more financially stable and had more expendable money. So I decided having kids younger made more sense. I was 26 which isn't really all that young but considering I'm now almost 30 and most of my friends still don't have any kids we were young. I don't regret it for a second. In fact, I'm not sure I'd have the energy for it if I waited much longer. I would have loved to do more traveling and we're in a better place to do to it now but it still would have been restricted to when I could get vacation that lined up with my husband. You can still travel with kids too. Granted it's harder and it changes your destination choices but you can still do it! ", "controversiality": 0, "created_utc": 1453604198, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9mhnd", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454689711, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MarianneDashwood", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, it's mostly because I had hyperemesis gravidarum with this one, but also because of complications related to age (GD, etc). But as I said, most women I know say pregnancy was worse at an older age but many women I know have a different experience. I'm just much more tired and feeling too old for this. Luckily I have been able to stay active enough that I have only gained less than 20 pounds or that would make it much worse.", "controversiality": 0, "created_utc": 1453604720, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9mr38", "link_id": "t3_42bari", "parent_id": "t1_cz9ke83", "retrieved_on": 1454689835, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sendCookiesSTAT", "author_flair_css_class": null, "author_flair_text": null, "body": "There is no right answer here- it is a very individual decision, and lots of things can work out really well.  That said, my general advice is to take things as they come.  You may respond to motherhood differently than you think- and you don't want to feel trapped in anything.\n\nI grew up the oldest grand-daughter in a large religious family, so I had been babysitting all my life, with a few summers under my belt as a live-in nanny to infants.  I was certain I would want a lot of kids, I would breastfeed them, and I would stay home with them (as least most of the time).  After I got married (just after turning 22), I decided to set up financial stability and get away from my abusive family before we had kids.  Then I found I really loved working and I loved having money and taking trips to Adults Only resorts and generally spending time with my husband.  After being married 5 years, we were both longing for a child and had a son.  By this point, I had reduced my ideal to 2 - 3 kids, but after having my son, I discovered that I really missed my job and was counting the days to the end of my maternity leave to get back to it.  I love my son and I am discovering what motherhood means to me more each day- but I at this point I don't know if I will have any more kids.  Ironically, my best friend who thought she might never want kids ended up leaving her job and feeling very fulfilled as a stay-at-home mom.  So you don't know for sure how you will actually feel.\n\nOne of the best reasons for waiting the 5 years to have kids was that our marriage (and bank account) was able to weather the storm of having a child that did not sleep for 1.5 years.  If we had our son a few years earlier, I would have had to move in with my parents or my in-laws and I think I would have been looking for a divorce by the end of it.  I was completely shocked at how hard motherhood hit me- physically and emotionally.  I hope that your transition is smoother than mine was, but if it isn't, then you'll need constant support from your partner and either your families or (as in my case) lots of hired help.", "controversiality": 0, "created_utc": 1453604869, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9mtur", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454689872, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MonsoonAndStone", "author_flair_css_class": null, "author_flair_text": null, "body": "You're not wrong, but marriage does include legal protections that may not exist in other, marriage-like arrangements, so it's worth looking into before deciding one way or the other", "controversiality": 0, "created_utc": 1453606375, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9nlro", "link_id": "t3_42bari", "parent_id": "t1_cz9k9nv", "retrieved_on": 1454690306, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rpsychnurse", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 24 and I had my first at 23 (3 months ago). I love what another poster said- it's important to have a stable job, secure housing, and a committed relationship. Which you seem to have on track! If you want to get married I'd almost do that first- it can cost money that you may not feel okay spending once you have littles. \n\nAs for your travel comment- I may be in the minority but I always dreamed of travelling with my kids. I want to share that with them more than anything. Obviously some trips aren't kid friendly so I'd just decide if that's important to you or not. \n\nI love being a young mom so far. I felt ready and I just wanted to share my life with my kids. I don't feel I'm missing out on anything- I just have another buddy to share all my experiences with now!\n\nGood luck! It's a very personal decision and I hoe this thread gives you insight into what's right for you!", "controversiality": 0, "created_utc": 1453606796, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9ntkn", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454690410, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothergirlonreddit", "author_flair_css_class": null, "author_flair_text": null, "body": "It's definitely going into the \"saved\" link for me. A one time reading of all these experiences doesn't give it justice!", "controversiality": 0, "created_utc": 1453606993, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9nx5m", "link_id": "t3_42bari", "parent_id": "t1_cz9ntkn", "retrieved_on": 1454690456, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SingingThroughRain", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my first at 23. I was like you and wanted to have kids young for all the reasons above. I have no regrets!", "controversiality": 0, "created_utc": 1453607001, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9nxao", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454690458, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "JollyRancherEater", "author_flair_css_class": null, "author_flair_text": null, "body": "You have way too many kids", "controversiality": 0, "created_utc": 1453607033, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9nxuj", "link_id": "t3_42bari", "parent_id": "t1_cz91uc3", "retrieved_on": 1454690465, "score": -17, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MarianneDashwood", "author_flair_css_class": null, "author_flair_text": null, "body": "Well thanks! I like them all, so I'm just going to go ahead and keep them all if that's ok. :) ", "controversiality": 0, "created_utc": 1453607466, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9o5tr", "link_id": "t3_42bari", "parent_id": "t1_cz9nxuj", "retrieved_on": 1454690569, "score": 14, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RatSandwiches", "author_flair_css_class": null, "author_flair_text": null, "body": "There is no \"right time\" to have kids for sure. But some times are better than others for individuals at different times in their lives. My only advice, at any age, would be to do some very deep soul searching about your relationship before having children with someone. Divorce and separation after a child are by no means the worst thing that can happen, but ending a relationship that has produced a child is so much more complicated than one without a child (assuming both of you want to continue being a part of the child's life). I would honestly put this before many other considerations. ", "controversiality": 0, "created_utc": 1453607529, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9o6ym", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454690584, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cadense", "author_flair_css_class": "green", "author_flair_text": "Matthew Ryan 7/3/2013", "body": "I got married 5 months after I turned 21. My son was born almost exactly 9 months after my husband and I got married, when I had just turned 22 two months before, and I have pretty mixed feeling about it. I always wanted to be a young mom but we just weren't really prepared to be parents yet. Not that we're terrible parents, my son has never wanted for anything, but we just weren't at that stage in our life where we wanted kids yet. \n\nI love being a mom this young! My husband and I both grew up with older moms who were always too tired to take us to do fun things so it's awesome to be able to take my 2.5 year old out to do things and not be tired. Plus we have plenty of time to decide if we want to have one or two more. Money is sometimes tight but it's never been too bad. We've never gone without things we've needed. The only thing I sometimes don't like about it is that all my friends are out doing fun things and I can't go with them because I have a 2 year old. It does suck sometimes and I get jealous but I still don't regret having my son.\n\nThe way I see it is there will be time for traveling and things when my husband are in our 40's and my son is off to college or whatever he wants to do with his life. Plus traveling with kids is doable, you just have to adjust your expectations. There will never be a right time to have kids. You just have to decide what your main priorities are and adjust your life to meet them. If having kids young is a priority for you then you'll be fine with doing all the \"fun things\" later.", "controversiality": 0, "created_utc": 1453607894, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9odk4", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454690671, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lolaordie", "author_flair_css_class": null, "author_flair_text": null, "body": "my mom was 19 when I was born and though it was irresponsible having a kid at her age without money, a career, a stable partner, etc, I've always loved that she had so much energy and she was kind of the cool crazy mom. I became a mom in December, I was 19 - now 20, and it's amazing, I don't regret it. it wasn't planned but his dad and I have been together for four years and everything is perfect. it is hard to keep up with what we're studying but I don't want to stop doing it so I'm just doing everything at the same time. \nif you want to be a young mom go for it!", "controversiality": 0, "created_utc": 1453608187, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9oj3x", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454690744, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "JollyRancherEater", "author_flair_css_class": null, "author_flair_text": null, "body": "You still somehow have time for reddit...so I suppose you can keep them", "controversiality": 0, "created_utc": 1453608820, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9otur", "link_id": "t3_42bari", "parent_id": "t1_cz9o5tr", "retrieved_on": 1454690884, "score": -16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, that's true. We're reasonably lucky here with \"de facto\" rights in Australia. ", "controversiality": 0, "created_utc": 1453609864, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9pbno", "link_id": "t3_42bari", "parent_id": "t1_cz9nlro", "retrieved_on": 1454691117, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "valereea93", "author_flair_css_class": null, "author_flair_text": null, "body": "i love everything you said. \n\ni always wanted to have kids young as well but the more i spend time with my husband the more i want to wait. im currently in graduate school and my husband is still trying to finish up his bachelors while working full time (he is such a trooper). Im 22, he is 25 and we have been married for almost three years now and our life is so much fun. we stay up late (sometimes) we go out drinking, we travel for fun almost every weekend. i love that my husband and i are spontaneous and that we can spend random money on random things and not feel bad because we have basically no responsibilities. We both want kids. a lot of them. but we also know how much fun we have together. Luckily we have really good communication and know that we both want our own house, good jobs, financial stability and health (i have some back issues that could require surgery) before we start. it might take a while but it will be worth it! ", "controversiality": 0, "created_utc": 1453612395, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9qguf", "link_id": "t3_42bari", "parent_id": "t1_cz9ds3p", "retrieved_on": 1454691656, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sunderella", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I wouldn't give up that time I had for anything. \n\nI think this line is the most telling in your entire post. You say *I* wouldn't give that time up. It's all a matter of priorities. \n\nI never enjoyed the partying scene or dating around. I like being married young. I'm not giving up things that make my life fun if I don't enjoy them to begin with. That may be the case for you, but it's certainly not for me. ", "controversiality": 0, "created_utc": 1453612904, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9qovq", "link_id": "t3_42bari", "parent_id": "t1_cz9ds3p", "retrieved_on": 1454691761, "score": -2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sour-tomato", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm 30 and I've just had my first baby. I've travelled, I've lived crazy, I've had a lot of sex and done some crazy and wild things. I'm fully satisfied that I've ticked the boxes and lived. I'm still young but if I could do it all over, I'd probably have done the baby stuff when I was around 26. \n\nSome of us are born to be mum's :) x", "controversiality": 0, "created_utc": 1453615052, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9rlrv", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454692192, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Poobaby", "author_flair_css_class": null, "author_flair_text": null, "body": "Cool, babies are awesome. I think being a young parent is great and congratulate you on wanting to conmit yourself to your children early in life. It is a big commitment to make that many young women don't want, the fact that you want it demonstrates your readiness to me :)", "controversiality": 0, "created_utc": 1453615637, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9ru6x", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454692302, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DOITDOITDOITORDONT", "author_flair_css_class": null, "author_flair_text": null, "body": "30 year old 1st time parent here, I agree with everything you wrote. I've wanted kids since I was 18 &amp; I am so glad I waited. I lived it up in my 20s, and I'm ready to give my all to my children now. I don't feel like I'm missing out on all the debauchery I experienced in my 20s. ", "controversiality": 0, "created_utc": 1453619052, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9t3aj", "link_id": "t3_42bari", "parent_id": "t1_cz9ds3p", "retrieved_on": 1454692892, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "i_am_the_last_one", "author_flair_css_class": null, "author_flair_text": null, "body": "If you want to travel, I suggest to do it now without children, and then again with. Yes, I understand right now you want to be financially stable because you want children, but if your thoughts are always with the future how might you enjoy the present? Just a bit of advice from someone who has \"been there, done that\". I had a hellavu lot of fun in my 20s including studying abroad and with that came traveling internationally. Now that I'm married and have an almost three year old, I can't wait to travel with her.\n\nI had her when I was 35 and no regrets here whatsoever. I was fit and healthy before I had her, so my energy/health/whatnot was not effected. \n\nChildren will change your life and in no way possible can you be ready for that 100%. I heard a great quote once, \"You live the first half of your life for yourself, the second half is for your children.\" I say think of it like that. Be selfish now! And yes, make sure you take time for you after you have kids too, but I see my cousin (who had her first child at 17) trying to play catch up now in her 30s and it's kind of sad to me. \n\nEnjoy your youth now, have adventures so you'll have something to look forward to sharing with your children later. \n\nGood luck to you! ", "controversiality": 0, "created_utc": 1453619911, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9tdco", "link_id": "t3_42bari", "parent_id": "t1_cz92uhx", "retrieved_on": 1454693025, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "caramelolives", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not a mom yet, but I lurk here an awful lot. On my 24th birthday (one month ago today) my fiancé told me he was ready to start trying. We've lived together for three of the four and a half years we've been together, and we're currently renting a condo. He's job hopped a bit, but has been with his current employer eleven months. I've been with my current employer for eight years this year, and they're helping me pay for grad school so I can advance. That will still put me in a frightening amount of debt, but I'm eligible for loan forgiveness after ten years working full time in the field. The reason we chose to have kids now (aside from the fact that this is just the age people in my family have kids) is because I'm part time at work and my grad degree is entirely online, so it will make it easy to exclusively breastfeed over the first six months (provided I get knocked up reasonably soon) and we won't have to worry about too much childcare. Hopefully I feel ready to go back to full time by the time I get my degree. \n\nBest of luck to you!", "controversiality": 0, "created_utc": 1453620280, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9thhb", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454693078, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "resavr_bot", "author_flair_css_class": null, "author_flair_text": null, "body": "*A relevant comment in this thread was deleted. You can read it below.*\n\n----\n\nI joined the Army when I was seventeen, met my husband at nineteen, and had our daughter a month shy of my twenty first birthday. I am now twenty three, with a beautiful two year old. I'm a full time college student and my husband is still active duty. Having a kid does impact your ability to do things as freely as you want to, but it is not an end all for fun things. Your life will revolve entirely around the needs of this child and your needs will become secondary most of the time. [[Continued...]](http://www.resavr.com/comment/im-23-kids-young-2573466)\n\n----\n\n\n*^The ^username ^of ^the ^original ^author ^has ^been ^hidden ^for ^their ^own ^privacy. ^If ^you ^are ^the ^original ^author ^of ^this ^comment ^and ^want ^it ^removed, ^please [^[Send ^this ^PM]](http://np.reddit.com/message/compose?to=resavr_bot&amp;subject=remove&amp;message=2573466)*", "controversiality": 0, "created_utc": 1453630931, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9w8vd", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454694451, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; A committed partner. (I recommend being married)\n\nA committed partner who is also enthusiastic about being a parent. Read a partner vent every few days on /r/beyondthebump about dad's who don't help, and it breaks my heart. I'd also advise against starting a family with a man who can't cook a meal and clean up afterwards, and needs his hand held to tidy a room properly.", "controversiality": 0, "created_utc": 1453632626, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9wm7e", "link_id": "t3_42bari", "parent_id": "t1_cz90p1n", "retrieved_on": 1454694626, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel like planning for the age you want to be a grandparent is getting a bit ahead of yourself. What if your kids don't want kids? Head over to /r/childfree to see the other side of that equation.", "controversiality": 0, "created_utc": 1453632675, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9wmlp", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454694630, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "notfrandrescher", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; The thing is, though, that that often just doesn't happen, and when it does it's a totally different type of traveling that isn't half as adventurous\n\nYES!  THIS!  We have traveled all over with our 15 month old daughter (she's been on 20+ flights) but holy shit is travel an entirely different beast now.  \nI'm now stuck in hotels/apartments during naptime(s) because we have a child that refuses to nap in her stroller/carrier.  We also have a toddler that goes to bed at 6:30pm so late night dinners, evening strolls, *any* night time activities?  Out of the question.  \nWe realized early on that we'd have to pony up extra money for one bedroom suites in hotels because if we didn't we'd be putting our baby/toddler to bed at 6:30pm and then sitting in the dark, making no noise so we didn't wake up the baby.  \nWhile traveling with the little one we now have  a very set amount of time in between eating and nap time/bed time to go see things.  It completely changes how you travel.  \nWe're going to Spain this spring and we're taking a nanny with us.  It seems ludicrous for three adults to be there for one child but we realized we really wanted to *enjoy* our vacation!  We're going for two weeks and the nanny will alternate working the morning/early afternoon half of the day or the late afternoon/evening half of the day. We'll still get plenty of opportunities for late night dinners, explorations, and wanderings but also get plenty of time with our little one!  ", "controversiality": 0, "created_utc": 1453639680, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9y9ng", "link_id": "t3_42bari", "parent_id": "t1_cz9j3rq", "retrieved_on": 1454695404, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NikkiP0P", "author_flair_css_class": "purple", "author_flair_text": "Rory born 7/14/15", "body": "You already have lots of comments here, so I will tell you what I did:\n\n23 - I married my now husband, we bought our first house. \n\n24 - paid off debt, bought new car to replace DHs\n\n25 - 2 vacations, savings\n\n26 - dream trip to Australia, started trying\n\n27 - bought larger house, had first kid, replaced second car\n\n\nThere have been a few times we've been strapped for cash in the beginning, but we both have 2 degrees and great jobs and we commute from the burbs to have the space and finances we want. We love to travel and we made that a priority first because God it's going to be forever until we can again. Do it now. We also, it isn't listed, visited his family up north at least once a year. \n\nGood luck! Do what works for you ", "controversiality": 0, "created_utc": 1453643291, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9zam5", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454695888, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "idkwhatdoyouwannaeat", "author_flair_css_class": null, "author_flair_text": null, "body": "Wait a few years. Your twenties (especially your early twenties) are for making mistakes and taking chances. You learn a lot about yourself and your partner in that time. \n\nThere is lots of time to have kids. Live in the present for a little while, learn who you are, what you really like. Challenge yourself to try new hobbies and go new places before adding \"mom\" to your description.", "controversiality": 0, "created_utc": 1453644262, "distinguished": null, "edited": false, "gilded": 0, "id": "cz9zmeu", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454696042, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "defguysezhuh", "author_flair_css_class": null, "author_flair_text": null, "body": "“\"Having children is like living in a frat house - nobody sleeps, everything's broken, and there's a lot of throwing up.” – Ray Romano\n\nI'm a dad here, so I hope you don't mind me jumping in... /u/500Hats said it perfectly: steady income, your own place, transportation, phone, and a committed partner.  With that said, it's true that there's never a right time or wrong time for kids.  My wife and I wanted to wait a couple years after marriage to discuss kids, especially since multiple doctors told her while growing up that conception would be extremely difficult if at all possible (short version: her uterus is completely flipped).  We ended up with a honeymoon baby.\n\nWe had all the other previously mentioned requirements except financial stability.  We weren't ready, financially, and we struggled for a long time.  However, we wouldn't change it for the world because parenthood has been the best thing for us, watching our daughter (now four years old) grow and learn.\n\nThe only other thing you need to remember is priorities.  I often joke about how I wanted to name our kid(s) after their designated chores (\"Dishwasher\", \"Laundry\", \"Lawn Mower\", \"Bring Daddy Beer\" - in that order) and how the day will come when I tell my daughter, \"Sorry baby, but school lunch will have to wait because daddy's got a new video game preordered\" but your kids will always have to come first, obviously.  You will miss the days when you were single/not a parent once in a while (baby's first Christmas, we all got the same stomach virus on Christmas Eve; mama and daddy spent all night playing \"pass the baby\" while running for the toilet), but I promise it's worth it.  All the bad stuff (the sick nights, the doctor/hospital visits, the explosive diapers, the sleeplessness, etc.) are greatly overshadowed by the good things (the cuddles, the unconditional love they give, watching them learn and grow, watching them succeed, all of their many firsts).\n\nHowever, while your first priority will and should always be your kids, you cannot neglect yourself.  When the kid hasn't slept in days, take turns with your partner so you each get SOME sleep, even if it means kicking each other to a family member's or friend's house for a few hours or overnight to catch up on some sleep.  Your days of going out alone or as a couple may be much more limited, but they are no less important.  You'll both still need that time out with your friends and with each other to just decompress and have fun.\n\nIf becoming a mom is calling for you, then talk about it.  See how your boyfriend feels.", "controversiality": 0, "created_utc": 1453645564, "distinguished": null, "edited": false, "gilded": 0, "id": "cza031q", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454696260, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mommasaur", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my first kid at 23. Had my second one at 25. I will say wait and save and do all the things you want to do before having kids. I don't regret having my boys young but I do regret not doing all the things I wanted to do before kids like finish college, travel, live on my own, and only have to worry about myself for a while. \n\nI suggest getting that debt down a bit and find a nice, steady job that'll be helpful time wise (maternity leave) and stable. ", "controversiality": 0, "created_utc": 1453667108, "distinguished": null, "edited": false, "gilded": 0, "id": "czac2ug", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454702052, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MommyLI", "author_flair_css_class": null, "author_flair_text": null, "body": "I always wanted kids.  That being said, I waited until I was 31 to start trying to get pregnant.  We were married for a year, although we had been living together for a total of 9 years.  I may be old and tired now (just had baby #3), but I do not regret waiting to have kids.  It was the perfect time for us, and we had just finished a marriage workshop class together.  That being said, it's really up to you when you feel like you are ready.  The only thing I would caution is that you mention you have a boyfriend of 3 years.  Kids are a lifetime commitment.  And generally speaking, they tend to cause problems in relationships.  Almost every relationship gets rocky once the baby comes along.  Even previously perfect relationships.  If both of you are not mentally in a position to be ready to get married, you are both probably not in a mental position to be ready for children.  And I always encourage first time pregnant mom's to take a relationship class, or marriage counseling, with their partner before the baby arrives.  You would be surprised at the unspoken, and often contradictory, expectations each partner will have of the other with regards to child rearing. ", "controversiality": 0, "created_utc": 1453669231, "distinguished": null, "edited": false, "gilded": 0, "id": "czadpiu", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454702822, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "luckysevensampson", "author_flair_css_class": null, "author_flair_text": null, "body": "While this is all certainly true, I was actually comparing traveling before having kids to traveling after your kids have grown up and left the house, since that's when most young parents envision doing their traveling. The thing is, when you're older, the last thing you want is a group of drunk 20-somethings stumbling into your hostel dorm, waking you up at stupid o'clock in the morning, so you stay in private rooms or proper hotels. You stick together with your husband/wife, and while you certainly have a good time, it's more private time doing planned activities. When you're in your 20s, even if you're not one of those stumbling in drunk, your dorm-mates are the people you end up befriending along your journey and have impromptu side adventures with. They're the ones who say, \"Hey, a bunch of us are going rock climbing at [insert popular climbing spot]. Want to join us?\" And then you go along and learn to rock climb, because why the hell not? Some of the greatest adventures traveling are a result of meeting other random travelers and doing spontaneous activities with them. There's so much less of that when you're older and don't stay in hostels.", "controversiality": 0, "created_utc": 1453679446, "distinguished": null, "edited": false, "gilded": 0, "id": "czakwl0", "link_id": "t3_42bari", "parent_id": "t1_cz9y9ng", "retrieved_on": 1454706283, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "If you want to have kids soon, I would prioritize paying your student debt over traveling.  \n\nI disagree with another poster, I think having your own home isn't important.  Especially if we are talking a 'starter home' type situation, you can have more predictable costs and savings by renting.  So, do not buy a home if it means you don't pay off your student debt.\n\nI'm NOT saying you have to have your student debt paid off to become a parent - god knows I don't and I have $80,000 of law school loans.  \n\nI had my first kid the year after I passed the bar exam, at age 27. I wish I could have started earlier, but I worked full time and went to law school at night and there was no way to stack pregnancy and motherhood on top of that, I was at my wits end.  ", "controversiality": 0, "created_utc": 1453730792, "distinguished": null, "edited": false, "gilded": 0, "id": "czb7e10", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454717091, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "One of my friend's mum had my friend at 23 or 24, her husband sadly passed away a few years later and she remarried at 35 and had another child at 36 and she always said that pregnancy in her early twenties was a breeze compared to her 30s and she's only had two children. \n\nAlso just had to say I love your username! Marianne Dashwood is one of my favourite Jane Austen heroines, I was heartbroken when Alan Rickman died, I know that most people think of him as Snape in Harry Potter but to me he'll always be Colonel Brandon :) ", "controversiality": 0, "created_utc": 1453735093, "distinguished": null, "edited": false, "gilded": 0, "id": "czb9n74", "link_id": "t3_42bari", "parent_id": "t1_cz91uc3", "retrieved_on": 1454718152, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "My feeling is that it's not about the right timing, it's about the right person. If you feel that this man is the one for you and you would have a blast raising a baby, go for it. Don't wait. You're circumstances won't change. You'll be who you are, where you are but with a baby. Any good relationship can handle having a baby.", "controversiality": 0, "created_utc": 1453757459, "distinguished": null, "edited": false, "gilded": 0, "id": "czbpebe", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454725598, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "emzilla0220", "author_flair_css_class": null, "author_flair_text": null, "body": "I would reccommend trying to pay all your debts, also I don't know what kind of area you live in but if you will have to put baby in a daycare then research\n the prices on that. Also make sure that you take care of any dental issues. This is because if you have dental problems while you are pregnant it can actually affect the fetus. So now is the time to get that stuff done.", "controversiality": 0, "created_utc": 1453994151, "distinguished": null, "edited": false, "gilded": 0, "id": "czf5xku", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454785421, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pregonewb", "author_flair_css_class": null, "author_flair_text": null, "body": "I waited a long long time... Ok I was 28 when I first got pregnant but my husband and I married when we were 21. If your boyfriend is on board I think anytime is a good time. Waiting for the perfect time is just not reasonable, obviously you are doing well and not struggling as there are definitely bad times to have a baby. I wish I had done it younger, you get stuck in your ways the older you get and babies are a huge change. I have seen people recommend marriage but I think that is a personal decision and the commitment to have a baby with someone is a much bigger commitment than marriage, especially these days. I think 25 would have been a perfect time. A little more prepared for life but not so use to life. I feel I would have adapted to motherhood more naturally had I done it then. ", "controversiality": 0, "created_utc": 1454258301, "distinguished": null, "edited": false, "gilded": 0, "id": "czioc2c", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1454846331, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Wbevil", "author_flair_css_class": null, "author_flair_text": null, "body": "I wanted kids young too. I am now though 32 and just had my first. The only reason I waited was because I saw my sister have children and it changes EVERYTHING. It's awesome and I wouldn't change what I have for the world (although currently my 6 month old has given up on sleep) but our lives are forever changed. You can't undo having a baby. I'm so SO glad I waited. I got married and had a career and had fun!!!! And one day I woke up and said \"now I am ready\". I also now have patience that I didn't have 10 years ago along with life experience. My advice is think about it. Think about ALL of it. Are you ready to give yourself to someone else completely? It's ok if you aren't and it's ok if you are either way good luck!!!", "controversiality": 0, "created_utc": 1454653752, "distinguished": null, "edited": false, "gilded": 0, "id": "czokm0o", "link_id": "t3_42bari", "parent_id": "t3_42bari", "retrieved_on": 1458302495, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}