{"submission": {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1453927646, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/42zl3g/has_anyone_experienced_a_feeling_of_impending/", "gilded": 0, "id": "42zl3g", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 69, "over_18": false, "permalink": "/r/Mommit/comments/42zl3g/has_anyone_experienced_a_feeling_of_impending/", "retrieved_on": 1455036486, "score": 65, "secure_media_embed": {}, "selftext": "Hi Ladies. I didn't know who to turn for this but it's been on my mind so much and I don't know what to make of it or how to control it anymore.\n\n\nJust some background: my grandmother died when I was 6 and it really affected me. I was confused and scared and got sick for 3 months. My mother died of cancer 4 years ago. I had a baby 12 months ago.\n\n\n\n\nI just have this feeling that I am going to die or that I am not going to be here for very long. As it gets closer and closer (to what I don't know,) it seems to affect me more and more. Last night, I started crying because I felt like my time is coming up. I've had this urgency to tell people how I truly feel about them. It comes and it goes. Sometimes I feel it but then the next it feels like it's not true and I should just enjoy life. \n\n\n\nI have come to the point where I don't know what to trust. Is this instinct trying to tell me something? Is this paranoia? Is this because I now appreciate life and have something to live for? Is this how Alexander Hamilton felt where he knew he was going to die but didn't know when? What if it's like Harry Houdini, where I have spent my whole life wanting to know about death. How people know they're going to die. How people cope with knowing they're going to die. That when I get my own insight I don't trust it and end up dieing without doing anything I wanted to do. Or maybe, I DO KNOW I am going to die. At some point. Hopefully when I am older and this is just that realization and now the contemplation of how to make the most of my life.\n\n\nHas anyone ever experienced this feeling before? Well, I guess if you did you'd be dead but it's always on my mind and freaks me out.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Has Anyone Experienced A Feeling of Impending Death After Having A Baby?", "url": "https://www.reddit.com/r/Mommit/comments/42zl3g/has_anyone_experienced_a_feeling_of_impending/"}, "comments": [{"author": "bronzeandblush", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm still a bumper but this sounds like a panic attack to me.  I have had them for years but have done a lot better job of coping and recognizing them.\n\nI just skimmed [this link](http://www.anxietycoach.com/overcoming-panic-attacks.html) - didn't read all of it - and it seems to have some good advice for handling a panic attack as it happens.\n\nGood luck and know that you're *absolutely* not alone in feeling this way.\n", "controversiality": 0, "created_utc": 1453928807, "distinguished": null, "edited": false, "gilded": 0, "id": "czeb7if", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454770660, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "Thoughts like these after having a baby are common, even though people don't often talk about it. What you're describing could be a form of postpartum anxiety, partially due to your background, and partially attributable to postpartum hormones. It's real, it's temporary, and it's treatable. \n\nIf you would like to discuss your concerns with a compassionate, trained volunteer who can refer you to local resources, please contact Postpartum Support International. If you are in the US, the helpline number is 1-800-944-4PPD. (If you live somewhere else, here's a link to support listings in other countries: http://www.postpartum.net/get-help/locations/international/.) Please keep in mind that the number I gave you is a warmline, not a hotline; you'll likely have to leave a message and someone will call you back within 24 hours. ", "controversiality": 0, "created_utc": 1453929003, "distinguished": null, "edited": false, "gilded": 0, "id": "czebcts", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454770730, "score": 66, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bonjourtabby", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree that it sounds like you may have postpartum anxiety. Whether or not that's the case it sounds like something that a therapist could help with! Sometimes talking to someone can help so much and they can help figure out if this is PPA. ", "controversiality": 0, "created_utc": 1453931902, "distinguished": null, "edited": false, "gilded": 0, "id": "czedju3", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454771764, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Awww thank you. This makes me feel better.", "controversiality": 0, "created_utc": 1453932190, "distinguished": null, "edited": false, "gilded": 0, "id": "czedrb0", "link_id": "t3_42zl3g", "parent_id": "t1_czeb7if", "retrieved_on": 1454771862, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. Thank you so much for the support. I truly appreciate it.", "controversiality": 0, "created_utc": 1453932224, "distinguished": null, "edited": false, "gilded": 0, "id": "czeds6h", "link_id": "t3_42zl3g", "parent_id": "t1_czebcts", "retrieved_on": 1454771873, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much. It makes me feel better to know that this is common and not truly instinct that I might day. Soon.", "controversiality": 0, "created_utc": 1453932746, "distinguished": null, "edited": false, "gilded": 0, "id": "czee5ar", "link_id": "t3_42zl3g", "parent_id": "t1_czedju3", "retrieved_on": 1454772045, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rpsychnurse", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes. It was absolutely terrifying! I agree with everyone else- I was diagnosed with post partum depression. It got better with medication and therapy- but those feelings were the worst I've ever felt.", "controversiality": 0, "created_utc": 1453937641, "distinguished": null, "edited": false, "gilded": 0, "id": "czehdyn", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454773572, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh wow. Thank you for sharing. Are you over it now? How long did it take? How long ago was this? Obviously you're not dead now so go you!", "controversiality": 0, "created_utc": 1453940377, "distinguished": null, "edited": false, "gilded": 0, "id": "czej31c", "link_id": "t3_42zl3g", "parent_id": "t1_czehdyn", "retrieved_on": 1454774441, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheSavageBallet", "author_flair_css_class": null, "author_flair_text": null, "body": "I remember laying next to my son for nap time when he was about three months old and having my first real panic attack. All I could think about was what if I just had a aneurysm or something, who would take care of him, what if I fell asleep and didn't wake up. I freaked out but apparently it's super common with new moms. ", "controversiality": 0, "created_utc": 1453941427, "distinguished": null, "edited": false, "gilded": 0, "id": "czejq51", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454774744, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Really? That makes me feel better. Not that you went through that but that it's common. I hope it goes away and that I don't die.", "controversiality": 0, "created_utc": 1453941798, "distinguished": null, "edited": false, "gilded": 0, "id": "czejy9j", "link_id": "t3_42zl3g", "parent_id": "t1_czejq51", "retrieved_on": 1454774850, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rpsychnurse", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem. My baby is three months old now and while I still have some symptoms of depression they're mild (feeling weepy,  lack of energy, etc). The first two weeks post partum were the absolute worst for me. I was in the hospital for that time because I got home with my baby and had such strong feelings that I was going to die I went back to the ER. I just kept telling myself if I could make it to six weeks PP it would get better- no idea why I picked that time to focus on but it gave me something to work towards. I went home after two weeks and it was better but still tough. I would say the worst feelings passed after two weeks and then by six weeks I was just sort of sad and now at 3 months PP I feel much better.\nI was on antidepressants my whole pregnancy but they upped them two days PP and I was also on an anxiolytic (Ativan) and Ambien for those first two weeks. I wouldn't have made it without my wonderful doctor and my husband. \nGood luck - it absolutely gets better. But I know how hopeless it feels when you're experiencing those feelings. ", "controversiality": 0, "created_utc": 1453941839, "distinguished": null, "edited": false, "gilded": 0, "id": "czejz5x", "link_id": "t3_42zl3g", "parent_id": "t1_czej31c", "retrieved_on": 1454774862, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NeverMyCakeDay", "author_flair_css_class": null, "author_flair_text": null, "body": "I went through this. I'm in my mid 30s so I felt old, I guess I really shouldn't have thought that. I've had about a dozen people around me die from suicide type deaths due to feeling abandoned, alienated, or some mental disorder. It was hard after birth because we had just moved to a rural town 2000 miles from our friends and family and I was feeling alien. I felt old. My body hurt. It looked floppy. I was tired. No one would talk to me for days, weeks at a time. \n\nThere was this new little girl laying there. Her skin was beautiful and her back was straight. She could learn whatever she wanted to without hardly trying... And she looked like me, but younger. I was jealous of her youth and of all the time life she had to live yet. But mostly, I was scared because I felt so helpless and small. I felt about as strong as she did. I knew no one I could call for help. What if I just exhausted myself one day? I what if I lay down for a nap with my daughter and she woke up but I didn't? \n\nThis went on. Some days I would stare at her for hours planning some way to have someone around when I needed them. My husband worked in a remote area I could never get a hold of him. I wish I could make friends but I felt injured and couldn't join a club or do friendly things.... I daydreamed about going back in time.\n\nIt took me about a year to get over it. I didn't take meds, and I didn't go to a doctor. I worked it out. I knew it was depression because I have been diagnosed with depression before. Meds never helped me. So, I just tried to become healthier. Lost weight. Started working out. Ate better. I feel a little more confident I won't just drop dead. And it made me feel happier.", "controversiality": 0, "created_utc": 1453942187, "distinguished": null, "edited": false, "gilded": 0, "id": "czek6n7", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454774960, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "chEEZe_p00f", "author_flair_css_class": "blue", "author_flair_text": "5yr old boy", "body": "I agree with the other people that say it's common. I've experienced it to a much smaller degree and it really is hard because the reality is we all die, sometimes suddenly. What helped me feel better was when I finally went to a dr (for another issue) and had a full detailed physical and blood panel that all came back great. Maybe try going to the dr and getting a full work up? It may put your mind more at ease as well as getting the chance to mention the anxiety to the dr. ", "controversiality": 0, "created_utc": 1453942487, "distinguished": null, "edited": false, "gilded": 0, "id": "czekd3n", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454775044, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheSavageBallet", "author_flair_css_class": null, "author_flair_text": null, "body": "Seven years later, I'm still kicking. I went and got a checkup, made sure I wasn't dying and that my heart was not in danger of just stopping to beat and my dr prescribed cymbalta which helped tremendously. ", "controversiality": 0, "created_utc": 1453942697, "distinguished": null, "edited": false, "gilded": 0, "id": "czekhn7", "link_id": "t3_42zl3g", "parent_id": "t1_czejy9j", "retrieved_on": 1454775104, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Phillis_Ofickle", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt this way after I had my second baby, I laid awake every night thinking that I could go any day in any way.  I would sob thinking of how she wouldn't understand what happened or why she wasn't being nursed anymore, but she would most certainly feel a void where she could no longer smell me or hear my voice.  I too was diagnosed with postpartum depression.  ", "controversiality": 0, "created_utc": 1453942706, "distinguished": null, "edited": false, "gilded": 0, "id": "czekhsw", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454775106, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for sharing. It is such an awful feeling and I am trying so hard not to let it get to me. I am so glad you over came it to help people like me. Baby is 12 months and I am still struggling with these thoughts. I am not sick or unhealthy but it feels like it could happen any time. This is terrible. :/ ", "controversiality": 0, "created_utc": 1453942746, "distinguished": null, "edited": false, "gilded": 0, "id": "czekinu", "link_id": "t3_42zl3g", "parent_id": "t1_czejz5x", "retrieved_on": 1454775118, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Whoa. Thank you so much for sharing. I love hearing that you overcame this without meds. That's what I am trying to do. As I have focused more on myself, eating better, dressing better and putting on SOME makeup, I have felt better but then I come back to the what ifs. I just want to spend the rest of my life with my daughter and see her enjoy her life. It would make me really sad if I couldn't be there to see her grow up or our time was shadowed by illness. I don't know why i think so much. I just wanted to feel normal. Like I'm not going to die. ", "controversiality": 0, "created_utc": 1453945030, "distinguished": null, "edited": false, "gilded": 0, "id": "czelwhs", "link_id": "t3_42zl3g", "parent_id": "t1_czek6n7", "retrieved_on": 1454775769, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Great suggestion. I am pretty healthy so it would help to see that in numbers and then use it as a new starting point.", "controversiality": 0, "created_utc": 1453945109, "distinguished": null, "edited": false, "gilded": 0, "id": "czely98", "link_id": "t3_42zl3g", "parent_id": "t1_czekd3n", "retrieved_on": 1454775792, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Awwww lol. Good for you. I should do that. I am just riddled with anxiety. I never thought I would go through this.", "controversiality": 0, "created_utc": 1453945928, "distinguished": null, "edited": false, "gilded": 0, "id": "czemgdq", "link_id": "t3_42zl3g", "parent_id": "t1_czekhn7", "retrieved_on": 1454776030, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Awwww. That's terrible! why must we go through this! I just want to enjoy life! Ugh!", "controversiality": 0, "created_utc": 1453945961, "distinguished": null, "edited": false, "gilded": 0, "id": "czemh20", "link_id": "t3_42zl3g", "parent_id": "t1_czekhsw", "retrieved_on": 1454776039, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheSavageBallet", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly If you have insurance getting a clean bill of health and the reassurance that i am healthy human being was way worth the embarrssment of admitting my anxiety to my dr. It helped knowing that it happens to other new parents. I mean, not to sound like, \"kids are EVERYTHING\" but what other reason have we really had to fear death before having a little person to take care of? All the sudden its like, holy crap i cant die for at least 18 years.", "controversiality": 0, "created_utc": 1453947047, "distinguished": null, "edited": false, "gilded": 0, "id": "czen4uk", "link_id": "t3_42zl3g", "parent_id": "t1_czemgdq", "retrieved_on": 1454776350, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "internetwife", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt this way before I had a kid. I was for sure I'd never make it past my mid twenties. All my teen years I thought I'd go above and beyond to make friends and do something that would last because I felt I'd be dead by 21. Either in a car accident or some random event that led to my death. \n\nEvery year closer to twenty I tried less and less and got so depressed and anxious. I wouldn't leave my room except to use the bathroom, eat, go to work. I was diagnosed with depression and took a weeks worth if meds. \n\nI pulled my head up and got into school. Met my future husband and eventually 21 came and went. \n\nI don't get the feeling of eminent death anymore. I've had pregnancy dreams about dying when my son was born and my husband having to deal with everything as a single dad. \n\nI think everyone has a couple of those what ifs from time to time. But if it's getting worse and you can't shake that feeling, then seek help. It's okay to feel life is fleeting but it shouldn't invade us so totally it preoccupies our day to day life. Hang in there. I always thought I was the only one with that feeling, glad to know I'm not super weird. Hopefully it'll pass, if not there are ways to help cope. ", "controversiality": 0, "created_utc": 1453947979, "distinguished": null, "edited": false, "gilded": 0, "id": "czenoup", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454776612, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's pretty common after you have a baby to have intrusive thoughts like this, but it sounds to me like the degree to which you have them is more than normal. It sounds like other commenters have already linked you up with some good resources :) \n\nBut I do think that having them is normal to an extent. Every mom I've talked to has acknowledged having something similar. You'll be walking down the stairs and suddenly imagine what would happen if you dropped the baby. Or randomly, I'll wonder what would happen if I die while my husband is deployed-how long would it take for someone to notice that I'm dead and come rescue my kids? For me, it was more frequent when my baby was young. I'm sure it's partly hormonal and partly just the truth of a daunting reality-I know that my baby relies on me for her survival. Once she started drinking from a cup and eating some food, some of that pressure goes away because I know she would at least be able to be fed by a stranger should something happen to me. I also think it's sort of your brain's way of prepping you to be aware of environmental dangers.\n\nAnyway, the difference seems to be that I have these thoughts, I think about them for a moment or two, maybe prepare a \"what if\" solution for the problem, and then I move on with my day. My friend, on the other hand, was having trouble letting go of these worries. She knew they were kind of bizarre and very unlikely to actually happen, but it was affecting her overall mood for the day and was keeping her awake at night. She went to her doctor and then consulted with a mental health professional and started medication for her anxiety. She pretty quickly felt happier and no longer dwelled on the negative thoughts. \n\nSo if it interferes with your life on a regular basis (which it seems like it does), and you want it to stop, I would definitely consult with someone about it. But personally, I still have moments of overwhelming emotion and I don't mind them. Life *is* short and I appreciate the reminder from time to time. ", "controversiality": 0, "created_utc": 1453949227, "distinguished": null, "edited": false, "gilded": 0, "id": "czeog4q", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454776969, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "softerr--", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a four month old and I have been feeling this way! Oh my goodness. I didn't realize how bad it was until I read your post and saw the replies. I constantly think I'm going to die and I actually spend a lot of time thinking about writing my husband /kids a letter for after I'm dead. No one in my life has died though. It has gotten better recently but for a while there I was just totally convinced that I was going to die at any point. \n\nI think I'm going to have to talk to my doctor about it. After reading the comments here I'm pretty sure it's not normal. \n\nThank you for posting, OP. ", "controversiality": 0, "created_utc": 1453949748, "distinguished": null, "edited": false, "gilded": 0, "id": "czeorfp", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454777116, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dinahsaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I had it and went on Zoloft (safe for breastfeeding if that applies) and was so much better afterward.  I was on it for a year and then weaned off, and then got 10 Ativan pills to take just in case.  I've taken 3 in the past 10 months, so I still get those thoughts but super rarely (I also am terrified of addiction, so I try to cope on my own before I resort to taking meds).  Therapy did nothing for me, it was truly messed up hormones that could really only be fixed with time.", "controversiality": 0, "created_utc": 1453950675, "distinguished": null, "edited": false, "gilded": 0, "id": "czepbe0", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454777378, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I had morbid thoughts and I also lost my mother a few years before having my child.\n\nMy GP said it was totally normal.\n\nHowever, if it affects your daily life - like you avoid going out because you're worried about a car accident, that kind of thing - then counselling is wise.\n\nYou may also get a resurgence of the grief at losing your mother, and this continues as your child grows and it's yet another milestone the late grandparent will never see. It's very, very hard. ", "controversiality": 0, "created_utc": 1453952424, "distinguished": null, "edited": false, "gilded": 0, "id": "czeqcet", "link_id": "t3_42zl3g", "parent_id": "t1_czeds6h", "retrieved_on": 1454777934, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mutantmother", "author_flair_css_class": null, "author_flair_text": null, "body": "Still happens to me 10 years after birthing kiddo. It's rare but when it hits, it hits hard. In my psych training we talked about PPD and intrusive thoughts. It helps a ton now to remember that my brain is just having a moment. I try not to judge my thoughts and just let them be. The death related panic attacks last only minutes now. If you have time maybe do some reading on intrusive thoughts and mindfulness. The combo might help. :)", "controversiality": 0, "created_utc": 1453953056, "distinguished": null, "edited": false, "gilded": 0, "id": "czeqprl", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454778109, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ChainsawJane", "author_flair_css_class": null, "author_flair_text": null, "body": "I know this isn't exactly the same, but before I had my baby I was a total adrenaline junkie! Roller coasters, street racing,  motorcycles, sky diving, whatever gives me that life threatening rush! After having baby suddenly even 25mph in a school zone was pretty scary for me. Parking lots even if they have speed bumps.... just driving in general, I was almost certain we were just all going to die. And not by my own recklessness, but because of the unpredictability of another driver in a separate vehicle ramming into me (potentially) heh.... It's a strange control issue I'm still working on. \n\nI guess my point is, I don't think what you are feeling is unusual or abnormal. ", "controversiality": 0, "created_utc": 1453956010, "distinguished": null, "edited": false, "gilded": 0, "id": "czesbkn", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454778865, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Amorfati77", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm doing the exact same thing right now. The change is great and I should be weaned off the drugs by late Spring. I feel like a much happier Mom now", "controversiality": 0, "created_utc": 1453957045, "distinguished": null, "edited": false, "gilded": 0, "id": "czesu80", "link_id": "t3_42zl3g", "parent_id": "t1_czepbe0", "retrieved_on": 1454779110, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "I had it to a certain extent. But I also worried that my daughter would die before she was five. I wasn't depressed and I didin't have PPD. I was otherwise perfectly normal. I didn't tell my husband because I knew my fears were irrational. \n\nI had her at 40, so the feelings of mortality I get are particularly strong every now and then. I'm reminded that when she's 20 I'll be 60 and it scares me that I might not live to see her become an adult. \n\nMost of the time, though, I'm fine. But that fear is always at the back of my mind, and honestly, I think it's pretty normal. ", "controversiality": 0, "created_utc": 1453971732, "distinguished": null, "edited": false, "gilded": 0, "id": "czey2jk", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454781645, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lolaordie", "author_flair_css_class": null, "author_flair_text": null, "body": "My mom was pregnant with my sister which was a very difficult pregnancy considering she had surgery to remove the appendix at the 3rd month, we were living in a seismic zone so the risk of an earthquake was *there* all the time and shortly after giving birth (emergency c-section) her mother was diagnosed with cancer. she would wake up in the middle of the night almost every night thinking she was dying and crying until she saw a professional and she diagnosed her with general Anxiety. \nEvery night since I'm 9 (I'm 20 now), when I'm trying to sleep I remember I'm going to die someday and I get anxiety attacks and especially now that my son is almost two months. \nDon't go through this alone, try to get help and you'll get over this.\nI wish you the best of lucks.", "controversiality": 0, "created_utc": 1453976472, "distinguished": null, "edited": false, "gilded": 0, "id": "czez8qz", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454782198, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Nymphadora85", "author_flair_css_class": null, "author_flair_text": null, "body": "I have similar (3 months PP) but mine is attributable to how sick I was during pregnancy and still am now. I had multiple pulmonary embolisms and was so scared that the baby and i would die and leave my poor husband all alone. It has been a really tough time. But I'm still here and the anxiety is getting less. I don't think it will ever go away completely as it's like living with a ticking timebomb. I did go to therapy which helped immensely. I still have fears of suddenly dying/collapsing and baby being harmed because of it (e.g. if I'm walking dog alone with baby, no one would know where I was). But I'm trying really hard to not let it stop me doing things. Speak to your doctor, they can help. Good luck!", "controversiality": 0, "created_utc": 1453983079, "distinguished": null, "edited": false, "gilded": 0, "id": "czf0z1p", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454783014, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lps41", "author_flair_css_class": null, "author_flair_text": null, "body": "New dad here that browses this subreddit - I too have a heightened sense of my own mortality since my son was born two months ago. I regularly feel anxious about the possibility that I may not be around a whole lot longer. Haven't really discussed it with my SO or anyone else. Hoping I will just come to accept it and not feel so anxious!", "controversiality": 0, "created_utc": 1453990291, "distinguished": null, "edited": false, "gilded": 0, "id": "czf3s3e", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454784336, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Thisismyfulltimejob", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey just letting you know I had post partum psychosis and overcame it without drugs. You can do it. It sounds like you have some paranoia that you're not yet 100% sure you don't believe. It's hard. Sometimes I still think my delusions miiight be true which is depressing. Just live a functional life and your track record itself will be your comfort.", "controversiality": 0, "created_utc": 1453991993, "distinguished": null, "edited": 1453992212, "gilded": 0, "id": "czf4oml", "link_id": "t3_42zl3g", "parent_id": "t1_czelwhs", "retrieved_on": 1454784763, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sendCookiesSTAT", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep- my son is three and I am still anxious about me and/or my husband dying.  My best friend started getting serious anxiety even while she was still pregnant.  Her doctor explained that it was a normal reaction to such a large responsibility- and I suspect in your case it's past experience creeping in as well.\n\nI agree with the other posters and recommend you contact a counselor to talk through your thoughts and see if they can provide any additional help.", "controversiality": 0, "created_utc": 1453995490, "distinguished": null, "edited": false, "gilded": 0, "id": "czf6sc4", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454785823, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sendCookiesSTAT", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for posting this.  I would give you gold if I weren't so cheap. :-)", "controversiality": 0, "created_utc": 1453995595, "distinguished": null, "edited": false, "gilded": 0, "id": "czf6uvw", "link_id": "t3_42zl3g", "parent_id": "t1_czebcts", "retrieved_on": 1454785857, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "This has been my post partum theme. It doesnt affect my daily life, but I do think about how someday I am going to take my last breath. I often think about it at bedtime and then I have to try my best to shake it off. To top it all off the medication I take to keep me healthy also increases my cancer risk. If I think about it too much I feel panicked. I dont want to fucking die.... :(", "controversiality": 0, "created_utc": 1453999905, "distinguished": null, "edited": false, "gilded": 0, "id": "czf9tpx", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454787255, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ThePolemicist", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't know if I had a feeling of impending death, so much as worry about what would happen if I died. I think, to a certain extend, those thoughts are normal because it's the first time you've had someone's entire existence dependent on your survival. At least for me, my kids were both breastfed and wouldn't take a bottle. I couldn't leave the house for more than an hour at a time without them because they needed me. It was a sinking feeling sometimes thinking, \"What would happen if I died?\" Those thoughts are kind of normal, as long as they're fleeting and don't disrupt your life. If you're dealing with anxiety over the thoughts and feel overwhelmed in anyway, then you should look into talking to someone.", "controversiality": 0, "created_utc": 1454000907, "distinguished": null, "edited": false, "gilded": 0, "id": "czfajke", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454787594, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CoffeeGodCigarettes", "author_flair_css_class": null, "author_flair_text": null, "body": "I've just been diagnosed with postpartum anxiety.  My doctor prescribed me a mild anti anxiety medication, though I haven't started taking it yet and am unsure if I will.  Though just going and acknowledging that that's what I'm experiencing actually helped a lot on its own.\n\nI've been terrified of bad stuff happening to my baby, my husband, or my marriage and how I'd survive after. I know that what I'm thinking is irrational and with practice I'm getting better at just redirecting my thoughts and telling myself how thankful I am that things *are going well* as sort of an internal mantra.  The more I practice it the easier it's getting, and there shorter the negative thoughts seem to linger.  \n\nDefinitely talk to your doctor!  It's so common.  After I started talking about it, my sister said she had been experiencing the same thing since her daughter was born 3 years ago.  There's definitely no real timeline for this sort of thing.", "controversiality": 0, "created_utc": 1454006601, "distinguished": null, "edited": false, "gilded": 0, "id": "czfep2a", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454789620, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hspankow", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it is normal. I didn't have PPD or anything, but having a kid brought on my sense of mortality like nothing else. I still get hit with waves of panic now. I remember reading something about the Sun's life span soon after she was born and while I knew that fact before, for some reason now, it gutted me and I was completely distraught that life as we know it had a definite timeline. It just comes in waves now, but I was obsessed with that fact and the idea of my own death for awhile. I am a lot more careful now about going to the doctor for preventative or early on where before I used to wait until I had a fever of 104F or something really bad before I would bother. It just feels so heavy now sometimes that someone really needs me.", "controversiality": 0, "created_utc": 1454007932, "distinguished": null, "edited": false, "gilded": 0, "id": "czffo1k", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454790079, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh wow. Thanks so much for the support. Yes! I am in the process of writing things down. I am just so worried I can't be there for them. it's terrible. I just want to not think about it.", "controversiality": 0, "created_utc": 1454009084, "distinguished": null, "edited": false, "gilded": 0, "id": "czfghzl", "link_id": "t3_42zl3g", "parent_id": "t1_czeorfp", "retrieved_on": 1454790471, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you. I am trying to do it without meds and luckily it doesn't happen often but often enough that it scares me and makes me think it's really going to happen.", "controversiality": 0, "created_utc": 1454009143, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgjjo", "link_id": "t3_42zl3g", "parent_id": "t1_czepbe0", "retrieved_on": 1454790491, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Ohh good. I don't think I am there yet but I do get scared. Glad to hear it's pretty common.", "controversiality": 0, "created_utc": 1454009173, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgkbo", "link_id": "t3_42zl3g", "parent_id": "t1_czeqcet", "retrieved_on": 1454790501, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "I really love this. Thank you. I am very interested in psychology so maybe studying this will really help me.", "controversiality": 0, "created_utc": 1454009268, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgmu3", "link_id": "t3_42zl3g", "parent_id": "t1_czeqprl", "retrieved_on": 1454790534, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. This is great to hear. So it is possible to go from one thing to another after having a baby. I had these feelings when I was sick and I've been pretty good about keeping them at bay but when I had a baby, they came up ten fold! I am glad to know that it's just something with the mind that happens after giving life. Almost like an appreciation for life. Which is actually a good thing!", "controversiality": 0, "created_utc": 1454009491, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgsnw", "link_id": "t3_42zl3g", "parent_id": "t1_czesbkn", "retrieved_on": 1454790610, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mutantmother", "author_flair_css_class": null, "author_flair_text": null, "body": "I hope it does!!!! Psychology always interested me as well so I decided to get a degree in it :) \nIf you do end up seeing a counselor be blunt with them. The one I saw for PPD completely ignored the fact that I had just given birth weeks earlier and tried to diagnose me as borderline. He wanted to put me an antipsychotics and lithium.... While I was trying to breastfeed. Some psychs can be crazier than their patients!", "controversiality": 0, "created_utc": 1454009550, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgu5x", "link_id": "t3_42zl3g", "parent_id": "t1_czfgmu3", "retrieved_on": 1454790630, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Awwww. That would intensify this so much more. Just remember that 60 is the new 30! Atleast that's why my 60 year old parents say and they are spry!", "controversiality": 0, "created_utc": 1454009720, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgyhw", "link_id": "t3_42zl3g", "parent_id": "t1_czey2jk", "retrieved_on": 1454790687, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for sharing. Is your mother still alive??? At least she was vocal about her fears. My mother never talked about it which is why I have so many questions.", "controversiality": 0, "created_utc": 1454009758, "distinguished": null, "edited": false, "gilded": 0, "id": "czfgzey", "link_id": "t3_42zl3g", "parent_id": "t1_czez8qz", "retrieved_on": 1454790699, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Awwww. :/ These thoughts suck. Good thing you got help because it seems like everyone who has had it has overcome it. In other words, didn't die. of course we can't take into account the dead people but I am sure it's less.", "controversiality": 0, "created_utc": 1454009846, "distinguished": null, "edited": false, "gilded": 0, "id": "czfh1px", "link_id": "t3_42zl3g", "parent_id": "t1_czf0z1p", "retrieved_on": 1454790728, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "So it's not just us women. Thanks for sharing. It must be a natural thing in regards to appreciating life and now wanting to be here. When I was young, I didn't really care or think about it. Now I think about it ALL the time.", "controversiality": 0, "created_utc": 1454010120, "distinguished": null, "edited": false, "gilded": 0, "id": "czfh8qu", "link_id": "t3_42zl3g", "parent_id": "t1_czf3s3e", "retrieved_on": 1454790821, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Good point. Yes I am a bit paranoid. :/", "controversiality": 0, "created_utc": 1454010146, "distinguished": null, "edited": false, "gilded": 0, "id": "czfh9gh", "link_id": "t3_42zl3g", "parent_id": "t1_czf4oml", "retrieved_on": 1454790830, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. Everyone, including you, has been SO helpful. I am so glad I'm not alone.", "controversiality": 0, "created_utc": 1454010175, "distinguished": null, "edited": false, "gilded": 0, "id": "czfha8m", "link_id": "t3_42zl3g", "parent_id": "t1_czf6sc4", "retrieved_on": 1454790840, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Ugh. That's the worst. Before bed when you fear you won't wake up. I just think about HOW I am going to die. Will I suffer? What will that feel like? Will I know? Is this cramp ovarian cancer? Should I get it checked? Am I dieing? I'm going to die! That's how it progresses. lol.", "controversiality": 0, "created_utc": 1454010255, "distinguished": null, "edited": false, "gilded": 0, "id": "czfhcau", "link_id": "t3_42zl3g", "parent_id": "t1_czf9tpx", "retrieved_on": 1454790867, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "I know what you mean. I always think about what would happen. Luckily, I have come to turns with who would take care of her but I want to do it!", "controversiality": 0, "created_utc": 1454010301, "distinguished": null, "edited": false, "gilded": 0, "id": "czfhdhm", "link_id": "t3_42zl3g", "parent_id": "t1_czfajke", "retrieved_on": 1454790882, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you! I do the same thing where I am all about prevention now. I want to live until I am 100 and would think it was really unfair for someone to take my life or if I died in an accident.\n\n\n\nThe thing I think about the most is someone taking my life. There is nothing you can do in that situation and that's what scares me.", "controversiality": 0, "created_utc": 1454010391, "distinguished": null, "edited": false, "gilded": 0, "id": "czfhfy1", "link_id": "t3_42zl3g", "parent_id": "t1_czffo1k", "retrieved_on": 1454790915, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Really? How long did it take to get back into school? Was it expensive? I have been thinking about getting a degree in Psychology but I have a full time job and 2 kids and quitting work is not on the horizon.", "controversiality": 0, "created_utc": 1454010452, "distinguished": null, "edited": false, "gilded": 0, "id": "czfhhkm", "link_id": "t3_42zl3g", "parent_id": "t1_czfgu5x", "retrieved_on": 1454790936, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mutantmother", "author_flair_css_class": null, "author_flair_text": null, "body": "I waited till kiddo was in kindergarten to go back. Honestly I'm extremely lucky as I had a family member offer to pay my whole way through school. I found a job at the county mental health Dept that allows me to set my own schedule so I can work when kiddo is in school and can miss during class times. It's taking forever since I can really only afford to take two classes a term but I'm nearly done with my BA. Kiddo is nine and the only time she complains is when I have to take night classes. She's used to me being home with her 24/7. (Single mom so she relies on me more than anything) Keeping a routine has been my lifesaver. If I didn't have daily routine built in if lose my mind :)", "controversiality": 0, "created_utc": 1454011185, "distinguished": null, "edited": false, "gilded": 0, "id": "czfi13t", "link_id": "t3_42zl3g", "parent_id": "t1_czfhhkm", "retrieved_on": 1454791192, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dinahsaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "Which is fine, I tried to, too.  Don't forget though that it is a chemical (serotonin) problem and you can't will it away with the power of positive thinking any more than a diabetic can will away an insulin imbalance.  Diet and exercise can sometimes control it but sometimes can't.", "controversiality": 0, "created_utc": 1454011223, "distinguished": null, "edited": false, "gilded": 0, "id": "czfi260", "link_id": "t3_42zl3g", "parent_id": "t1_czfgjjo", "retrieved_on": 1454791206, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MarianneDashwood", "author_flair_css_class": null, "author_flair_text": null, "body": "I experienced this after my fourth child. It was really severe postpartum anxiety and I didn't want to be treated because the self preserving nature of the illness meant that I believed that I was thinking very CLEARLY, and everyone around me wasn't paying enough attention to the fact that death was around every corner. \n\nThe things that helped me:\n1. Medication. None of the other stuff would have worked without that. \n2. hydration-- SUPER important for me. Like a gallon a day was what I needed. \n3. Getting rid of caffeine. \n4. Learning meditation/hypnosis breathing. \n\nThings that did NOT help:\n1. Reassurances that \"everything is FINE, there is nothing to worry about, you're not going to die.\" \n2. Therapy. I am actually a therapist and I know that therapy is VERY important in most treatment plans. For me it didn't work because I really just thought that my therapist was not thinking logically and was just reassuring me without full knowledge of the situation. \n3. Breastfeeding. In most cases, women can and should continue to breastfeed through mental illness if they desire to do so, but I had dysphoric milk ejection reflex, and it was exacerbating (maybe even causing) my anxiety, due to an inappropriate drop in dopamine levels triggered by oxytocin with each letdown response. ", "controversiality": 0, "created_utc": 1454013014, "distinguished": null, "edited": false, "gilded": 0, "id": "czfjd9e", "link_id": "t3_42zl3g", "parent_id": "t3_42zl3g", "retrieved_on": 1454791822, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hspankow", "author_flair_css_class": null, "author_flair_text": null, "body": "...I may also be taking a lot less risks, like driving less aggressively, paying attention to which routes I take, being more aware if someone kind of sketchy is near me, because I worry a lot more about those two things too. Staying out of those situations is the best way to avoid them! ", "controversiality": 0, "created_utc": 1454019224, "distinguished": null, "edited": false, "gilded": 0, "id": "czfnui3", "link_id": "t3_42zl3g", "parent_id": "t1_czfhfy1", "retrieved_on": 1454794005, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for mentioning D-MER. It is real, but no one ever talks about it because breastfeeding is *supposed to be* this magical, blissful bonding experience... and yet for some women the very act of nursing gives them horrible anxiety/depression or worse.  ", "controversiality": 0, "created_utc": 1454028579, "distinguished": null, "edited": false, "gilded": 0, "id": "czfts7c", "link_id": "t3_42zl3g", "parent_id": "t1_czfjd9e", "retrieved_on": 1454796870, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NeverMyCakeDay", "author_flair_css_class": null, "author_flair_text": null, "body": "It also helps to keep in mind that mothers have been going though this for a very, very long time without drugs available to them. Maybe they had other things to worry about, maybe they had the comfort of family. I'm not condoning the fact I didn't seek medical help, or the help of drugs. I felt like I knew my body better than anyone else. It also was a situation where there weren't doctors or medications available to me. Have confidence in yourself and know things will feel a little better every day. Some days a leap forward, some days a step back, but always getting better.", "controversiality": 0, "created_utc": 1454051649, "distinguished": null, "edited": false, "gilded": 0, "id": "czg5mwp", "link_id": "t3_42zl3g", "parent_id": "t1_czfh9gh", "retrieved_on": 1454802571, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks incredible. You are a hard worker. Thank you for sharing!", "controversiality": 0, "created_utc": 1454097484, "distinguished": null, "edited": false, "gilded": 0, "id": "czgrls4", "link_id": "t3_42zl3g", "parent_id": "t1_czfi13t", "retrieved_on": 1454813134, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, definitely good to know. Thanks.", "controversiality": 0, "created_utc": 1454097507, "distinguished": null, "edited": false, "gilded": 0, "id": "czgrmdv", "link_id": "t3_42zl3g", "parent_id": "t1_czfi260", "retrieved_on": 1454813142, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you. ", "controversiality": 0, "created_utc": 1454097608, "distinguished": null, "edited": false, "gilded": 0, "id": "czgroy3", "link_id": "t3_42zl3g", "parent_id": "t1_czg5mwp", "retrieved_on": 1454813175, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theothermotherme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the info. I like your ideas about how to over come it. You're right, \"You're not going to die.\" Is NOT helpful! Lol.", "controversiality": 0, "created_utc": 1454097701, "distinguished": null, "edited": false, "gilded": 0, "id": "czgrrbe", "link_id": "t3_42zl3g", "parent_id": "t1_czfjd9e", "retrieved_on": 1454813206, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mutantmother", "author_flair_css_class": null, "author_flair_text": null, "body": "No prob! Good luck with everything!!!", "controversiality": 0, "created_utc": 1454098604, "distinguished": null, "edited": false, "gilded": 0, "id": "czgseol", "link_id": "t3_42zl3g", "parent_id": "t1_czgrls4", "retrieved_on": 1454813512, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lolaordie", "author_flair_css_class": null, "author_flair_text": null, "body": "she is! ", "controversiality": 0, "created_utc": 1454100466, "distinguished": null, "edited": false, "gilded": 0, "id": "czgtqea", "link_id": "t3_42zl3g", "parent_id": "t1_czfgzey", "retrieved_on": 1454814136, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Nymphadora85", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha very true!", "controversiality": 0, "created_utc": 1454103865, "distinguished": null, "edited": false, "gilded": 0, "id": "czgw4zp", "link_id": "t3_42zl3g", "parent_id": "t1_czfh1px", "retrieved_on": 1454815271, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}