{"submission": {"author": "kitkatkelly_", "author_created_utc": 1350949384, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_9dpv5", "created_utc": 1461872768, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/4gvqjg/how_many_csections_have_you_had/", "gilded": 0, "id": "4gvqjg", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 68, "over_18": false, "permalink": "/r/Mommit/comments/4gvqjg/how_many_csections_have_you_had/", "retrieved_on": 1463581379, "score": 20, "secure_media_embed": {}, "selftext": "Yesterday for my 31 week dr appointment my dr asked if we planned on having another baby after this one. I said we definitely are going to try for a third baby. Possibly 4 but that's a little too far ahead right now. She said the risk after 3 cesareans that my uterus could attach to my scar tissue or other problems goes way up. My first son was a csection because my labor wasn't progressing and his heart rate was dropping. He wasn't gonna come out at 9lb 4oz! So with this next boy we are having a scheduled one. Husband can take off work, no overdue 10 days like the first time. It's fine with me. Cuz apparently it's hard to find a dr that will go along with a VBAC anyways. I've looked into how many you can safely have. Of course everyone is different. I healed well and pretty quickly too. I'm only 28 and I try my best to exercise and eat healthy. I do have diastasis recti and endometriosis. So I just want to hear from some of you other moms. If you've had a csection, how many? Or if you've had a VBAC too? Share your stories if you like.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How many csections have you had?", "url": "https://www.reddit.com/r/Mommit/comments/4gvqjg/how_many_csections_have_you_had/"}, "comments": [{"author": "Timey_Wimey", "author_flair_css_class": null, "author_flair_text": null, "body": "I've only had one c-section, and I'm 34 weeks now with my 2nd and going for a VBAC this time, so I'm not sure my experience is too relevant to your question.  But, I had a VBAC consult with the hospital this week, and when the doctor asked me if I planning on having more kids after this one and I said it's a possibility, she said a VBAC was my best option if that's the case, for the reasons that you mention above.  Definitely not trying to talk you into a VBAC if that's not what you're into, but in case you're on the fence, apparently it does make future pregnancies less complicated.  My hospital was way more supportive of the VBAC route than I anticipated (I went in there with all kinds of stats, etc, to talk them into it, and didn't end up needing them), so if you look around you may find a practice that supports it.  Hope that helps :)", "controversiality": 0, "created_utc": 1461875978, "distinguished": null, "edited": false, "gilded": 0, "id": "d2l6es0", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463757170, "score": 14, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ekspreslonac", "author_flair_css_class": null, "author_flair_text": null, "body": "My first was an emergency c-section, my second an unmedicated VBAC, because with an epidural I wouldn't be able to feel if my uterus scar burst open or something else went wrong. \n\nI had horrible back labor and begged for a c-section, but I had my son before my blood work came back from the lab. \n\nWhile prepping for the c-section I never got, the doctor told me, if I wanted the c-section I could obviously get it, but a third child would have to be born via c-section again, no chance of VBAC, wich also means no more children after that because three c-section are the maximum. \n\nThis was in Germany. ", "controversiality": 0, "created_utc": 1461876700, "distinguished": null, "edited": false, "gilded": 0, "id": "d2l6y87", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463757425, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you looked into a vbac? Placenta accreta becomes an increased risk factor to consider with multiple cesareans. If you can find a care provider near you that does/supports vbacs they're more likely to be honest about the risks for multiple cesareans over a care provider who is against them. There are risks either way, but I feel like that's something that you should be able to decide with 100% certainty. You need to know everything about both ways in order to do that. I myself have never had a csection, I'm just a big believer in fully informed decisions when it comes to birth. Doctors like to scare us into things instead of talking with us honestly. A midwife/birth center is more likely to perform vbacs if that's an option near you. :)", "controversiality": 0, "created_utc": 1461878396, "distinguished": null, "edited": false, "gilded": 0, "id": "d2l86xg", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463758011, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1461880982, "distinguished": null, "edited": false, "gilded": 0, "id": "d2la00m", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463758932, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "I've heard of many successful vba2c. I'm confused - is it not allowed there to try for a vba2c?", "controversiality": 0, "created_utc": 1461881906, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lam77", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6y87", "retrieved_on": 1463759222, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "I've thought about having a VBAC but I'm more set on having the csection. I'm wondering if it's possible to go through a regular birth after 2 csections. I think I'm gonna look into that. Also with our insurance we're going to have to switch Drs and hospitals with our third so I may just find myself a midwife.", "controversiality": 0, "created_utc": 1461882124, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lare6", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l86xg", "retrieved_on": 1463759290, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Very helpful thank you for sharing.", "controversiality": 0, "created_utc": 1461882267, "distinguished": null, "edited": false, "gilded": 0, "id": "d2laur8", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6es0", "retrieved_on": 1463759335, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "I've heard of many successful vba2c so I know it's possible! Look up Birth Without Fear and Improving Birth if you have a Facebook :)", "controversiality": 0, "created_utc": 1461882547, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lb1cq", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lare6", "retrieved_on": 1463759420, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Omgahhh", "author_flair_css_class": null, "author_flair_text": null, "body": "This is anecdotal, but my mother has had 5... She was at risk for the placenta growing into the scar with #4, but everything turned out fine. If there were any complications they would have had to just do a hysterectomy, I think... #5 was born a little bit early (currently 6 weeks) and the uterus was at very high risk or rupture, like a cell thick when they finally went in there. (Not sure if that's related to the c sections or having kids for 22 years).\n\nI think 3 c-sections would be fine. My doctor doesn't even offer VBACs, so we're going for #2 (probably the last) c-section again.", "controversiality": 0, "created_utc": 1461883738, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lbt1m", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463759783, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheSilverHook", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an emergency section after being induced at 41+1. Baby was 9lbs 11oz. His head never descended, so it was inevitable. I'm trying for a vbac this time, but it will likely end up a section. Basically if I don't go into labor naturally or this babe I'd also measuring large or if labor didn't progress without labor enhancing drugs it has been decided it will be another section. \n\nHere (Ottawa Canada), I have been told 3 is generally the limit. Each time had increased risks. After 2 sections, the 3rd pregnancy will be a section.", "controversiality": 0, "created_utc": 1461883883, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lbwdq", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463759826, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Omgahhh", "author_flair_css_class": null, "author_flair_text": null, "body": "I mean... They couldn't STOP you from having 4... But it wouldn't be recommended. ", "controversiality": 0, "created_utc": 1461883939, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lbxos", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6y87", "retrieved_on": 1463759843, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Omgahhh", "author_flair_css_class": null, "author_flair_text": null, "body": "If you go the midwife way the third route, PLEASE make sure you are near a hospital! After having two c-sections, you are at a much higher risk of complications. ", "controversiality": 0, "created_utc": 1461884061, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lc0hy", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lare6", "retrieved_on": 1463759881, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Will do, thank you!", "controversiality": 0, "created_utc": 1461884603, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lccq1", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lb1cq", "retrieved_on": 1463760040, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I'm not going to worry myself about everything now. Im close to the end. Im just a bit annoyed that they went along with me wanting to have a csection for this one then they go and tell me all these issues I could run into. And they don't even suggest VBAC to begin with.", "controversiality": 0, "created_utc": 1461884828, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lchuj", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lbt1m", "retrieved_on": 1463760107, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ldymcbeth8", "author_flair_css_class": "blue", "author_flair_text": "#2 6/30/13", "body": "1st was a c-section for failed induction. Had a VBAC (first 18 hours in medicated... Then epidural) with my second 2.5 years later. Although I had to have a few extra ultrasounds to make sure that the placenta was not attached near my scars or previa before they would let me go for the VBAC. Both were 9 lbs 6oz.    ", "controversiality": 0, "created_utc": 1461884857, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lcihn", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463760116, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "herewe90", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a scheduled c-section due to breech, then a VBAC with an epidural. My OB is very pro VBAC and has done VBA2C and even does vaginal breech deliveries sometimes which is somewhat rare here in the US. The funny thing is that I picked him specifically for these reasons, and then he happened to be unavailable when I went into labor with #2 and my VBAC was done by a doctor I'd never met before who was not particularly pro VBAC at all. ", "controversiality": 0, "created_utc": 1461885516, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lcx5d", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463760308, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "My first was vaginal, pretty much textbook, no complications, not even any tearing, no episiotomy. I wasn't prepared for the nosedive my future pregnancies would take. Second was a c-section at 33 weeks, and the only reason it wasn't 31 weeks is because my water didn't break all the way, just a trickle. Like your first, I wound up with a section because labour wasn't progressing (though my contractions were only a few minutes a part and incredibly painful, I was stuck at 3 cm dilation) and her heart rate kept decelerating. For my third, I had a VBAC. I begged for a c-section because we discovered that our baby had passed away right at the end of the pregnancy, and I didn't think I would be able to handle a vaginal delivery knowing what was on the other end of it for us. And they would've done one for me if I'd insisted, but the doctor told me I could handle a VBAC and it was worth doing it to avoid having a second c-section. I realized she was right and it went fine; I was induced, I had an epidural, and physically it was the easiest labour I ever had. I'm very grateful to that doctor for encouraging me to try. I don't regret that choice at all. \n\nI know it's your choice, but if you can find a doctor willing to help you through a VBAC, you actually have a pretty good chance of being able to do it. Women with c-sections now have a much higher likelihood of having a vaginal delivery because the incision is made far lower on the uterine wall and that lowers the risks that used to be associated with c-sections. It's much safer than it used to be. That being said, I live in Canada, and I know things are different here; I haven't heard of many doctors who are unwilling to help a woman have a VBAC. So take this with a grain of salt!", "controversiality": 0, "created_utc": 1461886793, "distinguished": null, "edited": false, "gilded": 0, "id": "d2ldqbo", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463760690, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ktsays", "author_flair_css_class": null, "author_flair_text": null, "body": "I was told the same (also in Canada), that 3 is the comfortable limit by OBs, but 4 is usually OK. After that, it's not recommended. I just had my 3rd (1=emergency C-section, 2=attempted VBAC, no progression, he ended up having a huge head, 3=automatic scheduled C-section) and this is planned to be our last. Everything went fine with all of them, and this time around I actually had the easiest recovery, and the Dr said I only had minimal scar tissue from last time.\n\nI've heard, though, that it really depends on the condition of your uterus each time. Some people can have many C-sections with no issue, some people's uterus will thin out and be at high risk of rupture, some people with have scar tissue and high risk of placenta accreta, ...a lot depends on what they find in there and then will give you advice for the next one.", "controversiality": 0, "created_utc": 1461886877, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lds71", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lbwdq", "retrieved_on": 1463760714, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I've thought about having a VBAC but I'm more set on having the csection. I'm wondering if it's possible to go through a regular birth after 2 csections. \n\nIf you can't find a doctor who will help you have a vaginal birth after just one section, you may have a hard time finding anyone to help you after 2 sections. \n\nShe was right that a midwife or birth center is more likely to perform a VBAC than a doctor.", "controversiality": 0, "created_utc": 1461886989, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lduto", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lare6", "retrieved_on": 1463760748, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "A midwife would definitely be the best route for me if we're able to have a third child.", "controversiality": 0, "created_utc": 1461889925, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lft0h", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lduto", "retrieved_on": 1463761667, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dropastory", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not too late to change doctors. If you aren't feeling great about them, then find someone who will support a v-bac if that's what you want to do. \n\nMy sister had 3 csections. First was emergency, second was breach and third was scheduled, though her doc would have done a vba2c. My sister found the recovery more difficult for the third. She's really fit too. \n\nThere are risks no matter what and whatever you feel is best for you should be supported as long as you have all the medical facts for you and your baby. \n\nAlso, just as a positive side note, it is totally possible to have a big baby vaginally. My lo was 10 lbs and we had a wonderful unmedicated vaginal birth. I feel like we hear a lot of horror stories about birth, so I just wanted to put out a positive story that it can be peaceful, amazing, and just magical. Thank goodness for modern medicine when things do go as planned, of course. Every pregnancy and birth is different, so if vaginal birth didn't work out the first time it still could with the second (or third). \n\nGood luck with whatever you decide to do! As long as you and baby are healthy and happy, that's all that matters. ", "controversiality": 0, "created_utc": 1461891108, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lgnz6", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lchuj", "retrieved_on": 1463762073, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dropastory", "author_flair_css_class": null, "author_flair_text": null, "body": "A midwife probably won't take a vba2c because of the risks for rupture. They aren't able to operate if anything goes wrong. You could look for a practice that has OBs and midwives, they might be more supportive of a vba2c. Vba2c is still pretty rare in the US, though vbacs are much more common. My sister, who is an l&amp;d nurse, opted for a third csection. She said it seemed less risky to her than a vba2c even though her doc would have done a vba2c. She had hoped for a vbac with her second, but she was breach. ", "controversiality": 0, "created_utc": 1461891484, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lgya2", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lare6", "retrieved_on": 1463762208, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pregonewb", "author_flair_css_class": null, "author_flair_text": null, "body": "My hospital is specifically equipped to do vbacs. Not something I need thankfully but a lot of hospitals seem to be more in favor of this option. They have a delivery room attached to a surgical room incase a c-section is needed. I thought it was pretty cool during my tour last pregnancy. Anyway if it's something you are considering I definitely think it's worth looking into an office/hospital that will accommodate you. ", "controversiality": 0, "created_utc": 1461893228, "distinguished": null, "edited": false, "gilded": 0, "id": "d2li971", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6es0", "retrieved_on": 1463762889, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "momonomicon", "author_flair_css_class": null, "author_flair_text": null, "body": "My step mom had 4 and her youngest is 28. \n\nAll were high risk pregnancies, and the latest she carried was 32 (or maybe 34?) weeks. I don't know if that makes your situation more or less favorable than hers, but there it is. ", "controversiality": 0, "created_utc": 1461893718, "distinguished": null, "edited": false, "gilded": 0, "id": "d2limfg", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463763061, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thelmick", "author_flair_css_class": "green", "author_flair_text": "2 boys", "body": "I've had two c-sections and I'm pregnant again now with a planned c-section. When I had my first, the doctor mentioned that there was a limit, but it was per uterus. He said my uterus was good to have a second child, but if I had a second child, to ask the doctor doing the surgery to check the thickness of my uterus when they opened it back up to see if it could withstand another pregnancy and c-section. When they opened me up for the second time, they said I had a lot of scar tissue but that they removed a lot of it and I could handle another pregnancy and c-section, so we went for it. This is it for us as we only want 3, but I'm sure I could ask again if we wanted to try for a 4th to see what the condition is. \n\nIf you go the c-section route, it might be worth asking the operating doctor before hand to check the condition for another pregnancy. ", "controversiality": 0, "created_utc": 1461896784, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lkuui", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463764114, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "1) 41 weeks. 10.6lb baby. Meconium Aspiration Syndrome &amp; PPHN. 18 hours labor. Emergency cesarean birth. \n\n2) 39 weeks. 9.8lb baby. Polyhydramnios. Scheduled cesarean birth. \n\nMy doctor said I could try a VBAC if it was what I wanted. I did but for my own mental health went with a repeat cesarean. Coupled with the complications of that pregnancy I was fine with my choice BUT we were done at 2. No interest in anymore for lots of reasons. \n\n", "controversiality": 0, "created_utc": 1461898192, "distinguished": null, "edited": false, "gilded": 0, "id": "d2llvtq", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463764599, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "myhubbymademedoit", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had 3 c-sections.  First was emergency after baby got stuck after pushing for 2 hours. Second we were going to try vbac if I went into labour before baby got to a certain size. Ended up in c-section. For my third I really wanted to try a vbac and my OB said there was a 1%chance of Uterine Rupture. My husband was not comfortable taking the chance, so we had another C-section. I had my tubes tied in that section, so there was no discussion of further pregnancies. I do have a friend who had 4 C-sections with no complications.", "controversiality": 0, "created_utc": 1461900389, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lngci", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463765338, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "californialimabean", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a fantastic c-section (first baby was breech). Second baby I was excited to do a VBAC. That was incredible; I can appreciate the challenge that is vaginal delivery.\n\nI honestly don't know why anyone would have an elective c-section. Major abdominal surgery because it's more convenient? No thanks. \n\nDon't do what's best for you, do what's best for your baby. \n", "controversiality": 0, "created_utc": 1461905300, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lq5dc", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463766623, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "californialimabean", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a wonderful VBAC 1 1/2 years ago. Each pregnancy, labor and delivery were TOTALLY different. You can do it!", "controversiality": 0, "created_utc": 1461905470, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lq88o", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6es0", "retrieved_on": 1463766661, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "californialimabean", "author_flair_css_class": null, "author_flair_text": null, "body": "Unmedicated? WTF? I think that's unusual. I had an epidural for my VBAC when I was 3cm. Praise da lawd, it was incredible! I live in Missouri.", "controversiality": 0, "created_utc": 1461905598, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lqa99", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6y87", "retrieved_on": 1463766687, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CrunchyMother", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had 4 c-sections and 2 D&amp;Cs. During my last section I had my ob carefully examine my uterus for scar tissue and she said it looked amazing and I shouldn't  have any issues having more children.  I've  met several women who have had 6 c-sections and heard about a few that have had 9.\n\nAlthough if I had been more informed I would have tried for a vbac with my second. ", "controversiality": 0, "created_utc": 1461906012, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lqgry", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463766772, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "With a uterine rupture can be a significant amount of pain (different and intense from labor pains) and epidural numbs this just like contractions. Some places only allow VBACs without epidural so they can catch the signs of uterine rupture before it completely bursts, putting both mom and baby's lives in imminent danger. This restriction isn't as common in the US!\n\nEdited to add: there are many indicators of uterine rupture, not just pain. But each rupture can be completely different from the next. I have seen three ruptures in my career, 2 VBACs and one primip, and each presented differently. It's a scary, crazy thing to happen but providers should be trained to monitor for these signs and pay extra special attention them when presented. ", "controversiality": 0, "created_utc": 1461909264, "distinguished": null, "edited": 1461973647, "gilded": 0, "id": "d2lrs5w", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lqa99", "retrieved_on": 1463767392, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ekspreslonac", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess they couldn't stop you like someone else mentioned, but it is strongly discouraged. ", "controversiality": 0, "created_utc": 1461909608, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lrwts", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lam77", "retrieved_on": 1463767454, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ekspreslonac", "author_flair_css_class": null, "author_flair_text": null, "body": "Of course. ", "controversiality": 0, "created_utc": 1461909624, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lrx1a", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lbxos", "retrieved_on": 1463767457, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ekspreslonac", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, they told me from the start, no epidural for me, but they promised me some \"med cocktail IV\" that would help a lot. Never got that either. It was awful, I was begging for help the whole time. ", "controversiality": 0, "created_utc": 1461909798, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lrzbz", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lqa99", "retrieved_on": 1463767486, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1461909916, "distinguished": null, "edited": false, "gilded": 0, "id": "d2ls0xg", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lrzbz", "retrieved_on": 1463767507, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LadyDaisy1978", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had 3.\n\nThe first one after a failed induction, on a friday.\n\nThe second after a failed induction, on a friday.\n\nThe third was planned because she wasn't growing enough, on a tuesday (day before Christmas), I could choose the following friday but I just wanted to get it over with by then.\n\nEach recovery was different, my last was the easiest though.", "controversiality": 0, "created_utc": 1461913847, "distinguished": null, "edited": false, "gilded": 0, "id": "d2ltd1i", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463768137, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yellin", "author_flair_css_class": null, "author_flair_text": null, "body": "I just had my third section two weeks ago. It was planned (like the first two) but I went into labor early and when I arrived at the hospital they asked if I wanted to try for a vaginal birth. I opted for the section, as was the plan, and while she did it, my surgeon checked out my uterus and said it looks great and I should have no issues going for a fourth if I want (which I don't, but it's nice to know that everything looks good).\n\nI think it's very individual, just remember that medical professionals have to give you the worst case scenario so that you're informed.", "controversiality": 0, "created_utc": 1461921350, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lveob", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463769101, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "Ummmm I'm on my second pregnancy in Ottawa and was given the same info/advice. I guess it's consistent!\n\nMy son was a c section after a failed induction at 10 days s overdue. The dr basically reached his hand right up, felt my son's head and my pelvic bones and told me it wasn't happening. My son's heart rate was also decelerating/irregular so I just wanted him out. He was \"only\" 8lbs 13 oz but to this day has an enormous head. His head is bigger than most 3-4 year old kids and he's not quite 2. \n\nOriginally my OB was happy to let me go to term to see if baby #2 would come on their own but I've recently been diagnosed with placenta praevia. If that doesn't resolve I will have to have a repeat c section. ", "controversiality": 0, "created_utc": 1461925698, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lwjee", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lbwdq", "retrieved_on": 1463769634, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL had 3 in the 1980's. I know they never wanted a 4th kid. Apparently her first c section (my husband) was rushed/emergency and they had to make the incision vertically instead of horizontally and she was told from the get go she would have to have repeat c sections. She had her 2nd one a year and 10 days later. ", "controversiality": 0, "created_utc": 1461925836, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lwku1", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463769653, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Liseykathleen86", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm an obstetric healthcare provider and I have a client at the moment who is having her 8th cesarean section. Obviously that's a higher risk scenario but with proper prenatal care, you can decrease the risks associated. As for the VBAC conversation, I'm very pro VBAC, as long as the client understands the associated risks. The recommendation is to deliver in a hospital setting so that electronic fetal monitoring is available to continuously listen to the baby's heart rate. It isn't actually severe pain that is seen first with a uterine rupture but a change in the fetal heart rate. That could be an significant prolonged increase in the rate or a significant deceleration. Pain is a confounding factor but is not always present and does not always appear in the expected manner. It's important that you're at a hospital with c section capability within a maximum of 30 mins, preferably sooner. You should be getting ultrasounds during the pregnancy to make sure your placenta has not attached to the scar tissue inside your uterus, making an accreta, that would need to be surgically removed. A VBAC is not an option for clients who have had a t- incision or vertical incision because of the high rate of rupture. Having a V2BAC or more obviously increases your risk of uterine rupture but there isn't great research on how much it increases the risk. In a general population, the success rate of VBAC is approximately 80%, so it's actually quite high. But to decrease risk to the baby, all of the other guidelines should be followed. So, if you're planning on potentially having a vaginal birth at some point, the logical time to do that would be now, as it decreases risk for all future pregnancies, rather than attempting after 2 cesarean sections. ", "controversiality": 0, "created_utc": 1461932102, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lyr7l", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463770744, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheSilverHook", "author_flair_css_class": null, "author_flair_text": null, "body": "Nice to see someone else from Ottawa here! My first was at the general and I had wonderful care. This time I am going to the civic. Hoping for the same great experience.", "controversiality": 0, "created_utc": 1461934427, "distinguished": null, "edited": false, "gilded": 0, "id": "d2lzu6k", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lwjee", "retrieved_on": 1463771254, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank so much for commenting! That was all extremely helpful!", "controversiality": 0, "created_utc": 1461934926, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m036o", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lyr7l", "retrieved_on": 1463771373, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so glad they do the bikini style incision now. Unless there was a major problem and they had to do vertical. My aunts vertical scar is scary looking. It goes all the way up to her belly button! My incision healed so well the dr said.", "controversiality": 0, "created_utc": 1461935098, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m06c2", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lwku1", "retrieved_on": 1463771414, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for sharing. I never thought of having them check to see how the \"situation\" is down there. I think I'd be happy with 3 kids but if they told me I could have a forth that would be nice too!", "controversiality": 0, "created_utc": 1461935250, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m0956", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lveob", "retrieved_on": 1463771451, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing. I feel like I'm much more prepared going in for this one. With my first there was some sort of miscommunication and I didn't get sent home with any pain medication. It was awful. ", "controversiality": 0, "created_utc": 1461935361, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m0b73", "link_id": "t3_4gvqjg", "parent_id": "t1_d2ltd1i", "retrieved_on": 1463771478, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mind_grapes_4_all", "author_flair_css_class": null, "author_flair_text": null, "body": "Emergency c-section after an induction for first in England. She almost didn't make it (placenta detached, meconium, and fetal heart rate was plummeting).  Second baby 18 months later, was in the US. Planned a VBAC but at 41 weeks was showing no signs of labor and baby was sideways. Scheduled a c-section, surgeon said scar tissue looked minimal and uterine walls were fine. Third baby at same practice, was very VBAC friendly but recommended a c-section just because I don't seem to go into labor on my own ever, and they don't induce a VBAC. Doctor didn't recommend a fourth pregnancy due to my health. She's the chief of OB surgery so I'm inclined not to push it. Id be freaked out the entire pregnancy. It's very strange to be done, but honestly 3 kids is all I can handle anyway. ", "controversiality": 0, "created_utc": 1461938801, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m2bya", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463772430, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree on big babies vaginally. I follow a birth page and they shared a photo of a momma who had a 12lb baby vaginally with no tearing :) not that I'd want that lol but it is possible. My first was 6lbs8oz, second 8lbs 12oz, and third 7lbs even. I had my first in a hospital with an epidural and had tons of tearing. Next two I had unmedicated at home with 0 tearing. I think being able to go at my own pace, not being on my back, and being able to feel it so I slowed down with pushing helped. With my first I pushed as hard as I could and he flew out in 3 pushes. ", "controversiality": 0, "created_utc": 1461941725, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m4bsx", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lgnz6", "retrieved_on": 1463773371, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mamaof2boys", "author_flair_css_class": null, "author_flair_text": null, "body": "I also agree with this - I wanted to go the midwife route with my first but the nearest hospital was nearly an hour away so we opted to birth there instead. With my second 2 we were 5 minutes away in case of emergency so we felt comfortable birthing at home. But if I was a vbac patient I would have used the birth center across from the hospital. You have to be careful and consider all the risks when looking into midwifery care. ", "controversiality": 0, "created_utc": 1461942091, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m4lat", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lc0hy", "retrieved_on": 1463773507, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "victoriasaurusrex", "author_flair_css_class": null, "author_flair_text": null, "body": "http://www.childbirthconnection.org/article.asp?ck=10210#vaginal\n\nThis page goes through the risks and benefits and both VBACs and repeat c-sections as informed by the current accepted research. Hope it helps!", "controversiality": 0, "created_utc": 1461948119, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m939u", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463775627, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "edmondskt", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had 1 c-section, 8 years ago. Head didn't descend past the 0 position. I'm 35+2 weeks and my hospital and midwives have been nothing but supportive for a VBAC. I did have a VBAC consult with the surgeon and if I go into labor myself I'll have a 70% success rate of getting a VBAC.\n\nI base the support directly to my location. I live in my state's capital and going to a very family-friendly hospital with high VBAC success rates. If I stayed and gave birth to the hospital that I had the c-section with I would most definitely not be given the option.", "controversiality": 0, "created_utc": 1461948408, "distinguished": null, "edited": false, "gilded": 0, "id": "d2m9bdw", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463775734, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "262Mel", "author_flair_css_class": null, "author_flair_text": null, "body": "My Dr. said 3. We're currently trying for baby number 3. After my first c section she said that 3 was the limit for most reputable OB practices in our state.", "controversiality": 0, "created_utc": 1461952048, "distinguished": null, "edited": false, "gilded": 0, "id": "d2mc2q4", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463777112, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Allysonanonymous11", "author_flair_css_class": null, "author_flair_text": null, "body": "They can't stop you, true. But doctors are allowed to turn you away, so to speak... So you would have a difficult time finding a doctor. But obviously someone will do it because it has to be done. I think insurances stop covering the procedure as well. ", "controversiality": 0, "created_utc": 1461956326, "distinguished": null, "edited": false, "gilded": 0, "id": "d2mfa0q", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lbxos", "retrieved_on": 1463778621, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "redgirl329", "author_flair_css_class": null, "author_flair_text": null, "body": "there is a really great facebook group for fact-based vbac information. lots of women on there are looking at 2, 3, 4 csections. give it a few days to wade through some of the dumber, irrelevant posts. but i've learned a lot. the name of the group is VBAC and Birth After Cesarean Facts -- Evidence Based Support.", "controversiality": 0, "created_utc": 1461958193, "distinguished": null, "edited": false, "gilded": 0, "id": "d2mgnp7", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463779272, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "redgirl329", "author_flair_css_class": null, "author_flair_text": null, "body": "fyi - [pain is not the best indicator for uterine rupture](http://1.bp.blogspot.com/-vXZF-onTffA/VZvVJ08CZHI/AAAAAAAAYa8/q_fY8IXODH4/s1600/UR%2BSigns-%2B640.jpg). ", "controversiality": 0, "created_utc": 1461958344, "distinguished": null, "edited": false, "gilded": 0, "id": "d2mgrk8", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6y87", "retrieved_on": 1463779322, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "redgirl329", "author_flair_css_class": null, "author_flair_text": null, "body": "no. pain is not a good indicator of uterine rupture. ", "controversiality": 0, "created_utc": 1461958600, "distinguished": null, "edited": false, "gilded": 0, "id": "d2mgyag", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lrs5w", "retrieved_on": 1463779410, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "There are MANY indicators of a uterine rupture. Crappy FHTs, unexpected ascent of the fetal presenting part, tachysystole of contractions, vaginal bleeding...there can be all of these things, there can be one, each mom is different. Is the rupture a slight tear over the incision only an inch long? Did the uterus grossly rupture and the baby is now inside of the abdominal cavity? These moms will experience different symptoms. The first, maybe just sudden stabbing pain over the incisional line and the contractions looking a bit funny on the monitor, but baby could deliver and the rupture may be discovered afterwards when it is atonous. The second, that mom and baby could go into shock and die in mere seconds. Pain may not be *the* indicator of a rupture, but I will sure as hell rule it out when laboring/pushing with a VBAC and she starts having a sudden pain characteristic/intensity changes.", "controversiality": 0, "created_utc": 1461973359, "distinguished": null, "edited": false, "gilded": 0, "id": "d2mqkz2", "link_id": "t3_4gvqjg", "parent_id": "t1_d2mgyag", "retrieved_on": 1463784005, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DoublePlusGoodly", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had 4 c sections. My last c section 6 months ago was a c section / hysterectomy with an extra 6 hours of surgery to separate my placenta from my bladder. I had placenta percreta with bladder invasion. ", "controversiality": 0, "created_utc": 1461996197, "distinguished": null, "edited": false, "gilded": 0, "id": "d2n2t3k", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1463789795, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Sweet! Thank you!", "controversiality": 0, "created_utc": 1462030224, "distinguished": null, "edited": false, "gilded": 0, "id": "d2ndpz8", "link_id": "t3_4gvqjg", "parent_id": "t1_d2mgnp7", "retrieved_on": 1463795003, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much!", "controversiality": 0, "created_utc": 1462030294, "distinguished": null, "edited": false, "gilded": 0, "id": "d2ndrcj", "link_id": "t3_4gvqjg", "parent_id": "t1_d2m939u", "retrieved_on": 1463795020, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kitkatkelly_", "author_flair_css_class": null, "author_flair_text": null, "body": "The biggest reason I want to go for a csection this time too is the unmedicated part. I got an epidural when I was 3 centimeters. I only made it to 4, things weren't progressing. And even with the epidural I still felt tremendous pressure. Not sure I could handle it without it!", "controversiality": 0, "created_utc": 1462030677, "distinguished": null, "edited": false, "gilded": 0, "id": "d2ndz7x", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6y87", "retrieved_on": 1463795123, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "I was at the queensway last time and doing it again. The nurses were awesome. And it's close to home so bonus. ", "controversiality": 0, "created_utc": 1462038290, "distinguished": null, "edited": false, "gilded": 0, "id": "d2nijhl", "link_id": "t3_4gvqjg", "parent_id": "t1_d2lzu6k", "retrieved_on": 1463797342, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mablesyrup", "author_flair_css_class": "purple", "author_flair_text": "Girl | Girl | Girl | Girl", "body": "I have had 4 c-sections.  The first two I tried vaginally and both ended with c-sections after 24+ hours of labor for each.  The scheduled c-sections were 100 times easier to recover from (not saying c-sections are easy to recover from at all though).  I was advised to seriously consider not having anymore children because of the upped risks with the amount I have had.  The 4th c-section took the longest because there was already so much scar tissue they had to go through.  I had my first c-section at 20 and my last c-section at 34.", "controversiality": 0, "created_utc": 1462077901, "distinguished": null, "edited": false, "gilded": 0, "id": "d2o4g8x", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1465554796, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MagicMurder", "author_flair_css_class": null, "author_flair_text": null, "body": "My sister has had 6 c-sections. She was told not to have more kids because they all come out huge and she has to have a c-section no matter what. She didn't have any complications with them but I'm sure 6 is a ridiculous number for doctors to deal with in terms of scar tissue and such. ", "controversiality": 0, "created_utc": 1462079456, "distinguished": null, "edited": false, "gilded": 0, "id": "d2o52s4", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1465555091, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "syboor", "author_flair_css_class": null, "author_flair_text": null, "body": "I had one c-section, one VBAC. Had a placenta previa scare with the second pregnancy so because of that did lots of reading about the risks of uterine scars.\n\nI've never heard of a blanket prohibition against getting pregnant after 3 c-sections, just a prohibition against labour/vaginal birth. But reading this thread it is apparently common. In my country, when they operate on a particularly scarry / sticky uterus, they just tell the woman afterwards that she shouldn't have anymore children. You are absolutely right that everybody is different. Why make sweeping statements based on averages when you have the chance to look at the relevant uterus directly?\n\nTheir is no magic cutoff number, the risks simply go up for each additional c-section, and sadly, a lot of those risks apply to the entire pregnancy and not just to the (optional) VBAC part of it.\n\nI don't think the doctor was trying to discourage you from having lots of children, rather, I think, the doctor was trying to get you to seriously consider VBAC. Have you straight up asked if they would go along with it or if this doctor knows a doctor who will go along with it? Some doctors will even do inductions if the main reason for the prior c-section was the baby's size.\n\nEven if you plan a c-section, don't forget to discuss what happens if you go into labour spontaneously before that. Stopping an spontaneous early term labour to have c-section would be such a shame.\n", "controversiality": 0, "created_utc": 1462181987, "distinguished": null, "edited": false, "gilded": 0, "id": "d2pgj26", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1465577632, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "syboor", "author_flair_css_class": null, "author_flair_text": null, "body": "No epidural allowed? With my VBAC the anesthesist tried to counsel me on something like that, but the midwife and nurse were all \"this guy doesn't know what he is talking about, if we have to wait for you to feel your scar bursting we would be seriously incompetent with the CTG\".\n", "controversiality": 0, "created_utc": 1462182190, "distinguished": null, "edited": false, "gilded": 0, "id": "d2pgkvk", "link_id": "t3_4gvqjg", "parent_id": "t1_d2l6y87", "retrieved_on": 1465577656, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "FL_Sunshine", "author_flair_css_class": "green", "author_flair_text": "2 boys, 13 and 10 years...baby girl 10/14/2015", "body": "I am 39 and have had 3 c-sections, with my third (this past year) being the easiest. I asked my doctor about a 4th because we're undecided on more children - high risk would be something that we'd factor into that decision.\n\nMy OB is a high risk doctor and she told me that I was a good candidate for a 4th c-section and that with the change in the way that they close the incision the risks had gone way down. But that was my doctor speaking with me about my own physical health and situation. I would definitely recommend having this discussion with your OB.", "controversiality": 0, "created_utc": 1462205753, "distinguished": null, "edited": false, "gilded": 0, "id": "d2prdvl", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1465582761, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SexyMuffin", "author_flair_css_class": null, "author_flair_text": null, "body": "I have had 4 c sections. First was an induction at 42 weeks that didn't progress after 30 hours of labor.  Tried for a VBAC for the second but there was no progress at 41.5 weeks and we couldn't induce safely a second time due to the previous c section.  Number 3 and 4 were scheduled c sections because of my history.  We were very open with our OBGYN about our desire to have 4 children and he let me know (after surgery and examining my uterus) that my scarring from the c sections was minimal and that my uterus was not thinning or wearing due to the incisions. He felt with each pregnancy another c section would be safe.  If he had told us it would not have been safe, we would not have had another child.  Good luck!!", "controversiality": 0, "created_utc": 1462250397, "distinguished": null, "edited": false, "gilded": 0, "id": "d2qnrbs", "link_id": "t3_4gvqjg", "parent_id": "t3_4gvqjg", "retrieved_on": 1465598230, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}