{"submission": {"author": "matt951207", "author_created_utc": 1358363272, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_a93cs", "created_utc": 1467289937, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/4qleon/looking_for_opinions_on_circumcision/", "gilded": 0, "id": "4qleon", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 107, "over_18": false, "permalink": "/r/Mommit/comments/4qleon/looking_for_opinions_on_circumcision/", "retrieved_on": 1472829161, "score": 23, "secure_media_embed": {}, "selftext": "I'm new to this sub, hopefully it's okay to ask this kind of stuff. If their is a better place to ask please let me know. \n\nWe are only 3 weeks from having our first kid and undecided on whether to get one. We are not religious so no influence there. \n\nIf you have any input or advice we'd like to hear it.\n\nI'm a soon to be dad wondering what women's thought on subject is.\nI'm cut and have no complaints, but sometimes wonder what it would be like if I wasn't. My wife has never been with anyone uncut to know if their is any difference from the women's perspective.\n\nReally hope this isn't inappropriate but we are so clueless we are about to decide by flipping a coin lol.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Looking for opinions on circumcision.", "url": "https://www.reddit.com/r/Mommit/comments/4qleon/looking_for_opinions_on_circumcision/"}, "comments": [{"author": "DarkBeforeDawn1", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is circumcised. My son is not.\n\nAfter researching it, I could find no compelling reasons to do it. Ultimately, I decided it was completely unnecessary and didn't want him going through any unneeded, probably painful medical procedures. ", "controversiality": 0, "created_utc": 1467290121, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tva84", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469396425, "score": 104, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "butterflycyclone", "author_flair_css_class": null, "author_flair_text": null, "body": "Same with us. ", "controversiality": 0, "created_utc": 1467290432, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tvfxd", "link_id": "t3_4qleon", "parent_id": "t1_d4tva84", "retrieved_on": 1469396500, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "care99bare", "author_flair_css_class": null, "author_flair_text": null, "body": "This. Also, should he decide as a man that he wants to be circumcised, it can still be done but with pain killers and appropriate hygenic care and (most importantly) his permission.", "controversiality": 0, "created_utc": 1467291902, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tw76w", "link_id": "t3_4qleon", "parent_id": "t1_d4tva84", "retrieved_on": 1469396857, "score": 42, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "care99bare", "author_flair_css_class": null, "author_flair_text": null, "body": "I've also had other people suggest watching a video that shows a circumcision. I have a friend who circ'd her first two but not her third because she saw the video and couldn't stomach it.", "controversiality": 0, "created_utc": 1467291946, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tw81t", "link_id": "t3_4qleon", "parent_id": "t1_d4tw76w", "retrieved_on": 1469396869, "score": 24, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "Also not religious here. My husband is not circumcised. He is Asian and it's pretty unheard of outside of North America to circumcise for non-religious reasons. I have been with a circumcised man and then him. To be honest there was no noticeable difference other than needing lube less often with my husband (the not circumcised one). We left our boys intact, and it's super easy to clean. You don't retract it at all, as the membranes are fused at birth, and it's cleaned just like you'd wipe a finger. It'll retract on its own over time as they hit puberty. We had no reason to circumcise our boys. If problems do arise later on, there are intermediate steps that can be taken (steroid creams and stretching), and if absolutely medically necessary or if they choose to as adults then they can choose to circumcise.", "controversiality": 0, "created_utc": 1467292251, "distinguished": null, "edited": false, "gilded": 0, "id": "d4twe77", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469396948, "score": 23, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anothertokengirl", "author_flair_css_class": null, "author_flair_text": null, "body": "I think babies are just fine as they are and don't need body modifications. We didn't circumcise our son and wouldn't do it to our daughter if we had one.", "controversiality": 0, "created_utc": 1467292659, "distinguished": null, "edited": false, "gilded": 0, "id": "d4twmns", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397059, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "body": "Husband is, son is. We were in a similar situation as you, undecided but leaning towards doing it just based on what we're used to. Now after a year+ I think that was kind of a cop out. It's becoming more normal to not circumcise. In the hospital they told us we had a day to decide then they would do it. One of the docs from my practice performed the circumcision. He gave us two options. One where they put the ring on and one where they make a cut and no ring. I'd research now what you would do. We were somewhat clueless for such a big decision. \nIn the end I sometimes have regret, especially on mom sites because people can really view it as butchering your child, almost like amputating something from them.\nBut most of the time I don't even think about it. He was fine, it healed fine, it's easy to clean. In fact this morning he had two big poop blow outs that went up the back and up the front, and I couldn't imagine cleaning around there if he wasn't circumcised. It would take 10 wipes or a bath probably, but then again I don't know. ", "controversiality": 0, "created_utc": 1467292938, "distinguished": null, "edited": false, "gilded": 0, "id": "d4twslf", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397137, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "proclivity4passivity", "author_flair_css_class": null, "author_flair_text": null, "body": "We didn't have a boy on the first go, but if we do, we will not circumsize. My (circumsized) husband is against it, and as a mother, I don't feel I could put my newborn son through a painful procedure like that for literally no reason. At that age, they don't understand what is happening. They just had the shock of coming into the world, and now someone is cutting off part of their genitals. Plus, things can go wrong with circumcisions. Why risk it?", "controversiality": 0, "created_utc": 1467293065, "distinguished": null, "edited": false, "gilded": 0, "id": "d4twvbk", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397172, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "luckysevensampson", "author_flair_css_class": null, "author_flair_text": null, "body": "Same here. There's just no point in it. My husband, who is circumcised, was against doing it for this reason, and that's enough for me.", "controversiality": 0, "created_utc": 1467293297, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tx0bt", "link_id": "t3_4qleon", "parent_id": "t1_d4tva84", "retrieved_on": 1469397239, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "smhockr", "author_flair_css_class": "blue", "author_flair_text": "MommatotheMax", "body": "My family is 'intact'. I guess my MiL who is a nurse saw no reason to get it done. I can't stand the thought of cutting my baby, especially for something that I personally feel is unnecessary. If my son(s) decide later in life that it is important and necessary,  that will be an informed decision at the time. ", "controversiality": 0, "created_utc": 1467293327, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tx0yd", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397246, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Arriettys_mom", "author_flair_css_class": null, "author_flair_text": null, "body": "My eldest son is, I won't circumcise any future sons. I regret it deeply. His penis is fine now, but the circumcision was botched and the healing process was terrible for him.  I can't dwell in regret, nothing I can do about it now, but I'd never do it again. I don't think badly of moms who do, but it is definitely something I wish I'd researched more beforehand rather than going with \"what's expected.\"", "controversiality": 0, "created_utc": 1467293691, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tx92w", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397353, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lemonadeandlavender", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in the boat of not altering a child's body without their consent for an unnecessary medical procedure. So circumcism and ear piercings are both \"no\" in my book because they are cosmetic. Vaccines are a \"yes\" because they save lives. Does that make sense? \n\nYou may want to do a quick search or circumcism over in /r/nursing. There was a huge thread over there about nurses that have taken part in circumcisms and the stories are not pretty. If you are going to circumcise, I think you need to watch a video of one being done so that you will know exactly what is happening to your son. It is too easy to think \"oh the baby leaves and comes back not crying and it's a minor procedure\" and once you really start to research it, watch a video of the procedure, and all that jazz you realize the baby isnt crying because he is in shock. I think it's terrible that parents circumcise their children without being willing to see firsthand what is happening to their sons. Knowledge is power.\n\nAlso, if it matters, I much prefer uncircumcised penis and my husband is circumcised. In my experience, I've had two uncircumcised partners that have struggled with sexual dysfunction (not being able to get off within a reasonable amount of time) and I think that has to do with the tip of the circumcised penis being less sensitive to sexual stimuli because is is always exposed. You can Google it and sexual dysfunction is more prevalent in circumcised males. Also, the uncircumcised penis feels better (smoother?) when having sex. The extra skin kinda acts as extra lubrication so the in/out motion isn't as rough.", "controversiality": 0, "created_utc": 1467293732, "distinguished": null, "edited": 1467294119, "gilded": 0, "id": "d4txa08", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397365, "score": 42, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "samarra", "author_flair_css_class": null, "author_flair_text": null, "body": "We circ'ed, no regrets. Two of my uncles had to have adult circumcisions so that tipped our scales.", "controversiality": 0, "created_utc": 1467294029, "distinguished": null, "edited": false, "gilded": 0, "id": "d4txgom", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397452, "score": 19, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sjb1985", "author_flair_css_class": null, "author_flair_text": null, "body": "I have two younger brothers. One is circumcised. One is not. My husband is, and we decided not circumcise our son. We did our research and at the time WHO didn't really have an opinion either way. I believe WHO has since gotten behind circumcision, but if we have another boy we will not circumcise. I asked my parents why my two brothers are different in that respect to get some perspective. My older younger brother had to have a few surgeries to \"fix\" a poorly done circumcision. I am only 1-2 years older than he is, so my memory isn't the best. I remember being older and asking why he had to go away and my dad told me he couldn't pee straight. I then asked my youngest brother about it, and he said he never felt odd not being circumcised (he played sports all throughout high school) and no girl has ever had a problem with it. I also think it feels different sexually for men, but cannot confirm as I only know what my husband has explained to me. I mean my brothers and I are close, but not THAT close. So we decided not to. If our little guy wants to later in life, we can do surgery when his foreskin is larger and easier for a surgeon to remove. \nTL;DR: Brothers are circumcised and not circumcised. Brother with circumcision had very bad experience. Additional research stated we could do it later if infections become an issue (mostly they don't). ", "controversiality": 0, "created_utc": 1467294109, "distinguished": null, "edited": false, "gilded": 0, "id": "d4txih1", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397475, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "buckette19", "author_flair_css_class": null, "author_flair_text": null, "body": "Good for you for researching it. \n\nWe decided not to do it because there is no benefit to it. At first my husband was set on having it done because he is circumcised but after he researched it he agreed with me that he didn't want to put our newborn through an unnecessary procedure which could result in many complications such as adhesions, infections, and even very rarely death.", "controversiality": 0, "created_utc": 1467294307, "distinguished": null, "edited": false, "gilded": 0, "id": "d4txmx6", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469397535, "score": 19, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IHaveAFunnyName", "author_flair_css_class": null, "author_flair_text": null, "body": "I watched a medical training video on circumcision and was horrified, even as someone who has seen surgeries before. Something about doing that to a baby for no reason made me sick to my stomach and solidified my decision to not circumsize. ", "controversiality": 0, "created_utc": 1467294825, "distinguished": null, "edited": false, "gilded": 0, "id": "d4txyzp", "link_id": "t3_4qleon", "parent_id": "t1_d4tw81t", "retrieved_on": 1469397692, "score": 23, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "&gt;In fact this morning he had two big poop blow outs that went up the back and up the front, and I couldn't imagine cleaning around there if he wasn't circumcised. It would take 10 wipes or a bath probably, but then again I don't know.\n\nActually, it's pretty easy! The foreskin is fused to the head of the penis at birth and doesn't start to separate at all until at least 2 years old and doesn't retract until puberty. I'd basically just hold the base of the penis and wipe downward like wiping something off of a finger. If some got around the tip, just kind of wiping across the tip usually got rid of it. Source: mom of 2 intact boys who have had many, many blowouts.", "controversiality": 0, "created_utc": 1467295636, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tyieg", "link_id": "t3_4qleon", "parent_id": "t1_d4twslf", "retrieved_on": 1469397946, "score": 15, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Decadencedancer", "author_flair_css_class": null, "author_flair_text": null, "body": "It's genital mutilation made mainstream. \n\nThankfully here in the UK is it not the norm (outside of religious beliefs) to mutilate the genitals of an infant.", "controversiality": 0, "created_utc": 1467296623, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tz6nf", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469398263, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "matt951207", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing. I was wondering if women had a preference for sex.\n\nPersonally I feel I was circumcised just right. I have enough skin that I'm able to masterbait without lube, it's very sensitive, and i've had no problem lasting in bed.  However I always wondered if it could be even better if I was uncut.", "controversiality": 0, "created_utc": 1467297698, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tzyot", "link_id": "t3_4qleon", "parent_id": "t1_d4txa08", "retrieved_on": 1469398702, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "firesoups", "author_flair_css_class": null, "author_flair_text": null, "body": "I do not have a son, I have a daughter.\n\nOn bodily autonomy:\nThis is the first time you will get to show your child that no one gets to do something to his body without his permission, regardless of the fact that he won't remember it. You could use his lack of circumcision in a future conversation about the importance of consent. This could be a really good thing.\n\nAs a woman who has slept with both cut and uncut men, I literally do not care in the least of my partner is or isn't. ", "controversiality": 0, "created_utc": 1467297726, "distinguished": null, "edited": false, "gilded": 0, "id": "d4tzzeo", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469398711, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thesongbirdy", "author_flair_css_class": null, "author_flair_text": null, "body": "We circumcised. I personally do not have any strong feelings on it one way or another, but what tipped the scale for my husband was thinking that my son would wonder why he is different from his dad (dad is circumcised).", "controversiality": 0, "created_utc": 1467297847, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u02kl", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469398752, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SeaStar96", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that there is no strong medical evidence one way or another....\n\nBut if you don't circumcise than the child than your saying to your child \"the way your body is , is your choice. You have the right to make decisions for yourself.\"", "controversiality": 0, "created_utc": 1467298107, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u09jq", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469398843, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "body": "See, this is why I wish I had asked more questions of other parents (like OP). Because just based on my own imagination/bias or what have you, I assumed it would be harder to clean. Maybe that's because that is what society has told us since generations back. We're  made to feel it is \"dirty\", when in fact it's not!", "controversiality": 0, "created_utc": 1467298177, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0bdy", "link_id": "t3_4qleon", "parent_id": "t1_d4tyieg", "retrieved_on": 1469398867, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "matt951207", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks. I was kind of leaning against getting one since i've always wondered what if I was missing out since i've been cut even though I have no complaints or ever remember having any problems.\n\nMy wife thought we should get him cut since I am and thought maybe he'd feel different if we didn't but I would think we would quit seeing each other naked before he's of age to have any memory of that stuff.\n\nI expected a more divided discussion on the topic but it seems like the majority agrees that there is no real reason to get one.", "controversiality": 0, "created_utc": 1467298275, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0e1t", "link_id": "t3_4qleon", "parent_id": "t1_d4txmx6", "retrieved_on": 1469398905, "score": 14, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_purple", "author_flair_css_class": null, "author_flair_text": null, "body": "Why did they have to?", "controversiality": 0, "created_utc": 1467298284, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0eb8", "link_id": "t3_4qleon", "parent_id": "t1_d4txgom", "retrieved_on": 1469398906, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "I totally don't blame you at all! It's so daunting as new parents and then all of a sudden realizing you have to decide whether or not to do a procedure you may or may not be familiar with. We had to answer these types of questions for my side of the family, who was just used to doing it because of the same reasoning and because it was \"just what was done\". They were skeptical when my first son was born, but now that a number of them have done diaper changes and their own research and such they understand.", "controversiality": 0, "created_utc": 1467298493, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0jxp", "link_id": "t3_4qleon", "parent_id": "t1_d4u0bdy", "retrieved_on": 1469398980, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "matt951207", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing.\n\nI'm against doing it if there isn't any good reasons (medical reasons or if women strongly prefer it I'd consider it)\nI just felt to uninformed on the topic to know if there was any medical advantage of it.", "controversiality": 0, "created_utc": 1467298589, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0miu", "link_id": "t3_4qleon", "parent_id": "t1_d4tzzeo", "retrieved_on": 1469399014, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "matt951207", "author_flair_css_class": null, "author_flair_text": null, "body": "I was leaning towards not getting one but my wife had the opinion that it might make him feel different. I don't know if my dad has one and I would imagine that we would quit seeing each other naked before he is old enough to care about it. ", "controversiality": 0, "created_utc": 1467298976, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0wxo", "link_id": "t3_4qleon", "parent_id": "t1_d4u02kl", "retrieved_on": 1469399150, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "samarra", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't ask. My dad told me when I brought up we were deciding whether or not to circ 7 years ago. He just talked about how much pain they went through, etc. They grew up on a farm and none of them were circ'ed. My dad had to get circ'ed last year. He isn't the type to discuss why! I will see if my mom knows, because now I am curious.", "controversiality": 0, "created_utc": 1467299047, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u0yte", "link_id": "t3_4qleon", "parent_id": "t1_d4u0eb8", "retrieved_on": 1469399174, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Salty_Caroline", "author_flair_css_class": null, "author_flair_text": null, "body": "As a nurse I have assisted with a few circumcisions, and though the doctors claim it's really not that painful (only 4/5 babies cry if done with freezing/sugar water), but the freezing makes the babies cry, because that part hurts, so I'm not convinced it's as pain free as they suggest. I felt very much against circumcision before watching it done, and I felt very much the same after.\n\nThe newest research suggests not to do it, and the Canadian Pediatric Society just announced again last year that they stand by that decision. If you have reason to believe it's necessary, such as living in a high HIV/AIDS community, or what have you, perhaps it would be more necessary, but otherwise the risk outweighs the potential benefits.\n\nI know that there is so much anecdotal evidence out there, mostly how some men had to get it done when they were older, so just do it when they're young, but that's like taking out every appendix in hopes that you'll save someone from getting appendicitis. The risk of the procedure far outweighs the potential benefit, again. So I realize this is anecdotal, and not the norm, but a baby in my province died last summer from blood loss after his circ. There is definitely risk involved with it being done, more so than just the pain.\n\nAs a woman who has been with mostly uncircumcised men, I prefer the look. I'm so used to it that seeing a circumcised penis sort of startles me. Which is always great as a nurse!\n\nEdit: You can youtube the procedure, and watch it if you're interested. It may or may not influence your decision.", "controversiality": 0, "created_utc": 1467299185, "distinguished": null, "edited": 1467301287, "gilded": 0, "id": "d4u12iq", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469399223, "score": 19, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MamaD_Cooks", "author_flair_css_class": null, "author_flair_text": null, "body": "I honestly don't think routine infant circumcision is necessary. I also don't believe in piercing a child's ears until they ask for it. But the time he grows up, it will not be a big deal because so many parents are opting against RIC. \n\nI have not ever seen one that is in tact, but two of my friends husband's are still in tact and it's no big deal to them. ", "controversiality": 0, "created_utc": 1467300869, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u2dub", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469399842, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "beegma", "author_flair_css_class": "green", "author_flair_text": "Mom of 2", "body": "I am a maternity nurse and I didn't circumcise either of my sons. My husband is circumcised, but we agreed that it was unnecessary and cruel. Just because you want your son to look like Daddy and everyone else downstairs is just ignorant. I challenge people that say that to assist with a circumcision. I don't work in a clinic or hospital anymore, but the last time that I did I began refusing to assist. The babies do feel pain when they're cut. I won't go into specific details, but besides cutting there's clamping and injecting that goes into the procedure as well. I told my boys that if someone in the bathroom or locker room teases them about the way their un-cimcumsized penis looks they should tell them to stop looking at their junk.", "controversiality": 0, "created_utc": 1467301335, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u2r26", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469400015, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "unclegrassass", "author_flair_css_class": null, "author_flair_text": null, "body": "My school of thought was that if there is no strong reason to do it, then we shouldn't. If there is no religious reason or strong parent feelings then it is essentially an unnecessary surgery on an infant. Also the arguments people come up with, adhesion or cleanliness were both non issues for us. The penis is self cleaning so we make sure to give regular baths and wipe the outside regularly which takes care of the cleaning, pretty basic stuff that everyone is capable of doing. Adhesion are very are and mostly come from retracting the foreskin so just don't retract the foreskin. It will retract on its own and your son will help it along as he gets older.  ", "controversiality": 0, "created_utc": 1467301356, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u2rob", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469400023, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "unclegrassass", "author_flair_css_class": null, "author_flair_text": null, "body": "Not to mention if he asks just explain that your parents decided to circ you buy you wanted your son to be able to make that decision for himself. Not a big deal.", "controversiality": 0, "created_utc": 1467301543, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u2wwr", "link_id": "t3_4qleon", "parent_id": "t1_d4u0wxo", "retrieved_on": 1469400092, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fluffypotato", "author_flair_css_class": null, "author_flair_text": null, "body": "We chose not to. My husband is circed so it took a wee bit of convincing him. Once he did his research too, he was completely on board for keeping our boy intact. I'm quite glad that we went with that decision.\n\nMy friend had her third son shortly after our first. That baby was so freaking cranky every time he peed or pooped. I think the wet diaper irritated his raw penis. She said all her boys were like that for weeks after their circs.\n\nRecently, I got to assist a few urology surgeries. The doctor and anesthesiologist were discussing how unnecessary and potentially harmful the circumcision was they were performing on a three year old that day. Hope this helps.", "controversiality": 0, "created_utc": 1467301742, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u32lr", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469400166, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1467302080, "distinguished": null, "edited": 1467578962, "gilded": 0, "id": "d4u3c84", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469400293, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sammit87", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm curious as well. ", "controversiality": 0, "created_utc": 1467302156, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u3edj", "link_id": "t3_4qleon", "parent_id": "t1_d4u0yte", "retrieved_on": 1469400321, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "F0MA", "author_flair_css_class": null, "author_flair_text": null, "body": "Hubs is, son isn't. Hubs did not have strong feelings either way and my bottom line was I wanted my daughter to make her own decision about getting her ears pierced so my son should decide for himself if he wants to get circumcised. I know I'm not comparing apples to oranges but the sentiment is the same. It's a tough decision to make but at the end of the day I don't think there is a \"wrong\" answer so don't beat yourself up about it. Good luck!!", "controversiality": 0, "created_utc": 1467302485, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u3nq4", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469400443, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "numericrhino", "author_flair_css_class": null, "author_flair_text": null, "body": "Same. I told my husband he could make the decision. Originally he planned on having our son circumcised. I asked him to research circumcision since I suspected he based his decision on outdated information. He changed his mind after he thought about it a bit more. My understanding is the Midwest USA that has the highest rate. We live in the Midwest but still decided against it. ", "controversiality": 0, "created_utc": 1467302679, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u3t19", "link_id": "t3_4qleon", "parent_id": "t1_d4tva84", "retrieved_on": 1469400513, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "raiu86", "author_flair_css_class": null, "author_flair_text": null, "body": "This is reddit. You will find **lots** of opinions on this.\n\nMy husband was circumcised as an adult; our son is intact. I was basically against giving little guy the snip, but willing to defer to the parent with a penis and experience being circumcised.\n\n\"Do you wish your parents had circumcised you as a baby so you didn't have to have it done as an adult?\"   \n\"No. I wish they hadn't taught me to be so ashamed about jacking off that I was unwilling to got medical care years earlier when the problems first started. We'll do better by our little guy.\"   \n\nAny lingering doubts my husband had were removed when we took the hospital's birth class; they showed us pictures of how circumcision is preformed. He was not letting my OB (or anyone else) do that to our *awake* 1 day old.\n\nWe got a fair bit of push back from both our families. But my OB was relieved we said no (\" good. It's just cosmetic surgery...for newborns\" he didn't say this until *after* we said no.), and our son's pediatrician has also been supportive (\"there are no medical benefits that can't be matched by good hygiene and safe sex\")", "controversiality": 0, "created_utc": 1467304281, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u52cj", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469401105, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "somersaultsuicide", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't understand, wasn't she present when she did the first two? Why would the video make any difference?", "controversiality": 0, "created_utc": 1467304482, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u585b", "link_id": "t3_4qleon", "parent_id": "t1_d4tw81t", "retrieved_on": 1469401182, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "orantte", "author_flair_css_class": null, "author_flair_text": null, "body": "No, usually parents are not present for it, like any other surgical procedure.", "controversiality": 0, "created_utc": 1467304855, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u5ivn", "link_id": "t3_4qleon", "parent_id": "t1_d4u585b", "retrieved_on": 1469401322, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SuperSpiderRN", "author_flair_css_class": null, "author_flair_text": null, "body": "Same here. ", "controversiality": 0, "created_utc": 1467304903, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u5k7s", "link_id": "t3_4qleon", "parent_id": "t1_d4tva84", "retrieved_on": 1469401339, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "casstron", "author_flair_css_class": null, "author_flair_text": null, "body": "If it wasn't meant to be there, it wouldn't be. neither of my sons are circumcised, and I'm very happy with our choice. If they decide to go through with it later, that's great, it was a decision about their body made by them, not me. Autonomy is so important!", "controversiality": 0, "created_utc": 1467304943, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u5lby", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469401354, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SuperSpiderRN", "author_flair_css_class": null, "author_flair_text": null, "body": "That baby dying happened just before we had our son. We were on the fence about it, and after talking to the docs at my hospital and that incident, we decided against, even though husband is. ", "controversiality": 0, "created_utc": 1467305141, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u5qzi", "link_id": "t3_4qleon", "parent_id": "t1_d4u12iq", "retrieved_on": 1469401428, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "somersaultsuicide", "author_flair_css_class": null, "author_flair_text": null, "body": "I was present for my son's. Stood right beside him, that's why I was confused.", "controversiality": 0, "created_utc": 1467305141, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u5qzo", "link_id": "t3_4qleon", "parent_id": "t1_d4u5ivn", "retrieved_on": 1469401428, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "FreeWhaleWilly", "author_flair_css_class": null, "author_flair_text": null, "body": "We circumcised our son, but we had religious precedent. Let's just say we are glad our new arrival is a girl and don't have to think about it again. \nNothing was botched, healing was fine, our son has no problems with it, but watching it happen was heart wrenching. If we had another boy, we would have reconsidered even with the religious issue. ", "controversiality": 0, "created_utc": 1467305179, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u5s5p", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469401443, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bitterred", "author_flair_css_class": null, "author_flair_text": null, "body": "Not OP, but I had family members in a similar situation. They grew up with non circ'ed and were harassed at school for being different, which led to them getting circumcised as adolescents. ", "controversiality": 0, "created_utc": 1467305503, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u61fl", "link_id": "t3_4qleon", "parent_id": "t1_d4u3edj", "retrieved_on": 1469401565, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "librarianzrock", "author_flair_css_class": null, "author_flair_text": null, "body": "I had two girls so I don't have first hand experience, but when I was in the birthing center after my 2nd daughter was born, the baby next to us was having it done. I have never heard such a horrible sound - the screams were so tiny and just gut wrenching. I'm sure they used a painkiller but it was just awful to hear.\n\nDoctors used to think \"babies didn't feel pain\" but for anyone who has witnessed this happen, I think it stays with you. If it's an important part of your culture and you view it as a rite of passage, so be it. If not, spare your new baby a painful greeting into the world.", "controversiality": 0, "created_utc": 1467306188, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6lb9", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469401825, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ponopls", "author_flair_css_class": null, "author_flair_text": null, "body": "We felt the same way. I've also found caring for an uncut baby boy to be a lot easier than I thought since you don't have to (actually shouldn't) retract the foreskin until it naturally retracts (around age 5 I think?), so that's a plus during diaper changes. ", "controversiality": 0, "created_utc": 1467306213, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6m0x", "link_id": "t3_4qleon", "parent_id": "t1_d4tva84", "retrieved_on": 1469401834, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "raiu86", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I couldn't imagine cleaning around there if he wasn't circumcised\n\nMy mom worried about that when she found out we left our son intact. We told her he's \"sealed for freshness\"\n\nBut mostly I wanted to add, I was afraid of circumcision because \"OMG! What if he poops before it heals?!?!?\" So I guess it goes both ways!", "controversiality": 0, "created_utc": 1467306260, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6nei", "link_id": "t3_4qleon", "parent_id": "t1_d4twslf", "retrieved_on": 1469401852, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "orantte", "author_flair_css_class": null, "author_flair_text": null, "body": "For my son's and my nephews, they just take the baby while you are in the hospital on day 2 or 3 and do it in a procedure room, then return the baby. My son was calm and comfortable when he returned so I was pleased with how that was done. ", "controversiality": 0, "created_utc": 1467306349, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6px5", "link_id": "t3_4qleon", "parent_id": "t1_d4u5qzo", "retrieved_on": 1469401886, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "raiu86", "author_flair_css_class": null, "author_flair_text": null, "body": "A slightly nsfw take on a Daniel Tiger episode\n\n🎼 🎶 In some ways we are different, but in so many ways we are the same 🎶 ", "controversiality": 0, "created_utc": 1467306424, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6s21", "link_id": "t3_4qleon", "parent_id": "t1_d4u0wxo", "retrieved_on": 1469401913, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sjb1985", "author_flair_css_class": null, "author_flair_text": null, "body": "My brother is uncircumcised. He's in his mid twenties and when I asked him, he said it wasn't a big deal in the locker room. I think it depends on the person's temperament. I also think more and more people are leaning towards not doing it. ", "controversiality": 0, "created_utc": 1467306472, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6tfm", "link_id": "t3_4qleon", "parent_id": "t1_d4u61fl", "retrieved_on": 1469401931, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ponopls", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is circ'd, son isn't, and if son ever asks why he is different than daddy we will just use it as an opportunity to talk about bodily autonomy. ", "controversiality": 0, "created_utc": 1467306571, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u6w6q", "link_id": "t3_4qleon", "parent_id": "t1_d4u0wxo", "retrieved_on": 1469401967, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RorschachBulldogs", "author_flair_css_class": null, "author_flair_text": null, "body": "I think if you're in doubt, you shouldn't do it since it is permanent.  I have 2 boys that are circumcised.  I didn't really know that much about it, and the whole idea of *not* circumcising wasn't all that prevalent like it is now (in the US).  \n\nMaybe you guys should sit down and watch a video of the procedure being done, then decide whether you think any benefits of it would outweigh the obvious distress that it puts on the baby.  \n\nI personally wouldn't do it again, and sort of regret having it done on my 2 boys.  Nothing bad happened with them, I just didn't know it was painful or traumatic for a baby, and I didn't realize that there were adult males out there who regretted not having their foreskin.  The Dr's basically talked me into it by downplaying it as a routine thing that everyone just 'does'.  \n\n[Here](https://www.youtube.com/watch?v=bXVFFI76ff0) is a pretty good video of the procedure being done, if you're interested.  It's NSFW obviously.", "controversiality": 0, "created_utc": 1467307011, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u78yu", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469402135, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "spacepiratetabby", "author_flair_css_class": null, "author_flair_text": null, "body": "Also depends on the time period. My dad told us stories about the single uncircumcised boy in grade school and how he was teased in the locker room, but it's steadily been getting less popular to circumcise over time. If the trend continues, by the time a baby born today is old enough to notice/care, they'll be surrounded by peers that are also uncircumcised. ", "controversiality": 0, "created_utc": 1467307200, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u7eld", "link_id": "t3_4qleon", "parent_id": "t1_d4u6tfm", "retrieved_on": 1469402209, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RorschachBulldogs", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I was wondering if women had a preference for sex.\n\nThere's no difference whatsoever.  ", "controversiality": 1, "created_utc": 1467307249, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u7g0w", "link_id": "t3_4qleon", "parent_id": "t1_d4tzyot", "retrieved_on": 1469402230, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RorschachBulldogs", "author_flair_css_class": null, "author_flair_text": null, "body": "I assumed the same!  I imagined poop getting up under the foreskin and having to dig it out of there.. Then I realized that it's not a whole lot more complicated having daughters.  It's not a big deal.  \n\nWish I would have had the chance to talk to other people about this, too.  I have 2 circumcised sons that I almost certainly would have left intact had I been able to properly research my decision.  ", "controversiality": 0, "created_utc": 1467307618, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u7qsz", "link_id": "t3_4qleon", "parent_id": "t1_d4u0bdy", "retrieved_on": 1469402438, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "somersaultsuicide", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah in Canada (at least where I am from) you do it through a private clinic (not at the hospital). Small little boutique office. I stood right beside him when the doctor did it, son barely cried (he cried more getting his vaccines) which made for an overall good experience.\n\nI always find it interesting that people are adamant that it is the babies body and so we shouldn't have the right to do anything to it (which I can somewhat agree with), but have no problem with religious people indoctrinating their children with their beliefs (without the child's consent). I think a fundamentalist Christian infusing their beliefs into their children would do more damage to them vs circumcision, but hey that's just me.", "controversiality": 0, "created_utc": 1467307723, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u7tp0", "link_id": "t3_4qleon", "parent_id": "t1_d4u6px5", "retrieved_on": 1469402476, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bitterred", "author_flair_css_class": null, "author_flair_text": null, "body": "These family members are 50+, and from a very rural area. It's a bit different. \n\nI only found these stories out because they were horrified that I wasn't going to circumcise my son.", "controversiality": 0, "created_utc": 1467307755, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u7ujd", "link_id": "t3_4qleon", "parent_id": "t1_d4u6tfm", "retrieved_on": 1469402487, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "taurus_indigo", "author_flair_css_class": null, "author_flair_text": null, "body": "I won't repeat what others have said, but one thing I didn't know: if you have him circumcised you have to put vaseline on it every time you change his diaper for the first year. We left my son intact and we don't have to do anything with it other than clean him in the tub. The foreskin doesn't retract until they are around 4 or 5. So as a baby it's very little maintenance. (Ok some people had to do it for less time. I guess maybe it takes longer if it doesn't heal right. There is no reason to message me I'm not looking to have my opinion changed.)", "controversiality": 0, "created_utc": 1467308425, "distinguished": null, "edited": 1467443434, "gilded": 0, "id": "d4u8bwe", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469402714, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "body": "It was only for about two weeks for us. It heals faster than you think. ", "controversiality": 0, "created_utc": 1467308779, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u8ljv", "link_id": "t3_4qleon", "parent_id": "t1_d4u8bwe", "retrieved_on": 1469402841, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "Interestingly, in Canada the circumcision rate is now 31.9% as of 2006. It's much more common now *not* to circumcise in Canada, and has been so in most of the rest of the world for a long time.\n\nEdit: Not sure why my comment is getting downvoted. It's a [fact](https://en.wikipedia.org/wiki/Prevalence_of_circumcision). ", "controversiality": 0, "created_utc": 1467309440, "distinguished": null, "edited": 1467310751, "gilded": 0, "id": "d4u94je", "link_id": "t3_4qleon", "parent_id": "t1_d4u7eld", "retrieved_on": 1469403089, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "care99bare", "author_flair_css_class": null, "author_flair_text": null, "body": "No, you're not usually present when they do the circumcision.", "controversiality": 0, "created_utc": 1467309716, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u9ch2", "link_id": "t3_4qleon", "parent_id": "t1_d4u585b", "retrieved_on": 1469403193, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "spacepiratetabby", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh yeah, I should have been more clear that I was only really talking about the US. We are a bit behind on this issue but it does seem like we are catching up! ", "controversiality": 0, "created_utc": 1467309744, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u9d9w", "link_id": "t3_4qleon", "parent_id": "t1_d4u94je", "retrieved_on": 1469403204, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "Oh no worries! I just looked up the rate for the US. I find it so crazy the difference in the rate of circumcision, given that we share a border and many have dual citizenship. Even our Canadian Pediatric Society no longer recommends it as routine without religious or medical reasons. ", "controversiality": 0, "created_utc": 1467310085, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u9n08", "link_id": "t3_4qleon", "parent_id": "t1_d4u9d9w", "retrieved_on": 1469403332, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "somersaultsuicide", "author_flair_css_class": null, "author_flair_text": null, "body": "Where I am from people are present when they do circumcisions.", "controversiality": 0, "created_utc": 1467310474, "distinguished": null, "edited": false, "gilded": 0, "id": "d4u9y1b", "link_id": "t3_4qleon", "parent_id": "t1_d4u9ch2", "retrieved_on": 1469403476, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Graendal", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a Canadian living in the States and it honestly confuses me that it's even a thing here, aside from in the Jewish community (I can understand old religious rituals sticking around for a long time). I don't have a strong opinion that parents who do it are mutilating their babies or whatever, I just don't really.. get it? Like, why would this weird and unnecessary procedure have persisted so long in American culture? When people talk about how it's \"cleaner\" it sounds so strange, like suggesting you remove your entire fingernails to prevent dirt from accumulating underneath them.", "controversiality": 0, "created_utc": 1467310929, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uaazr", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469403645, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Graendal", "author_flair_css_class": null, "author_flair_text": null, "body": "I've read that it's getting closer to 50/50 in the USA, so I don't think \"feeling different\" will be as much of an issue as it would have been in the past.", "controversiality": 0, "created_utc": 1467311104, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uag13", "link_id": "t3_4qleon", "parent_id": "t1_d4u0wxo", "retrieved_on": 1469403711, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Salty_Caroline", "author_flair_css_class": null, "author_flair_text": null, "body": "And he'll likely be very satisfied with that decision! And hopefully you are too.", "controversiality": 0, "created_utc": 1467311143, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uah69", "link_id": "t3_4qleon", "parent_id": "t1_d4u5qzi", "retrieved_on": 1469403726, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "I was actually worried about that until my husband corrected me about the status of the foreskin at birth. I'm more nervous about having a girl this next time (I don't know what we're having yet), as I have no clue how to change a baby girl's diaper!", "controversiality": 0, "created_utc": 1467311836, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ub18c", "link_id": "t3_4qleon", "parent_id": "t1_d4u7qsz", "retrieved_on": 1469403989, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mbutterflye", "author_flair_css_class": null, "author_flair_text": null, "body": "From my experience when an uncut penis is erect the foreskin retracts to the point where you can't really tell there is foreskin. Cosmetically it only really looks different when flaccid. Sensationally, well the interior of the vagina doesn't have a lot of precise nerve endings, so it's not going to feel any different. Blunt fleshy objects feel like Blunt fleshy objects. :)", "controversiality": 0, "created_utc": 1467312047, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ub7fu", "link_id": "t3_4qleon", "parent_id": "t1_d4tzyot", "retrieved_on": 1469404070, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MrsTroy", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is circumcised. My oldest son is circumcised (2.5yrs). Our youngest son is not (11 months). My husband and I both agree that circumcising our first son is the biggest parenting fail that we have made. If we have any more sons they will not be circumcised, either. The day after son #1 was born, they came and got my son and I from our room to go do the circumcision as planned. My husband was not present. We walked down to the nursery and it was done in there. I was assured he would feel no pain, but may feel minor discomfort. They had me stand at his head and gave me a pacifier and little syringe of sugar water to calm him \"in case he cries\". Oh, boy, did he cry. They did inject a numbing agent at the base of his penis, which didn't bother him at all. He was in between sizes on the clamp, so they used the smaller one. (\"Better to not take off quite enough than to take too much\"). He was also fine when they applied the clamp. The MOMENT the doctor began cutting, my baby began to wail. To this day I have never heard anything like it. It haunts me. I was there for the entire \"completely normal and routine\" procedure, and it just felt barbaric. I felt awful for subjecting my son to that. He still has problems. Sometimes he complains when he gets erections because it hurts when the super sensitive head of his penis rubs on his diaper. Luckily, that \"little bit extra\" he still has protects his penis while flaccid, and basically acts as a working foreskin. He's had a few adhesions, which are very painful for him, so we always apply a+d ointment as a preventative measure during diaper changes. With our second son, we refused to have him circumcised. He will be a year old in less than a month and we have never had any issues whatsoever with his penis. We just leave it alone, and it's fine. ", "controversiality": 0, "created_utc": 1467312731, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ubqy6", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469404325, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dirtyMAF", "author_flair_css_class": null, "author_flair_text": null, "body": "Dont do it. I was born in 1970s and feel very lucky not to have been. A significant part of my sexual sensation comes from the foreskin and ive never had any problems with it. If I were to suddenly lose I know that sex would be much less pleasurable. Its amazing that so many ignorant doctors still advocate doing this barbaric procedure to infants. But dont take my word for it. Dont take a doctor's word either, research it for yourself and see how many medical societies in the western world outside the U$ think circumcision is a good idea. Youll see that none of them do and have publicly condemmed the AAP circumcision policy. Also, as of 2010 the circumcision rate in the US was around 50% and I suspect is much lower now.\n\nGood for you for thinking for yourself and hopefully not subjecting your son to this procedure. I wish more parents were like you.", "controversiality": 0, "created_utc": 1467312896, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ubvrs", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469404389, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WhiteRushin", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it depends on your hospital policy, mine gave us the option to watch, but I opted out. My MIL however, was all for it.", "controversiality": 0, "created_utc": 1467314982, "distinguished": null, "edited": false, "gilded": 0, "id": "d4udjl8", "link_id": "t3_4qleon", "parent_id": "t1_d4u5ivn", "retrieved_on": 1469405171, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "We have chosen not to circ. For various reasons, including, in no particular order:\n1) the foreskin is a protective membrane\n2) baby boys that have been circumcised are more prone to uti and other infections\n3) it's not OUR body\n4) babies go into SHOCK from circumcision. Birth is already traumatic, why make it worse?\n5) it doesn't seem right to deprive our son of a large amount of sensation that us experienced by the foreskin\n6) we are under no religious obligation to circumcise\n7) outside of the US it is considered inhumane\n\nThere's more, but that covers the largest reasons we chose against.make sure your future ped is on board with whatever decision you make. Uncircumcised penis care us somewhat forgotten in this country, so making sure your docs are aware us very important.", "controversiality": 0, "created_utc": 1467316080, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uefp0", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469405592, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaywhaaat", "author_flair_css_class": null, "author_flair_text": null, "body": "Husband wanted to, because he is. \nI didn't want to, because I didn't want my son unnecessarily cut, and I sooo didn't want to deal with the after care. uncircumcised penis? give it a wipe! Circumcised? bit more. \n\nI told husband if he REALLY wanted to get it done, we could, but *HE* would be doing *all* diaper changes until it was fully healed. That, plus the fact that since it's an elective surgery here it costs like 500 bucks (unless it actually becomes medically necessary), made him not want to.\n\n&gt; My wife has never been with anyone uncut to know if their is any difference from the women's perspective.\n\nsexually? Been with both, didn't notice any different pertaining to that really personally. different folks different strokes and all that.", "controversiality": 0, "created_utc": 1467316553, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uet7k", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469405768, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "For intercourse, there is little to no difference on our end, but I found foreplay to be nicer with a foreskin, if this makes sense? My uncut partner seemed to have an extra range of stimulation and sensitivity than I have found with circumcised partners. So it makes no petsonal difference, but it made me feel like I was a more satisfying lover, which made me feel sexier. If that makes sense/helps at all.", "controversiality": 0, "created_utc": 1467316708, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uexoo", "link_id": "t3_4qleon", "parent_id": "t1_d4tzyot", "retrieved_on": 1469405827, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stinkyunicorn", "author_flair_css_class": null, "author_flair_text": null, "body": "I was mildly against circumcision before having my son. When I was pregnant, I watched several videos of the procedure being done and have since been extremely against it. (Not religious and son is intact.)\n\nI know several men who have gotten circumcised later in life (for a variety of reasons) and all said they noticed a decrease in sensitivity. I know that's anecdotal, but between that and watching those videos, I feel like I made the right decision for my kid. ", "controversiality": 0, "created_utc": 1467317089, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uf8hj", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469406037, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nakamura_branchevska", "author_flair_css_class": null, "author_flair_text": null, "body": "Please don't decide this by flipping a coin.  If you are not sure - don't do it, this way the kid can choose later on.  I know a few people who had theirs as adults - it's unpleasant, but not on the same scale as, for instance, childbirth or a torn ligament.\n\n", "controversiality": 0, "created_utc": 1467317256, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ufd64", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469406099, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a worse time jeeping my girl clean becauseso many nooks and crannies. The worst for boys is the scrotum when poop gets stuck in the crinkles, but even still that is less worrying than some places girls get it.", "controversiality": 0, "created_utc": 1467317281, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ufdvy", "link_id": "t3_4qleon", "parent_id": "t1_d4u7qsz", "retrieved_on": 1469406108, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nakamura_branchevska", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, each woman has a preference.  But there is no overall 'women' preference that would be binding on your son's future sex partners if he chooses to have any that happen to be female.", "controversiality": 0, "created_utc": 1467317394, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ufh3t", "link_id": "t3_4qleon", "parent_id": "t1_d4tzyot", "retrieved_on": 1469406151, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "Yes about the scrotum! Especially when it's crumbly-ish poop because I didn't get it right away. It's like impossible to get all of it. I wish the scrotum was smooth until they outgrew diapers!", "controversiality": 0, "created_utc": 1467317496, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ufjwz", "link_id": "t3_4qleon", "parent_id": "t1_d4ufdvy", "retrieved_on": 1469406187, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "with_an_E_not_an_A", "author_flair_css_class": "green", "author_flair_text": "XY'11, XX'14, XY'15", "body": "We had my first son circumcised because he had a congenital deformity on his penis that had to be corrected using his foreskin. We didn't circumcise my second son as we figured he could get it done later in life if he needs to or decides he wants to.", "controversiality": 0, "created_utc": 1467318402, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ug9mm", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469406523, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mia_Mama_Bear", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm going to show two perspectives, neither religious.\n\n1. No real medical reason to. Actually more hygienic to not in the long run. A lot of what has been said before.\n\n2. However, I have two very close friends that both just had boys and they chose to circumcise. Their reasons were a) dad is and therefore wouldn't want the kid to feel strange because he's different from daddy, and b) it's a cultural norm in the USA (at least outside the enlightened world of reddit, haha) and not being circumcised is a potential bullying target as kiddo gets older. This option may be fueled by a recent news story that has been circling our hometown about this very thing. And c) if dad is circucised, he would have a difficult time teaching son to clean and care for an uncircumcised penis.\n\nAll food for thought. I also have to mention that I really appreciate how respectful this thread has been! This is a hot button topics and I'm just really impressed with all of us right now.", "controversiality": 0, "created_utc": 1467320364, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uhsuz", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469407247, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "babyrabiesfatty", "author_flair_css_class": null, "author_flair_text": null, "body": "I prefer an uncircumcised penis in foreplay and sex. The extra layer of skin almost feel like a lubricant because it helps the movements have some 'play'.", "controversiality": 0, "created_utc": 1467322303, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uj8s9", "link_id": "t3_4qleon", "parent_id": "t1_d4u7g0w", "retrieved_on": 1469407926, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "linz_in_the_sky", "author_flair_css_class": null, "author_flair_text": null, "body": "Both of my sons were healed enough to be done with Vaseline within a week.", "controversiality": 0, "created_utc": 1467323627, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uk7x8", "link_id": "t3_4qleon", "parent_id": "t1_d4u8ljv", "retrieved_on": 1469408387, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "breia", "author_flair_css_class": null, "author_flair_text": null, "body": "I decided not to circumcise my son because I believe the only person making a permanent decision about what his genitals look and feel like should be him. I don't think I have the right to decide that for anybody else. The other reason is because it's a surgical procedure, and like any, it has risks. The risks are low, but still there. A couple people have already mentioned in 2015 an infant died from bleeding after a circumcision. There's a possibility that it won't heal right, and cause him pain. It might get infected. It's unlikely, but possible, compared to a 0% chance of that happening if you leave him intact.", "controversiality": 0, "created_utc": 1467324034, "distinguished": null, "edited": 1467378715, "gilded": 0, "id": "d4ukijg", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469408525, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ultrapenis6000", "author_flair_css_class": null, "author_flair_text": null, "body": "If your most compelling reason to do it is because it was done to you, you certainly shouldn't do it.  There have been some studies into what factors determine what parents in America choose, and the status of the father is the strongest predictor by far every time.\n\nWhat that means is that you probably lost your foreskin just because your father lost his.  Seems asinine when you think about it...there is no particular reason to think it's for the best, it's just being done because it's painful to recognize a mistake you can't undo.", "controversiality": 0, "created_utc": 1467328718, "distinguished": null, "edited": false, "gilded": 0, "id": "d4unmjv", "link_id": "t3_4qleon", "parent_id": "t1_d4u0e1t", "retrieved_on": 1469410063, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "We chose not to circumcise. Ultimately the benefits aren't strong enough for us (key words: for *us*, other families may weigh things differently) to consider it an essential procedure, and we don't want to do an elective cosmetic procedure on an infant. It can always be done later if needed/wanted.", "controversiality": 0, "created_utc": 1467329660, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uo84c", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469410345, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "I support people who get circumcisions for health reasons, though we opted against, but it drives me nuts when people circ so that dad and son look the same! You are going to have plenty of differences between his body and yours - your crotch will have hair and his won't, you might have tattoos, scars, or piercings, hell even your haircuts will be different. It's not hard to explain the differences and that's just a really bad reason to have a medical procedure! Think of it like this - I have a C-section scar so my bikini area would look different from my daughter's - would I scar her so we match? No way.\n\nIMO, if you look at the rates of HIV transmission, penile cancer, etc and decide that's a reason to circ, go for it. I personally will choose to educate my son on condom use instead but I can see the possible medical benefits. But it's a medical decision and should remain as such, not a cosmetic one.", "controversiality": 0, "created_utc": 1467330135, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uoipv", "link_id": "t3_4qleon", "parent_id": "t1_d4u0wxo", "retrieved_on": 1469410484, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1467330719, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uovql", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1469410654, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bmora_kc", "author_flair_css_class": null, "author_flair_text": null, "body": "My son cried for a few seconds while getting it done and then he was fine. No complications, no pain that I could tell afterwards, and the care for it wasn't difficult. ", "controversiality": 0, "created_utc": 1467334323, "distinguished": null, "edited": false, "gilded": 0, "id": "d4ur2lg", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471070873, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wufoo2", "author_flair_css_class": null, "author_flair_text": null, "body": "U.S. male, not circumcised at the peak of the circ fad, with an intact son.\n\nI recommend [this article](http://www.mothersagainstcirc.org/fleiss.html) and [this one](http://www.nocirc.org/articles/fleiss2.php) for the facts on circumcision.\n\nIf you let your son keep his foreskin, he will want to thank you for it someday. That much is certain.", "controversiality": 0, "created_utc": 1467336097, "distinguished": null, "edited": false, "gilded": 0, "id": "d4us3tu", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471071361, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Doromclosie", "author_flair_css_class": "purple", "author_flair_text": "DS/3 DD/1", "body": "Same. My husband is, my son isnt. We also couldn't find any good reason to. I left the final decision up to my husband as I dont own a penis and dont know the intricate details of the extensive bonsai-esq care it may require.\n", "controversiality": 0, "created_utc": 1467349819, "distinguished": null, "edited": false, "gilded": 0, "id": "d4uzqjr", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471129834, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1467360792, "distinguished": null, "edited": false, "gilded": 0, "id": "d4v3txc", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471131763, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "redshinyboots", "author_flair_css_class": null, "author_flair_text": null, "body": "It's actually only the first week that Vaseline is required.", "controversiality": 0, "created_utc": 1467373527, "distinguished": null, "edited": false, "gilded": 0, "id": "d4v7mzk", "link_id": "t3_4qleon", "parent_id": "t1_d4u8bwe", "retrieved_on": 1471133578, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "papnvleis", "author_flair_css_class": null, "author_flair_text": null, "body": "I decided against it as I believe it isn't my choice,  I am not going to be using it. ", "controversiality": 0, "created_utc": 1467394494, "distinguished": null, "edited": false, "gilded": 0, "id": "d4vlfn5", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471140241, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah I was thinking it healed in even less time, but we just kept using the Vaseline anyway for about 2 weeks.", "controversiality": 0, "created_utc": 1467396148, "distinguished": null, "edited": false, "gilded": 0, "id": "d4vmqy5", "link_id": "t3_4qleon", "parent_id": "t1_d4uk7x8", "retrieved_on": 1471140859, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "linz_in_the_sky", "author_flair_css_class": null, "author_flair_text": null, "body": "I think I did too, just to protect it but I was surprised how quickly it looked better. I was nervous about taking care of it, but it ended up being a breeze!", "controversiality": 0, "created_utc": 1467397687, "distinguished": null, "edited": false, "gilded": 0, "id": "d4vnya6", "link_id": "t3_4qleon", "parent_id": "t1_d4vmqy5", "retrieved_on": 1471141427, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TorontoIntactivist", "author_flair_css_class": null, "author_flair_text": null, "body": "You're a liar. The babies scream, shriek, turn blue and purple and frequently go into shock. They sometimes have seizures, collapsed lungs from screaming, and cardiac arrest. This is not even starting on all the babies that die from bleeding or infection. ", "controversiality": 0, "created_utc": 1467440837, "distinguished": null, "edited": false, "gilded": 0, "id": "d4wct17", "link_id": "t3_4qleon", "parent_id": "t1_d4v3txc", "retrieved_on": 1471153321, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1467450541, "distinguished": null, "edited": false, "gilded": 0, "id": "d4wfm1q", "link_id": "t3_4qleon", "parent_id": "t1_d4wct17", "retrieved_on": 1471154722, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Messicaaa", "author_flair_css_class": null, "author_flair_text": null, "body": "Because of my son's congenital heart disease, he was not able to be circumcised at birth. They didn't want to put him through any unnecessary risk of infection prior to his first heart surgery at 3 weeks. I decided after recovery of his first surgery that I wasn't going to put him through the unnecessary trauma of circumcision. I figured when he was an adult if he wanted to be circumcised he could make that choice for himself.\n\nFast forward about a year after his third heart surgery, he had been having ongoing irritation caused by his foreskin only partially retracting. Poor guy was red, swollen and in pain for months even though we cleaned him and took care of his penis as recommended and we were told it should clear up in a few weeks of this regimen. We opted to have the circumcision done at that point. He was PISSED post-op, but once he fully recovered (which took much longer than it does for infants) he's been pain and irritation free, and happy. If I ever have another boy I will go for the circumcision at birth, it seems to be much less traumatic than for older children. I've also heard it's even worse once you reach adulthood.\n\nThat's just my personal experience, and it's a very personal decision for you and your wife to make. It's tough being responsible for making the right decisions for a little human who needs you, especially when there is no clear right decision. Good luck!", "controversiality": 0, "created_utc": 1467478426, "distinguished": null, "edited": false, "gilded": 0, "id": "d4wqajm", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471159777, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Been_there-Wed_that", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is circumcised and our son isn't. I've been with men who are uncircumcised and I've found it makes no difference on my end. For the men, I've been told it's more pleasurable for them to be uncircumcised. I figure if there are no health benefits, who am I to alter such a private part of his body without his consent. We've been very happy with our decision not to circumcise. ", "controversiality": 0, "created_utc": 1467505935, "distinguished": null, "edited": false, "gilded": 0, "id": "d4x5trx", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471167256, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_blor", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is and my son is not. I was for it because that's what I was used to and then my son would look like his daddy. My husband was against it. He considers it mutilation and there's not really compelling reason to have it done. I deffered to my husband since he was the one with the shared body part. I'm glad we didn't do it - I couldn't imagine doing it now. \n\nEdit: he's only three and not yet potty trained. At this point we haven't touched it or pulled it back - based on the pediatrician's recommendation. She mentioned that it's still pretty tight and should loosen up with time and at that point we'll teach him how to clean it properly. ", "controversiality": 0, "created_utc": 1467566265, "distinguished": null, "edited": false, "gilded": 0, "id": "d4xts1s", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471178793, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "littlealbatross", "author_flair_css_class": "purple", "author_flair_text": "Son born 4/13/12", "body": "In terms of numbers it really depends on the area. In my sons age cohort in our state, 60% of kids are uncircumcised. Even if it is closer to 50/50, its pretty likely that there is going to be another uncircumcised kid in the locker room with them, so i don't think it will be like 10-20 years ago when it was so rare. ", "controversiality": 0, "created_utc": 1467606299, "distinguished": null, "edited": false, "gilded": 0, "id": "d4yg88o", "link_id": "t3_4qleon", "parent_id": "t1_d4uhsuz", "retrieved_on": 1471189614, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pegasus0527", "author_flair_css_class": null, "author_flair_text": null, "body": "We chose not to for our son after consulting several urologists. They independently agreed that it is 100% unnecessary.\n", "controversiality": 0, "created_utc": 1467850102, "distinguished": null, "edited": false, "gilded": 0, "id": "d525bf7", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471253741, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "shonuph", "author_flair_css_class": null, "author_flair_text": null, "body": "[He was in shock](https://www.psychologytoday.com/blog/moral-landscapes/201109/myths-about-circumcision-you-likely-believe)", "controversiality": 0, "created_utc": 1467878762, "distinguished": null, "edited": false, "gilded": 0, "id": "d52kkkc", "link_id": "t3_4qleon", "parent_id": "t1_d4u6px5", "retrieved_on": 1471261088, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "shonuph", "author_flair_css_class": null, "author_flair_text": null, "body": "In order to have adult sexy time, you should spell your sex words right.", "controversiality": 0, "created_utc": 1467878843, "distinguished": null, "edited": false, "gilded": 0, "id": "d52kli1", "link_id": "t3_4qleon", "parent_id": "t1_d4tzyot", "retrieved_on": 1471261100, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "keks-dose", "author_flair_css_class": null, "author_flair_text": null, "body": "Interesting to to see all the comments from a European view. \n\nI've never seen a circumcised penis. I'm German, living in Denmark. The only reason people do it here is because they're Muslims or Jewish - and even a lot of them feel that it's cruel. Half of the parties in the parliament want to make circumcisions illegal, half don't. We're talking about 200,000 Muslims and 7,000 Jews in a country with 5.2 million inhabitants, so about 1% of men are circumcised, if any. \n\nI don't know why there are so many people in the USA still doing it to their boys. To me it's cruel just to do it because it has always been done. Think about how much in child upbringing has changed. Mostly we roll our eyes when 70 year old grandma does something completely strange and tells us: that's how we've done it when I was a first time mother. ", "controversiality": 0, "created_utc": 1468012675, "distinguished": null, "edited": false, "gilded": 0, "id": "d54stlw", "link_id": "t3_4qleon", "parent_id": "t3_4qleon", "retrieved_on": 1471299650, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}