{"submission": {"author": "thefallableuterus", "author_created_utc": 1437166229, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_oveoj", "created_utc": 1468966086, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/4tnsqu/rant_the_circumcision_decision/", "gilded": 0, "id": "4tnsqu", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 62, "over_18": false, "permalink": "/r/Mommit/comments/4tnsqu/rant_the_circumcision_decision/", "retrieved_on": 1472970994, "score": 8, "secure_media_embed": {}, "selftext": "I don't know if this is the right place to put this. If it's not let me know and I can take it down. I tried posting in /r/babybumps but I guess this topic is not allowed. I really just need to vent. I'm so sorry, this is going to be long. \n\nMy mom has been my rock since I was a kid. She has made her fair share of mistakes, like everyone, but has always done a great job at fostering honest and open conversation with me, and we almost always come to a happy understanding at the end of a discussion or disagreement. Because of that I'm really kind of reeling from our latest conversation.\n\nMy mom knows that we're having a boy, and has been possibly even more ecstatic than we are about this (very very wanted and anticipated) child. She's known that we were seriously considering not circumcising for quite some time now (at this point we are actually 100% sure that we are not going to circumcise), but now that we're nearing our due date (August 29th!) I've been fielding questions from family, mainly because they want to know if we're having a bris (my side is Jewish, although I'm in no way religious) and she's been dancing around the subject more and more. It finally came to a head yesterday, when she brought it up again, and essentially told me that she thinks that we're making a really big mistake, like to the point that our son will live a more difficult life because of it. I stayed calm, since I really didn't want to get into a fight about it, and we ended the call on a relatively good note. We spoke again today, and although she says that she will love my son no matter what - which I completely believe - she reiterated that she thinks we're making a huge mistake. Specifically that we'll make his life more difficult because of bullying, later in life in sexual encounters, and even just going to pee at a urinal. She also said that she thinks that we're \"putting an undue burden on him that [we] won't have to deal with, but he will, for the rest of his life\", and that we're \"taking the easy way out by choosing to not make a decision about what to do\". She also stated that she thinks that my husband and I are trying to be rebellious against religion (she is in no way a religious person either), and that we're being immature. The worst part though, was when she said that I was putting a burden on him.\n\nThe way I see it, we're giving our son the chance to have an intact body the way that nature intended. Although there's no medical reason NOT to do it, other than the typical risks of surgery that come with every minor procedure, there is also no good reason TO do it, unless there's an issue later in life such as phimosis, which wouldn't be known about until later in life, and is relatively rare. I feel like we're making an informed decision, and one that really isn't pertinent to anyone other than myself, my husband, and most importantly, my son.\n\nAm I being a terrible mother already? Am I making the wrong decision for the wrong reasons? Am I being selfish?\n\nI haven't had a huge emotional breakdown once during this pregnancy, and yet this sent me over the edge. I BAWLED after I got off the phone. I told her how hurt I was by what she said, and she said that I had told her to be honest. I had told her to be honest, but this just felt cruel. I honestly don't understand why she thinks that this is such a huge mistake, and other than saying that she thinks that he'll be ridiculed for his penis, I can't figure out why she feels this strongly about such a relatively benign subject.\n\nUGH. This got so long. I just am so upset over this, and I don't know what to think. If you've read this far, thank you, and if you've got any insight, I'd be happy to hear it.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "[rANT] The Circumcision Decision", "url": "https://www.reddit.com/r/Mommit/comments/4tnsqu/rant_the_circumcision_decision/"}, "comments": [{"author": "morbuque", "author_flair_css_class": null, "author_flair_text": null, "body": "Of course it doesn't make you a terrible mother!\n\nLook, it seems like you made your decision for good reasons and that's great that you guys are actually trying to find out by yourselves what's best for your baby instead of just doing what people tell you to. I think this is a part of becoming a parent: you'll have to make decisions for your kid, and A LOT of people will, at least, question those (when not telling you what to do). So, be prepared to stand up for yourself! It looks like you're on the right track, tho.\n\nAnd about circumcision: I'm European, I come from a country where it is not the norm at all to have boys circumcised. And I don't think it makes all of us bad parents :) Plus if your son really wants to do it later in life, it sounds like you'd be open to let him have the procedure done, so it will be up to him. Which is awesome: the way I see it, you're just giving your baby the possibility to make this choice over his body once he's older. You're already considering him as a person on his own, which is great!\n\nStory time: when I told my (not circumcised, male obviously, european) friends that I was, maybe, considering circumcision for my son, they all looked at me with a horrified look on their faces and said \"why would you do that to him??\"\n\nSo yeah, I guess I just wanted to put the whole circumcision debate into perspective. \n\nAnd maybe it is time to make it clear to your mom that this is your decision to make and that you made it already, so there's no point in arguing about it anymore. I swear I feel inches taller everytime I say \"I think this is the best for my kid so that's what I'll do, but thanks for your input\"\n\nGood luck to you guys, Internet hugs :)", "controversiality": 0, "created_utc": 1468967521, "distinguished": null, "edited": false, "gilded": 0, "id": "d5is78g", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471541812, "score": 22, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for your kind words. \n\nI just don't understand where she's coming from, or why she's being so...intolerant. Europe is a perfect example of a very very large group of people who are majority uncircumcised and *gasp!* just fine. \n\nI have zero intention of changing my decision, and I think she knows that, but I'd really appreciate it if she would just keep it to herself at this point. She just sent me a link to a Huffington Post article about the American Academy of Pediatrics and how they've changed their standards for the first time since 1999, slightly in favor of the procedure, although it's not to the extent to suggest that it *should* be done. \n\nMay I ask why you were considering circumcision for your son? What did you ultimately decide to do? Thank you for the internet hugs. I needed them. ", "controversiality": 0, "created_utc": 1468970709, "distinguished": null, "edited": false, "gilded": 0, "id": "d5iuh3z", "link_id": "t3_4tnsqu", "parent_id": "t1_d5is78g", "retrieved_on": 1471542882, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bages627", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so sorry you're having this stress put on you. I don't by any means think you're a terrible mother or making a mistake. On the contrary, I think you are making a very well informed decision that relates to the well-being of your child. \n\nAccording to my OB and pediatrician, these days circumcised v. non circumcised boys are at an about 50:50 in the US. So I don't think there will be as much ridicule or stigma as when I was a kid, for example. \n\nFor the record, I chose to circumcise my son. But, I fully support your decision regarding your child. I think you are making the right choice. If your mother disagrees, then that's fine. This is your child and your decision to make. She doesn't really get a say in the matter. \n\nDo you. You are doing the right thing. ", "controversiality": 0, "created_utc": 1468971966, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ivbw5", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471543286, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for the response and the support!\n\nI spoke to my OB about it today at my appointment, and she basically said the same thing about the stats, which was also my understanding. I have no issue with people who do choose to do it, and I just wish that people would stop thinking about my sons penis!! lol. I just wish I knew what to say to her to get her off of my back about it, and also to get her to stop being so judgmental. It seems like it stems from something more, but I can't put my finger on exactly why she is so passionate about the subject.  ", "controversiality": 0, "created_utc": 1468972584, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ivqtn", "link_id": "t3_4tnsqu", "parent_id": "t1_d5ivbw5", "retrieved_on": 1471543481, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wufoo2", "author_flair_css_class": null, "author_flair_text": null, "body": "Male here, left intact at the height of the U.S. circumcision craze.\n\n&gt;bullying, later in life in sexual encounters, and even just going to pee at a urinal\n\nNothing that may or may not happen in school has any impact whatsoever on the sexual enjoyment I have had and continue to have throughout my life, thanks to the presence of my foreskin.\n\nPlease look at [this article](http://www.nocirc.org/articles/fleiss2.php) to help bolster your resolve. Maybe even print a copy for your mom next time she raises the issue, and -- going out on a limb here -- let her know the subject is closed.\n\nOne question: Did she have sons that were circumcised? If so, that would explain her need to validate that decision.", "controversiality": 0, "created_utc": 1468973831, "distinguished": null, "edited": false, "gilded": 0, "id": "d5iwlsg", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471543887, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crunchyfayetteville", "author_flair_css_class": null, "author_flair_text": null, "body": "I really don't understand why people care about this. It's a TINY piece of skin covering an area that is private and should be seen only by parents, medical professionals (as needed...) and their future partner. \n\nI, for the life of me, have never been able to comprehend why grandparents, cousins, or anyone else thinks they have any right whatsoever to comment on YOUR CHILD'S genitalia.\n\nAre you a terrible mother?\n\nHELL no. \n\nWhat about if you circumcise and they accidentally chop the tip off your son's penis, leaving him to never **fully** experience sex? \n\nNot a terrible mother.\n\nWhat if you leave him intact and he has continuous infections that you have to give antibiotics for?\n\nNot a terrible mother.\n\nWhat if you circumcise (or leave intact) and nothing happens?\n\nNot a terrible mother.\nYou're doing the best you can. \n\nMy point: you're not a terrible mom. Not even close. And a tiny piece of skin renders no judgment for or against you.\n\nMom on, mama! &lt;3 &lt;3 &lt;3", "controversiality": 0, "created_utc": 1468974408, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ix0a3", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471544076, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dirtyMAF", "author_flair_css_class": null, "author_flair_text": null, "body": "You are making the right choice. I'm intact and consider myself very lucky to be. I know I would be missing a lot of sexual sensation if I was circumcised. There are no hygiene issues from being intact, that argument is laughable provided you are willing to teach your son how to use soap and water when hes older and his foreskin retracts. Above all it is an unethical practice and in spite of what some try to say is a mutilation.\n\nThe US is a bubble, its the only country in the western world that still endorses circumcision in spite of the fact that virtually every major medical association has condemned it. Its motivated by money and religious influence. As of 2010 only about half of all newborns were circumcised and since then public opinion of it has signifcantly changed. Only 1/3 of millenials still think its acceptable, meaning the practice will soon disappear. This doctor wrote an excellent article on circumcision if you want more information: http://m.huffpost.com/us/entry/7031972.html\n\n", "controversiality": 0, "created_utc": 1468975264, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ixkok", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471544343, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dirtyMAF", "author_flair_css_class": null, "author_flair_text": null, "body": "I just want to point out that the tiny piece of skin on a baby grows to 15 square inches and is a full third of the skin on the penis. Not insignificant by any measure. People care about it because its an issue of basic human rights. If that sounds ridiculous to you, imagine if this same discussion were about a girl instead.", "controversiality": 0, "created_utc": 1468975949, "distinguished": null, "edited": false, "gilded": 0, "id": "d5iy10j", "link_id": "t3_4tnsqu", "parent_id": "t1_d5ix0a3", "retrieved_on": 1471544557, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crunchyfayetteville", "author_flair_css_class": null, "author_flair_text": null, "body": "Look lady (or dude, not into discrimination here!!), I'm not interested in making this a deal and if you think it is, good for you. Not going to be getting into drama. I felt compelled to share my opinion, yours is welcome too...there's room for all of ours (opinions).", "controversiality": 1, "created_utc": 1468976497, "distinguished": null, "edited": false, "gilded": 0, "id": "d5iye7e", "link_id": "t3_4tnsqu", "parent_id": "t1_d5iy10j", "retrieved_on": 1471544730, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bages627", "author_flair_css_class": null, "author_flair_text": null, "body": "I wonder if making a comment like, \"nobody is going to be bullying him about it, except YOU\" is enough to make her stop. It's a little harsh but she's really harping on it. ", "controversiality": 0, "created_utc": 1468976599, "distinguished": null, "edited": false, "gilded": 0, "id": "d5iygov", "link_id": "t3_4tnsqu", "parent_id": "t1_d5ivqtn", "retrieved_on": 1471544762, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "girlwithcurls", "author_flair_css_class": null, "author_flair_text": null, "body": "Out of curiosity, what made you consider it? It was my understanding that over there it's basically never done at birth unless for religious reasons.", "controversiality": 0, "created_utc": 1468977452, "distinguished": null, "edited": false, "gilded": 0, "id": "d5iz132", "link_id": "t3_4tnsqu", "parent_id": "t1_d5is78g", "retrieved_on": 1471545109, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "numericrhino", "author_flair_css_class": null, "author_flair_text": null, "body": "What helped our situation is my mom came with us to the baby prep class offered at the hospital. In their slideshow they explained that the AAP doesn't recommend routine neonatal circumcision, that the US (specifically the Midwest) was the only developed country/area with such a high incidence of circumcision and other developed countries do not have \"cleanliness\" issues. I think all of that was new information both for my husband and my mom, and it helped her understand where I was coming from. ", "controversiality": 0, "created_utc": 1468979005, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j031f", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471545607, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CharistineE", "author_flair_css_class": "blue", "author_flair_text": "Soon to be mom", "body": "I didn't circumcise my son and I'm against it, just to let you know my bias but my thoughts have nothing to do with this.\n\nOnce that baby is out, your mom wont care if he has green hair and a snaggletooth. He will be her perfect little grandbaby. My mom had some reservations about some of our choices before our little guy was born but now that he has been here a year on Monday (eek!), there has been nothing but love, cuddles and pictures of him covering every surface of her house. \n\nI'd guess that after the time to do a newborn circumcision has come and gone, it won't be an issue anymore, or at least as big of one.", "controversiality": 0, "created_utc": 1468981525, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j1s5q", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471546407, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm happy to hear from a guy on the subject. I was thinking of cross posting to /r/daddit too and seeing what the guys on there think. I'm very glad to hear that you had no seriously horrible encounters regarding the presence of foreskin. Did you at any point in a public place, such as a gym locker room or bathroom have anyone comment on it? She seems obsessed with this idea that someone will see it and ruthlessly tease. But I can't imagine that unless someone is actively looking at the penis that they'd even really notice at all. And if they're staring at my underage son's penis, then there are other issues more pressing going on than if he's cut or not, I'd imagine. If he's of age, then presumably either they're looking at it consensually, or they're being a creeper and he'll be able to deal with it. \n\nTo answer your question, nope. She has no sons. I'm her only child, which also could maybe explain some of it maybe? I'm thinking maybe she's projecting her own preference in a man, and what she feels like she would do if she had had a son. ", "controversiality": 0, "created_utc": 1468981928, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j21wj", "link_id": "t3_4tnsqu", "parent_id": "t1_d5iwlsg", "retrieved_on": 1471546533, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "I love this idea, and I wish I could do that. Sadly she lives 1,500 miles away, and won't be here until after the baby is born next month. I think I'm just going to try and avoid the topic, although if she continues to push it I'm going to make sure that I have more information in my arsenal. ", "controversiality": 0, "created_utc": 1468982545, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j2h76", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j031f", "retrieved_on": 1471546734, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "I know for sure that at least some of this is true. She's going to plaster her walls with photos. But I do still fear that she'll treat him differently than her other 3 (step)grandsons because of the sate of his penis. Which is so insanely stupid! We've been considering moving back to her state, but it makes it much less appealing when I feel like my parenting decisions are being questioned and undermined before the baby is even born. :-/ ", "controversiality": 0, "created_utc": 1468983122, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j2vf8", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j1s5q", "retrieved_on": 1471546921, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CharistineE", "author_flair_css_class": "blue", "author_flair_text": "Soon to be mom", "body": "First biological grandchild? You're golden! ", "controversiality": 0, "created_utc": 1468983793, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j3bp8", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j2vf8", "retrieved_on": 1471547133, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WrenDraco", "author_flair_css_class": "orange", "author_flair_text": "one boy", "body": "It's super out of fashion in Canada too, at this point it is not recommended by any medical professionals, and it's not covered under general healthcare. You have to take a baby to a private clinic and pay extra if you want it done. I know a dozen families that had boys within the last couple years and I think only one or two of them are circumcised. My MIL is a nurse and I'm pretty sure she'd have tried to kidnap the baby if I'd sounded like I was even thinking of having my son circumcised (fortunately we weren't planning on it anyway!).", "controversiality": 0, "created_utc": 1468988991, "distinguished": null, "edited": false, "gilded": 0, "id": "d5j69lk", "link_id": "t3_4tnsqu", "parent_id": "t1_d5iuh3z", "retrieved_on": 1471548519, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Decadencedancer", "author_flair_css_class": null, "author_flair_text": null, "body": "Mama, you are 100% right in your decision simply because it is your decision to make. Not least because of all the facts.\nI am glad to live in a country where circumcision is recognised as unnecessary genital mutilation. It is only ever performed when the child presents with a serious issue, never before 2 years old and only as a last resort. Religious groups,obviously, still perform it but overall it is very uncommon where I am.\nI can assure you that no one is suffering sexually from having a foreskin, the men in this country aren't walking around lamenting it's presence and neither are the women.\nI understand that this is part of your religion and for your mum it may be that it is all that she knows, she may very firmly believe her reasons to be truth even when they can be proven not to be. \nDisagreeing with parents seems to be the norm when you have a baby, everything you do is seen as a criticism of how they did things, it's not intentional but it's what happens. \nIt's a hard line to take but if she keeps on about it and won't listen to facts maybe ask her if she'd be pushing genital mutilation if you were having a girl. That one tends to bring people to a halt.", "controversiality": 0, "created_utc": 1469003901, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jc1yd", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471551329, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "numericrhino", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly it might be one of those things where engaging in a debate is only going to convince her she's right. I would probably go along the lines of \"I recognize the opinion you've voiced. The decision I make is up to me. Let's move past this topic.\"", "controversiality": 0, "created_utc": 1469008103, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jd7u4", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j2h76", "retrieved_on": 1471551875, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wufoo2", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Did you at any point in a public place, such as a gym locker room or bathroom have anyone comment on it?\n\nI did not. I think the other guys were too \"glass houses\" about themselves to take notice.\n\nI believe it's condescending to tell a boy he can't possibly have enough confidence to ignore or defend himself against the envy of others, so we have to permanently alter his (healthy) body for his own protection. I'm grateful my parents essentially taught me the opposite.\n\nWhether he is in the minority or not (depends on region, ethnic makeup, and date of birth), I do think it's important to inform a boy about the differences and why he's fortunate. Only you will know how to do that, according to his maturity level.\n\nEDIT: I'm puzzled about her overweening interest in this. Maybe she wants to feel helpful, or valued. If that's the case, maybe you should ask her to research the pros and cons of circumcision for you.", "controversiality": 0, "created_utc": 1469014320, "distinguished": null, "edited": 1469024190, "gilded": 0, "id": "d5jf3af", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j21wj", "retrieved_on": 1471552840, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "morbuque", "author_flair_css_class": null, "author_flair_text": null, "body": "(Sorry for the late reply, different time zone!)\n\nI considered it only because I knew it's such a common, almost default procedure in the US, so I thought if so many people do it, I should give it a thought. I finally didn't because the benefits of it seem to be quite few and almost virtual whereas the pain the baby feels is very real. Not something I would want my baby to experience during his very first days on earth, you know?\n\nThat and the fact that he can still do it later if he wants to. Also since it's not very common in Europe, I'm not even sure how the baby's pain is handled there (according to what I heard on that subject, it seems like there are quite a lot of ways to reduce the pain during and after the procedure in the US).\n\nOh yeah and it seems to be real in the US, but why on earth would kids look at each other's penis?? I get the lockerroom situation but don't you wrap a towel around your waist and try to not show your naked body to your peers? Let alone say something about it?! It always sounds so... straight from movies when I hear about that.\n\nYou know, I really feel you. When you become a parent, your relationship with your own parents can change a lot (not always in a bad way!!) but it hurts so much, specially when pregnant and imagining the life ahead, when someone you love and trust (here your mother) isn't on the same page as you. Plus it is hard for new grandparents sometimes to transition and be aware that they are not the ones who make decisions anymore, that their child is an adult with their own child. Do you think your husband, who may be less emotional right now, could explain to your mom that it's not even about circumcision, it's about the fact that when becoming a mother yourself, you'd feel much better if you could have you own mom's support? Or do you think she feels too strongly about circumcision to even hear that and drop it? I'm having a hard time imagining that this is something so important to her that she'd rather hurt you over this.\n\nOr you could go scorched earth and show her videos of circumcision but I do think it's a bit brutal and maybe not going to the root of the problem.\n\nHang in there mama, you're gonna be a dope parent :)", "controversiality": 0, "created_utc": 1469017363, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jg9vx", "link_id": "t3_4tnsqu", "parent_id": "t1_d5iuh3z", "retrieved_on": 1471553398, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "morbuque", "author_flair_css_class": null, "author_flair_text": null, "body": "You're perfectly right, no penis cutting over here unless god asked for it :) That's why my friends were so startled when I asked their opinions about it!\n\nI considered it because it's a very common procedure in the US, so I thought it may be beneficial in some ways? I was just trying to keep an open mind and see what would be best for my son, just like with any of the many decisions you have to make when you have a child. But after some research, it appeared to me that it was more of a quite recent (since the 60s maybe?) cultural thing than a necessity.", "controversiality": 0, "created_utc": 1469017918, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jgiqi", "link_id": "t3_4tnsqu", "parent_id": "t1_d5iz132", "retrieved_on": 1471553513, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ElderflowerGin", "author_flair_css_class": null, "author_flair_text": null, "body": "So what I'm hearing reading this is you and your husband are having a baby. You have made a choice regarding your baby and someone is criticising that choice. THIS IS GOING TO HAPPEN A LOT. \n\nFor me, I think you're making the right decision on his behalf but that's by-the-by, it's YOUR choice to make and it's done so just shut your mother down and tell her you weren't opening up a discussion you were answering her question and it doesn't need to be spoken about again. \n\nShe's from a generation where lots of American (I'm assuming you're US, seems like most people are) men, Jewish or not, were circumcised but your sons generation are a different group and more and more people are making the same choice as you so her argument that he will be different is actually Rubbish and so what if he is?! The penis is designed that way. It's not supposed to be surgically altered. \n\nI'm in the UK and very few non Jewish (or Jewish) men are circumcised here. It's just not a thing. \n\nAnyways, I'm due with #2 exactly a week before you so I know the stress of people interfering with your choices. Feel good about it. You're doing what you think is best and that's entirely your job. Xx ", "controversiality": 0, "created_utc": 1469022818, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jj60w", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471554760, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469040638, "distinguished": null, "edited": 1469041152, "gilded": 0, "id": "d5jwj3t", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471561159, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "You obviously thought a lot about this and made a decision that you and your husband are comfortable with for good reasons. Your mother is quite frankly, way too involved with her grandchild's genitals, and you need to tell her that clearly. \n\n\nHer reaction is her decision. If she chooses to be disrespectful and rude, that's sad but it's on her. \n\n", "controversiality": 0, "created_utc": 1469040840, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jwoz2", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471561236, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup, nobody I know is getting their sons circumcised. The thought is that any body modifications should be the decision of the child, not the parent. ", "controversiality": 0, "created_utc": 1469040956, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jwsc5", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j69lk", "retrieved_on": 1471561280, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "It's a cultural thing in the States because last century it was touted as a deterrent to masturbation. (Obviously unsuccessfully).", "controversiality": 0, "created_utc": 1469041040, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jwush", "link_id": "t3_4tnsqu", "parent_id": "t1_d5jgiqi", "retrieved_on": 1471561312, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "morbuque", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my goodness, that'd be a good one if it weren't for all those babies hurt :/\n\nDo you happen to know how it was supposed to prevent masturbation? I'm really curious now!\n\nWasn't it also supposed to be cleaner? Or at least easier to clean?", "controversiality": 0, "created_utc": 1469042227, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jxspw", "link_id": "t3_4tnsqu", "parent_id": "t1_d5jwush", "retrieved_on": 1471561756, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I have no idea how they thought it was cleaner at all. A foreskin is like our clitoral hood; it's more or less self cleaning or you wash it gently with water.  A normal penis is as easy to clean as a finger. You just wash it without retracting the foreskin and once they are old enough that it retracts naturally, the child will pull it back gently and wash like normal. \n\n\nHere's a source that describes how circumcisions in America became popular as part of the anti-masturbation movement in the late 1800s: http://www.circinfo.org/Circumcision_and_masturbation.html", "controversiality": 0, "created_utc": 1469044271, "distinguished": null, "edited": false, "gilded": 0, "id": "d5jzhhm", "link_id": "t3_4tnsqu", "parent_id": "t1_d5jxspw", "retrieved_on": 1471562552, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "morbuque", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, thanks a lot for that link!!", "controversiality": 0, "created_utc": 1469047043, "distinguished": null, "edited": false, "gilded": 0, "id": "d5k1r44", "link_id": "t3_4tnsqu", "parent_id": "t1_d5jzhhm", "retrieved_on": 1471563701, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "Tell her these things. Ask her if it's worth jeopardizing her relationship with you and her grandchild over a cosmetic procedure. ", "controversiality": 0, "created_utc": 1469057349, "distinguished": null, "edited": false, "gilded": 0, "id": "d5k98ym", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j2vf8", "retrieved_on": 1471567313, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "There is now a large and growing movement within the Jewish community both in Israel and worldwide to stop circumcising infant Jewish boys.\n\nThere are some wonderful alternatives to circumcision — including the Brit Shalom ceremony.\n\nhttp://www.beyondthebris.com\n\nhttp://www.tabletmag.com/jewish-life-and-religion/178356/alternatives-to-circumcision\n\nhttp://www.britshalom.info\n\nhttp://www.jewsagainstcircumcision.org/brisshalom.htm", "controversiality": 0, "created_utc": 1469057767, "distinguished": null, "edited": false, "gilded": 0, "id": "d5k9j01", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471567444, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "The real and deep issue is that it is part of your mother's identity. She comes from a circumcising culture and religion, and thus she sees your decision not to circumcise as a threat to that identity. Hence she will oppose your decision even to the point of irrationality.\n\nBut once you give birth, it will all be fine, and she will just forget about it.\n", "controversiality": 0, "created_utc": 1469058002, "distinguished": null, "edited": false, "gilded": 0, "id": "d5k9oqh", "link_id": "t3_4tnsqu", "parent_id": "t1_d5j21wj", "retrieved_on": 1471567519, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; This is your child and your decision to make.\n\nActually, it's the decision of the owner of the penis to make. A parent has no more rights to amputate a boy's foreskin as they do to amputate a girl's clitoral hood — or any other parts of her anatomy.", "controversiality": 0, "created_utc": 1469058101, "distinguished": null, "edited": false, "gilded": 0, "id": "d5k9r7x", "link_id": "t3_4tnsqu", "parent_id": "t1_d5ivbw5", "retrieved_on": 1471567552, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I really don't understand why people care about this.\n\nWell, here are some good reasons.\n\nNote: *The vast majority of these links from reputable scientific journals, with peer-reviewed research.*\n\n1: Women prefer intact penises. And elsewhere you can find men do as well!\n\nSource: http://www.healthcentral.com/drdean/408/60750.html \n\nhttp://www.cirp.org/library/anatomy/ohara/\n\n2: Masturbation feels better.\n\nSource: http://www.cirp.org/pages/anat/\n\n\n3: Circumcision significantly reduces sensitivity. \n\nSource: http://onlinelibrary.wiley.com/doi/10.1111/j.1464-410X.2006.06685.x/epdf\n\nhttp://www.livescience.com/1624-study-circumcision-removes-sensitive-parts.html\n\n\n4: Despite the reduced sensitivity, there is no change to lasting longer during sex. \n\nSource: http://onlinelibrary.wiley.com/doi/10.1111/j.1743-6109.2005.00070.x/abstract;jsessionid=E233A9E106A9 A6D724B4E3606446784E.d03t01\n\n\n5: Cut men have a more difficult time fapping.\n\nSource: http://onlinelibrary.wiley.com/doi/10.1111/j.1743-6109.2005.00070.x/abstract;jsessionid=E233A9E106A9\n\nWhich was the reason it was promoted in the USA in the first place. \n\nhttp://english.pravda.ru/science/health/27-03-2006/77873-circumcision-0/\n\n\n6: Circumcision increases risk of erectile dysfunctions.\n\nhttp://www.ncbi.nlm.nih.gov/sites/entrez?cmd=Retrieve&amp;db=PubMed&amp;list_uids=14979200&amp;dopt= Abstract|\n\n\n7: If too much skin is removed in circumcision, it can make the penis smaller since the dong needs some skin to expand during an erection: \n\nhttp://www.altermd.com/Penis%20and%20Scrotal%20Surgery/buried_penis.htm \n\nhttp://www.drgreene.com/azguide/inconspicuous-penis\n\n\n8: Circumcision does not lower the risk of AIDS.\n\nhttp://www.msnbc.msn.com/id/22096758/\n\n\n9: Circumcision is more hygienic. Who the heck doesn't clean their penis? It's a three second job you do when you shower so this is not a valid argument. Women produce 10 times as much smegma as men - so it's OK to amputate an infant girls' labia lips so she doesn't have to wash them??\n\n\n10: Circumcised foreskin sold to cosmetic manufacturers for profit:\n\nhttp://voices.yahoo.com/human-foreskins-big-business-cosmetics-201840.html\n\n11: Erectile dysfunction 4.5 times more likely to occur if you're circumcised \n\nhttp://www.thewholenetwork.org/14/post/2011/08/does-circumcision-cause-erectile-dysfunction.html etc\n\n12: Stanford's school of medicine list of circumcision complications (including infection, haemorraging, skin-bridging, phimosis, amputation and death):\n\nhttp://newborns.stanford.edu/CircComplications.html\n\n13: Cut infants get long-term changes in pain response from the trauma of being circumcised\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/9057731\n\n14: Circumcision decreases penile sensitivity\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/23374102?dopt=Abstract\n\n15: Circumcision associated with sexual difficulties\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/21672947\n\n16: Circumcision linked to alexithymia\n\nhttp://www.mensstudies.com/content/2772r13175400432/?p=a7068101fbdd48819f10dd04dc1e19fb&amp;pi=4\n\n17: The exaggeration of the benefits of circumcision in regards to HIV/AIDS transmission\n\nhttp://jme.bmj.com/content/36/12/798.abstract\n\n18: Circumcision/HIV claims are based on insufficient evidence\n\nhttp://www.4eric.org/wp-content/uploads/2011/06/MC.pdf\n\n19: There is no case for the widespread implementation of circumcision as a preventative measure to stop transmission of AIDS/HIV\n\nhttp://onlinelibrary.wiley.com/doi/10.1111/j.1753-6405.2011.00761.x/full\n\n20: Circumcision decreases sexual pleasure\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/17155977\n\n21: Circumcision decreases efficiency of nerve response in the glans of the penis\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/17378847\n\n22: Circumcision policy is influenced by psychosocial factors rather than alleged health benefits \n\nhttp://www.circumcision.org/policy.htm\n\n23: Circumcision linked to pain, trauma, and psychosexual sequelae \n\nhttp://www.cirp.org/library/psych/boyle6/\n\n24: Circumcision results in significant loss of erogenous tissue\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/8800902\n\n25: Circumcision has negligible benefit\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/9091693\n\n26: Neonatal circumcision linked to pain and trauma\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/9057731\n\n27: Circumcision may lead to need for increased care and medical attention in the first 3 years of life\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/9393302\n\n28: Circumcision linked to psychological trauma\n\nhttp://www.cirp.org/library/psych/goldman1/\n\n29: Circumcision may lead to abnormal brain development and subsequent deviations in behaviour\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/10657682\n\n30: CONCLUSIONS: This study confirms the importance of the foreskin for penile sensitivity, overall sexual satisfaction, and penile functioning: Furthermore, this study shows that a higher percentage of circumcised men experience discomfort or pain and unusual sensations as compared with the uncircumcised population.\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/23374102?dopt=Abstract\n\n31: CONCLUSIONS: Circumcision was associated with frequent orgasm difficulties in Danish men and with a range of frequent sexual difficulties in women, notably orgasm difficulties, dyspareunia and a sense of incomplete sexual needs fulfilment.\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/21672947\n\n32: CONCLUSION: There was a decrease in masturbatory pleasure and sexual enjoyment after circumcision, indicating that adult circumcision adversely affects sexual function in many men, possibly because of complications of the surgery and a loss of nerve endings.\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/17155977\n\n33: CONCLUSIONS: The glans of the circumcised penis is less sensitive to fine touch than the glans of the uncircumcised penis. The transitional region from the external to the internal prepuce is the most sensitive region of the uncircumcised penis and more sensitive than the most sensitive region of the circumcised penis. Circumcision ablates the most sensitive parts of the penis.\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/17378847", "controversiality": 0, "created_utc": 1469058188, "distinguished": null, "edited": false, "gilded": 0, "id": "d5k9tcm", "link_id": "t3_4tnsqu", "parent_id": "t1_d5ix0a3", "retrieved_on": 1471567579, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469065359, "distinguished": null, "edited": false, "gilded": 0, "id": "d5keisa", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471569797, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469066226, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kf4d5", "link_id": "t3_4tnsqu", "parent_id": "t1_d5keisa", "retrieved_on": 1471570080, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469066543, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kfc8k", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kf4d5", "retrieved_on": 1471570183, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "I completely agree that once the baby is here she won't care what his penis looks like. It could be a penguin or anything else out of the \"norm\" that she has decided on and she'd probably not even notice. Haha. Ironically she claims that this has nothing to do with Judaism, seeing as she's only slightly more religious than me, and I'm a full blown atheist. The more I think about it, the more I think that she's uncomfortable with the idea because she's only ever known circumcised people. She told me she's never seen an uncircumcised penis, and I'm guessing the idea is scary to her. And of course she won't just go and google it, because then she'd have to see a penis! EEK! At least, that's what I assume. ", "controversiality": 0, "created_utc": 1469066580, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kfd6m", "link_id": "t3_4tnsqu", "parent_id": "t1_d5k9oqh", "retrieved_on": 1471570195, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crunchyfayetteville", "author_flair_css_class": null, "author_flair_text": null, "body": "You must have missed my point. It is no one besides OP, her partner and their son's business. No one's. ", "controversiality": 0, "created_utc": 1469066600, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kfdmf", "link_id": "t3_4tnsqu", "parent_id": "t1_d5k9tcm", "retrieved_on": 1471570201, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for the links! I'm going to look at these and see if maybe some of these would be good to send to her. She claims that it's not a religion thing, as she's really barely religious, but I think it's the same thing as when she found out that I was getting a tattoo. She reverted to her old school ways of thinking and told me I wouldn't be able to be buried in an Orthodox cemetery because of a tattoo. Which is hilarious since I've always wanted to be cremated anyway and she knows it!  ", "controversiality": 0, "created_utc": 1469066777, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kfht7", "link_id": "t3_4tnsqu", "parent_id": "t1_d5k9j01", "retrieved_on": 1471570256, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I really hope that she chooses to let this go. She's great at pulling my heart strings, and knows it. But the more I learn about circumcision, the more solid I feel in our decision. I just hope that she can accept it sooner than later. Cause otherwise I'm just going to force her to watch a video of it, and see how that goes down. Pretty sure she doesn't want to make her first biological grandson bleed from his genitals within the first 48 hours of life.", "controversiality": 0, "created_utc": 1469067121, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kfpuc", "link_id": "t3_4tnsqu", "parent_id": "t1_d5jwoz2", "retrieved_on": 1471570361, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "Sure. So you think if parents are going to cut-off a bit of their infant daughter's genitals for cultural, religious or ritualistic reasons, then it's not your business or anyone else's.\n\nIt's just between the parents and their daughter.\n\nNice.", "controversiality": 0, "created_utc": 1469067276, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kftdr", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kfdmf", "retrieved_on": 1471570408, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crunchyfayetteville", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, I have a lot of things to crusade about and a circumcision certainly isn't one of them. Again, my opinion is that this decision is between the family--the immediate family. You are welcome to your own opinions. No need to be condescending, as they say: you'll likely catch more flies with honey than vinegar. ", "controversiality": 1, "created_utc": 1469067426, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kfwy8", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kftdr", "retrieved_on": 1471570454, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469067736, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kg4ag", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kfc8k", "retrieved_on": 1471570550, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "I really sense a lot of deep love between you and your mother. Your new child is just going to make that bond even deeper; and your hearts will just keep expanding to hold all that love!\n\nIt's certainly a lot easier to keep an intact penis clean. Just a wipe with water! *Never* pull his foreskin back, for at birth, and for quite a few years after, the foreskin is naturally adhered to the glans. It will naturally separate as the boy gets older.\n\nAnd try if you can to educate anyone around your boy about how to care for an intact penis. Many doctors don't have a clue, and given the chance, they will yank the foreskin back, causing damage and pain to your little boy.\n\nYour boy is going to thank you so much when he is older. There are many videos of \"regret moms\" on YouTube. These are mothers who have circumcised their boys and then only learnt the truth afterwards.\n\nMother Apologizes to Son for Circumcision:\nhttps://www.youtube.com/watch?v=gUFwPD8yfNU\n\nCircumcision - A Mother's Regret:\nhttps://www.youtube.com/watch?v=DqIGGq175ps\n\nJewish Mother on Circumcision:\nhttps://www.youtube.com/watch?v=HfnqN3YgTd8", "controversiality": 0, "created_utc": 1469067961, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kg9r5", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kfd6m", "retrieved_on": 1471570702, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; No need to be condescending\n\nYou've just agreed that Female Genital Mutilation is OK. How should a reasonable person react to that?", "controversiality": 0, "created_utc": 1469068116, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kgdau", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kfwy8", "retrieved_on": 1471570749, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469068704, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kgr4n", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kg4ag", "retrieved_on": 1471570930, "score": -1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crunchyfayetteville", "author_flair_css_class": null, "author_flair_text": null, "body": "You're conclusions are waaaaay to broad and honestly, I won't provide a rebuttal for something that you're inferring. It seems to me like you're way too fired up about this topic and I'd hope you're as involved in a real-life community as you are on a parenting forum. I also hope you will be able to not only see differing opinions one day, but actually respect them. Have a good night, I won't engage with you any longer as I feel there is nothing positive to add.", "controversiality": 0, "created_utc": 1469068782, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kgsyc", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kgdau", "retrieved_on": 1471570954, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; It is no one besides OP, her partner and their son's business. No one's.\n\n&gt; I also hope you will be able to not only see differing opinions one day, but actually respect them.\n\nOne minute you are all *\"...no one is allowed to discuss male circumcision, it's just the parents and their son's business\"*\n\nAnd next you have gone hippy and telling us it's OK to have different opinions and to \"respect\" them.\n\nIt's the OP who is loving and open-minded. And it's you, u/crunchyfayetteville who is cold, narrow-minded, and cruel.\n", "controversiality": 0, "created_utc": 1469069157, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kh1ku", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kgsyc", "retrieved_on": 1471571067, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it might help you too, to come to peace with the fact that she may very well never agree with you, and that whether or not she does is actually not important. You are about to experience a non stop barrage of opinions and criticisms on your parenting decisions. No matter what you do, someone will disagree with you; that's just how it is. \n\nYou've been really respectful and tried very hard, but sometimes you just need to say \"you have no say in this matter. We will not discuss it further\" and then really do never ever let her draw you in to another discussion. She's trying to push your boundaries and disrespect your parenting before she's even a grandmother. You need to draw very firm boundaries with her and work together eighth your husband to enforce them. ", "controversiality": 0, "created_utc": 1469070047, "distinguished": null, "edited": false, "gilded": 0, "id": "d5khm7x", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kfpuc", "retrieved_on": 1471571337, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469072947, "distinguished": null, "edited": false, "gilded": 0, "id": "d5kjcz0", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kgr4n", "retrieved_on": 1471572161, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1469074061, "distinguished": null, "edited": 1469119464, "gilded": 0, "id": "d5kjz3w", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kjcz0", "retrieved_on": 1471572450, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "c_survivor", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi. Wanting to offer my own two cents. Maybe the best way to sum up this whole discussion is focusing on the word \"decision\"... why circumcising a newly-born baby boy should have to be a \"decision\" in the first place? there is already a lot of stress put upon any soon-to-be parent and is just so horribly unethical from hospital staff in the US to even ask if parents \"want\" to have their child surgically altered, when is not even their own body to begin with (is the child's penis). I can't blame your mother for her views when there has been a whole pervasive cultural thing going on trying to make genital mutilation of babies okay (either on religious or supposedly \"medical\" grounds). In the end she will have to come to terms with your decision, you just have to stay strong; I honestly feel she has good intentions and the love for you and her grandson will prevail... and if she ever brings the subject again, well, you will always have the last word, as after all YOU are the mother and anyone can say what they want, but you are the one in charge of caring for your son, not them, and you already keep his best interest in mind.\n\nI really have to praise you and all those young mothers in the USA, certainly a new generation, who are changing the tides and stopping what has been a horrible tradition pushed mostly for greed (because US hospitals make a lot of money from amputating babies, without a care for the supposed oath to \"not harm\"). So, just to cheer you up a bit in this grim subject, you are in good company: http://bellyitchblog.com/2012/11/jemima-kirke-says-she-wont-circumcise.html (and btw her husband comes from a jewish upbringing, so it makes it more relevant). Best wishes.", "controversiality": 0, "created_utc": 1469081901, "distinguished": null, "edited": false, "gilded": 0, "id": "d5knmu3", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471574175, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Consilio_et_Animis", "author_flair_css_class": null, "author_flair_text": null, "body": "You might really consider a \"Brit Shalom\" ceremony for your little boy — and be sure to invite *all* your friends and family, especially your Jewish ones! That way you can spread the word.", "controversiality": 0, "created_utc": 1469154140, "distinguished": null, "edited": false, "gilded": 0, "id": "d5lts27", "link_id": "t3_4tnsqu", "parent_id": "t1_d5kfht7", "retrieved_on": 1471594398, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "It's not a bad idea at all, but my whole family lives 1,500 miles away, and it's highly unlikely that many if any people would be able to come. The good news (hopefully...) is that after some extensive emailing back and forth, that included me telling her exactly how hurt and upset I was by what she said, she now wants to learn more about why I feel the way I do. So maybe she's realizing that she's been a bit too stuck in her ways and is driving a wedge, and she is wanting to fix that. I hope. ", "controversiality": 0, "created_utc": 1469157382, "distinguished": null, "edited": false, "gilded": 0, "id": "d5lvwgi", "link_id": "t3_4tnsqu", "parent_id": "t1_d5lts27", "retrieved_on": 1471595398, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't thank you enough for taking the time to post all of these. My mom is actually willing to listen to my side (and asked for resources of her own volition!) and I went back to the thread to start pulling up links, and then saw this! You rock, and I really appreciate your support and kind words. ", "controversiality": 0, "created_utc": 1469232605, "distinguished": null, "edited": false, "gilded": 0, "id": "d5n2kc0", "link_id": "t3_4tnsqu", "parent_id": "t1_d5k9tcm", "retrieved_on": 1471615867, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rarrimali0n", "author_flair_css_class": null, "author_flair_text": null, "body": "Please don't cut off a functional part of your children's genitalia due to bizarre cultural tradition. Check out Saving Our Sons, it's a fb group and also a website. Maybe you can find info there to show her. His penis is not her business. It's his and should be left to him. And also tell her the practice has also declined, last I checked it was 50/50 and dropping ", "controversiality": 0, "created_utc": 1469337992, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ogggk", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471640022, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sharktayto", "author_flair_css_class": null, "author_flair_text": null, "body": "You are not a terrible mother, you are making the right decision for your son and I applaud you for that! Women get more utis and infections than men, but we don't chop off their labia to combat that! My husband and son, both intact, have never had infections. You just wipe it like a finger and it takes care of itself. And sexually, my husband's penis is just great. If someone is turned off by your son's penis when he is an adult, well then they are shallow and don't deserve him anyway. Stick to your guns mama, you're doing GREAT!!", "controversiality": 0, "created_utc": 1469368498, "distinguished": null, "edited": 1469369218, "gilded": 0, "id": "d5oq00q", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471644549, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "snootybird", "author_flair_css_class": null, "author_flair_text": null, "body": "Your being the opposite of a terrible mother. Your giving your child choice. He won't be bullied in school because more and more parents are coming to their senses and keeping their child intact so he most definitely won't be singled out. My husband is intact and we started dating when we were 18- his being intact was in no way off-putting. In fact I find that notion pretty insulting on behalf of my husband. How would this be spun if people said baby girls labia needs to be cut for their future partners preference- oh wait....", "controversiality": 0, "created_utc": 1469513578, "distinguished": null, "edited": false, "gilded": 0, "id": "d5r5kzm", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471686457, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pegasus0527", "author_flair_css_class": null, "author_flair_text": null, "body": "You are a GREAT mom!  You and your spouse considered the issue and made the decision that was right for you and your child!  If it helps we chose not to circumcise our now 5 year old.  The idea of cutting off part of my kids penis because everyone else is doing it was INSANE to me.  When the hospital urologist said it was pointless to do it (he happened to be the husband of the lady doing birth classes and got roped in to the class when he tried to sneak a sandwich) we were convinced.  We've had no issues thus far, and if somehow someone starts to bully him over it, well, we'll deal with it.  Keep up the great work!\n\nEDIT: just realized this was a bit of a late reply, lol, and want to add too: I'm American just for reference.", "controversiality": 0, "created_utc": 1469712615, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ue2rf", "link_id": "t3_4tnsqu", "parent_id": "t3_4tnsqu", "retrieved_on": 1471749838, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thefallableuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "Nothing wrong with late replies! :) I really appreciate how much support we've gotten on here regarding our choice. I feel so much more secure in the decision, and thankfully my mom and I have come to an understanding. :) As far as I'm concerned, he's going to have adversity in his life, and having or not having a foreskin is really probably pretty low on the list of things he's going to have to deal with when it comes to other peoples opinions. I'm so glad that you got a doctor to tell you how NOT necessary it is. My OB said the same thing. ", "controversiality": 0, "created_utc": 1469720112, "distinguished": null, "edited": false, "gilded": 0, "id": "d5ujkmz", "link_id": "t3_4tnsqu", "parent_id": "t1_d5ue2rf", "retrieved_on": 1471752428, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}