{"submission": {"author": "ISFJthrowaway", "author_created_utc": 1470841952, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_10biik", "created_utc": 1470923155, "domain": "self.Mommit", "edited": 1471004121, "full_link": "https://www.reddit.com/r/Mommit/comments/4x81xc/need_advice_about_caring_for_child_and_home_and/", "gilded": 0, "id": "4x81xc", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 74, "over_18": false, "permalink": "/r/Mommit/comments/4x81xc/need_advice_about_caring_for_child_and_home_and/", "retrieved_on": 1473036851, "score": 49, "secure_media_embed": {}, "selftext": "Hello,\n\nMy husband says I should never let our 2.5 year old out of my sight. He gets really worked up that I \"lock our child in the living room\" (put up a baby gate) so I can do housework (for the length of an animated film -1.5 hours?). He says I need to include our son in everything I do, even if it takes longer and that it should only take an hour to do housework, so he doesn't know what I do with my whole day since I'm a SAHM.\n\nHe often cites that \"millions of women do this without problems\" and I should stop acting stupid. So, I'm coming to you with a request for advice: How *do* you do it? Helping with laundry and general tidying up I understand, but the kitchen? -bathrooms? -floors? -cooking?\n\n***\n\n*Addition info and husband help request:*\n\nI had never even held a baby or knew anyone with small children before I got pregnant and I don't have any family near-by to help me. My mom lives out of state, my step-mom is chronically ill, and my MIL is an elderly snowbird. I lost contact with all my single friends from college. I tried to have lunches with them, but my husband complained that the housework was suffering and \"always out\" if I asked to use the truck more than twice a week. So eventually we just stopped meeting.\n\nHowever, my husband recently introduced me to another young mother he works with, so the play dates we've been setting up once a week (at our house) that have been a ray of light!!\n\nAlso, when I talk about needing a break, he says he works 75 hours a week and he doesn't get a break (he's transitioning/overlapping jobs right now). He handles it, like an adult, and he doesn't get to sleep 10 hours a day (I go to bed at 9pm and wake up at 4am -7hrs-, then nap with our son for 1 to 2 hours in the afternoon, so he's not far off) or hang around the house all day. \n\nHe says I'm welcome to go back to work, if I can't handle taking care of our child, and then someone else can raise him, but that totally **not** what I want.\n\nHe started complaining that he needed to \"hire a babysitter for his wife\" and I told him that's not what's said. Since one-third of the work he does is at home, I just wanted him to watch our son while I wash dishes or put away laundry or take a phone call from my mom on my birthday -- but that is asking too much. He's doing the work of four people and can't be distracted.\n\nHe also wants to know why I don't motivate him anymore (I use to write him notes on the whitboard or send him inspirational quotes/pictures/whatever) or why I'm never in the mood for anything. Its like I just don't care about him anymore, I only think about what I need. \n\nI'm not as happy as I use to be, but I'm not sad either. I'm not excited about our future as I use to be, but I still listen to him talk about the things he wants to do. I'm not unhappy, but I'm not the carefree 20 year old girl that inspired him to go after his dreams eight years ago. \n\nAnd the worst part is that I can't explain why I feel like this. I know my husband works his butt off for us, so it's unfair of me to ask for more time for me. Especially since I have \"no time for him\" anymore, despite everything he does for me.\n\nI **don't** want to be ungrateful, he *does* do a lot for us:\n\n* He buys me flowers\n* He's building me shelves for my books\n* He buys the food and pays the bills\n* He haggles with the medical insurance people and phone company\n* He takes me to the bookstore for an hour every couple weeks and takes our son to get lunch\n* He puts water in the inflatable pool so I can swim with our son\n* He takes us to the park\n* He gives our son showers\n* He takes care of the yard and the truck\n* He makes all the repairs around the house \n\nHe says he just feels like we're more like business partners than anything. I've tried to get him to try to schedule some down-time for himself to de-stress, but he says he doesn't *have* any time to give and that's what he needs me for. \n\n***What can I do?***\n\n***\n\n**Edit:** Wow! I was not expecting these answers. I'll try to reply to everyone. My husband is off today and taking a nap....We had a pretty big fight (our first serious fight) today that ended with him telling me I shouldn't be parent; that I need to go get a job, so someone else can watch our child (as I don't seem to care if he gets hurt - by leaving him in the living room while I go in and out); and I've pretty much ruined our marriage by going back on my promise (to take care of things at home plus whatever he needs from me)... so there's that. :\\\n\n**Edit2:** Husband works tomorrow. I will have to reply more then. He's already said that this won't \"just go away\" and that he's waiting for me to talk to him about something, but I have no idea what he's talking about??\n\n**Edit3:** Good morning. I'm not sure I can reply to everyone anymore, but I'll try to answer the ones with questions! \n\nWe talked last night and worked it out a bit. He just wants to make sure I'm committed to the family and our plan for the future. He says I'm very important to him and making this whole thing work. If we are fighting, he can't perform his best at work and that will destroy everything we've worked for. I can't be a little girl anymore, that I need to start acting my age, and take care of my business --stop making excuses-- and if we don't want to be average \"just like every other family\" then I need to make some adjustments to my attitude. He's had to make sacrifices too. \n\nOh, and the the thing he was waiting for me to talk about was: what my problem is and some proposed solutions. He says I have terrible communication and I need to start speaking up about what I want, before it becomes a problem. But that is kinda the problem (as stated in my original post) I don't know what my problem is or how to solve it. What do I need? Am I truly a bad mom because I go in and out of the room? Is it a matter of bad time-management? Is it a matter of being under-stimulated? -overwhelemed? -selfish? How do we come to terms with conflicting parenting styles without fighting?\n\nI feel as though I *have* tried to get us to go out and do things, but my husband always has reasons why we can't. Mainly it's because he doesn't have time, but also: the water park has urine in the water, the ball pit has needles in it, the zoo is hot and boring, the children's museum is full of snotty sick kids -- although he *has* gotten better. We have gone to a couple places now. Although he usually doesn't want us to go new places without him and I don't want him to miss out on the fun either. \n\nAlso, to answer another question, no - I don't have a car. We sold it the week after our son was born. It saves us car and insurance payments.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Need advice about caring for child and home (and husband) -- please", "url": "https://www.reddit.com/r/Mommit/comments/4x81xc/need_advice_about_caring_for_child_and_home_and/"}, "comments": [{"author": "Twenty3isNumberOne", "author_flair_css_class": null, "author_flair_text": null, "body": "Your husband sounds like a really demanding jerk. The reason he feels like you guys are business partners is because he is treating you like an employee and not a wife. If he wants the house kept a certain way, then he can take care of it. If he wants your son cared for in such a particular fashion, then he can do it while you go back to work. \n\nI'm reading through this and it sounds like he believes that he is the \"boss\" of the home and is telling you how to do your job, which is raising your son during the day and looking after the home. Listen carefully--if anyone is the boss of these tasks it is YOU. You decide how your son is cared for and you decide how often the floors get cleaned. You decide what's for dinner. If he doesn't like it, too bad. He can do it himself or move out but what he CAN'T do, is boss you around. Because he's not the boss here. \n\nTo be totally honest, your relationship doesn't sound particularly healthy. BUT it's easy for me make that knee jerk reaction from reading just one post. You live with him every day, so you can make the decision for yourself whether or not you are happy with how he treats you. ", "controversiality": 0, "created_utc": 1470924339, "distinguished": null, "edited": false, "gilded": 0, "id": "d6d84ng", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473345777, "score": 94, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sinisterFUEGO", "author_flair_css_class": null, "author_flair_text": null, "body": "Daycare isn't letting someone else raise your child. There is more to raising your child than the day to day minutiae. Teaching values and  dinner and homework and discipline and whatnot. ", "controversiality": 0, "created_utc": 1470924677, "distinguished": null, "edited": false, "gilded": 0, "id": "d6d8cwc", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473345876, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "body": "I am not a stay at home mom but I work from home and my son goes to day care 3 days a week, and at my mom's once a week. \n\nI read your post and felt somewhat angry at your husband's tone and reactions to your needs. Does he not understand how hard it is to keep up a house? I think maybe he needs to see it for himself to really get it. My son is only 15 months old so not as old as yours but he still wants to get into things and needs constant attention. Once I started leaving him more with my husband and going grocery shopping alone, going to the gym, or just going to lunch with friends on the weekend he started to understand that you can't really get anything done around the house with a toddler at your feet pulling at you and needing you. So he gets it more and helps me.\n\nI don't have any advice about incorporating your child into your everyday chores because I haven't really reached that point yet. I noticed my son obsessing over the broom and dustpan when I would sweep so I bought him a mini version to \"play\" clean with. Maybe get him something like that so he feels like he's involved? I know it can be hard. I usually just deflect and give him a toy. Even when I'm cooking I give him a pot and a wooden spoon and usually that keeps him somewhat entertained. \n\nEdit - I'm glad I came back to this post to see what others said that I wanted to originally add as well. I didn't want to come off judgmental when you were asking advice. But you should listen to these ladies. You are in an abusive relationship. He's sounds very controlling. ", "controversiality": 0, "created_utc": 1470924699, "distinguished": null, "edited": 1470927053.0, "gilded": 0, "id": "d6d8deu", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473345881, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sjb1985", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you need to go back to work. Go back to work part time. Or take a class or something. Mostly I feel that you don't feel valued so you don't place value in yourself. I feel like that's the underlying problem. You are running the house because that's your job. He may have ideas on how things should be done, but I also had ideas on how to be a parent before I was a mom. Ideas on how something should be done and reality are two very different things. You got this. You know that you spend so many hours with your child that sometimes you both may need alone time for LO it's watching a movie in the living room... for you it's doing the dishes (that kinda is not a fair trade off... ;) ) You are there in the trenches every day. Don't let him forget that. You don't tell him how to do his job after interacting with his frustrations or hearing a story... so he needs to either co-parent or get out the kitchen!\n\nYou need to get out of the house and have adult time NOT focused on your child. Play dates are nice and all, but I bet it's spent talking about kids, husbands and house projects. You are a human being. You deserve some time to not be just a mom. PS. Millions of families take their children to daycare and it is a wonderful support system. I love my daycare and so does my son. He knows who mommy is and who daddy is. It's not something one forgets. That's not a complete jab at your \"someone else raising our child.\" I assure you, when your child goes to school that you still be raising your child though he will not be in your care for 40 plus hours a week. Daycare can be a wonderful support system for us Mommies who do not have families to assist or need to work to provide for our families. We are all in this parenting thing together. ", "controversiality": 0, "created_utc": 1470925506, "distinguished": null, "edited": false, "gilded": 0, "id": "d6d8x9l", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473346119, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stffny", "author_flair_css_class": null, "author_flair_text": null, "body": "I know you're asking for different advice, but your husband sounds incredibly manipulative and potentially emotionally abusive. I am currently a SAHM for a few more weeks to a 12 week old and it is not as easy as he thinks it is, no matter what the age. Regardless of how many hours of sleep you bag in a 24 hour period, it's not the pre-kid sleep you used to enjoy. Furthermore, there is nothing wrong with having your kid entertain himself while you catch up on housework (provided you check in to make sure kid is alive!). It's encouraged to let kids play on their own. I let my 12 week old play by himself so he can study things without me constantly distracting him. A 2.5 year old should be more than capable of entertaining himself. \n\nAnyway, I'm sorry you're getting crap from your husband for what sounds like a totally normal day and life. We all go through ups and downs. Not getting motivational notes from you is clearly affecting him, it seems like a fairly simple thing to start back up again to make him feel loved. Maybe write out a week's worth on the weekend when your husband is home and watching LO? \n\nMy other advice is to read the 5 Love Languages or just visit the website and each of you take the test. It helps you better understand what each of you needs from the other to feel loved. My DH and I are both primarily Acts of Service which means we feel loved when the other one does something for us, like I will make him breakfast and get him coffee on weekend mornings. I used to do it before LO but I have yet to get back on that schedule :D \n\nBest of luck to you both! ", "controversiality": 0, "created_utc": 1470925627, "distinguished": null, "edited": false, "gilded": 0, "id": "d6d909l", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473346154, "score": 57, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "odette_decrecy", "author_flair_css_class": null, "author_flair_text": null, "body": "Your husband's behavior sounds pretty immature and controlling, not particularly healthy. YOU are the boss of how you choose to run the home you and your husband share. I am kind of appalled at how he believes he can belittle and micromanage you.\n\nYou might take a look at a couple books. Lundy Bancroft has two that are amazing: [\"Why Does He Do That? Inside the Minds of Angry and Controlling Men,\"](http://www.abebooks.com/servlet/SearchResults?isbn=0399148442&amp;cm_sp=mbc-_-0399148442-_-all) and [\"Should I Stay or Should I Go?\"](http://www.abebooks.com/servlet/SearchResults?isbn=9780425238899&amp;cm_sp=mbc-_-9780425238899-_-all) If you get the books, make sure he won't find them, because especially the first one is like a 400 page manual of how controlling people control others. \n\nYou deserve for him to act better. Bancroft's books are a great resource. Unfortunately, because he has everything exactly the way he wants, when he wants it, your husband might not have a lot of impetus to change. You might consider individual counseling for yourself to get some tools and strategies for making positive changes in your life (marriage counseling in a situation where one partner is very controlling is NOT a good idea). \n\nEDIT:  I'm also concerned about how much he seems to isolate you. Do you not have access to a car? You mention that your husband takes you and your child to the park, and that he introduced you to a woman he works with. Isolation is another huge red flag in relationships. Has he, slowly and over time, reduced your ability to have your own relationships, to go places independently, to do your own thing? Another HUGE indicator of controlling behavior.\n\nEDIT2: Re-reading your post, it DEFINITELY sounds like he has limited your relationships and your freedom slowly over time. DEFINITELY get and read the Bancroft books. Another great one is [Gavin de Becker's \"The Gift of Fear.\"](http://www.abebooks.com/servlet/SearchResults?isbn=9780316235020&amp;cm_sp=mbc-_-9780316235020-_-all) I had reservations about the title, but it's about predicting human behavior. My concern is that if you try to assert independence or especially if you try to exit the relationship, your husband might escalate his behaviors, even using violence, to keep you from leaving. Contact a local women's shelter or domestic violence group for support and resources:   1-800-799-7233 National DV Hotline http://www.nrcdv.org/\n\nAND:  Feel free to PM me. I left an abusive/controlling relationship about 5 years ago, and it was the best thing I had ever done. Use DV resources--they can do things like threat assessments, to keep you and your child safe. Get important documents, like your child's birth certificate and your own, together in a safe place, preferably OUT of your home, like at a trusted friend's house. Or, if you can obtain additional copies without him knowing, keep those at a friend's house.\n\nAND:  You might want to stay in your marriage, which is also your choice. I would recommend thinking about getting work outside the home, even though that would mean putting your child in day care. But whatever you do, love and strength to you. You deserve better, you do NOT deserve to be treated this way.", "controversiality": 0, "created_utc": 1470926019, "distinguished": null, "edited": 1470931282.0, "gilded": 0, "id": "d6d9a8l", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473346271, "score": 38, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "I am a SAHM and I very much do what you do regarding cleaning. Also not everything gets done and we just grin and bear it because we have kids.\n\nBut IMO, letting the kid be by themselves but within earshot teaches them to be independent which is very important.", "controversiality": 0, "created_utc": 1470926969, "distinguished": null, "edited": false, "gilded": 0, "id": "d6d9ypw", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473346563, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "You don't need advice about caring for your home or child, because you aren't actually having any issues with that you have a husband problem. He clearly doesn't respect you as a SAHP. If you intend to remain as such, I think you need to demand marital counseling. He needs a reality check, and hard. He also needs to let go of his control issues. He wants you enforce how you spend your days, what you do, who you spend them with. Why do you think he introduced you to the woman he works with? He has already decided that she is an OK person to spend time with. He wouldn't want you hanging out with people he isn't close with.\n\nI'm not going to go all out and cry \"abuse\" in this situation, but I strongly encourage you to take a few online quizzes and do some reading on signs of an abusive relationship. Many people don't see the red flags, and by the time they realize they are in an abusive relationship, it's just their normal. It may never cross a line into abusive. Your husband might just need an attitude check. But he could be slowly ramping up on the abusive behavior as well. So be careful.", "controversiality": 0, "created_utc": 1470927089, "distinguished": null, "edited": false, "gilded": 0, "id": "d6da1xo", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473346602, "score": 26, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "a1b1no", "author_flair_css_class": null, "author_flair_text": null, "body": "Your husband is literally a dick! ", "controversiality": 0, "created_utc": 1470927610, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dafpc", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473346765, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thepriceforciv", "author_flair_css_class": null, "author_flair_text": null, "body": "Not sure if this is possible, but your husband needs to take a week off, and you should go on far away for a week (on a vacation, to help a family member, to volunteer, whatever). Your husband gets to take care of things how he thinks they should be taken care of during that week. Since it is so easy, should be no problem for him. My guess is that you will come home to either a humbled man or proof that he is a real jerk. Either way, valuable lessons will be learned. The only way for him to appreciate what you do is to do it himself for a week. ", "controversiality": 0, "created_utc": 1470930097, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dcaqh", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473347556, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "toastandpeanutbutter", "author_flair_css_class": null, "author_flair_text": null, "body": "This made me so angry to read. I barely get any housework done. Housewives used to be able to handle the workload when we lived in communities where we had lots of support from family, friends, and other moms. Now alone, it's next to impossible to get anything done! I hired a mother's helper for six hours a week, but even with her, I don't get to housework much, as I prefer to go to child-free appointments during that time (dentist, physio, oil changes, etc). But I have a motto: Hustle while you wait. (It's from the Seven Habits of Highly Effective People). Any free moment where I'm just standing waiting for something I clean like crazy. I also clean while Dad gives the kiddo a bath each night and whenever she seems distracted enough to give me a minute. Every once in a while I just hire a cleaning crew to come give everything a good once over. Like, 2-3 times a year. Anyway, I'm really sorry to hear about the anguish your husband is giving you. My husband and I fight a lot, too. We do marriage counseling, the Five Love Languages and we're reading And Baby Makes Three. Things are slowly getting better... Relationship repair has really been the hardest part about having a baby for us. ", "controversiality": 0, "created_utc": 1470930524, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dcmna", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473347694, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Dragynwing", "author_flair_css_class": null, "author_flair_text": null, "body": "A man that is a good provider is not necessarily a good husband. He sounds emotionally abusive. Have you ever heard the term gaslighting? If I were in your situation, I I would involve a marriage counselor right away. Neither of you are happy with the current situation so something has to change and it's not up to him to dictate what changes. If he doesn't agree to get help with you at least go get help for yourself.", "controversiality": 0, "created_utc": 1470932330, "distinguished": null, "edited": false, "gilded": 0, "id": "d6de0wn", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473348294, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "unknownRNG", "author_flair_css_class": null, "author_flair_text": null, "body": "Here's another point of view, men like to solve problems. Ask him to show you how he would attack specific things like housework with the child. Literally have him do it for an hour with the child and see how it works. MAYBE, just MAYBE, he does have some good ideas, and you can add more bonding time and learning time with the kiddo while doing housework. MAYBE he fails, understands the situation better, and backs off. I know this may sound stupid, but pander to him a bit to see what happens. If it's difficult for him, he should gain some perspective. If he figures it out, you'll all benefit. He gets to be hero, you get to do what you need to do. \n\nNow if he doesn't even attempt this and just says something like 'that's your job not mine', then he can shove it and let you do it how you need to do it. :)", "controversiality": 0, "created_utc": 1470932394, "distinguished": null, "edited": false, "gilded": 0, "id": "d6de2n0", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473348314, "score": 17, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "daradv", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes.", "controversiality": 0, "created_utc": 1470933253, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dequv", "link_id": "t3_4x81xc", "parent_id": "t1_d6de2n0", "retrieved_on": 1473348605, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ticklemeuntilisayno", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry but your husband is a dick and doesn't respect you and what you do for your child. It is perfectly normal to put your child in a room and do the chores. Housework for us SAHM is never ending, there's always something to be done. ", "controversiality": 0, "created_utc": 1470933750, "distinguished": null, "edited": false, "gilded": 0, "id": "d6df5d2", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473348776, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "momfish", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you should let him read this and maybe even have him take a couple of days off to take care of house and your child to see what it's like.", "controversiality": 0, "created_utc": 1470933960, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dfbga", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473348849, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "I wouldn't limit it to just an hour. Have him stay at home with the baby for a day. Maybe just 8 hours. See what he can get done.", "controversiality": 0, "created_utc": 1470934192, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dfi4i", "link_id": "t3_4x81xc", "parent_id": "t1_d6de2n0", "retrieved_on": 1473348949, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Angel3", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband did, and does, all the same things your husband does for your family.  He works minimum 50 hour weeks, takes care of the house and yard, and when I stayed at home with our son, he'd spend his weekends helping me clean and do laundry and take care of the baby.  Taking care of a house and a child is not an easy task.  Some women can manage it all without any issues and some of us can't seem to.  And that's okay.  You guys need to talk this out.", "controversiality": 0, "created_utc": 1470934568, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dft23", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473349142, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "Working 72 hours a week without a break can be tough. He shouldn't hold that up as an ideal for you to aspire to. That's horrible, and I hope everything shakes out soon so he can get back to a more normal workload. It could be that he's lashing out at you because he's overworked, stressed, and possibly jealous of you getting to stay home all day without realizing how much effort it is to watch a kid. \n\nI'm the mother of a 22 month old. I went back to work and my husband is a stay at home dad.  I remember from my 12 weeks of maternity leave how difficult it was to take care of a baby all day by myself. She's older now and her needs are a lot different, but all I need is a Saturday with her while hubby gets a \"break\" to remind me how much of a handful she still is. \n\nMy husband is very much guilty of \"locking\" our daughter in the living room from time to time. I do it on weekends, too. It's not the whole day. There's plenty of time to play with her and read books as well, but as human beings both my husband and I need time to mentally breathe without having a little one under foot. \n\nWe include her in chores when we can. She bangs in the pots and pans while I do dishes. She runs around the bedroom while he folds laundry. I've been trying to encourage her to clean up her own toys, but that's slow going. I recommend that you try to include him as much as you can, but don't feel guilty if there are some things you just have to do by yourself. \n\nAlso, as others have said, he NEEDS to be able to entertain himself. A baby who has a parent attached to him 24x7 may grow up to be totally dependent on you, unable to enjoy quiet time, always expecting to be entertained. \n\nAnd we have come to accept that our standard of living had changed since having a baby. The floors don't get vacuumed as often. The windows haven't been washed in forever. We stay on top of dishes and laundry, but just barely. I don't blame my husband for this. It's just how it is. I don't ask him to give up his precious little free time just so that I have more clean socks in my drawer, or the counter is uncluttered. It's just a little dirt. Get over it, we tell ourselves. :)", "controversiality": 0, "created_utc": 1470935189, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dgb3z", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473349330, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Blankety_blanks", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes - my husband had a real eye opening after staying home with our daughter for a full day.  He quickly changed his tune and praised me quite a bit for everything I was doing, when previously it had seemed like I wasn't doing that much. ", "controversiality": 0, "created_utc": 1470936173, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dh3on", "link_id": "t3_4x81xc", "parent_id": "t1_d6dfi4i", "retrieved_on": 1473349624, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry but he sound like a dick... Why does he think he can tell you how to spend time with your kid while he's at work? Does he ask you how to do his job? \n\nMy hubby and I split a lot of the child care, but we both work outside of the home too. If I need to get something done around the house and my three-year-old is acting particularly squirrelly, then I have no problem putting on some Curious George or a movie so that I can, nurse the baby, clean, do laundry or make dinner (all of which my husband does as well, minus the nursing...)\n\nThere are ways that you can have young kids help (if they're in the right mood...2-4 is so full of drama!) without creating too much more work for yourself... They can help you \"fold\" or stack laundry into piles, put silverware into categories, or wash veggies for dinner. I've pulled out the drawer so my LO can take clean silverware from the dishwasher and put it away...on the floor (your expectations for \"clean\" should already have been lowered by this point!)  We also have a small brush and dustpan that get pulled out a lot so LO can help sweep up the messes she makes. These chores are in excellent way for kids to start taking responsibility for the messes they make as well as contribute to household work. \n\nThat being said it should be something that you agree on as a family not something that your husband dictates... it's 2016 mamma!", "controversiality": 0, "created_utc": 1470936540, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dhegf", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473349736, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Franr1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I always put my son in the living room with the television on so I can clean. I would rather him be in one place and safe. Being a mother is a very demanding job.  As is being a working dad. They are both very different kinds of demanding though.  He needs to understand you both need breaks to just be yourself and not just be be parent/worker. Do you do date nights? ", "controversiality": 0, "created_utc": 1470938561, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dj18v", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473350344, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Franr1991", "author_flair_css_class": null, "author_flair_text": null, "body": "But reading all comments I agree that your husband sounds controlling. Asking why you don't offer motivation whilst belittling your efforts.  ", "controversiality": 0, "created_utc": 1470938841, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dj9hs", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473350431, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1470940125, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dkb1s", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473350814, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crikeybobs", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have anything to add here other than to reiterate that you sound like you're doing a brilliant job. My daughter also goes in front of the TV for an hour or two while I clean or cook, and there is NOTHING wrong with that. \n\nThere is so much more to being a SAHP than 'keeping house'. Raising a child involves constant interaction and energy which is absolutely exhausting. Not only are you always 'on' because your son needs looking after all of the time, while your husband inevitably gets breaks from work during his commute, lunch time, etc., but interacting with a toddler all day without adult conversation is really bloody hard work. \n\nKeeping the house spotless on top of always being there for your son is something we all aspire to, but the reality is that it isn't realistic. If you could see my living room right now..! \n\nThe only way that your son will get undivided attention and the house remain spotless and dinner appear on the table every day is if you have someone to look after the house and someone to look after your son, i.e. TWO people. You are one person. Your husband is living in cloud cuckoo land. \n\nAs a few others have said, his behaviour and comments are raising controlling/abusive red flags, but that's hard to really tell from one post. Do know that you're doing as well as any of us do, that your husband needs a reality check, and that if you ever have ANY concerns about his behaviour or the way he makes you feel, you should seek professional advice. ", "controversiality": 0, "created_utc": 1470942203, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dlz8q", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473351436, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your advice. We just had a big fight that started because I couldn't get a hotel reservation he asked for and it went into me breaking my promise to support him (including not upholding my part of the deal by caring for our son exclusively) and I told him I underestimated how much effort raising a child took and as my partner I thought I could ask him for help. \n\nHe says I'm just being lazy and dragging him down after I manipulated him into putting resources into achieving his dream by telling him I support him -- and that I've just ripped the rug out from under him and destroyed our future.\n\nAnyways, towards the end he did ask me specifically if I saw anything wrong with letting our son play alone. I said no. He said I was basically saying that I don't care if he climbs up the couch, falls off, cracks his head open and dies -- because all it takes is a second. Then he said I shouldn't be a parent and that I need to find a job soon, because I can't be trusted to watch him. So... That's where we are now. :/\n\nEdit: I think he's just stressed because finances are tight and he has been screwed over in the past by people breaking promises to him. He can't actually force me to get a job...right? But another part of me thinks that maybe I'm not cut out to be a mother and I'd be more useful to the family if I brought in some money. Plus our son would have other children to play with...", "controversiality": 0, "created_utc": 1470951022, "distinguished": null, "edited": 1470951667.0, "gilded": 0, "id": "d6dszta", "link_id": "t3_4x81xc", "parent_id": "t1_d6d84ng", "retrieved_on": 1473354087, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "storeboughtmama", "author_flair_css_class": null, "author_flair_text": null, "body": "omg you sound like you're in a sheltered, controlling, borderline-emotionally-abusive relationship o_o I don't mean to jump to conclusions but your post has some huge red flags. You and your husband should be a TEAM, husbands and wives have different roles in the marriage but they are equally important. Same goes for parenting, you should be team parents. You need to grow some balls and show confidence in yourself and your wife/mom skills! Tell your husband to back off and stop pressuring you to live up to his ideal standards.", "controversiality": 0, "created_utc": 1470952151, "distinguished": null, "edited": false, "gilded": 0, "id": "d6dtum9", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473354402, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Miett", "author_flair_css_class": null, "author_flair_text": null, "body": "Your list of all the \"nice things\" your husband does for you almost made me cry.  There is not ONE single thing on there that is emotionally supportive or invested in a relationship with you.  Literally anything on that list could be done by a complete stranger you hired.   \n\nThe things he says to you are no less than emotional abuse--every single one is designed to make you feel guilty and manipulate you into complying.  Please, please think about some kind of therapy, if not as a couple, for yourself.  Having this kind of manipulation leveled at you constantly can be really damaging to you.  \n\nAlso, you can tell him to sod off when it comes to letting your son play alone.  Toddlers NEED to be able to experiment and play independently in order to develop critical thinking and important motor skills.  Your response could easily be that what he's asking you to do is to stunt your child's development.  \n\nI hope I didn't come off as too critical about him, but frankly, I'm absolutely infuriated on your behalf!!\n", "controversiality": 0, "created_utc": 1470952641, "distinguished": null, "edited": false, "gilded": 0, "id": "d6du7to", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473354538, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lilla_beth", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Millions of women do this without problems\" - I would be super interested to find ONE woman who could get all the housework done in one hour a day while letting their small child \"help\". When we find that mythical woman she should be given book deals and a tv show. \nIt's pretty much a pick two: spend all the time with the child, keep the house immaculate, provide emotional support to spouse. Nobody I have ever met, seen, or heard of can do all three. And if someone figures out the secret, it'd sure be great if they could pass it along to the rest of us.", "controversiality": 0, "created_utc": 1470971254, "distinguished": null, "edited": false, "gilded": 0, "id": "d6e2ka7", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473357697, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ticklemeuntilisayno", "author_flair_css_class": null, "author_flair_text": null, "body": "Just because things are tight doesn't mean he should be treating you as if your worthless. Look, hes already gotten in your head that your a bad mother. His words are impacting you and its not good. Don't make excuses for him as why he might be acting like that, this is not normal. ", "controversiality": 0, "created_utc": 1470980328, "distinguished": null, "edited": false, "gilded": 0, "id": "d6e7fd9", "link_id": "t3_4x81xc", "parent_id": "t1_d6dszta", "retrieved_on": 1473359521, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LukaCat", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds to me like there is a very thorough 'scoreboard' being kept in your marriage. That is extremely unfair and unhealthy. I am currently a SAHM and my husband works 80+ hours a week (starts at 9am and works until 11pm or later depending on the project) and never from home. He never once tells me I'm not upholding my end if the dishes aren't done or the house is untidy. He will ask me to do it , but never blame me if I don't. \n\n\nYour husband seems controlling and manipulative. You need to stop having a scoreboard in your house or you will eventually break from the pressure to keep matching points. Also remember that even if he works long hours, you live at your work and it is 24/7. \n\nTake care of yourself, stop second guessing your parenting and your abilities. You're amazing for even trying to keep up with all the expectations placed on you, so try to get some perspective on how great you're already doing and take some confidence and heart from that. You deserve as much as your husband does.", "controversiality": 0, "created_utc": 1470981865, "distinguished": null, "edited": false, "gilded": 0, "id": "d6e82z9", "link_id": "t3_4x81xc", "parent_id": "t1_d6dszta", "retrieved_on": 1473359761, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "beanbaconsoup", "author_flair_css_class": null, "author_flair_text": null, "body": "Edit2: Husband works tomorrow. I will have to reply more then. |He's already said that this won't \"just go away\" and that he's waiting for me to talk to him about something, but I have no idea what he's talking about??\n\nThe name and contact details of your divorce attorney? ", "controversiality": 0, "created_utc": 1470986748, "distinguished": null, "edited": false, "gilded": 0, "id": "d6e9x2a", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473360467, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree that they are both demanding and we have both told each other that we couldn't do what the other does. He doesn't have my patience or ability to do busywork and I don't have his skills or ability to act under extreme pressure (he's a first responder, so he constantly works in emergency situations).\n\nHe brings me with him when he runs errands and since our son is in his car-seat it's \"down time\" for me and we talk some, but I think the last time he took me \"Out\" was for dinner on our anniversary last December. He does take me to the bookstore every couple weeks and let's me browse in peace for an or so.\n\nHis main complaint with giving me breaks is that I always want another one and he feels like it doesn't really change my attitute; it makes him question whether I really want to be a mother (which I do!) or if I'm just in it for myself :(", "controversiality": 0, "created_utc": 1471002233, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eesn1", "link_id": "t3_4x81xc", "parent_id": "t1_d6dj18v", "retrieved_on": 1473362275, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Maybe write out a week's worth on the weekend when your husband is home and watching LO?\n\nAlthough DH doesn't watch our LO (he just doesn't), I think this is great idea. Thank you!\n\n&gt; My other advice is to read the 5 Love Languages or just visit the website and each of you take the test.\n\nThis is interesting. I will ask him to do it with me. :)\n\nThank you!", "controversiality": 0, "created_utc": 1471004478, "distinguished": null, "edited": false, "gilded": 0, "id": "d6efqyt", "link_id": "t3_4x81xc", "parent_id": "t1_d6d909l", "retrieved_on": 1473362633, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Hello! I do not have a car. We sold it to save on car and insurance payments. It does make meeting new people difficult, which is why he tried to help. She's been really nice, is around my age, and her son is very friendly. \n\nAlso, I don't feel any fear for my safety and I believe my husband would leave if things got too heated. I will, however, look into those books you mentioned. I am an avid reader and he has always supported my need to read, so I often get books in the mail and the library. :) \n\nThank you for your kind words. Its hardest when we are in the middle of an argument and I believe things get said that wouldn't normally be said. I will try to communicate that I feel belittled when he makes those comments. He may not know that it effects me in a negative way, when he is simply stating what he believes.", "controversiality": 0, "created_utc": 1471005174, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eg2xj", "link_id": "t3_4x81xc", "parent_id": "t1_d6d9a8l", "retrieved_on": 1473362755, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Hello! He has watched our son for an hour or so (here and there). They will go get lunch while I'm at the bookstore, for example. \n\nMainly, he does feel that it's my job and requesting to be away from our son for a long period of time (like going to the cinema) is too long. There is no way I could get a day away. He already wonders if I really want to be a mother. Although he also says our son is the happiest kid he's ever seen and that he knows that I love him very much, he just thinks I might love myself more. \n\nThank you for your help. He does like to solve problems and be the hero :)", "controversiality": 0, "created_utc": 1471005712, "distinguished": null, "edited": false, "gilded": 0, "id": "d6egcaw", "link_id": "t3_4x81xc", "parent_id": "t1_d6de2n0", "retrieved_on": 1473362851, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm more afraid he would resent me for abandoning my post to go indulge in myself. He \"doesn't ask me to go to work for him\" so.... *(shrugs)* No one is giving him any breaks", "controversiality": 0, "created_utc": 1471005861, "distinguished": null, "edited": false, "gilded": 0, "id": "d6egezf", "link_id": "t3_4x81xc", "parent_id": "t1_d6dfi4i", "retrieved_on": 1473362880, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Housewives used to be able to handle the workload when we lived in communities where we had lots of support from family, friends, and other moms.\n\nI think about this all the time! Especially when he says \"women have been doing this for ages\" and stuff like that. I'm thinking, up until 1950's mothers had lots of help from other female relatives/friends or servants (depending on your social class). Winning the war and all the new suburban homes gave women freedom to run their own homes, but (along with air conditioning and TV) it also made isolation easier....\n\nI've gone off on a tangent. Thank you for understanding! I feel the same way :D\n\n &gt; Relationship repair has really been the hardest part about having a baby for us.\n\nI didn't realize how different our parenting styles were... :\\ Now I'm wondering how we can move forward from this", "controversiality": 0, "created_utc": 1471006898, "distinguished": null, "edited": false, "gilded": 0, "id": "d6egyet", "link_id": "t3_4x81xc", "parent_id": "t1_d6dcmna", "retrieved_on": 1473363080, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "First of all, you are a person and deserve breaks. It is not shameful to want a break from your child, regardless of how much your husband works. Just because he is suffering doesn't mean you have to.  \n\nI only watch my daughter in the evenings and weekends, and then it's not even \"full time\" because my husband is there, and even I need a break from her every so often. \n\nNow, the goal of asking him to watch your son for 8 hours is not to give you a break but to educate him on how hard it is. He's judging you without having walked in your shoes. Asking him to do this while he's working a 70+ week is unreasonable, but the point still stands that he shouldn't judge if he hasn't been in your position. \n\nHe doesn't ask you to do his job, and you don't tell him how to do his job, do you?\n\nI sincerely hope that your husband's attitude is a result of his long hours, and that things calm down for him soon. If there's no end in sight or if he's like this even when rested and relaxed you may want to think seriously over whether the relationship is worth keeping. ", "controversiality": 0, "created_utc": 1471007154, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eh3c0", "link_id": "t3_4x81xc", "parent_id": "t1_d6egezf", "retrieved_on": 1473363129, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "&gt; ...as I don't seem to care if he gets hurt - by leaving him in the living room while I go in and out...\n\nThis is why you child proof a room.  Your living room is child proofed, right?  \n\nAlso, if your son bumps himself a bit by falling off the couch that helps him learn his boundaries.  A kid who never gets a bruise or a cut isn't allowed to be a kid.\n\n&gt; ...and I've pretty much ruined our marriage by going back on my promise (to take care of things at home plus whatever he needs from me)...\n\nExcuse me?  \"Plus whatever he needs from me\"?  Your marriage should be a partnership.  You're not there to serve him.  That is a big red flag.  The roles are reversed in my household, I'm the breadwinner at work 8 hours a day and he's the homemaker, and every once and a while he asks me to fold laundry or do the dishes and I do it because it's OUR house and OUR responsibility.  He has MORE of it, but not ALL of it.\n\n&gt; If we are fighting, he can't perform his best at work and that will destroy everything we've worked for. \n\n...I don't even know how to respond to that.  He shouldn't be blaming you for the fights.  It takes two people to fight.\n\n&gt; I can't be a little girl anymore, that I need to start acting my age, and take care of my business --stop making excuses--\n\n\"A little girl\" and \"acting your age\"?!?!?  If my husband were to start talking to me that way I'd take my daughter and leave him.  He's not respecting your arguments, calling them \"excuses\", and calling you a little girl.  This is emotional abuse.  You do not have to take that.  That's horrible.\n\n&gt; Oh, and the the thing he was waiting for me to talk about was: what my problem is and some proposed solutions.\n\nYour problem is that you have an emotionally abusive husband.  Get in contact with a local women's shelter and get out. :(\n\nHow are you supposed to \"get out and do things\" without a car, by the way?  We specifically bought a brand new car for my husband and I drive the 13 year old junker to work because he needs the car more for the baby than I do for my short commute.", "controversiality": 0, "created_utc": 1471008194, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ehokz", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473363350, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "&gt; ...I don't care if he climbs up the couch, falls off, cracks his head open and dies...\n\nIf your couch is high enough for him to crack his head when he falls off of it then you must be extremely tall people.\n\nWhen my daughter started climbing up on the couch on her own I stopped trying to grab her when she fell.  I actually stopped my mom from grabbing her once.  She fell down a few times, cried a bit, and was just fine.  She learned to be more careful on the edge.", "controversiality": 0, "created_utc": 1471008377, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ehsh9", "link_id": "t3_4x81xc", "parent_id": "t1_d6dszta", "retrieved_on": 1473363391, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "You are entitled to love yourself just as much as your son.  If you don't take care of yourself (including breaks for mental sanity) then you won't be able to be a good mother to him.\n\nGetting a break to go to the cinema by yourself (or with him, if he gets time from work) is not unreasonable.\n\nIs he suggesting that any family that gets a babysitter while they go out for a few hours are bad parents?", "controversiality": 0, "created_utc": 1471008552, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ehwad", "link_id": "t3_4x81xc", "parent_id": "t1_d6egcaw", "retrieved_on": 1473363431, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "&gt; His main complaint with giving me breaks is that I always want another one and he feels like it doesn't really change my attitute\n\nDoes he think that just ONE break will satisfy you forever?\n\nYou need breaks on a regular basis.  More than every couple weeks in a bookstore.  You need time to do things that make you happy.  (And so does he - 70+ hours a week is much too much to work to for his mental health.)\n\nHonestly, it makes me sad that you think time in the car running errands is \"down time\".", "controversiality": 0, "created_utc": 1471008916, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ei4de", "link_id": "t3_4x81xc", "parent_id": "t1_d6eesn1", "retrieved_on": 1473363515, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "He sounds really *controlling*.\n\nHowever, I think there's hope - if the two of you get professional couples counselling.\n\n&gt; He can't actually force me to get a job...right?\n\nNo, but for a host of reasons you might be wise to get at least some part time work and part time child care. \n\n&gt; But another part of me thinks that maybe I'm not cut out to be a mother and I'd be more useful to the family if I brought in some money.\n\nErmm... you can actually do *both*. Be a mother AND earn money.", "controversiality": 0, "created_utc": 1471008936, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ei4tp", "link_id": "t3_4x81xc", "parent_id": "t1_d6dszta", "retrieved_on": 1473363521, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Franr1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't want to sound horrible but your husband sounds really selfish. You also sound like you're questioning your own ability as a mother!  Don't!  You're a very good mother and like all of us do everything that is best for out children. Looking after young children is very tiring with little thanks. Always cleaning and when you turn around its a mess again.  You need a break, just as your husband does. He needs to understand that. I take it you have tried to speak to him about it? Everyone deserves to feel like they are appreciated ", "controversiality": 0, "created_utc": 1471009823, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eip82", "link_id": "t3_4x81xc", "parent_id": "t1_d6eesn1", "retrieved_on": 1473363754, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "It was brought up after I assumed he would help me keep an eye on the munchkin while I was putting laundry away (while he was in the kitchen and our son was running back and forth between us). He was very upset that I just assumed he would watch him and when I said that he was a parent too, that was what launched our \"three day disscussion\" about roles and commitment.", "controversiality": 0, "created_utc": 1471010271, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eizz7", "link_id": "t3_4x81xc", "parent_id": "t1_d6eip82", "retrieved_on": 1473363866, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I went into our marriage knowing he was going to be the head of the family. I just didn't understand the extent of my role when I promised to support him. \n\n&gt; Ermm... you can actually do both. Be a mother AND earn money.\n\nOh I agree. Every mother I know of (including my own) works and I have no problems with that. Its more about failing to fulfill my promise to them, you know? I want to be loyal to the commitment I made.", "controversiality": 0, "created_utc": 1471010898, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ejer2", "link_id": "t3_4x81xc", "parent_id": "t1_d6ei4tp", "retrieved_on": 1473364017, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "toastandpeanutbutter", "author_flair_css_class": null, "author_flair_text": null, "body": "It's been so hard! One of the things we've noticed that we do a lot is try to make the other person listen to what we're saying, but the other person is unwilling to listen, because they feel unheard. So we just get louder and louder with whatever message we're trying to get across but get nowhere. Now when we start to feel the heat, we try to remember to do belly breathing and really stop and listen to each other. We make sure the other person is heard and understood by repeating what they've said back to them in different words (reflective listening). It takes a lot of willpower for me! But truly helps. The constant differences are forcing us to learn a lot of communication skills we lacked before baby. Anyway, I don't know if you guys relate to that particular issue but thought I'd share our little counseling breakthrough.", "controversiality": 0, "created_utc": 1471012426, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ekh80", "link_id": "t3_4x81xc", "parent_id": "t1_d6egyet", "retrieved_on": 1473364419, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Well. He says I get a lot of down time when I'm sitting in the living room with him and I do spend time on Reddit or reading books in between blowing bubbles, dancing, singing, coloring, working on saying words, meals and snacks, etc. \n\nSo...it's not that it's hard. That's part of my unknown problem. I don't feel like my job is difficult and I love being with my son, so why do I need a break? \n\nIs it terrible to say that I only feel stressed when my husband's home? I never feel like I'm doing enough or doing it right. And I just want him to watch our child for a bit so I can do some cleaning and be productive. Stuff my husband says I should do when he's not home. \n\nWhen he's home, he want me to give him attention (listen to him, rub his sholders/back/feet, give him motivational speeches, give positive feedback, give him a peaceful space to work in). But at the same time he'll be making comments about what I should (on shouldn't) be doing with our son. Don't leave him in the room alone. Don't let him stand on the chairs. Don't let him touch my stuff. Don't turn your back to him. Don't let him eat that Cheerios on the floor. Make sure he drinks lots of water today. Cut his grapes/apples/sandwich into smaller pieces.  Don't let him put his lips around the water-bottle spout. Have you been working with him on his sounds? I need to make important phone calls (at the kitchen table while our son is still finishing his breakfast), can't you keep him quiet? Why don't you listen to what I tell you the first time, so I don't have to keep repeating myself?\n\nStuff like that.", "controversiality": 0, "created_utc": 1471013606, "distinguished": null, "edited": false, "gilded": 0, "id": "d6elbmw", "link_id": "t3_4x81xc", "parent_id": "t1_d6ei4de", "retrieved_on": 1473364753, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "&gt; So...it's not that it's hard. That's part of my unknown problem. I don't feel like my job is difficult and I love being with my son, so why do I need a break?\n\nIt is mentally difficult to watch a child.  They sap your energy.  There's always some part of your brain that is focused on the child, even when you're reading, surfing Reddit, or cleaning in the other room.  That's taxing, even if you don't realize it.\n\nI had a job as a cashier in high school.  When I'd finally get to sit down after having stood for literally six hours at a stretch my legs would hurt so much.  I didn't realize how much effort it took to stand like that until I was no longer doing it.  Watching a child is just like that.  You don't realize how much mental effort you're spending making sure the child is okay until you get to stop for a moment.\n\nAlso, you need more mental stimulation than some books and the internet.  Is there anything else you like to do as a hobby?  Those are both great pastimes, but they tend to be very passive.  Is there anything active you like to do?  Knitting?  Board games?  Lacross?\n\n&gt; Is it terrible to say that I only feel stressed when my husband's home?\n\nThe way you describe your husband, that's perfectly normal.  It's also an indicator that you're in an abusive relationship.  Your husband doesn't need to beat you to abuse you.  Everything you've posted here screams emotional abuse.  Seriously, I almost wonder if you're trolling us with how textbook you are with some of these things.\n\n&gt; When he's home, he want me to give him attention (listen to him, rub his sholders/back/feet, give him motivational speeches, give positive feedback, give him a peaceful space to work in). But at the same time he'll be making comments about what I should (on shouldn't) be doing with our son.\n\nThis!  This, right here!  How is that acceptable behavior??  That is a completely one-way relationship.  He EXPECTS you to rub his feet and give him motivational speeches?  That's bull.  I keep coming back to this thread when I should be working because this stuff makes me so angry.  It's one thing for you to decide you want to rub his feet and to help him relax but if he EXPECTS you to do that like it's your job then you're not a wife, you're a concubine.  You're a servant.\n\nYou are better than this.  You deserve someone who sees you as a partner, not as an employee.\n\nYou. Do. Not. Have. To. Take. This. Crap.  This is NOT normal.  This is abuse.  Get help, please!\n\n\n**EDIT:** And a few more things...\n\n&gt; Don't turn your back to him. \n\nWhat is he, a tiger?\n\n&gt; Don't let him eat that Cheerios on the floor. \n\nIf it's dry and the floor is dry, it's fine.  My daughter has eaten dirt before.  She's fine.  The stuff that'll make you sick is wet.  Bacteria lives in wet stuff.\n\n&gt; Why don't you listen to what I tell you the first time, so I don't have to keep repeating myself?\n\nDo you realize he's talking to you like you're a child?", "controversiality": 0, "created_utc": 1471014645, "distinguished": null, "edited": 1471015068.0, "gilded": 0, "id": "d6em35l", "link_id": "t3_4x81xc", "parent_id": "t1_d6elbmw", "retrieved_on": 1473365041, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "If you wanna talk about being a bad parent, check this out. Letting your kid stay in the living room by himself for an hour is nothing. \n\nhttp://www.wlwt.com/news/franklin-boy-tries-to-sell-teddy-bear-for-food-police-go-beyond-call-of-duty/41162218", "controversiality": 0, "created_utc": 1471018671, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ep8a7", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473366233, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Our couch is of normal height  :) Our son has fallen off it a couple times while I was sitting right there, but it wasn't when my husband was home. He was just giving me a scenario to consider.\n\nI should note here that my husband is a first responder and has seen many accidents where the parent was out of the room or turned their backs \"just for a second\" and their child was seriously hurt or even killed. How can I argue with someone who's trying to protect us from that happening?", "controversiality": 0, "created_utc": 1471019562, "distinguished": null, "edited": false, "gilded": 0, "id": "d6epxw1", "link_id": "t3_4x81xc", "parent_id": "t1_d6ehsh9", "retrieved_on": 1473366499, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "No. He doesn't think people who get babysitters are bad parents. He just doesn't trust babysitters, or most relatives. He's taken reports for victims of abuse by a babysitter and by relatives.", "controversiality": 0, "created_utc": 1471019902, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eq7mg", "link_id": "t3_4x81xc", "parent_id": "t1_d6ehwad", "retrieved_on": 1473366598, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you guys need couples counseling ASAP. I'm not going to tell  you to leave him or say with him, that's your call, but things are really not going well here at all and that concerns me, not only for you but for your son who's growing up seeing this stuff.\n\nIt definitely sounds to me like there's a keeping score aspect here and less of a we-are-a-team mentality. I heavily recommend the book *And Baby Makes Three* by John and Julie Gottman. There are short chapters, followed by quizzes you can take together. Your husband might not have any real clue of how bad his behavior is.", "controversiality": 0, "created_utc": 1471020216, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eqgob", "link_id": "t3_4x81xc", "parent_id": "t3_4x81xc", "retrieved_on": 1473366689, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "I think because your husband sees these things all the time he thinks they occur more often than they really do.  There are hundreds or thousands (possibly millions, if we include the whole planet) of kids playing by themselves that do not get these sorts of injuries.  If you were to somehow count all of the semi-unsupervised kids in your city/state that did not get injuries against the kids who did in the same time frame you would find that only a very small percentage got hurt.  \n\nBut your husband doesn't see those kids who are unhurt.  He only sees the hurt ones, so he gets the impression that the injuries are more common than they really are.  I work in tech support and people ask me all the time if our customers are generally happy.  I tell them I have no idea, because I only talk to the unhappy ones.  Happy customers don't call us up, and healthy kids don't go to your husband (or have him come to them, you know what I mean).\n\nKids get hurt.  Your job is not to insulate them from all harm, your job is to minimize the harm.  You put bumpers on table corners not to keep your kid from hitting his head on it but to keep that head-hit from needing stitches, for example.\n\nYour constant vigilance will not prevent injuries, and I bet the types of injuries your husband sees could either have been prevented by making sure the space was safe (for instance, making sure free-standing bookshelves are fastened to the wall) or happened so fast that a parent right next to them couldn't have prevented it.  You will drive yourself silly if you try to watch your kid every waking moment to prevent him from all harm.\n\nI said earlier that I stopped trying to grab my daughter when she began climbing up on the couch on her own.  I did that because I knew that once she could get up there on her own I would not always be there to catch her, so I stopped even trying.  And you know what, she's okay.  She's taken some good cracks on the carpet, but she's fine.\n\n&gt; How can I argue with someone who's trying to protect us from that happening?\n\nJust because someone has good intentions doesn't mean they're right.  What if he decided that the best way to protect your child was to get rid of all furniture in the house and just live with a plush carpet and padded walls?  He only wants to keep your kid safe, so how can you argue with that, right?\n\nKids need independence.  They need to learn their own boundaries.  They need to have the freedom to take risks.  There is a balance to be struck between safety and freedom.  Your husband doesn't see that balance.  I'm not even talking about YOUR mental health anymore - you will harm that kid long term if you hover over him all his waking hours.  Let him do his own thing, bump himself, and learn.", "controversiality": 0, "created_utc": 1471020782, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eqx2i", "link_id": "t3_4x81xc", "parent_id": "t1_d6epxw1", "retrieved_on": 1473366861, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "He did mention that my communication skills are lacking and that he doesn't feel like I'm truly listening to him anymore. He says he knows he repeats stuff a lot, but that's because it's important and it helps us stay motivated and on track. I guess I need to work on my reflective listening!\n\nHe does wish that I would come to him when I have a problem, instead of waiting for things to blow up. My problem is that I usually feel like things are going well until they blow up. Mainly it's after I randomly assume he'll help watch our son while I'm trying to do something and he feels like I'm dumping my responsibilities on him and making him feel guilty. But I'm just trying to catch a break!", "controversiality": 0, "created_utc": 1471020803, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eqxp7", "link_id": "t3_4x81xc", "parent_id": "t1_d6ekh80", "retrieved_on": 1473366867, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "So because someone's sister abused their kid that means all aunts are bad?\n\nThat's faulty logic, there.  Just because babysitters and relatives have abused kids doesn't mean ALL babysitters and relatives do it.\n\nHeck, kids have been taken away from their parents because the parents were abusive.  Does he not trust himself with his son because of that?", "controversiality": 0, "created_utc": 1471020900, "distinguished": null, "edited": false, "gilded": 0, "id": "d6er0iv", "link_id": "t3_4x81xc", "parent_id": "t1_d6eq7mg", "retrieved_on": 1473366895, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Toddlers NEED to be able to experiment and play independently in order to develop critical thinking and important motor skills. Your response could easily be that what he's asking you to do is to stunt your child's development.\n\nI can try to tell him this, but it's mainly a safety issue. He says it only takes a second for our son to hurt himself (perhaps fatally). Our living room is baby-proofed, but it still has a couch and toys and blocks and wood floors. All stuff he could potentially get hurt by. I have, in frustration, asked, \"What am I suppose to do? Tie him to a chair?\" and the response was \"No, you just need to watch him properly.\"", "controversiality": 0, "created_utc": 1471021290, "distinguished": null, "edited": false, "gilded": 0, "id": "d6erc8a", "link_id": "t3_4x81xc", "parent_id": "t1_d6du7to", "retrieved_on": 1473367016, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm going to save this for later. You've brought up a lot of good points I wouldn't have thought of on my own. :)", "controversiality": 0, "created_utc": 1471023041, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ess8w", "link_id": "t3_4x81xc", "parent_id": "t1_d6eqx2i", "retrieved_on": 1473367553, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I will definitely get this book. I'm always interested in new perspectives. Thank you!", "controversiality": 0, "created_utc": 1471023128, "distinguished": null, "edited": false, "gilded": 0, "id": "d6esutg", "link_id": "t3_4x81xc", "parent_id": "t1_d6eqgob", "retrieved_on": 1473367580, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow. That's terrible :( We are far from that, thankfully.", "controversiality": 0, "created_utc": 1471024946, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eud50", "link_id": "t3_4x81xc", "parent_id": "t1_d6ep8a7", "retrieved_on": 1473368140, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "Yeah, THAT is someone who is unfit to be a mother. You are just fine. ", "controversiality": 0, "created_utc": 1471025662, "distinguished": null, "edited": false, "gilded": 0, "id": "d6euxzw", "link_id": "t3_4x81xc", "parent_id": "t1_d6eud50", "retrieved_on": 1473368351, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Miett", "author_flair_css_class": null, "author_flair_text": null, "body": "What he's saying to you is not an answer, and it's designed to place blame on you when (not if) your son gets a bump or bruise.  Toddlers are MADE to be able to handle bumps and bruises.  They need to be allowed to experiment with balance and motor skills in a safe environment or they will be stunted in that area developmentally.  \n\nYes, there is some risk to kids when they climb and play, but they're flexible and resilient, and most bumps don't even bother them.  The benefits of free play FAR outweigh the few risks.  Children develop motor skills and coordination faster and more proficiently, they get the many health benefits of being active, and they actually learn better once they're at school age.\n\nThe other issue is that without learning how to balance and without building strength from climbing and playing, your son is a lot more likely to injure himself when he does get a chance to climb.\n\nIt was hard, but as my son got into toddler age, I had to stop myself from rushing over every time he tried to climb onto the couch.  Instead, I put a body cushion along the couch and just stood back.  He fell on the cushion a couple times (and missed it a couple times!) but he was having such fun being active that he didn't care.  Since then, he's really learned how to balance himself when he climbs up, and he never falls anymore.  What your husband is doing is taking away your son's ability to learn to play safely.  \n\nYou may want to look up some articles about the benefits of play and activities for children, particularly in allowing children to take small, reasonable risks in order to develop skills for later.  Pretty much every childcare professional in the world would disagree with your husband about his expectations for you when it comes to your son.  ", "controversiality": 0, "created_utc": 1471028986, "distinguished": null, "edited": false, "gilded": 0, "id": "d6exp0y", "link_id": "t3_4x81xc", "parent_id": "t1_d6erc8a", "retrieved_on": 1473369381, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Franr1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you need to think about things in the long run. Like are you really happy with where things are or where they are heading?  Something my mum said to me only this evening, is life is too short to be unhappy", "controversiality": 0, "created_utc": 1471029610, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ey7g2", "link_id": "t3_4x81xc", "parent_id": "t1_d6eizz7", "retrieved_on": 1473369572, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm saving this. Thank you so much! It makes me feel so much better and a little more relieved.", "controversiality": 0, "created_utc": 1471029766, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eybwi", "link_id": "t3_4x81xc", "parent_id": "t1_d6exp0y", "retrieved_on": 1473369619, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm generally happy with the way things are, it's just when we have these little hiccups that I get thrown off balance. My husband has said that it will get easier when our son can talk and he can take him out for awhile. I have been getting a lot of advice and support from other moms too.  :)", "controversiality": 0, "created_utc": 1471030163, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eynbq", "link_id": "t3_4x81xc", "parent_id": "t1_d6ey7g2", "retrieved_on": 1473369733, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Miett", "author_flair_css_class": null, "author_flair_text": null, "body": "Very best of luck to you!  You've got this!!  ", "controversiality": 0, "created_utc": 1471030304, "distinguished": null, "edited": false, "gilded": 0, "id": "d6eyre1", "link_id": "t3_4x81xc", "parent_id": "t1_d6eybwi", "retrieved_on": 1473369792, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Franr1991", "author_flair_css_class": null, "author_flair_text": null, "body": "That's the most important thing, that you are happy :) :) try and explain that he could perhaps be a little nicer with his words. It must be a little resentment towards him? It certainly does for me", "controversiality": 0, "created_utc": 1471031652, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ezu2a", "link_id": "t3_4x81xc", "parent_id": "t1_d6eynbq", "retrieved_on": 1473370192, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm glad to hear it. My husband and I had so many problems being clear about what we needed from each other and asking for help at a good time and in a good way. I had to swallow a lot of my pride and so did he. I think this book really helped us learn how we could to better.", "controversiality": 0, "created_utc": 1471038312, "distinguished": null, "edited": false, "gilded": 0, "id": "d6f4x3q", "link_id": "t3_4x81xc", "parent_id": "t1_d6esutg", "retrieved_on": 1473372097, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "odette_decrecy", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for giving additional information, and I'm glad you feel safe!", "controversiality": 0, "created_utc": 1471044682, "distinguished": null, "edited": false, "gilded": 0, "id": "d6f99ly", "link_id": "t3_4x81xc", "parent_id": "t1_d6eg2xj", "retrieved_on": 1473373705, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "amkuska", "author_flair_css_class": null, "author_flair_text": null, "body": "Also, in the 1950s you didn't helicopter parent your child. You kicked them out of the house for the entire day and let them back in only for food and water. Children didn't have 50,000 toys for you to continuously, non-stop pick up, assuming they were in the house to play with them. In fact, no one in the history of mankind has parented the way he wants until this generation.\n\nI'm not a stay at home mom. I work 40+ hours a week, do 99% of the at home child care, and 90% of the housework. When I get off work early, which happens from time to time I...\n\n*whispers*\n\nleave him at daycare and scurry on home to clean the house. I can get a weeks worth of cleaning done in 10 minutes without a small boy to help me. :) \n\nAs most everyone has agreed with here, the problem is definitely not your mothering or the housekeeping. You're just not a magical house elf. And really, even if you were perfect I doubt he'd be happy. This sounds a lot like stressed-out-and-over-worked to me. People under too much pressure are not themselves, and it sounds like he's got too much on his plate.", "controversiality": 0, "created_utc": 1471049594, "distinguished": null, "edited": false, "gilded": 0, "id": "d6fcdho", "link_id": "t3_4x81xc", "parent_id": "t1_d6egyet", "retrieved_on": 1473374851, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "I kept thinking about this thread all weekend.  I hope you post updates over whether things are getting better.\n\n&gt; I went into our marriage knowing he was going to be the head of the family.\n\nYou know that the whole \"head of the family\" thing is an outdated idea?  People in the family can have different roles like \"breadwinner\" and \"housekeeper\", but the term \"head of the family\" implies that he's in charge of you.  That's not the way it should be.  I'm the breadwinner in our family and my husband is the housekeeper, but our relationship is a partnership.  I'm not the \"head\" of him.  He helps me out when I've had a bad time at work, and I help him out when our daughter has been a handful all day.\n\nYour relationship will serve as a model for your son.  Perhaps the way you've represented your husband to us is making him look worse than he is, but if not you should think about what lessons he's going to be teaching your son.  How will your son treat his wife some day?  Will he be a partner to her?  Or will he expect to be in charge.\n\nAlso, I re-read your initial post:\n\n&gt; Since one-third of the work he does is at home, I just wanted him to watch our son while I wash dishes or put away laundry or take a phone call from my mom on my birthday -- but that is asking too much. He's doing the work of four people and can't be distracted.\n\nWhile it's not unreasonable for him to watch your son for a few minutes at a time while you do those things, if he's working from home that's a different story (unless \"working from home\" means \"on call\" where he's not actively doing anything).  I've had to work from home on occasion, and when I do, I usually lock myself in a room or my husband takes the baby out of the house.  If he's got actual work to do then he probably needs to give his full attention to his work.\n\n&gt; ...introduced me to another young mother he works with...\n\nDoes this other mom have a car?  Have you talked to this mom about doing \"baby exchanges\"?  I.e. for a day or a period of hours one of you takes both kids and the other one does whatever they want/need, then next week/day the other mom takes both kids?  Maybe she'd even let you borrow her car, if you get along well enough.\n\nThis type of thing is how \"millions of women do this without problems\".  They share the burden.", "controversiality": 0, "created_utc": 1471255936, "distinguished": null, "edited": false, "gilded": 0, "id": "d6i4tcw", "link_id": "t3_4x81xc", "parent_id": "t1_d6ejer2", "retrieved_on": 1473412891, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ISFJthrowaway", "author_flair_css_class": null, "author_flair_text": null, "body": "Hello! We were out of town for the weekend (on business), so I was unable to get on Reddit. Things are much better now since I posted. It was our first \"big fight\" and I was frustrated, confused, and looking for answers (perhaps justification) when I made the post, so I will admit that there is a slight bias.\n\n&gt; You know that the whole \"head of the family\" thing is an outdated idea? \n\nI do. I know a lot of people don't like the idea, but I like having someone in charge and making decisions. I'm not sure if it's because of how I was raised, but I've always been a supporter/follower. My step-mother was very much the head of our family and we all stepped to her tune (and for me that meant staying out of her sight). I didn't learn very much about how life works outside of school. Even now, to be super honest, I'm not sure how to make decisions for house or our son except for what I read in books or on the internet. My husband is trying to help me learn to handle things myself without relying on someone to come do it for me.\n\n&gt; I usually lock myself in a room or my husband takes the baby out of the house.\n\nHe does have \"an office\" in the bedroom, but he prefers to use the kitchen table and to do his calls and paperwork while we're all together. I have suggested, if he needs a less-stressful place to work, to please take himself to a coffee shop or something, but he'll say something like, \"But then I'll never see you guys.\" And it is true that it seems like he's *always* working, so breaks are far and few between, for both of us. \n\n&gt; Does this other mom have a car? Have you talked to this mom about doing \"baby exchanges\"? \n\nShe does! And this is one of the best, most helpful suggestions I've ever heard. (I would have never thought to ask.) I think I will bring it up to her this week. I know she has help when she goes to work, but she's also planning on continuing her education online. Although we are still getting to know each other, it *could be* something we both need. \n\n&gt; This type of thing is how \"millions of women do this without problems\". They share the burden.\n\nThis part really sums everything up. I love it and I want to frame it!\n\nAlso, thank you of following up with this. I didn't know I would get so much support from strangers. :)", "controversiality": 0, "created_utc": 1471276578, "distinguished": null, "edited": false, "gilded": 0, "id": "d6if3ko", "link_id": "t3_4x81xc", "parent_id": "t1_d6i4tcw", "retrieved_on": 1473416698, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Merkuri22", "author_flair_css_class": "black", "author_flair_text": "working mom of 2yo", "body": "&gt; I like having someone in charge and making decisions.\n\nThat's understandable, but if you completely hand the keys of your life over to another person you may not like the direction he/she takes you in.  I'd really recommend that you try to stand up for yourself and insist on your marriage being an equal partnership.  It's okay to cede control when something is going on that you don't feel like you know how to handle or you don't have an opinion on, but you should make it clear to your husband that when you do have an opinion that *it matters*, and that he needs to listen to you.\n\nYou also need to try to trust your gut.  It seems clear from your posts that you are with your son much much more than your husband.  When it comes to child-raising, *you* should be the \"head\" of that department.  *You* are the one who is with your son all day.  *You* see how he interacts with his environment and how he is developing.  *You* should be the one who judges whether it's safe to leave him alone for a bit or whether he'd deal well with having a \"stranger\" watch him for a few hours.  Your husband should certainly feel welcome to voice his opinions and you should take them into account, but he should not be *telling* you what to do with your son while he's at work, and he should not be making you feel bad about what you're doing if your son tends to be happy and well-adjusted.\n\nI know you say you don't know how to make decisions for your son, but trust your gut.  Your mother's instinct is strong.  I learned with my daughter that if you ask a question about child-rearing you will get a hundred different responses, many of which will be directly contradicting each other.  I learned to go with my gut, with what felt right.  \n\nThey tell you to make sure to tell you pediatrician if you feel anything isn't \"right\" with your child because you're with the child all day and the pediatrician is only with the child for a few minutes.  A lot of problems are noticed by the parents, even though they don't have a medical degree, and if they don't speak up to the pediatrician then serious problems can go undiagnosed.  The same goes for normal parenting, too.  Even though you don't have a \"parenting\" degree, you can usually tell when something is not right with your child since you're with him all day.  Learn to trust yourself.\n\nFor example, if your husband tells you you shouldn't turn your back on your child or leave him unsupervised for a few minutes, your gut tells you this is okay (otherwise you wouldn't have done it).  It's okay to trust that instinct.  Your husband doesn't see your son as much as you do.  He may not realize how capable your son is of entertaining himself and judging his own safety (assuming the space is safe, of course).\n\nSomething I've been thinking about... you said in another post somewhere that you only feel stressed when your husband is home.  Have you told him this?  \n\nMy husband and I have a very open policy.  If one of us does something that the other one is uncomfortable with, we speak up.  It doesn't matter how small the issue or how justified we feel about it.  We both know that if we keep issues bottled up inside it only makes things worse.  We've had some tear-filled conversations like that, but once it's over and we both understand how the other feels there's a freedom there.  At worst, we don't have to keep dancing around the issue, and at best one or both of us changes our behavior so that the problem goes away (or is at least lessened).  \n\nIf you get problems out in the open it may start with hurt feelings, anger, and frustration, but that's the first step to a solution.  Think of it as cauterizing a wound.  You need to endure that pain in order to heal.\n\nIf you have a problem confronting him, write down your feelings and give him the note (or send him an email).  Make sure you talk about how his actions make you feel.  Try to acknowledge his point of view, if you can, but don't compromise your own position.  For instance, you can say you know he's only concerned for you son and you know he's very stressed with his job currently, but his constant criticism of how you handle what is essentially your job is causing you stress and pain.  Maybe tell him you're willing to listen to his advice, but that you'd really appreciate it if he'd tone it down so that it's *constructive* criticism, and not just criticism.  Maybe even ask that if he wants \"motivational speeches\" and support in his work, you'd like the same - because raising a kid and keeping up a household is as much \"work\" as what he's doing.  Everyone likes being told they're doing a good job once and a while, and if all you hear from a loved one is criticism it's going to hurt.\n\nBe ready to talk about the letter after you've given it to him, maybe after he's had some time to digest it.  At some point you have to do these things face-to-face, though a letter to start it off makes it easier to establish your position without giving him an opportunity to interrupt with his own point of view.  You both should hear *all* of what the other has to say first, and then you can discuss it.\n\nHe may not realize what he's putting you through, emotionally.  He may be so caught up in his own work problems and the financial problems of the household that he hasn't stopped to think what his words have been doing to you.\n\nEdit: Typo.", "controversiality": 0, "created_utc": 1471279417, "distinguished": null, "edited": false, "gilded": 0, "id": "d6ih9l9", "link_id": "t3_4x81xc", "parent_id": "t1_d6if3ko", "retrieved_on": 1473417517, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}