{"submission": {"author": "smal0ney", "author_created_utc": 1471297906, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_10jpli", "created_utc": 1471301531, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/4xwbrw/terrified_of_labour_help/", "gilded": 0, "id": "4xwbrw", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 66, "over_18": false, "permalink": "/r/Mommit/comments/4xwbrw/terrified_of_labour_help/", "retrieved_on": 1473049229, "score": 44, "secure_media_embed": {}, "selftext": "Hello. I'm calling out to all women who have bore a child. I am currently 32 weeks pregnant and absolutely terrified of labour. Every time I think about it I get the worst feeling in the pit of my stomach and I honestly can't convince myself thay I can do this. If anyone has tips or anything to say that will boost my confidence it would be amazing. Thanks.", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "terrified of labour. HELP.", "url": "https://www.reddit.com/r/Mommit/comments/4xwbrw/terrified_of_labour_help/"}, "comments": [{"author": "iamcakebeth", "author_flair_css_class": null, "author_flair_text": null, "body": "About 6 months in with my first I decided I'd changed my mind and didn't actually want to have a baby after all. Unfortunately it doesn't work that way. \n\nTowards the end you will be so unbelievably uncomfortable that the process of getting the baby out will be less unpleasant than living with the baby still in. And if not, well, that's what epidurals are for. There aren't childbirth awards if you do it drug free. \n\nAlso, take a childbirth prep class.  They'll walk you through the process and give you pain management techniques you can practice at home. ", "controversiality": 0, "created_utc": 1471303798, "distinguished": null, "edited": false, "gilded": 0, "id": "d6izo1r", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473424128, "score": 77, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hannahbell87", "author_flair_css_class": null, "author_flair_text": null, "body": "The thing the helped me most was reading birth stories on birth without fear's Facebook page. It showed me so many ways to give birth. It calmed me and let me know it was all going to be alright. I started telling myself that I'd be able to do this. It's what my body was designed to do. It was still scary, but it did help a lot. ", "controversiality": 0, "created_utc": 1471303799, "distinguished": null, "edited": false, "gilded": 0, "id": "d6izo2r", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473424128, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BrendaEGesserit", "author_flair_css_class": "green", "author_flair_text": "J 7/08, P 1/11, B 3/14", "body": "What worked for me was remembering that every human mother back to the dawn of time has done it, not to mention every other mammal mother- and many of them birth litters! I'm not a crunchy/granola mother, but knowing it's perfectly normal and natural to birth a child was remarkably reassuring to me.", "controversiality": 0, "created_utc": 1471304297, "distinguished": null, "edited": false, "gilded": 0, "id": "d6izzpf", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473424242, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "askwhy423", "author_flair_css_class": null, "author_flair_text": null, "body": "I always recommend reading Ina May's guide to childbirth to first timers. It covers birth stories and everything that happens during birth. I found that knowing everything helped me focus on helping my body do what it was doing. My labor ended up being a 10 hour non-event, I have a list of things that hurt worse. My biggest thing was being so tired, I went into labor right as I was going to sleep so no rest for us. A spoon full of honey helped greatly though. Most of all, start with positive words to yourself!! Half of the battle is mental, so you have to be prepared. You can and you will have a baby! Think of the little engine that could, you can, you can you CAN! ", "controversiality": 0, "created_utc": 1471306916, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j1q2x", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473424856, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SecretNameIsSecret", "author_flair_css_class": "lightcoral", "author_flair_text": "Two Girls! 6, 4 years!", "body": "For me, it was the realization that women have been having babies for... well, *ever*. Also, that it's okay to let medical science help you through your birth if that's what you want. That's what offered me the most comfort. MOST IMPORTANTLY (sorry, didn't mean to yell) it's your birth. **Yours**.  You get to choose if you use a midwife or not, if you give birth at home or not, if you use a tub or not, if you get an epidural or not. Don't let the stress of the activity outweigh the outcome!! A *baby*! \n\nAfter my eldest was born I said, \"I'm really glad that she's here, but I never want to do that again.\" \n\nThen I had one more. \n\nYou can do the thing!", "controversiality": 0, "created_utc": 1471307237, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j1xuw", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473424931, "score": 29, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "unclegrassass", "author_flair_css_class": null, "author_flair_text": null, "body": "So labor doesn't start out as unbearable pain. It starts out as being uncomfortable/antsy/or just plain off. There was, at least for me, a pretty instinctive feel about it. I know that I needed to do something, I just didn't know what. The feelings build as the contractions do, they taper and then surge back. As things progress you will find yourself in pain. But my body didn't register it was pain. It just felt like this giant wave of pressure that I had to bear through. Once my waters broke and I was pretty far into labor, 7cm, it started to hurt. My son was sunny side up and his fat head got stuck on my pelvic bone. \n\nMy body was working overtime to turn him and every contraction pushed him against me, which felt like someone pushing my lower body in half, outwards. This is where I tapped out and asked for an epidural. But, I was having twins and I knew I couldn't give birth twice with how hard my body was working. The epidural helped me relax and then the real work started. Pushing was an enormous effort, not pain but sheer exhaustion. It felt like I had just run a marathon and now someone was forcing me to climb a mountain. When he was actually born it was such a relief just because I could finally rest. And then do it all over again 20 min later! Point being, you can do it. It isn't like being stabbed or shot or maimed. It's like your body flipping it's self inside out. It will hurt but not as much as you think. It will be absolutely exhausting but you are strong enough to do it. ", "controversiality": 0, "created_utc": 1471307381, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j21a5", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473424964, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Zephurr", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my first without pain meds and I didn't think it was so bad! I was open to anything going in and didn't do any special prep and was pleasantly surprised at how manageable It was for me. I'd put it at 8/10 on the pain scale.\n\nIt felt like...really bad intestinal cramps. Like when you get this awful twinge in your gut and you know that later you're gonna have a big problem but right now you just gotta suck it up until it's showtime. It's like that except that you're screaming, pooping, and vomiting.\n\nIt became all mental once the contractions settled into every two minutes. Watch the clock for two minutes, breathe/count for one minute then rest. When transition ended, it didn't hurt at all anymore, I just had to push.\n\nThe ring of fire wasn't great, but I didn't feel much. I had a minor tear on a sensitive part of my anatomy that I had no idea had happened.\n\nThe worst part was afterwards. I had a blood clot in my uterus and the doctor had to scoop it out with her hand...with no pain meds...right after having a baby. 10/10 don't recommend", "controversiality": 0, "created_utc": 1471308452, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j2r2l", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473425222, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "chefymum", "author_flair_css_class": null, "author_flair_text": null, "body": "It is terrifying and you will probably have moments of panic about it until it happens. Lean on your partner or whoever comprises your support system and don't expect everything to happen according to plan. ", "controversiality": 0, "created_utc": 1471310200, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j3xdi", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473425635, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yw1", "author_flair_css_class": null, "author_flair_text": null, "body": "Once you hit 36 weeks you will start to get really uncomfortable and may begin looking forward to labor because you get to be done being pregnant!!  \n\nIt's not horrible, really.  It sucks, but I had a doc who epiduraled me up good as early as I wanted, and I watched crappy morning TV while waiting to be completely dilated.  My 10lb baby was born in under 5 min, painless thanks to the epi, no tearing.  Easy.  \n\nYou are afraid of the unknown, but for every scary birth story, there are 10 boring uneventful ones.  You'll do great.  Go get a massage, get your nails done, enjoy your last trimester!", "controversiality": 0, "created_utc": 1471311847, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j507u", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426015, "score": 17, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an induction at 37 weeks. Inductions are suppose to be more painful than a natural labor. At that, I couldn't have any drugs due to a medical issue. \n\nMy labor was surprisingly fine. It took 6 hours and he came out without any tears. Contractions were fine until 4cm, then they broke my water which gave me a shitload of relief because the water added a lot of pressure. After that, my contractions came every few minutes and I was able to *understand* them. They felt like a ball of energy right in my lower abdomen. My contractions didn't radiate or anything, so it was just to the one area. When they were over I fell asleep for a few minutes. \n\nHeating pads were a god send. They were able to reduce any feeling of contractions by  *a lot*. You have to understand that any \"pain\" during labor isn't a pain from being injured, it's a pain with a goal. Contractions aren't very terrible. It's very very important to go in with a very positive mindset, and don't allow anyone to say negative things. I kicked my MIL out because she made negative comments about the pitocin, and I only wanted positive vibes. \n\nPushing doesn't hurt, so don't be afraid of that. Pushing is very reliving. When you push, you don't feel the contractions and there's no feeling below (perhaps due to adrenaline...I don't know why). Once the baby is out, it's completely and totally over. \n\nI had the worst fear of labor to the point where I took birth control all my life and had anxiety attacks just thinking about it. I worked out a lot during pregnancy and watched my weight in order to have a little personal control over things like having high blood pressure (which can be caused by excessive weight gain during pregnancy). \n\nI went into my labor knowing that everything would be nothing but peace, and no drama. Do not be afraid to kick people out who are making comments like \"glad I'm not giving birth\" or \"this is why I don't want kids\". ***NOTHING BUT POSITIVE ENERGY***. \n\nMy labor took 6 hours, and I had no tearing. Also, When I had contractions I breathed in very deeply and rocked my hips. Towards the end, I allowed myself to have a few screams which felt nice. But save those screams for the end. Contractions are NOT bad. Contractions are NOT scary. Labor was so good that I'm excited to get pregnant again, and this is coming from a rape survivor who has a lot of anxiety and fear about everything.\n\nYou can do this. But again, ONLY POSITIVE PEOPLE ALLOWED.\n\nEdit: just answering OPs question what's with the downvotes?", "controversiality": 1, "created_utc": 1471312367, "distinguished": null, "edited": 1471315670.0, "gilded": 0, "id": "d6j5cek", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426133, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1471312557, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j5gzs", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426177, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "trixiepixiegirl", "author_flair_css_class": null, "author_flair_text": null, "body": "You can do this!\n\nIt may be long and it may hurt, but your body was literally made to do this thing you're doing!\n\nAfterwards you get a little squishy person to love, even when they crap and puke all over you you love them!\n\nDeep breaths, it'll be okay. \n\nI was frantic for my epidural, they even gave me another pain killer to take into I could get my anesthesiologist to show up because my pregnancy was pure hell and they could tell I was miserable. (Literally the only positive thing about my pregnancy was that I only gained weight in my belly although it was heavy as hell gaining 70lbs in my mid section) If you need medical intervention, get it and don't let anyone shame you or make you feel like you are somehow less than any other mom because you took meds to help. \n\nYou'll do great, deep breaths (again) \nAnd read anything you can about births (I suggest not reading about others' traumatic births, it'll just make things more stressful; which is why I'm not talking about mine)", "controversiality": 0, "created_utc": 1471312621, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j5ihu", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426193, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "00youdontknowme00", "author_flair_css_class": null, "author_flair_text": null, "body": "Friend, I have had two drug free child births. The most hard and amazing things I have ever done. Here are some quotes that bring me to tears about childbirth from Jan May Gaskin.\n\nI BELIEVE THE ACT OF GIVING BIRTH TO BE THE SINGLE MOST MIRACULOUS THING A HUMAN BEING CAN DO AND IT IS SURELY THE MOMENT WHEN A LOT OF WOMEN FINALLY UNDERSTAND THE DEPTH OF THEIR POWER AND CONNECTION TO ALL OF NATURE.\n\nYOU THINK IT CAN’T POSSIBLY BE DONE, YOU THINK YOU CAN’T POSSIBLY TAKE THE PAIN, AND THEN YOU DO — AND AFTERWARD YOU LOOK AT YOURSELF IN A WHOLE NEW WAY. IF YOU CAN DO THAT, YOU CAN DO ANYTHING.\n\nCheck out the books on this subject by Ina May Gaskin. She’s one of my great heroes.", "controversiality": 0, "created_utc": 1471312864, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j5o5i", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426248, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pajamist", "author_flair_css_class": null, "author_flair_text": null, "body": "I was so terrified of labor I would shake when I thought about it.  I went to birthing classes and watched YouTube videos of birth to try and prepare. I don't know that it made labor/birth any less scary, though. But once I was in labor, it's like some other part of my brain just took over and all I could think of was the moment and getting through it. Like I didn't have time to be scared I was busy focusing on my body and what was happening. And then it was over and we were ok.  \n\nI thought pushing would be painful, but it actually gave a little relief. I don't know about others, but as soon as my son was born I felt great! (A rush of endorphins, probably!) It wasn't til the next day I was a bit sore, but it was very manageable.\n\nDon't get me wrong, the pain of labor was intense, but not as horrific as I imagined. I did opt for an epidural after a point, but thinking back, the pain of it isnt really what I remember. I picked a hospital close by and where I felt safe, so I think that helped me feel prepared, too.", "controversiality": 0, "created_utc": 1471313130, "distinguished": null, "edited": 1471472404.0, "gilded": 0, "id": "d6j5umo", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426311, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Amycado", "author_flair_css_class": null, "author_flair_text": null, "body": "Read Ina May Gaskin's \"Guide to Labor\". The first half of the book is full of positive birth stories. It's good to read and understand that everyone has a different experience with birth. The second half of the book covers the more technical aspects of pregnancy, labor, delivery and postpartum. You'll learn about what you body is doing, how your hormones are working and a lot of tips and techniques for helping your body give birth - even little things like keeping your mouth and jaw loose (can't keep a tight mouth and a relaxed bottom). A lot of labor is a mind game and using positive language (while seeming stupid) helps tremendously as well as using visualization to help dialate.  It's a great and empowering read", "controversiality": 0, "created_utc": 1471313298, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j5yqa", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426350, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MickiRee", "author_flair_css_class": null, "author_flair_text": null, "body": "You'll do great! I was terrified as well. But it really wasn't so bad. Woke up in the middle of the night to gas like pains. Went to pee and found a mucus plug. So onto the hospital we went. It was our induction day anyways. Get all set up about an hour in a kind nurse asks if I'm in any pain. I say a little so she gives me Demerol. Then I slept for 3 hours. Woke up had my waters broken. Got given pitocin and an epidural and had 7 uneventful hours watching tv til it was time to push. The epidural was so easy too. Guy came in told me to pay attention to the nurse and just relax. She had me all cracking up and giggling. Finally I said okay I'm sorry I'll be still and he was done. Didn't feel a thing. Those guys know what they're doing. All in all not a bad experience. Pushing was the worst. But that's more just exhaustion than pain lol. ", "controversiality": 0, "created_utc": 1471314183, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j6jiy", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426554, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ttoc", "author_flair_css_class": null, "author_flair_text": null, "body": "The anticipation of the event is the worst. Once it's happening, you're just kinda in the moment and you get through it. I was terrified of childbirth too and I survived my pregnancy by not trying to dwell too much on the birth part. I always knew that I would opt for a medicated birth because I know I don't handle pain well and I didn't want a traumatic experience if it was not necessary. I know there's a lot of guilt out there from certain communities about choosing a medicated birth, but it is really not harmful to the baby, especially if you go the epidural route. I loved my epidural. It turned a painful and scary experience for me into a nice relaxed labour. I ended up needing a c-section anyway (not a complication from the epidural though- my baby was just positioned incorrectly to fit through my pelvic opening and attempts at turning him were unsuccessful) and I was glad in the end that I didn't make myself a martyr during my long labour for a birth that needed to be medicated in the end anyway. ", "controversiality": 0, "created_utc": 1471315390, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j7bem", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426828, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "uwfan27", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an unmedicated childbirth (and i hired a doula ahead to come with me to the hospital to help me and my husband). I had a great birth! Contractions come and go so you get breaks in between the hard parts. I always tell people that it was the worst pain I've been in but not the worst pain I can imagine. A thing to remind yourself that it isn't bad pain... We always associate pain with something bad, but in childbirth the pain means your body is doing its job! Definitely take a childbirth class (really any kind, the one they offer at the hospital are really convenient) and educate yourself about what your body will be doing in the BIG DAY so you can focus on what you need to do vs what may be going wrong. FWIW I'm pregnant with my second and am really looking forward to having an unmedicated birth again! ", "controversiality": 0, "created_utc": 1471315576, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j7flu", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426869, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RegularOwl", "author_flair_css_class": null, "author_flair_text": null, "body": "Epidural: 10/10 would do again. After it kicked in I didn't feel anything. I didn't want them to take it out after she was born :-/", "controversiality": 0, "created_utc": 1471315587, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j7fue", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426872, "score": 23, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dropastory", "author_flair_css_class": null, "author_flair_text": null, "body": "What kind of childbirth preparation are you doing? Some childbirth strategies have fear-releasing work built in, which sounds like it would be really helpful for you. I did hypnobabies, which was awesome for me. 32 weeks isn't too late to start, but I would try to start ASAP. Hypnobirthing is another similar preparation technique. I've been to a few hypnobirthing births and they were quite peaceful. \n\nI had a wonderfully positive birth experience and immediately after pushing out a 10 lbs baby without medication I said \"that was amazing, I could do that again!\" \n\nHave you talked with your care provider about your concerns? They might be able to refer you to someone you can talk to. \n\nPM me of you want more information on different childbirth prep techniques. There are lots of options. \n\nYou can do this, but it is important to find a way to let go of your fear, stay calm and relaxed as much as possible through the process. Let your body do the work it was made to do. ", "controversiality": 0, "created_utc": 1471315982, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j7or7", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426960, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ScrabblerNYC", "author_flair_css_class": null, "author_flair_text": null, "body": "Read Ina May's Guide to Childbirth! ", "controversiality": 0, "created_utc": 1471316086, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j7r5x", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473426986, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sophiatops", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt the same way with my first baby - I got more and more anxious thinking about the birth the closer I got. My husband and I went to a one-day birth prep class at our hospital but didn't do much to make me feel better or worse.\n\nAs you can probably tell by reading all the comments, every birth is different but mine was over before I knew it (or at least that's how it felt.).  My water broke two weeks before my due date and we went to the hospital right away. In hindsight the whole experience felt quick but we went in the morning and my son was born around 5pmish.  The contractions didn't feel horrible until hours into my time at the hospital and after I got the epidural.....I pushed two times and it was over. Anything that happened after I had my son was an absolute blur.\n\nI really really hope that this time goes as smoothly as the last time. I guess the biggest take away from my experience was that I was so caught up in the moment that I never even had time (or the mental capacity) to think about half the details I worried about beforehand. Hang in there and try to keep seeing your due date as your Independence Day from being pregnant haha! ", "controversiality": 0, "created_utc": 1471316196, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j7tna", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427009, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WaffleFoxes", "author_flair_css_class": null, "author_flair_text": null, "body": "Had no drugs, would do it what way again but don't judge the epidural or c section group.\n\nThe best thing my midwife said for me was when I gasped \"I can't do it!\" She said Well, sweetie....you also said that 10 minutes ago but look!  You're still doing it!\"\n\nLike, no amount of pain is going no to stop the minutes from moving forward or the baby from coming.  Makes it seem scary but it helped me", "controversiality": 0, "created_utc": 1471316602, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j82py", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427099, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "eatingaboook", "author_flair_css_class": null, "author_flair_text": null, "body": "YES I came to say this. The first chapter with the positive birth stories, especially important. So wonderful. ", "controversiality": 0, "created_utc": 1471316734, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j85k2", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j7r5x", "retrieved_on": 1473427127, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "peaches671", "author_flair_css_class": null, "author_flair_text": null, "body": "The second thought after finding out I was pregnant was the reality I would have to push this baby out! That fear stuck with me the entire pregnancy. The night I went into labor I was in pure denial. By the time I got to the hospital I was 7cm. First thing I did was get the epidural and I was so happy I made that choice. Labor wasn't as scary after that and even though I was so tired from pushing, I didn't have to deal with any of the pain I was so worried about. Drugs worked for me, do what you think will work for you because labor is only the beginning. Congrats momma!", "controversiality": 0, "created_utc": 1471317148, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j8ewv", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427218, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "esmereldas", "author_flair_css_class": null, "author_flair_text": null, "body": "Mom of 3 kids.   Get an epidural.   Once you get the epidural,  labor is not a big deal.   Some advice about epidural,  if it doesn't take away your pain,  ask the anesthesiologist to reposition it.   It makes all the difference in the world.  Some people are scared of needles,  but I didn't think the epidural was a big deal.   ", "controversiality": 0, "created_utc": 1471318182, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j917s", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427435, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ScarlettHouse", "author_flair_css_class": null, "author_flair_text": null, "body": "This is a big piece of the picture that helped me, too.  Humans seem to be the only species (and recently) that have turned labor and delivery into an event.  Every mammal on the planet gives birth.  We're not even that special.  In the same vein, it helps me to think sort of scientifically about the process and the pain involved.  The contractions aren't just pain, they're work.  It hurts, but, as others say, it doesn't generally come on all at once.  It's really gradual.  And it helped me to picture the muscles all pulling up around to the top of the baby and then pushing the baby from above.  I don't know why, but that mental image works for me.  I also did a lot of \"visualizing\", especially with my induced labor (FYI pitocin makes a less \"real\" labor and feels kind of out of control, at least for me).  My teacher in the birthing class had talked about visualizing a location that was soothing, like a beach.  I couldn't think that deep in the moment and ended up just visualizing petting my cat.  It moved my mind to a different place and seemed to help.  Now, when MY first was born, the first words out of my mouth were \"well I could do THAT again\".  And I did.  We're expecting number five any day now.  You can do it!\n", "controversiality": 0, "created_utc": 1471318400, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j95vs", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j1xuw", "retrieved_on": 1473427480, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "toastandpeanutbutter", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't worry, something clicks at the end and suddenly you won't want anything else except to have the baby! It really wasn't so bad. I took spa music with me and it helped a lot. ", "controversiality": 0, "created_utc": 1471318692, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j9bzs", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427540, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CharistineE", "author_flair_css_class": "blue", "author_flair_text": "Boy, 7/2015", "body": "Its really not so bad. I had an un medicated natural birth and yes, it hurt, but its a funny kind of pain. I'm used to something like breaking a bone where it hurts for a long time, slowly hurting less over time.\n\nNot labor. It hurts and then is immediately gone. Hurts again and is gone. No residual hurt between contractions.  It makes it much easier to get through it.\n\nJust know that every mom who ever existed has been through it- it cant be so horrible or we would have died out as a species.  :-)", "controversiality": 0, "created_utc": 1471318904, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j9gen", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427584, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "slabsquatthrust", "author_flair_css_class": null, "author_flair_text": null, "body": "Yesssss, I felt the same exact way. ", "controversiality": 0, "created_utc": 1471319232, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j9ndb", "link_id": "t3_4xwbrw", "parent_id": "t1_d6izo1r", "retrieved_on": 1473427652, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Axenus", "author_flair_css_class": null, "author_flair_text": null, "body": "What helped me was knowing it's what I was buit for. Yeah it hurts but not so bad you'll pass out from it or anything. I've had a headache that was worse than labor honestly. So it sucks but it goes by fast and once it's done you get a baby and you probably won't even remember the pain. You can do this, it's not so bad!", "controversiality": 0, "created_utc": 1471319527, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j9tjk", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427714, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not sure why you were downvoted; your experience of labor is certainly valid, and was well-described. I would only add that everyone's experience is different. I'm trained as a doula and have given birth twice, out-of-hospital and without pain meds. My labors were... not what you described. For one thing, they lasted 28 and 20 hours. The contractions -- for me -- were extremely painful and at one point I even begged for an epidural (yes, in my living room. I wasn't thinking clearly). But even so, if I were to have another child, gods forbid, I'd do it at home again. The tradeoff of being able to immediately go to sleep in my own bed  afterwards was just worth it to me. No matter how bad the pain is, it's over soon enough. \n\nYou're absolutely right though about banishing negativity. Heck, I even banished my own doula at one point when we weren't on the same wavelength. (And that too was over soon enough. Everything is temporary.)", "controversiality": 0, "created_utc": 1471319570, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j9ugj", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j5cek", "retrieved_on": 1473427724, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1471319570, "distinguished": null, "edited": false, "gilded": 0, "id": "d6j9ugw", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427724, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "whosparentingwhom", "author_flair_css_class": null, "author_flair_text": null, "body": "Things that made me feel better before the birth of my first:\n\n1 - Remember that a great majority of women have kids at some point, so if they can do it so can you (lots even decide to do it more than once so it can't be that bad)\n\n2 - There are lots of options for pain management.  Epidurals are magic.\n\n3 - Pain is temporary. Just get through it hour by hour, minute by minute and soon it will be a distant memory. ", "controversiality": 0, "created_utc": 1471320375, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jaakb", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473427882, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "You've got this! Like you, I was TERRIFIED of labor. I have an extremely low pain tolerance and do not do well at all with discomfort of any kind. But labor was bliss. It truly was. Contraction were very light at first and slowly got more and more noticeable. Then the pitocin came and after 1 strong contraction I called for the epidural. I endured 2 more then didn't feel anything after that. I was only 2 dialated and while that was really really soon to get an epi it was the BEST choice for me. After my epidural I was bed ridden so I just Layed down and relaxed. I closed my eyes and daydreamed about my baby. Hubs had made me a special photo album of cute pictures of my cat and it gave me the warm and fuzzies, I napped.. The hours in bed were actually nice and gave me energy for pushing. That was the best part. Since I felt no pain i remember smiling through some of the pushes. I just felt so strong and empowered and excited to meet my baby. Then the moment he came out.. Pure bliss! Not everyone would be cool with spending so much time in bed while in labor but for me skipping out on the pain side allowed me to really enjoy the experience. You're gonna do great!!", "controversiality": 0, "created_utc": 1471321000, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jamrk", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428020, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "californialimabean", "author_flair_css_class": null, "author_flair_text": null, "body": "I worked myself up over laboring with my first; she was breech and I had an emergency c-section after contracting for 18 hours. I worried for nothing!\n\nWith my second, I was way more relaxed. I knew what contractions felt like (they hurt like hell) but I also trusted my body...I knew that the baby was coming out one way or another. I had a fantastic VBAC.\n\nGiving birth vaginally was so amazing. Yes, there's pain, but I was 100% open to an epidural. \n\nYou can prepare yourself for every scenario, but you won't be at peace until you're \"in it.\" \n\nLet me put it this way, the labor is temporary, the parenting part is what's hard.  Enjoy your pregnancy!", "controversiality": 0, "created_utc": 1471321455, "distinguished": null, "edited": false, "gilded": 0, "id": "d6javkj", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428108, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dstam", "author_flair_css_class": null, "author_flair_text": null, "body": "I've had three, I remember being nervous about it every time. What helped me was educating myself as best I could on what to expect. What's funny is that when I was in it I wasn't really scared at all, just using all my energy to get through it. You will go into your animal mode once you're in labor, you can do this!!", "controversiality": 0, "created_utc": 1471321572, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jaxtk", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428131, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lolyssa", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't worry about the pain. If you're getting an epidural, you'll be fine. Besides, you forget it all when you see your baby for the first time. My daughter is 8 now and I can still remember being in labor, however I don't regret going through it and I wasn't traumatized by it either. We're women, our body's were built for this. Our pain tolerance is higher than men's for a reason. You'll be fine. :)", "controversiality": 0, "created_utc": 1471321672, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jazn6", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428149, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Alexis224", "author_flair_css_class": null, "author_flair_text": null, "body": "I've given birth twice - the first time with an epidural, the second with no pain relief (not intentionally, long story). I remember being scared of labor the first time - it is scary because no one can explain it for you - it is an entirely new bodily experience. I labored for a few hours until the pressure was enough that I couldn't really talk during a contraction (I know that sounds really terrible, but it is not - it's just intense pressure...pain not the right word...) then I got an epidural and my hubby and I got to sit calmly and watch my labor progress on the monitor. I still could feel when baby was coming, I knew when to push, etc but truly no actual pain! I delivered her vaginally and it is a wonderful memory. \nWhen my son came along, things went a bit awry (long story) and though I also delivered him vaginally with no complications, I did not have pain relief.if you wind up in a situation like mine, you WILL manage it. Moment by moment. You'll breathe in, breathe out and give yourself over to the process. Once you stop fighting it, it becomes totally manageable - I PROMISE YOU THIS. Fear is what hurts, so I just had to let go, and I felt very much a part of the process. I don't know how to explain it, but once birth became something that I was DOING, rather than something that was happening TO me, I was totally fine. My only regret about my sons birth is that because of the extreme physical sensations, I don't remember huge chunks of it. \nIf you get the epidural, you can kick back and watch a movie - it is that effective. If you don't get it, you will manage just fine when you remember to breathe deeply, surrender to the process, and let go of all fear. \nGood luck to you and congrats on all the joy ahead!!", "controversiality": 0, "created_utc": 1471322352, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jbc6k", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428274, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Valkyrja_bc", "author_flair_css_class": null, "author_flair_text": null, "body": "You can do it! What helped me leading up to it was thinking \"it's only a day\". I ended up having a C-section, so I can't speak to giving birth vaginally, but it was still only a day. There was, of course, recovery afterwards, but the scary part was, again, only a day. You can hold on for a day!", "controversiality": 0, "created_utc": 1471323144, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jbqiz", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428418, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "samesongnewverse", "author_flair_css_class": null, "author_flair_text": null, "body": "On my second kiddo, ready any day here, and I still experience some trepidation about giving birth a second time. My first was... average to reasonably good as an experience, I think?\n\nFor me, it comes down to telling myself that regardless of what happens, good or bad, it is a finite experience. It WILL be over, and then there's a baby on your chest to cry happy tears over. And honestly, its really too late to stop the oncoming train! Base level acceptance of that is key -- you can't turn this car around. It is going to happen, but you will come out all right on the other side.\n\nAnd lastly... make sure you are well versed in your options for things like pain management, support people, etc. Knowledge is power, even if things don't go to plan. At least you can know what might be coming.\n\nGood luck! It will be over before you know it.", "controversiality": 0, "created_utc": 1471323703, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jc02n", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428511, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dmee", "author_flair_css_class": null, "author_flair_text": null, "body": "You can do it sister!! Just like I see a couple other women have said, I also thought a lot about how women have been giving birth for literally ever! Our bodies were made for this.  This is your body's time to shine, and show you exactly what it is capable of...and I promise you you will not be disappointed!! Once you are in the throws of labor, you will be thinking more of the end product (a wittle baby!) than any of the immediate pain.   And, it also helped to me think about how your body remembers pain- you will always remember when something hurt you, but you don't actually feel that pain again, just that it hurt. It will all pass, and the second you hold your baby in your arms, it will all fade into a background because all that will matter in that moment is the tiny life that you made inside you and brought into this world! \n\nYou can do it.  I birthed 2 babies with no pain medication (one 8lb3oz and one 10lbs 14oz)and it wasn't a walk in the park, but to me, it wasn't half as bad as people made it out like it was going to be.  It's all mind over matter- and remember what the end result will be!! The miracle of birth is one of the most amazing experiences you will ever have, you won't ever forget that day for the rest of your life, so just remember to breath and try to enjoy it.  I promise you will do amazing!!", "controversiality": 0, "created_utc": 1471324423, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jccbn", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428633, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dmee", "author_flair_css_class": null, "author_flair_text": null, "body": "I got my son's head out then told my doctor \"I can't do it anymore!\" And he looked up at me and said \"well, you don't have a choice anymore, it's happening. Now push!\" And one more push and my baby was out.  Whew. Glad I didn't give up bc I'm pretty sure my vagina would have never recovered had I just halted the birth at that point 😂😂", "controversiality": 0, "created_utc": 1471324677, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jcgin", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j82py", "retrieved_on": 1473428675, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dmee", "author_flair_css_class": null, "author_flair_text": null, "body": "I recommend this book to everyone!! ", "controversiality": 0, "created_utc": 1471324719, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jch7r", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j7r5x", "retrieved_on": 1473428681, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Momenem", "author_flair_css_class": null, "author_flair_text": null, "body": "Get yourself a doula. I estimate 75% of a doulas work is done even before you go into labor. Your Doula will be someone you connect and feel comfortable with. They will work closely with you to talk about any fears or concerns that you have and can offer you resources to help navigate the minefield of information. You will talk with them about every aspect of your birth experience, what you like, dislike, comfort techniques and pain management. They can help you achieve an birth outcome in which you feel honored, respected, and cherished. No matter what decisions you make. It is your birth. Only you can decide. But in order to decide, you need to know all you options. Getting a doula puts you back in control and helps you let go knowing you're in good hands.", "controversiality": 0, "created_utc": 1471326749, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jdcok", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473428996, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tbusy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is your labor. Do whatever feels right for you be it natural birth, with pain management meds, or even elective c-section. The only thing that matters at the end of the day is your and your babies health, both physical and emotional. There is no universal right way to do things, you need to do what is right for you. You'll do great and at the end of it all it won't really matter because you'll have that sweet baby to focus all of your energy on.", "controversiality": 0, "created_utc": 1471329811, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jek3s", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473429436, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "swirly023", "author_flair_css_class": null, "author_flair_text": null, "body": "I gave birth 6 months ago after 3 days of contractions and no sleep, and I have chronic fatigue syndrome. So it's safe to say I was not in the best shape to give birth. And I was also terrified. But in the end it worked out GREAT! When it happens you just roll with it. Even if you're a type A control freak like me. My birth plan (home birth no meds) went out the window cause I wasn't progressing (2cm after 3 days of labor). And I went to the hospital and got an IV with meds. During the pushing I wasn't allowed meds and it hurt like crazy, but your body just takes over and the doctors will help you. Plus when you have your baby in your arms...best feeling ever!!! Try not to worry too much. You can't prepare...you can't go back... Just trust that you'll be fine!", "controversiality": 0, "created_utc": 1471334815, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jg9h5", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473430047, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gaiaofchaos", "author_flair_css_class": null, "author_flair_text": null, "body": "This! Everyone told me the same thing everyone is saying here. The reality is is different for everyone. My sister says that she felt no pain, my friend says she forgot the pain, for me it was the worst back pain ever, but once that epidural was able to be put in it was crazy awesome. I didn't find the class I took to be super amazing but practicing the different breathing daily really helped in the end. DON'T SAY NEVER TO ANYTHING! Please. Keep flexible and open to changing your plans. I intended to walk around and us a bouncing ball during labor but couldn't because every time I got up my baby's BP went way down so I adapted. You will find a way through, I promise, just talk to the nurses and your birthing partner. The nervousness and anxiety around birthing will help in the end because you'll talk and listen and remember  more about what you can do when it really counts. Best of luck! See you on the other side!", "controversiality": 0, "created_utc": 1471338240, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jhb7d", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j7fue", "retrieved_on": 1473430426, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "peacewithcylons", "author_flair_css_class": "orange", "author_flair_text": "Ian 5/29/15", "body": "I loved my epidural. The only thing I was unhappy about was waiting so long to get it in!", "controversiality": 0, "created_utc": 1471344497, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jj4se", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j7fue", "retrieved_on": 1473431090, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "FranniPants", "author_flair_css_class": "red", "author_flair_text": "Aiden 10-11-10", "body": "I was nervous, but like others have mentioned - women have been having babies forever - and that was comforting. Toward the end, I just wanted him out though, and it felt like that would never happen. Another piece of wisdom my doctor told me, \"no woman has ever been pregnant forever!\"\n\nMy birthing experience was tough because he decided he wanted to come right as I laid down for bed that night, after being up all day. I didn't want to be one of \"those\" people who went to the hospital for false labor, so I waited..and waited..from 11pm - 3am. I had been at an appointment 6 days prior and was told I wasn't dilated at all. \n\nI finally decided it was probably best to head up there, and - lo and behold - I was 7cm dilated.  The nurse said \"looks like you're going home with a baby!!\" HOLY CRAP THIS JUST GOT REAL!!\n\nHowever, since I waited so long, I did not have time for an epidural. I had to pass an 8lb 11oz baby boy with nothing to help with pain. On top of being exhausted from now at this point being up for almost 24 hours. There were times when I felt like giving up, but you find a way somehow.\n\nToward the end, around 10am at this point (awake for 28 hours now), I simply didn't have the strength to push. Then it happened - his vitals started to go. He was almost there, but because of where he was in me he was starting to lose oxygen. The Dr told me to either get him out with the next push, or I was having an emergency C-section. Hearing that, and seeing the vitals line on the monitor freaking out, gave me the strength I needed! And there was my sweet little boy, Aiden James.\n\nYou don't know what true love, honestly unconditional love, is - until you see that little face you created. Your heart will swell with happiness, and every second of pain you just endured will be worth it &lt;3\n\nGood luck, mama!", "controversiality": 0, "created_utc": 1471346128, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jjnuh", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473431283, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crikeybobs", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a bit late to this, but you will be FINE. Your body takes over and knows what to do, and you just start getting really excited to meet your baby. \n\nAround 20 weeks I started getting terrified and was convinced I needed a section as I wouldn't be able to give birth vaginally, but I listened to a great hypnobirthing course (the one by Kathryn Clark). Whilst I didn't plan to have a hypnobirthing experience (and didn't), the positive messaging throughout really helped me to believe I could do it. \n\nI put my trust in the professionals to look after me, and resigned myself to the fact that they would only offer necessary interventions that would result in the safety of me and my baby. I had an epidural, an episiotomy and several blood transfusions, and my daughter had a monitor attached to her head and was assisted out with a kiwi, so it wasn't exactly 'natural', but we both came out of the experience perfectly healthy and I look back on that couple of days really fondly. It was an incredibly special time. \n\nNot long until you'll be holding your beautiful baby in your arms. You can do it OP!", "controversiality": 0, "created_utc": 1471346344, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jjqlt", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473431313, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MrsJones2013", "author_flair_css_class": null, "author_flair_text": null, "body": "I had both of mine at home. It's a lot of pressure, then a pop, you'll feel like your crotch is on fire for a minute, and then they're out and you're a mom. \n\nDon't stress. Women have been having babies for thousands of years. As long as your birth team is fully supportive of you and let's you labor how you want, you'll be fine. It's just like taking an 8 pound poop. ", "controversiality": 0, "created_utc": 1471346502, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jjsnp", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473431335, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Doththecrocodile", "author_flair_css_class": null, "author_flair_text": null, "body": "I was really scared my first time too! The third trimester felt like this \"point of no return\" and while I looked forward to meeting my baby, I reeeeally didn't want to give birth. \n\nKnowledge is power has always been my approach to scary things, so I read up like crazy. I highly recommend the Bradley method book. We didn't do the class bc it was 12 weeks long, but the book had good pictures and information about stages of labor and what to expect an unmedicated birth to feel like. This really helped in the moment so I knew \"this is normal, don't panic, breath, ride the contraction waves\". \n\nReading a lot of birth stories was good too. Birth without fear is a great resource for this. Everyone is so different and it was good to hear lots of birth stories. I felt encouraged that even if things went poorly (emergency c-section was my fear), lots of babies are born this way and come out okay! That I'm not in any way a \"screw up\" bc I couldn't handle a natural labor or whatever if I decided I needed medication. There's definitely that vibe in the crunchy community, but it's bs. Do what's good for you and baby. Have a doctor you trust. \n\nI also took a short Lamaze style birth class which was good for laboring techniques to not overtire yourself. And what to expect with breastfeeding and early postpartum recovery. I was so wrapped up about the birth, I hadn't even thought about recovery much! I'm glad I heard some good tips and had my adult diapers and frozen witch hazel pads at home :P They helped a lot! \n\n\nFor me, labor itself was not painful until very close to pushing. My water broke around 2am and around 10am I started noticing mild period like cramping. It slowly intensified over the day and around 8pm the contractions were 1) close enough together (4 min I think?) 2)consistent 3)intense enough I couldn't talk through them anymore. So we drove to the birth center, we live about an hour away in the country, so we wanted to give plenty of time since I also reeeeally didn't want a home birth or a car birth! I labored there from 9pm-midnight. Pain management (mostly pressure in my lower back) was helped by swaying sitting on an exercise ball and hanging out in the shower with warm water hitting my lower back. I pushed for 3 hours (not bad for a first baby!) and that was by far the hardest. It didn't hurt to push per say, but it was exhausting and I felt sick, shaking and wanting to vomit. The last hour of pushing was painful and I was so tired. Was insanely happy when the baby came out and I could rest! My home recovery was good. Breastfeeding was hard. I had mastitis twice (think flu symptoms and painful nursing) and other issues. With a great lactation consultant we were able to heal up and continue nursing after a month or so of needing to supplement. That was scarier to me than giving birth. The problems felt unending and I was exhausted with a newborn who was losing weight :( We came out the other side ok and nursed over 2 years. I'm pregnant with #2 now and really hoping birth goes as smooth this time and maybe nursing won't be such a challenge. ", "controversiality": 0, "created_utc": 1471352006, "distinguished": null, "edited": 1471352643.0, "gilded": 0, "id": "d6jm6yw", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473432238, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "As with many other ladies have said, get the epidural, and take a birthing class if you can. Try to make sure that you have a really good support person in l&amp;d if not make sure the nurses know, they are trained to help. \nOh... and the epidural feels really freaking weird going in but well worth it. \n\nI don't know what natural labor feels like as I was one of the scary stories,  but listen to the ladies that have replied and remember your body is built for this and follow your instincts while in labor. If you need to rock or squat, do it regardless of what anyone might think.", "controversiality": 0, "created_utc": 1471352831, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jmmpo", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473432399, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1471354256, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jnftv", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473432721, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lauriegia", "author_flair_css_class": null, "author_flair_text": null, "body": "I think your description is right on. I had an epidural but I wasn't working on my left side for most of my labor. The fact that the pain comes and goes makes it bearable. I've had kidney stones before and I think I would rather give birth again then deal with that pain. ", "controversiality": 0, "created_utc": 1471354257, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jnfv6", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j9gen", "retrieved_on": 1473432721, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1471354494, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jnl2z", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473432771, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "body": "+1 for epidurals. I went to a class and learned pain management techniques but still, the fear of how much pain was coming next and if I could handle it outweighed my ability to remain calm in the moment. I chose to have an epidural and I would do it again. I went from freaking out every couple minutes to being able to relax and talk to the doctors. Before that I couldn't even talk or express how I was feeling because my senses were all over the place. ", "controversiality": 0, "created_utc": 1471355916, "distinguished": null, "edited": false, "gilded": 0, "id": "d6joh5b", "link_id": "t3_4xwbrw", "parent_id": "t1_d6izo1r", "retrieved_on": 1473433099, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "That's true, plus induced labors are suppose to be way faster...I should have added that even though I couldn't have drugs, I really wanted those drugs! It added an element of anxiety. But once it was over I was ok and I was very energetic (which I hear is normal). I always hear that everyone's experience is very different and that makes sense, there are so many factors that lead up to it. I was a little overly obsessed with having a \"perfect pregnancy\" because I had a very very high risk of hemorrhage so I felt like I could at least have a little control in other areas (or at least what seemed like control lol!). I didn't add that I needed routine platelet transfusions (is that the correct wording?) throughout the whole labor and about a day before, so my actual labor was 6 hours but I was in the hospital maybe a day and a half just preparing (I had a bed before I even got there, it was all planned). Contractions are very interesting and yes they can be painful and even are painful at times, but I just wanted OP to know that she doesn't need to be afraid that contractions are an injury pain, and have a goal. I'm the most nervous scared person on the planet and I think something just changed once I knew I was in labor...even before we began, I was crying a lot to the doctors lol", "controversiality": 0, "created_utc": 1471355960, "distinguished": null, "edited": false, "gilded": 0, "id": "d6joi6g", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j9ugj", "retrieved_on": 1473433109, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Wtfguysreally", "author_flair_css_class": null, "author_flair_text": null, "body": "What helped me was to remeber that \n\n1. It was a short period of time in an otherwise long life \n\n2. It was the start of something amazing.  The whole risk vs reward thing. \n\n3. These nurses are great at what they do, they do this everyday and know all the tricks of the trade. \n\n4. We also *literally* built for this and if  for whatever reason a vaginal birth isn't possible, we live in a time of medical interventions to keep both I and the baby as safe as possible!\n\n5. YOU GOT THIS!", "controversiality": 0, "created_utc": 1471368379, "distinguished": null, "edited": false, "gilded": 0, "id": "d6jy1is", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473436635, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "khaleesijen", "author_flair_css_class": null, "author_flair_text": null, "body": "This will be the most amazing thing your body ever does! In hindsight it's such a short amount of time to be in pain. And I started laboring on a Friday and had my baby girl Monday night. Once you push that creature out and they place him or her on your chest.. There's no other feeling like that. Euphoria! I remember saying  less than a week later, \"I can't wait to do this again!\". You've got this:) ", "controversiality": 0, "created_utc": 1471377730, "distinguished": null, "edited": false, "gilded": 0, "id": "d6k5plr", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473439437, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "usherova", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a labour resulting in emergency c-section (birth story is in my post history) and 8 months later I don't remember pain but those happy moments- my son's first scream, how cute and small he was, how I fell in love with him at the first sight. I'd do that again as it is so worth it!\n\nBtw as someone above said- you will be so miserable towards the end of pregnancy that you will wait till it is over and try everything to speed up the process.", "controversiality": 0, "created_utc": 1471378681, "distinguished": null, "edited": false, "gilded": 0, "id": "d6k6gi4", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473439727, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sachairiah", "author_flair_css_class": "green", "author_flair_text": "Son, born 04/04/13", "body": "I was scared too. What calmed me is this: whatever it is that you believe, a god or nature or what have you, they/ it has designed you for this.\n\nYour hips, your muscles, your uterus. Your hormones to deal with how discomfortable it might be. They've all been designed for this moment. You don't need to do this all natural, either (there's no medal if you do).\n\nNot thinking of this as a really painful thing helps. My labour doesn't rank in the top three for sure.  I went in not thinking \"this is really going to hurt\" but \"this will be discomfortable\".\n\nI also had a focus point. I focused/ imagined seeing his feet and counting his toes. That helped too.\n\nNot sure if that helped. All the best!", "controversiality": 0, "created_utc": 1471379167, "distinguished": null, "edited": false, "gilded": 0, "id": "d6k6us1", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473439869, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's because you've made some absolutes here like \"pushing doesn't hurt,\" \"there's no feeling below,\" and \"contractions are NOT bad.\" That's incredibly subjective. \n\nI think these kind of comments, while coming from a generous place of trying to reassure someone, can actually add to women's feelings of disappointment after the birth, thinking \"why was it so much more _____ or less ______ than people said it would be?\" or \"why didn't ______ work?\"", "controversiality": 0, "created_utc": 1471456942, "distinguished": null, "edited": false, "gilded": 0, "id": "d6lg7rv", "link_id": "t3_4xwbrw", "parent_id": "t1_d6j5cek", "retrieved_on": 1473457043, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds like you're experiencing a lot of anxiety and nervousness. I had that exact same feeling and kept waiting for myself to become ok with it and it just never happened, lol.\n\nHave you ever done public speaking? Public performance? Taken a final, or anything else that really tests you and puts you in the spotlight? It can be really nerve wracking, and even make you want to pass out or throw up. What if? What if? What if? But then you get up on stage, or start writing, and it's happening. You have no time for panic now because your mind is occupied with the task at hand. I've never seen a woman in labor saying \"what do I do?\" They're doing it :) \n\nYou will have a team of people whose sole job it is to take care of YOU, and your needs, and your baby. You will NOT be alone in labor like you're alone with your thoughts right now.", "controversiality": 0, "created_utc": 1471457181, "distinguished": null, "edited": false, "gilded": 0, "id": "d6lgf4x", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473457117, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry, I meant that contractions aren't a bad thing. Contractions are what move your baby down, to ensure that baby makes it. If you don't have contractions, baby can't move down and baby would need to get out another way. Thats just the way that I looked at it, since I spent all of my life being afraid of pregnancy and labor. I meant that contractions aren't a pain from injury or something being wrong; but a type of pain that is understandable and has a goal and end result. Believe me, I wanted those drugs but I couldn't. I won't be able to for the next one but it's not so bad that I won't want to get pregnant again.", "controversiality": 0, "created_utc": 1471458714, "distinguished": null, "edited": false, "gilded": 0, "id": "d6lhr9y", "link_id": "t3_4xwbrw", "parent_id": "t1_d6lg7rv", "retrieved_on": 1473457601, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "I think your own experiences are perfectly valid and I don't want to make it sound like you need to justify your own experience. I was just giving my two cents as to why people might be downvoting you (I did not downvote you). \n\nI know plenty of people who would agree with your statements. But they are worded like they apply to everyone, and that's probably what the issue was.", "controversiality": 0, "created_utc": 1471459096, "distinguished": null, "edited": false, "gilded": 0, "id": "d6li3b1", "link_id": "t3_4xwbrw", "parent_id": "t1_d6lhr9y", "retrieved_on": 1473457719, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah I see what you mean, now I understand the initial downvotes...thanks for explaining!", "controversiality": 0, "created_utc": 1471459225, "distinguished": null, "edited": false, "gilded": 0, "id": "d6li7eb", "link_id": "t3_4xwbrw", "parent_id": "t1_d6li3b1", "retrieved_on": 1473457762, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meowcluckquack", "author_flair_css_class": null, "author_flair_text": null, "body": "Epidurals are great if you want one. Do yourself a favor: UNDERSTAND THAT IT IS NEVER TOO EARLY TO GET AN EPIDURAL! do not let a nurse or even doctor tell you that it's too soon to Do it. Mine said I had to wait til I was 4cm dilated and, not knowing any better, I waited. I then dilated really quickly, so when they finally checked again, I was almost 6cm. \"So let's get that epidural,\" I said.  Well, the only nurse anesthetist in the building at the time had just started a csection, so I had to wait even longer. I had to wait 6 hours after I requested the epidural to actually get it. \n\nHere's the thing: this idea that you have to wait till you're dilated til youre dilated to any particular size to get an epidural is an old, outmoded viewpoint! I work with anesthesiologists every day (I'm a surgical tech) and they were really angry on my behalf that they made me wait. The reasoning behind this common practice is that an epidural can sometimes slow down labor, but it usually doesn't, and if it does, all they have to do is give you pitocin! This is your choice.  If they tell you they recommend you wait and you don't want to, you tell them that you understand the risks, and theyre relatively minor compared to the pain, and you would like to get your epidural now, please.  \n\nAlso, even if your only considering an epidural, fill out all the paperwork consenting to it As soon as you arrive, as it takes time for the nurses to process it and you dpwont want to fill it out when you're in pain. That way, as soon as you decide to get it, you can. See? You don't have to be in pain, even at the beginning! Nothing to fear! Once mine went in, I didn't feel a thing. And all I felt of the epidural was the burn of local anesthetic. Not bad. ", "controversiality": 0, "created_utc": 1471495163, "distinguished": null, "edited": false, "gilded": 0, "id": "d6m7t3n", "link_id": "t3_4xwbrw", "parent_id": "t3_4xwbrw", "retrieved_on": 1473466895, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}