{"submission": {"author": "cerealaddict30", "author_created_utc": 1465701496, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_ynkxx", "contest_mode": false, "created_utc": 1473908080, "domain": "self.Mommit", "edited": 1473952128, "full_link": "https://www.reddit.com/r/Mommit/comments/52u8e6/how_do_i_parent_my_6_month_old/", "gilded": 0, "id": "52u8e6", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 77, "over_18": false, "permalink": "/r/Mommit/comments/52u8e6/how_do_i_parent_my_6_month_old/", "retrieved_on": 1476420623, "score": 34, "secure_media_embed": {}, "selftext": "ETA - THANK YOU for all the responses! This is my first post on this sub-reddit and I knew I came to the right place. You all are so encouraging and supportive. Thank you thank you thank you. \n\nThis is very long, I know. But I really need some advice and wanted to be as detailed as possible, so please if you have time can you read and give some advice?\n\nI feel like such a failure of a mother. I have spent my whole life knowing I wanted to be a mother. I grew up babysitting for all the neighbourhood kids. I nannied for a 2 year old at one point. I am a teacher (but I teach high school kids). I have always LOVED spending time with my nephews (there are SEVEN of them!!). I even took care of one of my nephews one day a week from the age of 6 months - 1.5 years. So I guess I expected that \"moming\" would be no problem for me. \n\nWell here I am, 6 months in, and feeling like I am just not cut out for this. My babe has been a tough one from the get-go. He was never a good sleeper (though that is FINALLY improving) and he has always been on the \"fussy\" end of the spectrum. From 0-3 months he slept so much during the day that it wasn't too hard to entertain him when he was awake, but he did require me to constantly bounce him, walk around with him, etc when he was awake. I could not put him down on/in anything, and I also couldn't just sit down and hold him. He has never been a cuddly baby, and never simply wanted to be held or snuggled or rocked. No, he had to be held face out, and walked around the house and bounced. But as I said, the amount of \"wake time\" was minimal so I was only ever doing this for an hour at a time here and there throughout the day. I also chalked it up to being in the fourth trimester and told myself that things would get better. \n\nCut to now: he is 6 months old and things are not better! His wake time between naps is about 2 hours (3 hours before bed) and I am finding it SO hard to parent him during these times. He is only ever happy if I take him for a walk, or take a bath with him. When I do either of those two things he is TOTALLY chill/happy/content. \n\nHere is what a typical 2 hour wake time looks like for us (not including breast feeding, which happens somewhere in there as well): Lay him down on our big foam mat, on his back, and play with him. He will roll around a bit, and play a bit, but he will begin to fuss after 5-10 mins and then slowly escalate to full on crying. Then I try to pull him into my lap. He squirms and thrusts his hips and continues to cry. I try singing to him again. He still cries. I sit him up and give him a toy. He still cries. I give him a teether. He bites it once and then cries more. I try giving him a snack. He cries. Eventually I take him outside and we go for a walk (and then he is perfectly happy and content). It doesn't matter what \"activity\" I start with, it always starts out okay for a few mins and then shortly after he is crying. If I am proactive I might be able to move him from one activity to another before he melts down, but this would literally involve me doing something new with him every five minutes, which is exhausting. \n\nI am at a complete loss as to what to do. I wind up in tears at the end of every day because I am so exhausted. Today I went on FIVE different walks with him (the upside is I'm actually BELOW my pre-prey weight!) and we spent 40 mins in the bath together. But this just doesn't seem sustainable to me. Plus I live in Canada and WINTER IS COMING. \n\nI don't recall any of my nephews being like this. I also can't hear anybody tell me \"'it's just a phase\" one more time, because he has NEVER been chill! So I guess my questions are....Is this normal behaviour for a 6 month old? How should I be responding? I know you \"can't spoil a newborn\" by picking them up/responding to their cries, but at what point does that stop being true? Am I doing something wrong? I don't understand why my baby seems to be so unhappy so often. I love him to pieces but I am also so resentful that I can't enjoy this stage of my child's life because it is SO hard. When I meet up with friends or my sisters, and their babies, I get SO jealous that they seem to just play on the floor contentedly, while I am doing everything in my power to distract mine and keep him from crying. PLEASE HELP!!!", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How do I parent my 6 month old?", "url": "https://www.reddit.com/r/Mommit/comments/52u8e6/how_do_i_parent_my_6_month_old/"}, "comments": [{"author": "Cristinann", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter (7 months old) was like this before we did sleep training, mostly because she was never well-rested and therefore perpetually unhappy, but if there aren't any problems with his sleep schedule, my next thought/question would be to ask if he is meeting all of his developmental milestones. Usually around this age they are very distracted with the world around them, so they start to be able to occupy themselves for longer periods of time.\n\nDoes he roll himself around and explore? Does he play with toys on his own? Is he happier if you're walking around and holding him? Do you babywear? If not, it was/is seriously a lifesaver. \n\n", "controversiality": 0, "created_utc": 1473909960, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ndif2", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475686906, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CoffeeGodCigarettes", "author_flair_css_class": null, "author_flair_text": null, "body": "God, that walk thing sounds hard. I'm sorry.  \n\nHave you tried baby wearing him?  Mine is a stage 5 clinger, too, and has never been just okay with doing his own thing ever.  He requires constant attention.  The only way I get anything done is by wearing him.  When he's teething he will scream like a mad man the second you set him down, or dare to try to sit with him instead of walking and cooing and rubbing his back -  but he's always quiet and content strapped to me.\n\nI only know your baby from what you've said about him, but I'm willing to bet that this will stop once he has a bit more mobility and can explore on his own by rolling around and crawling.  ", "controversiality": 0, "created_utc": 1473910729, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ndy33", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475687231, "score": 25, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mathsciteach", "author_flair_css_class": null, "author_flair_text": null, "body": "Baby wearing is a great idea! Plus, take him places you want to go. Malls and big stores are great. Lots of attention for cute babies.\n\nDoes he like to pick things up? My fussy baby loved picking up stuff so a tray of Cheerios or baby puffs would focus her attention for a long while.\n\nRemember to take some time for you, too, AWAY from your little one.\n\nHang in there. You are doing everything right. ", "controversiality": 0, "created_utc": 1473915262, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ng9nr", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475688975, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "acidic_donkey", "author_flair_css_class": null, "author_flair_text": null, "body": "Try getting him more stimulating toys, maybe ones that are a little advanced? At 6 months, my daughter loved this Einstein kids music toy that flashed lights and her bouncer. I definitely recommend a bouncer and a swing. Babies like movement.\n\nBetween these two things (linked below) baby was never bored. Sorry for the crazy long urls!\n\nhttps://www.walmart.com/ip/Fisher-Price-Luv-U-Zoo-Jumperoo/15162354?action=product_interest&amp;action_type=title&amp;item_id=15162354&amp;placement_id=irs-302-m3&amp;strategy=PWVUB&amp;visitor_id=dxOVtPBcdFAw-HJmqR55oY&amp;category=&amp;client_guid=e4d017b6-e43b-43fd-823f-ef97a4893194&amp;customer_id_enc=&amp;config_id=302&amp;parent_item_id=46425698&amp;parent_anchor_item_id=46425698&amp;guid=69ba78e5-43bb-4294-85cb-bf9719bc877b&amp;bucket_id=irsbucketdefault&amp;beacon_version=1.0.1&amp;findingMethod=p13n\n\n\nhttp://www.target.com/p/fisher-price-my-little-snugapuppy-cradle-n-swing/-/A-14583532?ref=tgt_adv_XS000000&amp;AFID=google_pla_df&amp;CPNG=PLA_Baby%2BShopping&amp;adgroup=SC_Baby&amp;LID=700000001170770pgs&amp;network=g&amp;device=m&amp;location=1013789&amp;gclid=Cj0KEQjw6uO-BRDbzujwtuzAzfkBEiQAAnhJ0AFzOrbOoBG7Tqyh2-4gPt9uHf3mU7DwLGFyLylaAAgaAtVs8P8HAQ&amp;gclsrc=aw.ds", "controversiality": 0, "created_utc": 1473915404, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ngbzu", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475689027, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "This answer. I sleep trained my 10 month old and he's been sleeping through the night since like forever. He's also well-rested and meeting/exceeding milestones. I find that a long sleep during the night gets him ready for a day of lots of learning, eating, brain activity, and playing (with 2 naps per day, although they are short naps so nothing fancy). He has a big play pen and plays with all his toys while crawling; several times a day he'll crawl on the open floor. The baby needs a long sleep, he needs energy. My son knows that he's well loved, and was never worse for the wear during sleep training. \n\nAlso I want to add that at 8 months I had to abruptly stop breastfeeding, and I noticed that this caused an immediate change in him. He instantly became independent and didn't become fussy the moment I touched him (which was due to only associating me with breastfeeding, now he associates me with play time and laughter!). But that's up to OP and she'll wean baby when she and and baby are ready.", "controversiality": 0, "created_utc": 1473915609, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ngfcw", "link_id": "t3_52u8e6", "parent_id": "t1_d7ndif2", "retrieved_on": 1475689098, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lamest_username_ever", "author_flair_css_class": null, "author_flair_text": null, "body": "Get a jumperoo! They're a lifesaver. I can get like 10-20 minutes while he bounces around and spins himself between the toys. \n\nMy guy likes standing a whole lot. If I'm sitting, I'll help him stand on the floor between my knees. \n\nHe plays on his play mat for maybe five minutes before getting bored. I swap out toys and teethers and those seem to help us get more mileage out of it. \n\nMy babies have both lived in carriers. I have him face out and we do stuff around the house while he's in there. We also go for a lot of walks. Baby wearing keeps me sane.  \n\nHang in there! The stage between being a tiny infant and a baby on the move is frustrating for them. They want to see stuff but they can't get to anything. It'll get better once he can help himself out more to reach interesting stuff. Also, try and find a group of moms with babies his age. It makes me feel more normal!", "controversiality": 0, "created_utc": 1473917619, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nhaoa", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475689758, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cristinann", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, definitely a bouncer or jolly jumper! We have two stationary bouncers and a jumper that I rotate my kid between during play time, along with lots of floor play. It is exhausting to keep moving them around every 5-10 minutes and keep them interested, but the older they get they seem to be able to occupy themselves for longer periods.", "controversiality": 0, "created_utc": 1473917629, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nhatn", "link_id": "t3_52u8e6", "parent_id": "t1_d7ngbzu", "retrieved_on": 1475689761, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmwchampion", "author_flair_css_class": null, "author_flair_text": null, "body": "My oldest was like that. You have my sympathies.\n\nHow does he do in the car? We took lots of car rides around that age. The library near us had a weekly \"baby storytime\" that was novel enough to hold his attention. So did the community rec center. We went to any place that made the walks less boring for me... the zoo, botanical gardens, the mall, etc. It was go, go, go, to keep him happy. Also babywearing, as others have said.\n\nFor what it's worth, my son did get much easier around 10-11 months, so there is hope. I think due to sleep training and finally becoming mobile (he was a late crawler). Shortly after his first birthday I remember thinking that he was the happiest toddler ever! Although it probably only seemed that way because of the hell he put me through for the first year, hah.", "controversiality": 0, "created_utc": 1473917979, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nhfux", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475689873, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Estecia", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I cannot emphasize baby wearing enough. Ops post sounds like my life 4 years ago(my little one is just in kindergarten now) !\nClingy babies do grow out of it eventually mom, don't worry, you're doing great. \nI still say the best investment of my life was my baby wrap! ", "controversiality": 0, "created_utc": 1473918329, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nhktz", "link_id": "t3_52u8e6", "parent_id": "t1_d7ndy33", "retrieved_on": 1475689988, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gluestick05", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, constant change of activities and leaving the house is what we do.  Once he started sitting on his own, I started taking him to the playground, plopping him in the corner with his toys, and sitting next to him.  He likes to watch the kids play.\n\nBut we've definitely gone through phases where nothing is good in the world.  He basically lived in the baby carrier at the beginning, and has never been interested in playing on his own.", "controversiality": 0, "created_utc": 1473918456, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nhmnj", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475690025, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "boredgoldfish", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have answers sorry, but my first was very similar - and I felt the same way! Now almost 3, my daughter is just a full-on kid, and it's a challenge to keep her busy still. Childcare was a lifesaver for me (at 10 months), they provided the stimulation and social interaction she needed (and I went back to work and got the stimulation I needed!)\n\nProof it wasn't my \"moming\", baby #2 is the complete opposite, very chilled out and a great sleeper!", "controversiality": 0, "created_utc": 1473919492, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ni0yu", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475690325, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "angela52689", "author_flair_css_class": "blue", "author_flair_text": "M, 9/6/15", "body": "If you do your URLs like this, they'll be shorter and have a nice name.\n\n[Name](Link)", "controversiality": 0, "created_utc": 1473923800, "distinguished": null, "edited": false, "gilded": 0, "id": "d7njiw6", "link_id": "t3_52u8e6", "parent_id": "t1_d7ngbzu", "retrieved_on": 1475691482, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "catsinbranches", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think you're doing anything wrong, in fact, I'd say that you trying so hard to keep him entertained means you're doing things right (even though I know it doesn't always feel that way).\n\n6 months was a really hard age for us as well. I think he was desperate to be more mobile but hadn't reached that point yet developmentally, plus he had teeth coming in. It's also rough because at that age they are starting to have more specific \"wants\" rather than just \"needs\" but it's all kind of a guessing game.\n\nI used to get so frustrated when my mom came over to play with him every week and he always seemed so much happier playing with her, but my husband pointed out that she was \"new and exciting\" and also generally had more energy than me since she was not so run down. It's possible that your experiences with your nephews are similar to my mom's with my son. That being said, you should check out this article: [Some babies are just easier than others](http://mobile.nytimes.com/blogs/well/2016/03/14/some-babies-are-just-easier-than-others/?referer=)\n\nI know a lot of people have mentioned baby wearing/car rides. My son hated both (still does at 10.5 months). He liked being read to, but obviously the books are short so don't last long, but he used to get us to read him Hop On Pop over and over and over. There were definitely some books he just didn't like though. Also, and I know this is controversial, the tv was a big help. He has never cared for cartoons, but there's this band called Walk Off The Earth that does a lot of cover videos on YouTube where the camera is on their faces as they sing (rather than just random music video stuff) and he loves watching those. Seriously, they calm him down like nothing else, and it was such a relief for me to have a bit of a break. If you're interested in giving this a try, the first videos of theirs that he was really into were the Hello cover with the surf board and tap dancers, and the Can't Feel My Face cover. \n\nAnyways, you have my sympathies, 6 months was a really hard age cause they want to be entertained but can't do it themselves. Sending you some internet hugs!", "controversiality": 0, "created_utc": 1473924238, "distinguished": null, "edited": false, "gilded": 0, "id": "d7njnsb", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475691581, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ElleCorrigan", "author_flair_css_class": null, "author_flair_text": null, "body": "So so sorry for you. This was just like my first child, she didn't sleep, colicky and hated the world. Since she was refluxy only the swing, bouncer chair and baby wearing kept her upright enough to pacify her. We got a great swing with toys and a tray and used it a lot. It got better around 9-10 months though FYI she is 3 and still a bad sleeper. Another small ray of sunshine, our second daughter is opposite, happy, cheerful, loves everyone and all the toys, plays by self and sleeps. Just letting you know sometimes it's just their personalities. Take very very good care of you until this passes and get daycare and babysitters no matter what it takes so you can have cool down time. From what I've read it almost always resolves by 1so your new mantra is 6 months at most just a few more months, I can do a few months. Also don't be afraid to tell your friends and family how bad it is, they may be able to help. If any of them has been through a fussy baby they will help. I know when someone gets a fussy one now I charge in their with food, house cleaning, babysitting anything I can do to help cause I've been there. Welcome to the fussy Velcro baby support club, I am so damn glad to alumni and you will be too soon.", "controversiality": 0, "created_utc": 1473924423, "distinguished": null, "edited": false, "gilded": 0, "id": "d7njpvl", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475691622, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1473931937, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nlrlg", "link_id": "t3_52u8e6", "parent_id": "t1_d7ndif2", "retrieved_on": 1475693148, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "scaredofme", "author_flair_css_class": null, "author_flair_text": null, "body": "Can you recommend any resources that you used for the sleep training you did? FTM and still expecting, but want to read up. Thanks!", "controversiality": 0, "created_utc": 1473941777, "distinguished": null, "edited": false, "gilded": 0, "id": "d7np1ae", "link_id": "t3_52u8e6", "parent_id": "t1_d7ngfcw", "retrieved_on": 1475695617, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaeporagaebora", "author_flair_css_class": null, "author_flair_text": null, "body": "I can so relate to your story. My son is about 6.5 months and very much the same. He's such a whiner! I have a bunch of activities that we rotate through throughout each wake time.\n\n- Toys on the playmat\n- bouncer\n- reading books (this works particularly well when he is starting to fuss, I put a bright book in front of him and it is a good distraction)\n- toys on the bed\n- looking at the baby in the mirror\n- toys in the crib\n- eating solids (he really likes to suck on steamed broccoli and will do this happily sometimes for like 15 mins)\n- honestly sometimes I put on a baby show on the iPad for a bit to help him relax if he is fussy and i need a mental break\n\nSome of his fave toys are not actually toys at all and he will play longer with a little enamel pot, wooden spoon, silicone basting brush, etc. especially when it is something new he hasn't seen before.\n\nThe other thing is that I feel like they are desperate to get mobile at this age and that is why he is so frustrated all the time. So I have been trying to keep that in mind, he is frustrated too, and when we are doing floor play I try to encourage him to work on his movement.\n\nLuckily walks work well for me too so we do those often as well. \n\nSorry for the long post. I so feel your pain. Incidentally, I'm in Canada too. Whereabouts are you? I'm in Toronto.", "controversiality": 0, "created_utc": 1473941815, "distinguished": null, "edited": false, "gilded": 0, "id": "d7np1w4", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475695630, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HearMeRoar231", "author_flair_css_class": null, "author_flair_text": null, "body": "(1) You are not a failure! Babies are complex things and literally every single one is different. Try not to compare yourself to what you see other friend's babies doing. (2) I know tons of people have said it before but BABYWEARING. ZOMG. SO HELPFUL.", "controversiality": 0, "created_utc": 1473944572, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nqfpr", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475696676, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "numericrhino", "author_flair_css_class": null, "author_flair_text": null, "body": "Other people have made these suggestions but in separate comments so I'll just add - baby wearing (if he'll tolerate it) and a jumperoo might be what you need. I hope things get better for you soon.", "controversiality": 0, "created_utc": 1473945872, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nr6u6", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475697243, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Harpence", "author_flair_css_class": "purple", "author_flair_text": "♥HD♥ &amp; ♥CS♥", "body": "Going to jump on the baby wearing bandwagon. My first needed to be held ALLTHETIME. She would slowly nurse for 45 minutes, pass out at the tap, and if I so much as breathed the wrong way, the cycle started over. By 3 months I was at my wits end. Then I discovered that beautiful bjorn carrier. Suddenly she was the perfect infant. Honestly by 9ish months they're more interested in trying to crawl and grab stuff, so hang in there!\n\nEdit: I should add she will be 5 next month and is very independent now, and has been for years. Still loves to be coddled, but definitely enjoys some self time. ", "controversiality": 0, "created_utc": 1473946943, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nrv0a", "link_id": "t3_52u8e6", "parent_id": "t1_d7nhktz", "retrieved_on": 1475697743, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "He hates most kinds of baby wearing :( The only thing he will tolerate is begin face out. And even then, he only wants to do this if I go for a walk! He is not a snuggly guy so really hates being face in. He will also let me carry him on a hip carry in the ring sling, but only if I am busily going around the house. I do use this as a strategy sometimes!", "controversiality": 0, "created_utc": 1473946985, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nrvxp", "link_id": "t3_52u8e6", "parent_id": "t1_d7ndy33", "retrieved_on": 1475697763, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks, I will try the tray of puffs! He hasn't really mastered the pincer grip but maybe it will encourage him to practice :)\nAs with everything, he will only tolerate being in his high chair for so long though... (like a max of 10 mins). Blergh. ", "controversiality": 0, "created_utc": 1473947046, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nrxdg", "link_id": "t3_52u8e6", "parent_id": "t1_d7ng9nr", "retrieved_on": 1475697794, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! I have an excersaucer which I think is similar to a jumparoo. As with all things, he will tolerate it for a few mins then starts to scream! :( The one thing he will tolerate for slightly longer (like 10-15 mins) is the Jolly Jumper. He LOVES jumping. ", "controversiality": 0, "created_utc": 1473947147, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nrzq2", "link_id": "t3_52u8e6", "parent_id": "t1_d7nhaoa", "retrieved_on": 1475697842, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CrunchyMother", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you looked into Wonder weeks? Basically the charted the times that babies are frustrated and working on developing the next milestone and their mood is not so sun shiny. Make sure the carrier that you get lets you wear him on you back. I wear my infant on my back so she gets the contact that she needs and I get the ability to do the things I need to get done while not holding a baby. \n\nHave you thought about post partum depression? It can begin up to a year after you give birth. I've had it with all of my babies. I even take meds. With this last baby I was on a different med and this one worked so much better. I was able to smile and laugh more. I'm so much more smiley with this baby and she is so much more smiley than my other babies. \n\nShe has 3 movies that she loves to watch. Her dad often puts one of them on when nothing else stops her from crying when I'm not there. [Musical Baby](https://youtu.be/wdr4Gai4lWU) she loves watching the babies. They also have Nature Baby, Baby's Day and Baby Moves. \n\nHow often do you have music playing softly in the background.  Whenever my kids get fussy at any age I very softly play classical music in the background and they tend to quiet and calm down.\n\nAlso is he fussing or full out crying?", "controversiality": 0, "created_utc": 1473947261, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ns2d1", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475697896, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I was hoping the sleep thing might be my answer and was clinging to that hope but he has started sleeping great now (we did sleep train), but still no changes to his demeanour. I think he is hitting his milestones. He rolls both ways, and sits unassisted. He will play with a toy for a slightly longer period of time if he is sitting but he still seems to get bored/frustrated SO quickly. He doesn't really \"explore\" as he seems to really hate being on his tummy. So while I encourage him to spend some time there, he is not usually in fun/play-mode when he is. And he doesn't log roll around to get places. Mostly just rolls to his belly and then gets upset. He is happier if I walk around holding him, but I really don't think it's the holding part he wants. It's the walking around part. I will do a hip carry in the ring sling or face out in the ergo (he won't do any face-in carries without screaming) but there are only so many things I can do with him in there (can't really cook on a hot stove, bend over to unload dishes very easily, etc). Plus unless I am moving constantly, he wants out. So if I were to wear him and try to fold the laundry, for example, he would start fussing and then crying until I started walking around. SO exhausting. ", "controversiality": 0, "created_utc": 1473947528, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ns8qb", "link_id": "t3_52u8e6", "parent_id": "t1_d7ndif2", "retrieved_on": 1475698025, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Even when he is well-rested he is still not a happy guy :(\nI was really hoping this was the answer, so I sleep trained (which needed to happen regardless), but his day time behaviour has not changed. ", "controversiality": 0, "created_utc": 1473947665, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nsc4x", "link_id": "t3_52u8e6", "parent_id": "t1_d7ngfcw", "retrieved_on": 1475698095, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Darn, I have both of those already! He used to enjoy the swing but now just fusses and thrusts his hips trying to get out when I put him in. And he also used to handle the jumperoo for up to 15 mins, but now it's usually not more than 5. I am at my wits end!", "controversiality": 0, "created_utc": 1473947761, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nseek", "link_id": "t3_52u8e6", "parent_id": "t1_d7ngbzu", "retrieved_on": 1475698142, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "He does like the Jolly Jumper! I can usually get 15 mins out of him in there!", "controversiality": 0, "created_utc": 1473947798, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nsf9r", "link_id": "t3_52u8e6", "parent_id": "t1_d7nhatn", "retrieved_on": 1475698160, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "He can handle about 15 mins in the car before getting bored or upset, so I definitely take him out when the weather is crappy and just go buy some baby clothes or do some errands, etc. Thank you for telling him that your son got easier! I am still holding onto hope! (I have been doing this since day one, lol. \"It will be easier by 8 weeks. 3 months. I just have to make it to 3 months and then things get easier. 6 months! Then he can eat solids and be independent! I just have to last until 6 months!\" These have been my mantras and I feel like I keep getting disappointed. But I am still doing it anyways. Right now I am hoping that when he can crawl he will be happier. ", "controversiality": 0, "created_utc": 1473947952, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nsj0s", "link_id": "t3_52u8e6", "parent_id": "t1_d7nhfux", "retrieved_on": 1475698238, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "I can send you some resources or even explain how we did it (easy process for both baby and parents!). I'm sorry but well rested baby can do so much more, many women are told that babies should live basically nap-to-nap, and that's not entirely true! Lots of sleep at one time is good for his growth!", "controversiality": 0, "created_utc": 1473948060, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nslm3", "link_id": "t3_52u8e6", "parent_id": "t1_d7np1ae", "retrieved_on": 1475698291, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "What kind of sleep schedule does he have now? Usually it means long stretches of sleep at night with small pick-me-up naps during the day.  Don't worry mom!", "controversiality": 0, "created_utc": 1473948126, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nsn92", "link_id": "t3_52u8e6", "parent_id": "t1_d7nsc4x", "retrieved_on": 1475698326, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for the encouraging response. I haven't really left him with other people very often (though I have with my family) because of the fact that he is such a trying little guy. I worry that if I try to go to the gym and use the daycare there that he would just cry and they would end up calling me back. But I guess it is worth a shot! My biggest issue (and why I came here for support) is that my sisters and friends have all had relatively easy (or at least average) babies and they do not get it at all. Unless you spend 24 hours in my shoes, I don't think it is possible for them to comprehend. They usually brush it off with a \"oh yeah, babies are a lot of work\" comment, but I don't think they really know the extent of my situation. ", "controversiality": 0, "created_utc": 1473948165, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nso4n", "link_id": "t3_52u8e6", "parent_id": "t1_d7njpvl", "retrieved_on": 1475698344, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Did things every change for you?", "controversiality": 0, "created_utc": 1473948185, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nsomb", "link_id": "t3_52u8e6", "parent_id": "t1_d7nhmnj", "retrieved_on": 1475698354, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cristinann", "author_flair_css_class": null, "author_flair_text": null, "body": "How does he do in a high chair? Sometimes it's a change of perspective for them and they can stay occupied for longer. I'll put my daughter in her high chair, give her some puffs or snacks to smack at/feed the dog/sometimes eat, and she'll watch me do the dishes, clean the kitchen, cook, etc. She particularly loves watching the microwave if something is in there. It sounds silly, but I also sort of narrate to her what I'm doing and why. I figure even if she has no clue what I'm saying now, at some point she will, and it sometimes brings out new vocabulary for them to hear.\n\nI know they're still little and not able to do much at this point, but I try to incorporate my daughter into any chores I have for the day and that helps the tedium of keeping them entertained. I'll put her in her crib or on a blanket on the ground and dump clean laundry over her as I sort and fold it. She thinks it's great, and I don't really care if it gets a bit drooly. She gets to \"hold\" part of the leash when I take the dog outside (condo-dwellers with no fenced in yard), and \"helps\" me scoop food to feed the pup. \n\nI actually found that when I stopped stressing over keeping her happy and occupied and just starting doing things around the house that I needed to get done with her in tow, she was more apt to stay quiet and was very interested in watching what was going on. It definitely isn't easy or quick keeping a wobbly baby on your hip while doing some of this stuff, but it's okay. It's not a race, afterall. Plus it's a good learning experience for baby, and a good lesson in patience for mom (not that I want it most of the time, but y'know).\n\nAlso, once he figures out how to roll himself across the room, it will get easier on you. He'll be there soon enough and you'll be chasing him around and yelling things like \"Don't put the dog's butt in your mouth!\" and \"Stop licking the vacuum cleaner!\"\n", "controversiality": 0, "created_utc": 1473948510, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nswkb", "link_id": "t3_52u8e6", "parent_id": "t1_d7ns8qb", "retrieved_on": 1475698553, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "Mama needs to get her own things done and to get rest herself; I hate to say that breastfeeding has any drawbacks at all because it's the most beautiful relationship I've experienced, but I found that after I weaned him (didn't plan to before 1 year but had to in an emergency)  he became so much more independent and happier just playing with his toys, watching his stories. He became so independent that he suddenly hit like 20 milestones in like a week (he was lagging for a while, but he learned stuff like standing up, feeding himself, etc all in a week) and he became 100% less fussy when I held him. It kinda upsets me still that  breastfeeding has any drawbacks but the truth is that it was like night and day; he was always fussy when I held him unless I breastfed, and then like literally within a day or two he was happy to just be independent or just for me to hold him and play while he laughed.", "controversiality": 0, "created_utc": 1473948607, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nsywn", "link_id": "t3_52u8e6", "parent_id": "t1_d7ns8qb", "retrieved_on": 1475698613, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cristinann", "author_flair_css_class": null, "author_flair_text": null, "body": "We did the Ferber Method, and while it was very hard emotionally, it was a surprisingly quick fix for sleeping. My kid took about 8 days to get it, but the majority of babies get it after 3 days.", "controversiality": 0, "created_utc": 1473948683, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nt0q5", "link_id": "t3_52u8e6", "parent_id": "t1_d7np1ae", "retrieved_on": 1475698650, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "I suggest going to every possible activity - get a zoo membership. Walk around a free garden. Join museums. Just anything that might be interesting to *you*. THen at least when you are walking around you can enjoy yourself and your baby is happy being carried/worn outwards. I always felt a little silly bringing a tiny baby to the zoo or children's museum but it was a place I could go and it was socially acceptable to bring a baby. It made me feel better to have something to do. \n\n", "controversiality": 0, "created_utc": 1473949955, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ntx7m", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475699319, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Miss_Awesomeness", "author_flair_css_class": null, "author_flair_text": null, "body": "I have to second the jumperoo. My son loved jumping, not all babies do, but it was honestly the only way I could put him down for 20 minutes at a time... he would get tired and then start playing with the toys on the sides.", "controversiality": 0, "created_utc": 1473950115, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nu1fs", "link_id": "t3_52u8e6", "parent_id": "t1_d7nrzq2", "retrieved_on": 1475699406, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I love my baby to bits but it really makes me think I can't have another. I always wanted at least 2 kids but this has been so hard! I guess if I'm going to talk myself into another I will have to hope that my next one is easier!", "controversiality": 0, "created_utc": 1473950396, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nu8sb", "link_id": "t3_52u8e6", "parent_id": "t1_d7ni0yu", "retrieved_on": 1475699558, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "This was really helpful. Thank you!! Everything you said resonates with me and is so helpful. I am going to try those Walk Off The Earth videos! He likes books before bedtime so maybe I should try more during the day as well. \n", "controversiality": 0, "created_utc": 1473950738, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nuhvl", "link_id": "t3_52u8e6", "parent_id": "t1_d7njnsb", "retrieved_on": 1475699749, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! I feel like we are in a constant rotation of keeping him occupied and I just really wasn't sure if this was normal! It seems like other babies can entertain themselves for at least 20 mins here or there. So I was really questioning if I was doing something wrong. He will definitely \"inspect\" any new item he comes across, so it is a challenge to keep him interested in toys because once the inspection is over, he would like something new to check out. But like you said, it doesn't have to be a toy it can be a paper cup or a hat with a pattern on it or anything really. But some things take longer to inspect than others hahahah! I am out west in Calgary (but I used to live in Toronto!) PS - I also have a broccoli sucker! Too funny. ", "controversiality": 0, "created_utc": 1473951792, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nvahc", "link_id": "t3_52u8e6", "parent_id": "t1_d7np1w4", "retrieved_on": 1475700335, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rslashdp", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a fuss butt baby. She is a toddler now and is a completely different person than she was as an infant. She had to be held, she had to be bounced, there was never a cry and she'll calm herself or tire out she would cry until she wold vomit. Turns out she had acid reflux and she was just in pain a lot and that she got worse when she would lay down. This is why she wanted to be up right and bounced. I'm not saying that is the case with your little guy, but it's worth a conversation with your doctor. Your doctor may also have some advice for you as well. My pediatrician often asks about mom and dad's mental wellness at the kid's appointments because it's a huge part of parenting. ", "controversiality": 0, "created_utc": 1473952226, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nvmey", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475700615, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! Yes I think this is going to be my life. I have tried to have lots of \"at home playtime\" to encourage floor time and tummy time but this is just not working. I think I need to just get out of the house and be in survival mode for awhile, keeping baby happy. And just do 5 mins of floor time here and there. ", "controversiality": 0, "created_utc": 1473952489, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nvtw1", "link_id": "t3_52u8e6", "parent_id": "t1_d7ntx7m", "retrieved_on": 1475700764, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "This is so interesting and another poster mentioned something similar. I love breastfeeding and am so not ready to give it up, but I would do it if it caused this dramatic of a change! But I'm also worried that it might not change anything and then I gave up breastfeeding for nothing... This is so hard. ", "controversiality": 0, "created_utc": 1473952594, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nvwuh", "link_id": "t3_52u8e6", "parent_id": "t1_d7nsywn", "retrieved_on": 1475700829, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "This really resonates with me. Thank you for responding. He does't love being in his high chair (it seems to me that he doesn't like being confined...but then again he loves to stroller so who knows!) This is something I am working on because I am (trying to) do baby-led weaning which requires him to be in his high chair for periods of time but he gets mad in there before too long. \n\nI also narrate most of what I'm doing for the exact same reasons! He likes listening to me talk, and hopefully it will eventually help build his vocab. \n\nMaybe you are onto something and I need to just relax. I just get frustrated so quickly when I put him down to \"start\" something (like cooking, or folding laundry) and he starts crying so quickly. And then I don't know whether to just let him cry while I finish, or pick him up and try to entertain him again.\n\nI am equally excited and scared for when he is on the move! On the one hand, if he's happy, I'll be happy to chase him around all day. On the other hand, I might be eating those words before too long hahahah!", "controversiality": 0, "created_utc": 1473952917, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nw636", "link_id": "t3_52u8e6", "parent_id": "t1_d7nswkb", "retrieved_on": 1475701019, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "He is sleeping 11-12 (usually closer to 12) hours at night and then first and second naps around around an hour and third nap is 30-40 mins. If he sleeps closer to 11 hours then usually one nap will lengthen a bit. Do you think I need to be capping his night sleep so he can have longer naps?", "controversiality": 0, "created_utc": 1473953007, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nw8pa", "link_id": "t3_52u8e6", "parent_id": "t1_d7nsn92", "retrieved_on": 1475701074, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I did download the wonder weeks app (I am actually a bit appalled on how much money I have spent hoping it is going to result in me either understanding my baby better, or making him happier... recently I bought a $100 foam floor mat because I thought maybe he just needed a better place to play! I bought him the flashy light up with sound effects toys and then thought ooooh maybe I am overstimulating him and then bought wooden blocks and a wooden abacus with coloured beads on it for him to play with instead... the list goes on. Sorry this got away from me/what we were talking about here, but just had to vent about all my silly purchases). Anyways, I haven't found the wonder weeks thing to be all the helpful. I do like reading about the leaps and knowing what things are changing for him and what skills he is working on. But I haven't found him to be any \"sunnier\" during those sunny times...\n\nI will check out that Musical Baby link! And I will definitely try the classical music. I often play music in the evenings, but it's usually music I like haha, probably not the most soothing!\n\nAnd it always starts as fussing; it mostly sounds like he is really frustrated. Like he wants something but it isn't happening (usually it seems like he wants something that just isn't possible, like to pull the tag off the rug and be able to hold it in his hands or to chew on a big heavy plastic toy that doesn't actually feel very nice to chew on). And then it quickly escalates to full-on crying. It mostly seems to me that he doesn't have the ability to think \"hmmm I tried that and it didn't work. I'm going to do this instead now.\" But I'm really not sure if that is something babies this age are even capable of in the first place. Sorry for my REALLY long response! He is napping so of course I am redditing. ", "controversiality": 0, "created_utc": 1473953482, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nwm8s", "link_id": "t3_52u8e6", "parent_id": "t1_d7ns2d1", "retrieved_on": 1475701352, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I do sometimes wonder about reflux as he burps a lot. But I never notice that he cries harder after a burp or anything like that. And he doesn't have any issues at night. I think I just sometimes think that there must be something \"wrong\" that is fixable (i.e. with medicine) rather than accepting that my baby has a challenging temperament. But I do agree that it's at least worth asking at his next dr appt which is next week. What were the other symptoms for your LO?", "controversiality": 0, "created_utc": 1473953636, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nwqn0", "link_id": "t3_52u8e6", "parent_id": "t1_d7nvmey", "retrieved_on": 1475701445, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaeporagaebora", "author_flair_css_class": null, "author_flair_text": null, "body": "At least we know we're not alone. Hopefully by the time the cold hits our babies will be more independent and driving us crazy exploring the house on their own. ", "controversiality": 0, "created_utc": 1473954164, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nx5nl", "link_id": "t3_52u8e6", "parent_id": "t1_d7nvahc", "retrieved_on": 1475701745, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "It was very taxing emotionally because I was afraid that our relationship wouldn't go anywhere because I was afraid he would feel rejection :/  the first few days I made sure to hold him more and more, hold him close while bottle feeding, etc. I love now how he is. He plays in his play pen and practices standing and walking - he was barely crawling before I warned him :/  I took the worst emotional hit though - I cried for like a week. He was fine lol. It's defidently up to you, the only reason why I connected him always being fussy with me with breastfeeding was because many of the lactation consults in the hospital warned me that he would only associate me with that (not in a bad way, just heads up). It was so bad he couldn't even sleep next to my side of the bed in the bassinet cause he would just be fussy and upset ..soon as his bassinet went to his fathers side he was super calm lol. \n\nBut it's all up to you. Breastfeeding is nothing short of magical, almost spiritual.", "controversiality": 0, "created_utc": 1473956116, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nypu0", "link_id": "t3_52u8e6", "parent_id": "t1_d7nvwuh", "retrieved_on": 1475702902, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "I think his sleeps actually sound good- his brain is getting a lot of rest with that 12 hour time frame and his body grows while he sleeps so that's his growing time (kudos to you for sleep training btw! It's great for him to recover from all the learning and growing!) Im wondering if the fussiness is a lack of being able to do independent play coupled with being fussy on you due to only associating you with food. Of course that's just my observation from my experience, but I think his sleeping seems fine! I read (and I cannot link the source right now because it was sourced through my baby app) that babies can do 14 hours of sleep and that's fine; daytime naps won't be too fancy of course (as you know haha). Mine sleeps from 830pm -830am so he does 12 hours, and eats every 2 hours all day with 2 short naps. You're a good mom! Just want you to know that whatever you decide to do, baby will be happy and feel loved because at the end of the day, the love that you show him is not forgotten ", "controversiality": 0, "created_utc": 1473956543, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nz212", "link_id": "t3_52u8e6", "parent_id": "t1_d7nw8pa", "retrieved_on": 1475703158, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gluestick05", "author_flair_css_class": null, "author_flair_text": null, "body": "He's 9 months now, and his attention span has gotten longer and there are more activities that he can do.  But he needs a LOT of stimulation and a lot of attention.\n\nThere's a super neat (free!) indoor baby play thing near our house, so we do that a lot, and it will hold his attention for quite a while.  I also go there with a mom group, so there are a lot of people cooing at the babies, which helps.\n\nWe also spend quite a bit of time at grandparents' houses, since they have more space, and it's more people giving him attention.\n\nCrawling has been a mixed bag.  It basically means that he can follow me around screaming, but he also occasionally goes on his own adventures.\n\nSo, I guess it has changed insofar as I don't have to be literally holding him at all times.  But I have him out of the house doing baby activities basically every waking moment.", "controversiality": 0, "created_utc": 1473956990, "distinguished": null, "edited": false, "gilded": 0, "id": "d7nzf2k", "link_id": "t3_52u8e6", "parent_id": "t1_d7nsomb", "retrieved_on": 1475703427, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "boredgoldfish", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's easier because you know what you're doing the second time, but also fingers crossed for an easier baby! It does get better (even the difficult ones), in no time at all your little one will be listening and talking back, and communication helps so much! Hang in there..", "controversiality": 0, "created_utc": 1473960770, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o2hf9", "link_id": "t3_52u8e6", "parent_id": "t1_d7nu8sb", "retrieved_on": 1475705692, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "This is pretty much what I am expecting for myself. I have no idea how to go about fostering independent play skills. Or if that's even possible with babies of certain temperaments... ", "controversiality": 0, "created_utc": 1473961852, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o3e2l", "link_id": "t3_52u8e6", "parent_id": "t1_d7nzf2k", "retrieved_on": 1475706354, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I suppose that's what it all boils down to. I mean I obviously want my baby to be happy because it will make my life easier. But I want him to be happy because... well... I want him to be HAPPY and feel loved. I always worry when he cries that he feels like I am not doing what he needs :(", "controversiality": 0, "created_utc": 1473961967, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o3hjs", "link_id": "t3_52u8e6", "parent_id": "t1_d7nz212", "retrieved_on": 1475706421, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Such a tough decision. Did you find he was less fussy when his dad was playing/interacting with him? My LO is always SO happy when dad comes home but he goes back to being cranky before too long, even if it's dad who is playing with him. ", "controversiality": 0, "created_utc": 1473962067, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o3kif", "link_id": "t3_52u8e6", "parent_id": "t1_d7nypu0", "retrieved_on": 1475706482, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "I may be downvoted for this, but a little crying and fussing is fine tbh. Self-soothing is a good thing to learn (that I learned through my childhood psychology semester). It'll make him a secure sleeper, like he won't wake up and freak out because it's dark because he can just close his eyes and go back to bed (every night at around 12am my son wakes up, fusses for like 20 seconds, and passes out again lol). Soothing him when he's in pain and hurt is what a mother should do, but a little fussing because he's bored or is learning to sleep is fine. The very first time I put my son down to bed when I began sleep training, he drank his bottle and fussed for 10 minutes then fell asleep. I don't really see it as a \"good sleeper\", because babies are inherently good; but you're teaching him the methods to which he can feel secure, comfortable, and anxiety-free. :) ", "controversiality": 0, "created_utc": 1473963244, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o4itw", "link_id": "t3_52u8e6", "parent_id": "t1_d7o3hjs", "retrieved_on": 1475707146, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "The only person who could hold him was husband lol with me he would be fussy and crazy, so I could never actually enjoy holding him unless I baby wore him ..that always hurt my feelings :/", "controversiality": 0, "created_utc": 1473963311, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o4kus", "link_id": "t3_52u8e6", "parent_id": "t1_d7o3kif", "retrieved_on": 1475707186, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I would never down vote this! I sleep trained, and did \"cry-it-out\" (after investigating other methods that didn't work). Part of the reason I posted was because I was unsure whether I should be attending to him every time he cries or not. I do not want to reinforce the notion that he is not capable of entertaining himself. But I also don't want him to cry all day. So I'm finding it really hard to figure out what to do/how to respond. I don't do anything if he is fussing, but if he ends up crying I usually attend to him. ", "controversiality": 0, "created_utc": 1473966165, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o6xqc", "link_id": "t3_52u8e6", "parent_id": "t1_d7o4itw", "retrieved_on": 1475708861, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh no I meant people lurking would do the downvoting! I've always gotten the sense on other subs that babies are not suppose to ever fuss and cry and if we allow them to then we're bad parents lol \n\nHmmm I just wonder why he's not wanting to do a little independent play..does he have any favorite cartoons? I know mine likes to have his playing while he plays (I'll put them on my phone, they're on you tube, then I prop up the phone, the channel is \"little baby bum\" he even has favorite songs too!)\nCause I may be wrong here, but i get the sense that he's not wanting to have any play time at all or any relaxing time. Like after a meal, leave him in the high chair to watch his cartoons and that way he can be entertained while digesting his food (mine loves to spit up so he needs to be in that high chair for 20-30 minutes after eating!) and then after a little bit put him in his play area with his cartoons. I'm going to be drop dead honest, my son never wanted to play in his playpen until I weaned him :(  I felt so betrayed after I weaned and saw so many things change, because that means that there are drawbacks to breast feeding and I hate thinking that :/  ", "controversiality": 0, "created_utc": 1473966800, "distinguished": null, "edited": false, "gilded": 0, "id": "d7o7gpl", "link_id": "t3_52u8e6", "parent_id": "t1_d7o6xqc", "retrieved_on": 1475709235, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "He *will* do some *kind of* independent play. But he just doesn't last longer than 2-5 mins before getting bored/frustrated. Like he will not lay there and play with his feet endlessly like I have seen other babies do. So I pretty much need to be sitting right there ready to intervene with something new to try because he escalates SO quickly. That's why I worry that I am reinforcing the notion that he can't figure things out himself. But he doesn't just fuss, he will start bawling inconsolably. And then it's REALLY hard to get him to calm back down. At that point my only option is walk or bath. ", "controversiality": 0, "created_utc": 1473977163, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ofmcl", "link_id": "t3_52u8e6", "parent_id": "t1_d7o7gpl", "retrieved_on": 1475715142, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "polylop", "author_flair_css_class": null, "author_flair_text": null, "body": "Forgive me if im wrong but it doesn't seem like you do much with other people? If it helps, here's a typical week with my 7 month old:\n\nMonday: rest day at home usually. She is bored by the end of the day\n\n\nTuesday: 10am, library reading session delivered by librarian. Baby gets to interact with toddlers, get new books\n\n11am: playdate and lunch with friends and similar aged babies\n\n1-2ish: home for the day, probably pick up husband about 4pm\n\n\nWednesday: usually a day for errands. A trip into town, a walk, go out for afternoon tea. Usually out for a couple of hours\n\n\nThursday: 9am SPACE group (supporting parents as child educators, I'm in NZ and this is a freeish service) with about ten other mums and babies for three hours. Babies are mostly engaged in free play on the mat while we discuss different topics about their development and learning\n\nAfternoon: often a walk with friends or visiting someone with babies\n\nFriday: have just started attending play centre (another NZ thing) which is like a giant play group run by parents. Goes for three hours.\n\nAfternoon: another walk or visit with friends\n\nWeekend: family time\n\nTrying to fit a music group and swimming  in there somewhere too. Having said all that my baby is ridiculously chilled, but when she is playing on the floor independently it's the exception, not the norm, so she seems to relish that freedom.\n\nSomething else I'm a firm believer in is talking to our baby like an adult when it comes to plans. \"Good morning baby, we've got a big day planned today! First we're going to change your Nappy, then have a booby feed, then it's times to go to SPACE and see the other bubbas! After that we will....\" bla bla bla. Who knows if it helps but it can't hurt.\n\nGood luck!\n", "controversiality": 0, "created_utc": 1473978308, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ogeyg", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475715740, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lamest_username_ever", "author_flair_css_class": null, "author_flair_text": null, "body": "My kid spends a lottttt of time in carriers as he's my second and I have stuff to do. He doesn't always love it but he will almost always give in after a few minutes. Loosen your straps, pop a boob in his mouth, and go live your life. He might fight it a little at first but he will get used to it. ", "controversiality": 0, "created_utc": 1473982285, "distinguished": null, "edited": false, "gilded": 0, "id": "d7oj316", "link_id": "t3_52u8e6", "parent_id": "t1_d7nrvxp", "retrieved_on": 1475717724, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "batswantsababy", "author_flair_css_class": null, "author_flair_text": null, "body": "Does he have any food allergies or intolerances? My daughter had a milk protein allergy as an infant, and switching to hypoallergenic formula made her a totally different baby. Cutting out dairy can do the same thing, although it takes time to make a difference if that's the problem. \n\nSimilar colicky symptoms (frequent crying mainly) can be caused by other tummy troubles, too. It might be at least worth mentioning to a pediatrician to see what they think. \n\nMy daughter is a toddler now, and her milk protein allergy has passed. Still, she has kind of a sensitive stomach and gets really constipated sometimes. She gets clingy and fussy all over again until she has a good poop. ", "controversiality": 0, "created_utc": 1473988670, "distinguished": null, "edited": false, "gilded": 0, "id": "d7oncn7", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475720780, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "I did have him on a probiotic for the first 3 months of his life because he always had such bad gas issues and I've been considering putting him back on it. I think I definitely will, because it can't hurt! Today was actually an okay day (I know this because I never brought him into the bath, which is always my very last resort!) so I'm feeling a bit better about things and thinking I just need to do a better job of entertaining him :/  Today my goal was to never let him escalate to the point of hysterical crying, and though it was exhausting I managed! ", "controversiality": 0, "created_utc": 1473990794, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ooseo", "link_id": "t3_52u8e6", "parent_id": "t1_d7oncn7", "retrieved_on": 1475721830, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! We do get together with other mums and babes lots, but I pretty much always schedule these dates as \"walk dates\". It is so not fun for me to do much else because then I'm on the floor trying to keep my babe happy and can't really chat with the other mums or my friends etc. That SPACE program sounds great and I know there are similar things here, but I worry that I wouldn't be able to partake in the adult part because I would be attending to my screaming child every few mins! I am definitely trying to start taking him to the pool because he loves the water, so that's something I am going to start doing weekly. And maybe a zoo trip as well. But (at the moment at least) we can't really do \"stationary\" type things like going to a coffee shop or a hanging out at a friend's house. ", "controversiality": 0, "created_utc": 1473991216, "distinguished": null, "edited": false, "gilded": 0, "id": "d7op28a", "link_id": "t3_52u8e6", "parent_id": "t1_d7ogeyg", "retrieved_on": 1475722022, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "polylop", "author_flair_css_class": null, "author_flair_text": null, "body": "So he's not even happy interacting with other bubbas? This sounds so hard. I know it might be weird, and it's not something I would do, but a video of the behaviour might help. Or perhaps you could video it and show it friends or your dr? Cos it's all so subjective and maybe (unlikely, but maybe!) You perceive him to be upset and hes actually just figuring stuff out. I doubt it from what you have described but maybe if someone else saw it they could offer a different perspective.", "controversiality": 0, "created_utc": 1474002969, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ovvw2", "link_id": "t3_52u8e6", "parent_id": "t1_d7op28a", "retrieved_on": 1475726816, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1474002992, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ovw8f", "link_id": "t3_52u8e6", "parent_id": "t1_d7ovvw2", "retrieved_on": 1475726822, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "He *can* be happy around other kids - particularly an older child if they are giving him lots of attention and playing with him. But as with everything, he gets bored quickly and seems to want something else before too long. But maybe I just need to be more courageous and give him the chance to try more often. He definitely wouldn't handle being at a coffee shop or somewhere he had to sit on my lap for long. But it's possible he would sit on the floor of someone's house with another baby to look at for awhile without getting upset. ", "controversiality": 0, "created_utc": 1474040470, "distinguished": null, "edited": false, "gilded": 0, "id": "d7pcgfm", "link_id": "t3_52u8e6", "parent_id": "t1_d7ovvw2", "retrieved_on": 1475738057, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "262Mel", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh boy, my daughter is like that. She's 14 months now but LOVES to be outside. Before she could crawl, I would put her on a blanket in the yard with a few toys and we would play for a bit, talk, look at things and I would get some gardening done at the same time. I would put her in my Moby wrap and go for walks or just get stuff done outside that I could do while wearing her. When she became mobile, she would just follow me around the yard while I pulled weeds or sit happily in the jogging stroller when I took her running. Now that she can walk, we go outside and pick veggies from our garden, she pushed her wagon and other push toys, plays in the dirt and with the stones and has a ball. As long as she's outside she's OK. ", "controversiality": 0, "created_utc": 1474048316, "distinguished": null, "edited": false, "gilded": 0, "id": "d7piv4n", "link_id": "t3_52u8e6", "parent_id": "t3_52u8e6", "retrieved_on": 1475742383, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cerealaddict30", "author_flair_css_class": null, "author_flair_text": null, "body": "This is my child!! If only I didn't live somewhere where freezing cold weather is on it's way! ", "controversiality": 0, "created_utc": 1474054159, "distinguished": null, "edited": false, "gilded": 0, "id": "d7pnm1r", "link_id": "t3_52u8e6", "parent_id": "t1_d7piv4n", "retrieved_on": 1475745530, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "262Mel", "author_flair_css_class": null, "author_flair_text": null, "body": "I live in Buffalo, NY. I get it. ", "controversiality": 0, "created_utc": 1474067986, "distinguished": null, "edited": false, "gilded": 0, "id": "d7pxi9z", "link_id": "t3_52u8e6", "parent_id": "t1_d7pnm1r", "retrieved_on": 1475752215, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "scaredofme", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, please! I have noticed the huge difference in my nephews' and nieces' behavior when rested or not and definitely see that a set sleep is the way we want to go if possible. It's just learning how to approach it is especially daunting.", "controversiality": 0, "created_utc": 1474174819, "distinguished": null, "edited": false, "gilded": 0, "id": "d7rg2l4", "link_id": "t3_52u8e6", "parent_id": "t1_d7nslm3", "retrieved_on": 1475791369, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "scaredofme", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! I will read up on that.", "controversiality": 0, "created_utc": 1474174856, "distinguished": null, "edited": false, "gilded": 0, "id": "d7rg36n", "link_id": "t3_52u8e6", "parent_id": "t1_d7nt0q5", "retrieved_on": 1475791379, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh crap! I saw this and then I got busy and I forgot! \n\nSo for us it came down to two different things that he learned: that he can sleep by himself; and that sleeping is done at night, after his routine that NEVER changes.\n\nIn the beginning weeks and months of course baby will be sleeping in the bassinet next to the bed (ours moved into the crib in the guest room at 6 months, although he was good earlier it's just that I got a little nervous at 5 months and then waited another month lol). The first part of sleep training that we did was establish NOT sleeping in the bed. He always slept in his bassinet. I can admit that for about 2 weeks we did have him sleep in the bed with us, but he was a premie (just by 5 weeks) and we wanted our body heat to always keep him warm (even though he hated blankets like...kid aren't you suppose to be a little chilly in the winter lol)\n\nThe training was slow. So he of course as an infant would have regular sleep/wake cycles; but beginning  at 8 weeks, I started skipping his last nap of the day by keeping him awake and entertained during that nap time. I would change his clothes, breast feed, watch tv, sing, etc. his last nap was always from 9pm-10pm; but once he started skipping that nap, he went to bed at 12am and woke up at 6am. I don't work so I spent literally all day attending to his needs and his hunger (for anyone who wants to make any snarky comments to me). My son always continued to gain weight, that's how we knew it was ok. He gained weight and he was always happy.\n\nSo from that point on his sleep lengths became longer and longer. By 5 months, he was asleep from 12am - 10am. I decided that the next phase of sleep training would begin; choosing an earlier bed time. By this time he was in solids and breastmilk so he was defidently getting a lot more calories in. I started with 10pm. I put him down in his crib at 10pm with a bottle, and after his bottle he cried for maybe 10 minutes and was out cold. \n\nBy this point, i put him back in the bassinet a few more weeks because i just needed to be sure, and he continued to sleep through the night (btw, the bassinet had to be on husband's side because if he smelled me he would be fussy and not sleep).\n\nAt 6 months he was back in his bassinet. His routine was always a bottle in his crib and lights out. Sometimes he would fall asleep, sometimes he would fuss for a minute or 10 and fall asleep. After a few more weeks I added in a warm bath before bed, and also, he naturally started to show signals of wanting to go to bed for the night earlier; so it turned into 9pm, then settled on 8pm. So now at ~10 months he expects dinner by 730, a bath at 8pm, lotioning up and pajamas,then a bottle. He knocks right out and sleeps the night. Usually as far as naps, he naps from 12pm -130pm and again for about 45min -1hour starting around 4pm.\n\nNo matter what, always keep to your preferred routine. Sometimes he'll be very fussy and cranky because he's tired and once he's in the bath he calms right down because he knows exactly what's coming next, and he expects it. A little crying and fussing will not hurt the baby, and your baby will not question whether you or dad love it. Also I like to point out that sleeping all night helps his brain recover from the constant learning he does daily, since he's not just surviving from nap to nap.\n\nAlways check for things like weight gain and general demeanor, that's what always kept me going. Baby will spend more time awake and eating during the day, so be prepared for that. My son is no worse for the wear. He's happy, he's gaining, and he has no sleep issues or sleep anxiety. I believe that this is more than just training to sleep at night; it's about reducing night time anxiety levels and adding a sense of comfort and security. \n\nWe didn't do any of the rocking to sleep or any of that. I have nothing against rocking to sleep, but I feel that it always kept my son awake and alert (so I always rock him in the morning just to have some cuddles and sweetness) so YMMV but we always put him down to sleep when he knew he was satisfied in his hunger and clean in his diaper, and it was time to sleep. Now he just knocks right out when he's put down. Just remember that your baby will not think that you don't love him if he fusses for a few minutes (I'm assuming a he now lol). Any other questions PM me! \n\n", "controversiality": 0, "created_utc": 1474320487, "distinguished": null, "edited": 1474320770.0, "gilded": 0, "id": "d7tpkyu", "link_id": "t3_52u8e6", "parent_id": "t1_d7rg2l4", "retrieved_on": 1475848289, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "scaredofme", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, thank you so much for the help! I just ordered several books on the subject, but your post really helped a lot. I can only hope that our little girl will learn as well as your little guy seemed to. Thanks again!!", "controversiality": 0, "created_utc": 1474362224, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ud4ib", "link_id": "t3_52u8e6", "parent_id": "t1_d7tpkyu", "retrieved_on": 1475865214, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "IveYaddaYaddadSex", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem, I know you can do it and your little girl will be sleeping soundly in no time! I really hope for the best and enjoy parenthood because it's so amazing and fun :D", "controversiality": 0, "created_utc": 1474381566, "distinguished": null, "edited": false, "gilded": 0, "id": "d7ulprr", "link_id": "t3_52u8e6", "parent_id": "t1_d7ud4ib", "retrieved_on": 1475871341, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}