{"submission": {"author": "KateAWP", "author_created_utc": 1475161709, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_11rc5g", "contest_mode": false, "created_utc": 1475162105, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/552n6t/how_often_do_you_get_pictures_done_of_your_kids/", "gilded": 0, "id": "552n6t", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 73, "over_18": false, "permalink": "/r/Mommit/comments/552n6t/how_often_do_you_get_pictures_done_of_your_kids/", "retrieved_on": 1476463145, "score": 28, "secure_media_embed": {}, "selftext": "Full disclosure, because I have never been in reddit before, I do have a business but I'm not here to market it. I don't have a wide circle of mom friends locally that I can ask this sort of question, I have only been a mom for two years, and my husband suggested I check out Reddit. \n\nHow often do you realistically want to get pictures of your kids? I see a lot of mini sessions springing up all year around: Valentine's Day, Easter, Mother's Day, First Day of School, Halloween, and Christmas. What is actually realistic? Are all these sessions that kind of \"Pinterest mom\" kinds of pressure?\n\nMy personal inclination is to say like maybe 2 per year, but I want to provide what people are interested in. My inclination toward maybe 2 per year makes me concerned about over-doing sessions if I plan for more. I don't want people to feel like I expect them to book sessions every two months all year round and that's how \"I\" would feel. \n\nI would rather people invest in the pictures they really want to have and for me personally, that has never been mini-sessions. \n\nIf you can't tell, I am a horrible sales person. I don't like to tell people they need to spend money on things that I don't truly believe they need to have. Quality pictures are always worth the investment, but I think it is worth investing in the things that are most important to you, and for me that is: birthdays, family time and traditions, big events, notsomuch the themed shoots.\n\nDiscuss, please. I am truly trying to understand how to better conduct business that meets client needs and expectations, not just mine. Your pictures are about you, not me. And if I want to call myself a professional I feel it is my responsibility to use my vision and skills to make my client's expectations come to reality. Not to tell people what they want, be happy with my work, and them not get what they want. \n\nI don't want to just do what everyone else is doing because it is what is the \"norm\" but I can't just only offer the things I like because my taste is my own.\n\nIf this post isn't allowed, apologies in advance. Reading the rules it didn't seem like it isn't allowed. ", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "How often do you get pictures done of your kids/ family? Feeling like a slacker-mom", "url": "https://www.reddit.com/r/Mommit/comments/552n6t/how_often_do_you_get_pictures_done_of_your_kids/"}, "comments": [{"author": "AmazingGraceFace", "author_flair_css_class": null, "author_flair_text": null, "body": "We do professional photos once per year.", "controversiality": 0, "created_utc": 1475162352, "distinguished": null, "edited": false, "gilded": 0, "id": "d86zaxi", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476181410, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gyrl67", "author_flair_css_class": null, "author_flair_text": null, "body": "We do at least once a year and sometimes twice with the second round including other family members like our siblings/parents. ", "controversiality": 0, "created_utc": 1475163224, "distinguished": null, "edited": false, "gilded": 0, "id": "d86zz8h", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476181848, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CoffeeGodCigarettes", "author_flair_css_class": null, "author_flair_text": null, "body": "I do freelance portrait photography and never approach people directly about hiring me unless it comes up in casual conversation: ie: someone saying \"I really need to get pictures of my kid done\" and I'll say \"hey I'm a photographer if you need some!\" And then I move on and don't bring it up again until they approach me specifically to book.\n\nAs for like social media advertising of the mini sessions:  I do 30 minute \"mini\" sessions all year long, but I dont see anything wrong with making a general post about special holiday props, pricing, and what have you each season.   But I wouldn't approach your friends about it personally expecting them to hire you.  FB local garage sale groups are great for that though.", "controversiality": 0, "created_utc": 1475163503, "distinguished": null, "edited": false, "gilded": 0, "id": "d87071n", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476181992, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nessarae", "author_flair_css_class": "purple", "author_flair_text": "Mommy to Edgar 11/13, and Arthur 2/15, Baby 3 due 3/17", "body": "I'll be honest. \n\nNever. Well, not yet at least. \n\nMostly because we knew our family wasn't complete yet. I want to do family photos annually after #3 arrives because we know it's our last and it seems to make sense to me that way. My local photographer in town does mini sessions and family sessions for a reasonable price, so we'll be going with her. It's ridiculously expensive in the city, though. ", "controversiality": 0, "created_utc": 1475163560, "distinguished": null, "edited": 1475163798.0, "gilded": 0, "id": "d8708ns", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182021, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/12, 1/15", "body": "Some sales advice for you. It's not your job to figure out what general client needs are beyond the basic \"people want good quality pictures in a reasonable amount of time.\" You're the expert photographer. You know all the advantages of having good pictures and it's your business to run in a way that feels right. It's your job to present all the advantages of getting pictures done with you because your client may not be seeing your perspective. And if you don't give it, who will? You're not saying \"you want this,\" you're saying \"these are all the great things about getting this at this price.\" It's up to the client to decide how to spend their money. When faced with a specific client, yes, you take the time to get to know them enough to give more targeted recommendations. But don't ever apologize for what you sell. It has value. You see it or you wouldn't do it. Show the client why you do what you do and then it's in their hands. If you've convinced them of the value and deliver accurately, they will always be happy. ", "controversiality": 0, "created_utc": 1475163580, "distinguished": null, "edited": false, "gilded": 0, "id": "d87098e", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182032, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "keeksg", "author_flair_css_class": null, "author_flair_text": null, "body": "We just did our first set, little dude is 21 months old.", "controversiality": 0, "created_utc": 1475163747, "distinguished": null, "edited": false, "gilded": 0, "id": "d870dyg", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182118, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "We've never been to a pro photo shoot, but we've ended up with pro photos through various channels:\n\n1. Weddings. We're all dressed up, the photographer takes photos of everyone, and our friends are nice enough to give us the JPEG of our family for free from their hugely expensive wedding package. Thank you!\n\n2. School photos. We have several pro photos of our little one, just not with us in them.\n\n3. Student photographers. Occasionally we run into someone at a party or other event who's a photography student and wants to go into portrait photography, so they ask if they can take photos of us there and then. Sure. They send us the files, we give feedback. Freebie time again.\n\nI hate the idea of photo sessions so I don't think we'll ever do professional studio portraits. Our personal cameras are good enough, and our photo skills are good enough for our liking. Also I prefer to photograph my child as she goes about her daily life, and not for a set event like Easter or Christmas. It's nice to take photos on those days, but just watching her at play is the best thing for me.\n", "controversiality": 0, "created_utc": 1475163753, "distinguished": null, "edited": 1475164086.0, "gilded": 0, "id": "d870e59", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182121, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RegularOwl", "author_flair_css_class": null, "author_flair_text": null, "body": "Personally for me I'm into photos once or twice a year (I have a baby who just turned one, so I don't have much experience). However, my coworker friend that recommended the photographer that we used for my baby's 1st birthday photos offers the same kinds of stuff you're talking about - Christmas, Easter, fall &amp; Halloween, etc... My friend does some of those. I don't think she feels pressured because I don't think the photographer personally and directly offers these services to clients and then waits for a response - that would be super awkward. If you're on her mailing list you get a little e-mail about these events. I don't think my friend does all of them, but if one is being offered around the time of year that she wants photos anyway then she'll go for it.\n\n\n\nI think if you are going to be a professional photographer it's smart to offer these things because people like variety and like things to be special. So if someone is getting photos taken because of a special event (birthday, first communion, kid lost their first tooth, whatever) it would be nice to be able to get photos that also correspond with the season so that the photos they get over the years don't look like the same damn thing over and over, just that the kids are older.\n\n\nAlso, why would you just offer two? A Christian family might really be into Christmas and Easter photos while other families might be into 4th of July and \"fall\" photos. People want to be able to have a variety to choose from and quite frankly if I had two photographers of equal talent to choose from and one only offered 2 special session types per year and the other offered many different kinds, I'd probably go with the one that has more offerings, especially since those particular 2 might not interest me.\n\nAlso think about your own schedule. Let's say you become a popular photographer. You're doing 2 themed sessions per year. So the families you serve that want themed photos all have to pack into your schedule during those timeframes. You're going to be overloaded, you won't be able to fit everyone in, and because your workload is going to be nuts during those times you'll be late getting finished products into people's hands, etc...\n\nOffering them doesn't mean people will feel pressured to book, I mean it's not like as someone is leaving a session you need to shove a flier in their hands for the next one you're doing and ask if they want to book the next session before they leave. It's like when Carter's is having a sale. I get the flier in the mail and if I need something I'll stop in, but getting the flier doesn't make me feel weird. I think you're overthinking this.", "controversiality": 0, "created_utc": 1475164039, "distinguished": null, "edited": false, "gilded": 0, "id": "d870m27", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182267, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "leaps_and_bounds", "author_flair_css_class": null, "author_flair_text": null, "body": "I still haven't done any professional photographs and my oldest is 3.5 years. I want to, though...it's on the list. \n\nI don't think there's anything wrong with offering lots of mini sessions...you aren't saying 'you should do 12 photo shoots a year.' You're saying, \"if Easter is a holiday you really like, here's a photo session for it.\" If I were a better adult I'd probably do one family session a year and another one just for the kids, maybe right around when school starts. ", "controversiality": 0, "created_utc": 1475164387, "distinguished": null, "edited": false, "gilded": 0, "id": "d870vvr", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182444, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1475164453, "distinguished": null, "edited": false, "gilded": 0, "id": "d870xp9", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182479, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1475164609, "distinguished": null, "edited": false, "gilded": 0, "id": "d871220", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182557, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1475164831, "distinguished": null, "edited": false, "gilded": 0, "id": "d8718ju", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182674, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1475164992, "distinguished": null, "edited": false, "gilded": 0, "id": "d871d5r", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182757, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1475165289, "distinguished": null, "edited": false, "gilded": 0, "id": "d871lbj", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476182904, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RegularOwl", "author_flair_css_class": null, "author_flair_text": null, "body": "just FYI none of the responses you've made have actually been as a response to the post you were replying to. When you want to respond to something someone has posted click the \"reply\" link directly below what they wrote and a little box will pop up for you to type into.", "controversiality": 0, "created_utc": 1475165555, "distinguished": null, "edited": false, "gilded": 0, "id": "d871srq", "link_id": "t3_552n6t", "parent_id": "t1_d871lbj", "retrieved_on": 1476183040, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh holy crap, haha. Noob! Thanks. I don't reddit 😂 ", "controversiality": 0, "created_utc": 1475165820, "distinguished": null, "edited": false, "gilded": 0, "id": "d8720bj", "link_id": "t3_552n6t", "parent_id": "t1_d871srq", "retrieved_on": 1476183182, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "I do overthink a lot. I said two thinking more of like seasonal rather than themed sessions. I hate props and I don't have a studio. Mini sessions are good for meeting a lot of people in a short amount of time, which is why a lot of people do them, but I can't imagine doing them every couple of months all year around. It's a lot and it just feels supers \"salesy\" to me - like the photographer just wants to keep making money off of people any way they can. ", "controversiality": 0, "created_utc": 1475165891, "distinguished": null, "edited": false, "gilded": 0, "id": "d87229u", "link_id": "t3_552n6t", "parent_id": "t1_d870m27", "retrieved_on": 1476183218, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Is it a particular time of year? Like fall? ", "controversiality": 0, "created_utc": 1475165965, "distinguished": null, "edited": false, "gilded": 0, "id": "d8724d7", "link_id": "t3_552n6t", "parent_id": "t1_d86zaxi", "retrieved_on": 1476183256, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, I get that. I don't really approach people either.  I don't work out of a studio though and I don't really work with props and sets. I prefer a lifestyle/documentary approach to sessions, that's why I'm trying to get a handle on what most people actually want. The last thing I want to do is invest in a bunch of props and sets that I don't really like working with and then find that most people prefer a formal session to a themed mini. ", "controversiality": 0, "created_utc": 1475166011, "distinguished": null, "edited": false, "gilded": 0, "id": "d8725ne", "link_id": "t3_552n6t", "parent_id": "t1_d87071n", "retrieved_on": 1476183280, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! Still working on that \"delivery\" haha. As I said, I'm a terrible salesperson and still trying to get a feel for how I want my presence with clients to be. I tend to overthink, more experience will certainly help. That is unfortunately why I'm exploring all of this. I haven't had enough in the door to get into a good rhythm yet. My local market is a odd one and I don't like how most choose to operate within it. ", "controversiality": 0, "created_utc": 1475166051, "distinguished": null, "edited": false, "gilded": 0, "id": "d8726sg", "link_id": "t3_552n6t", "parent_id": "t1_d87098e", "retrieved_on": 1476183299, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "That's what I like too! That's how I tend to shoot families when I get the chance to, but most people figure they can just do it themselves and won't pay for professional pictures that are that \"normal\" look at everyday life. Studios are way stiff for me. Natural is the way to go!", "controversiality": 0, "created_utc": 1475166093, "distinguished": null, "edited": false, "gilded": 0, "id": "d8727y8", "link_id": "t3_552n6t", "parent_id": "t1_d870e59", "retrieved_on": 1476183321, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ProfessorMMcGonagall", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it depends on what you charge!  The photographer I use is way cheap.  Seriously, she's excellent and she charges $35 for a mini-session where she brings all the props, etc. and we get 20 edited photos.  $50 for an hour session with 35 edited photos.\n\nShe does mini sessions for spring, summer, fall and Christmas.  We hit up some of the mini sessions and then I paid the $50 charge for pictures of my twins' first birthday.  \n\nNow, I don't feel obligated to do every mini session she has.  She'll throw in a back to school theme, or a beach theme, and we don't go to those. But if it's a weekend that we have open, it's so easy for us to wrangle three kids together for a 30 minute session. And at the end of the day, the price is right. So if the kids don't cooperate, and I get 2 good photos instead of 20, I'm not that fussed.\n\nMy suggestion would be to advertise on facebook as much as you want.  If you're feeling the weather one day and you want to say \"hey, I found this great field of daisies, book your session for tomorrow\", that's a great idea.  It gets people to know you, gets them to think about and associate you with photo sessions, and there's no pressure or hard sell aspect to a mini session.\n\nYou may also want to try a give away -- for every person who likes your page, they get a ticket in a raffle for a free or half price mini session, or something of that nature.\n\nLong post short - do as many sessions as you want.  People will book only the ones they want to book and they wont feel obligated to attend more than they want.", "controversiality": 0, "created_utc": 1475167494, "distinguished": null, "edited": false, "gilded": 0, "id": "d873cbk", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476184104, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dedicednu", "author_flair_css_class": null, "author_flair_text": null, "body": "My son is two and we have yet to do a professional photo session, even though I really really want to. We had one done in the hospital room when he was born, but that's it. We've done our own little set up for Christmas but they never turn out like I want them to. I would probably only do one a year. I'd either do one for Fall or Christmas, but not both in one year. \n\nSince I'm a SAHM I could never afford the outrageous price I see people pay on Facebook and my husband doesn't see the point in them at all. So I usually set my son down next to a pumpkin display at a festival and snap a picture with my phone. ", "controversiality": 0, "created_utc": 1475172153, "distinguished": null, "edited": false, "gilded": 0, "id": "d877349", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476186650, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BeBubbly", "author_flair_css_class": null, "author_flair_text": null, "body": "I think a lot of families only do it once a year, and mostly in the fall prepping for holiday cards.  I just had some done with my favorite photographer, we use him once every two years, and he said there is a family he shoots 4 times a year! And he isn't cheap. So, I think the very unhelpful but accurate answer is it is different for every family. ", "controversiality": 0, "created_utc": 1475174931, "distinguished": null, "edited": false, "gilded": 0, "id": "d8799h1", "link_id": "t3_552n6t", "parent_id": "t1_d8724d7", "retrieved_on": 1476188112, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sjb1985", "author_flair_css_class": null, "author_flair_text": null, "body": "I try to do 1 family one- once per year. My son will get at least one around Christmas, Halloween, and other days. We don't pay for them as Grandma is a photographer. She takes photos all year. ", "controversiality": 0, "created_utc": 1475176118, "distinguished": null, "edited": false, "gilded": 0, "id": "d87a6ny", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476188748, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "good ones once a year", "controversiality": 0, "created_utc": 1475177550, "distinguished": null, "edited": false, "gilded": 0, "id": "d87bbai", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476189530, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "orantte", "author_flair_css_class": null, "author_flair_text": null, "body": "Our photog is also very affordable. In our baby's first year I had lots of pics done, I really loved that first year of growth! We did newborn, baptism, easter, a random sporty/summer 8 month old one, fall family outside shoot and christmas family inside. In following years we've done only easter and christmas family. ", "controversiality": 0, "created_utc": 1475178671, "distinguished": null, "edited": false, "gilded": 0, "id": "d87c74z", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476190129, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "AmazingGraceFace", "author_flair_css_class": null, "author_flair_text": null, "body": "We do a birthday/family session, in July. ", "controversiality": 0, "created_utc": 1475179530, "distinguished": null, "edited": false, "gilded": 0, "id": "d87cvnx", "link_id": "t3_552n6t", "parent_id": "t1_d8724d7", "retrieved_on": 1476190610, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/12, 1/15", "body": "Shamelessly model after other businesses you respect. Be detailed and firm in all your policies. Set it up the way you want to and either you'll attract the clients who also don't like the prevailing model or you'll start seeing why it's run that way and can shift accordingly. That's the wonderful thing about your own small business--if you decide it should be different down the road, change it! Just commit to whatever you think the best version is now.", "controversiality": 0, "created_utc": 1475180425, "distinguished": null, "edited": false, "gilded": 0, "id": "d87dkdm", "link_id": "t3_552n6t", "parent_id": "t1_d8726sg", "retrieved_on": 1476191091, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "xboxwidow", "author_flair_css_class": "blue", "author_flair_text": "Three boys, 10, 7, and 1 ", "body": "Once a year, for Christmas cards", "controversiality": 0, "created_utc": 1475183678, "distinguished": null, "edited": false, "gilded": 0, "id": "d87g1yp", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476192895, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "superlalaura328", "author_flair_css_class": "lightcoral", "author_flair_text": "I'm tired, so very tired.", "body": "Literally never. ", "controversiality": 0, "created_utc": 1475184233, "distinguished": null, "edited": false, "gilded": 0, "id": "d87gggl", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476193177, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MRSAurus", "author_flair_css_class": null, "author_flair_text": null, "body": "Once every other year or so, if that. The idea of taking multiple photo shoots through the a single year seems extremely excessive. ", "controversiality": 0, "created_utc": 1475184399, "distinguished": null, "edited": false, "gilded": 0, "id": "d87gkrh", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476193260, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "It took me so long to find this comment. I was starting to think I was the only one!", "controversiality": 0, "created_utc": 1475185380, "distinguished": null, "edited": false, "gilded": 0, "id": "d87ha6h", "link_id": "t3_552n6t", "parent_id": "t1_d87gggl", "retrieved_on": 1476193761, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "superlalaura328", "author_flair_css_class": "lightcoral", "author_flair_text": "I'm tired, so very tired.", "body": "Nope, you're not alone! I'm not a fan of professional photos. I take tons of candid photos of the kiddos doing fun stuff, smiling, playing, etc. Those are the photos I love. But spending $200 to see us standing around wearing clothes we hate and forced smiles? No thanks, lol. ", "controversiality": 0, "created_utc": 1475185646, "distinguished": null, "edited": false, "gilded": 0, "id": "d87hh6u", "link_id": "t3_552n6t", "parent_id": "t1_d87ha6h", "retrieved_on": 1476193911, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dathyni", "author_flair_css_class": null, "author_flair_text": null, "body": "Haven't yet, don't really I tend to. Of course, she is only three months. Now, if we were getting a whole ton of extended family together...maybe? But no, you are no alone.", "controversiality": 0, "created_utc": 1475185955, "distinguished": null, "edited": false, "gilded": 0, "id": "d87hp6o", "link_id": "t3_552n6t", "parent_id": "t1_d87hh6u", "retrieved_on": 1476194080, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mangetoute", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly, never, I think posed family pictures look ridiculous.  If I never see another oversaturated family in jeans and shirts in front of a barn door or a vintage truck, it'll be fine with me.  I have about 10,000,000 pictures of my family and when I see a particularly nice one, I print it as an 8x10 and put it in a frame.  Occasionally I'll photoshop it a bit first.  ", "controversiality": 0, "created_utc": 1475187519, "distinguished": null, "edited": false, "gilded": 0, "id": "d87is7m", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476194844, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sweetcheeksberry", "author_flair_css_class": null, "author_flair_text": null, "body": "I never get them done. My mom got suckered in by some mall photo kiosk so I have like 4 \"professional\" photos that cost a ridiculous amount of money. They're cute, but not worth it.\n\nI get photos from school when it comes around but they always suck. Luckily my husband is very good at photography and I don't suck too much either so we have a lot of good (free) photos. \n\nBut the whole posing and formal thing. Nope.\n\nWhat might get me in is quality. Don't come up to me saying some bullshit like \"You're kid could be a model!! Let's make a portfolio!\" Yeah. They did that. Get away from me with that nonsense.", "controversiality": 0, "created_utc": 1475188567, "distinguished": null, "edited": false, "gilded": 0, "id": "d87jhf3", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476195389, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "I think a lot of it depends on how you market yourself and what kind of clients you end up having. If you want to take props/minis types of themed shoots, you'll end up with clients who want those. If you do the other kinds, it'll be that kind of client. But I think bottom line is that everyone struggles with how to grow their business in a non-pushy way. \n", "controversiality": 0, "created_utc": 1475188749, "distinguished": null, "edited": false, "gilded": 0, "id": "d87jlsp", "link_id": "t3_552n6t", "parent_id": "t1_d8725ne", "retrieved_on": 1476195478, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KaterMurrCat", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly! I feel the same way. I'd rather have action shots or photos I've taken at home in our normal life then posed ones that don't come with any memories. When I see those annual photos from school that everyone had taken as a kid, literally all they show me is what I looked like. All of our family photos show so much more.", "controversiality": 0, "created_utc": 1475188790, "distinguished": null, "edited": false, "gilded": 0, "id": "d87jmt9", "link_id": "t3_552n6t", "parent_id": "t1_d87hh6u", "retrieved_on": 1476195498, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Rose1982", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep samesies. My husband has a good eye and a few good cameras, we're good. But I totally seem to be the outlier among my friends with kids. ", "controversiality": 0, "created_utc": 1475189096, "distinguished": null, "edited": false, "gilded": 0, "id": "d87ju2f", "link_id": "t3_552n6t", "parent_id": "t1_d87hh6u", "retrieved_on": 1476195674, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "So don't do them! Why do something you hate?", "controversiality": 0, "created_utc": 1475189187, "distinguished": null, "edited": false, "gilded": 0, "id": "d87jw7l", "link_id": "t3_552n6t", "parent_id": "t1_d87229u", "retrieved_on": 1476195717, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SeaStar96", "author_flair_css_class": null, "author_flair_text": null, "body": "You can offer that you do all sorts of holidays, or themes. But no mom is alike.\n\nFor me, I never got photos done. Except when my son was 6m old his grandma insisted he needed to be in a picture with santa and promised to pay for it, then after we got the pictures said she needed to pay for her brothers daughters picture portion and that we needed to pitch in for theirs and ours (also I was 18 he's 52, and she's 54. Shouldn't they have dependable finances and not exploit me for money) \n\nHowever, if I had more disposable income, I'd definitely get photos done with whatever whim. With babies 0, 6m, 12m, 18m , 2 yrs it should be every 6 months because the growth they make is quite dramatic. But after 2 it should focus more on themes relating to holidays and the child's interests. ", "controversiality": 0, "created_utc": 1475189721, "distinguished": null, "edited": false, "gilded": 0, "id": "d87k8wq", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476195970, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ladyhallow", "author_flair_css_class": null, "author_flair_text": null, "body": "Professionally.... never... sorry hun", "controversiality": 0, "created_utc": 1475195222, "distinguished": null, "edited": false, "gilded": 0, "id": "d87nvvv", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476198627, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Saffron_says", "author_flair_css_class": null, "author_flair_text": null, "body": "Same here - thankfully Instagram effects hide the flaws of my amateur iPhone photograpy.", "controversiality": 0, "created_utc": 1475195667, "distinguished": null, "edited": false, "gilded": 0, "id": "d87o6s5", "link_id": "t3_552n6t", "parent_id": "t1_d87gggl", "retrieved_on": 1476198841, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "princessbuttercup87", "author_flair_css_class": null, "author_flair_text": null, "body": "This means you have not been with a good photographer! I'm a lifestyle photographer and I just come and capture your special moments! I detest posing people, it's not fun. I'll do it if they want but my best images are the ones that I capture while you forget I'm there! I have tons of images of my kids and my husband and kids but being the one always behind the camera there are never any of me!! :p we are investing in a really great photog when we go to Hawaii to capture all of us so my kids can know that they didn't grow up motherless 😂\n\n*edit typo", "controversiality": 0, "created_utc": 1475196174, "distinguished": null, "edited": false, "gilded": 0, "id": "d87oj83", "link_id": "t3_552n6t", "parent_id": "t1_d87hh6u", "retrieved_on": 1476199103, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1475197709, "distinguished": null, "edited": false, "gilded": 0, "id": "d87pkra", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476199854, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Vittoria12", "author_flair_css_class": null, "author_flair_text": null, "body": "We do Christmas and birthday. Luckily his birthday is in spring so we do Easter/family/birthday all in one shoot. I love our photographer but they are soooo pricey. I'm actually shopping around for a new photographer so I can do more throughout the year. I was thinking of trying a Facebook mini session but the ones I have seem don't seem as nice as my photographer. :(", "controversiality": 0, "created_utc": 1475198331, "distinguished": null, "edited": false, "gilded": 0, "id": "d87q018", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476200174, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "shiveringmeerkat", "author_flair_css_class": null, "author_flair_text": null, "body": "We do late fall family photos and then a yearly portrait on our daughter birthday. Photos are huge in my family and as awesome as my camera is and the number of candid photos we take are wonderful- we rarely get photos of all of us together as a family. Usually one parent and our daughter. So family photos are a big deal for us.", "controversiality": 0, "created_utc": 1475201147, "distinguished": null, "edited": false, "gilded": 0, "id": "d87rw9f", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476201540, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "EightyHM", "author_flair_css_class": null, "author_flair_text": null, "body": "We are getting our family pictures done on Saturday for the first time since last October. I would *love* to get them done more often, but everywhere around here is just so dang expensive that I can't justify it. If I'm going to spend a good chunk of money, I feel like there are things that it would be better spent on. \n\nHowever, when I see mini sessions pop up around the holidays or throughout the year I'm much more inclined to do one of those than I am to splurge on a family session...I'll probably stick to once a year for those, especially once my kids get older. But if the mini sessions are offered at a reasonable price I would take up the offer, I'm a sucker for cute pictures of my kids, especially if they can be used as a gift around father's day, Easter, birthdays, etc.", "controversiality": 0, "created_utc": 1475201291, "distinguished": null, "edited": false, "gilded": 0, "id": "d87rzop", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476201608, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CoffeeGodCigarettes", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not a prop person either, I do all my mini sessions in a local state park and that gets pretty good traction still.  The only place I advertise when I'm doing a whole day with staggered booking times for a reduced rate is the local city fb garage sale site and they fill up pretty quickly.  I generally do two days in spring or early summer, and two days in fall when the leaves are changing where I am.  But, my photography is supplemental income to my other freelancing, so I only allot weekends to it and thus take on a lot less booking.  It's all about what fits your life.", "controversiality": 0, "created_utc": 1475205605, "distinguished": null, "edited": false, "gilded": 0, "id": "d87uvk2", "link_id": "t3_552n6t", "parent_id": "t1_d8725ne", "retrieved_on": 1476203718, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BabyJaysMom", "author_flair_css_class": null, "author_flair_text": null, "body": "The one thing I always promised myself was a professional photo of my baby every month for his first year. If I did nothing else, I wanted that for myself. \n\nOn his birthday I will have his one year photos taken with his father and I and our two dogs. Later, we will have his smash cake photos. After that, it will be yearly. \n\nBut I will forever have photos of my boy for every month in his first year and I am thankful for that as he has grown so much and I already feel like I've missed it all. But I have my photos and I'm happy for it. ❤ \n\nThis was my gift to myself. I will do the same for any other children we have and fortunately it will be easy as the photographer I found is now our \"family photographer.\" \n\nI'm going to go look back now and cry a little bit about how much my boy has grown in just a year. 😭😭😭", "controversiality": 0, "created_utc": 1475218932, "distinguished": null, "edited": false, "gilded": 0, "id": "d8812qy", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476208326, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Dwightschrutesmom", "author_flair_css_class": null, "author_flair_text": null, "body": "My kid is 2 and I have never had a professional photograph taken of him aside from the pics they took while we were in the hospital. ", "controversiality": 0, "created_utc": 1475236896, "distinguished": null, "edited": false, "gilded": 0, "id": "d886hln", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476212340, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much! You sound like you speak from experience. ", "controversiality": 0, "created_utc": 1475244837, "distinguished": null, "edited": false, "gilded": 0, "id": "d88atj0", "link_id": "t3_552n6t", "parent_id": "t1_d87dkdm", "retrieved_on": 1476215639, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "I think that is part of my struggle too. I am a stay at home mom and my husband is a full time freelancer, so much of my business is more \"part time\" and our household doesn't rely on the income so if I have to sacrifice time for my husband to take extra meetings or attend conferences it usually happens. Not ideal, but it's a balancing act for sure. ", "controversiality": 0, "created_utc": 1475244954, "distinguished": null, "edited": false, "gilded": 0, "id": "d88awdz", "link_id": "t3_552n6t", "parent_id": "t1_d87uvk2", "retrieved_on": 1476215698, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't hate mini sessions, I hate the prop sessions, haha! A short session doesn't have to be themed. I was just wondering what other people thought of the themed sessions because I don't personally dig it. ", "controversiality": 0, "created_utc": 1475245041, "distinguished": null, "edited": false, "gilded": 0, "id": "d88ayfx", "link_id": "t3_552n6t", "parent_id": "t1_d87jw7l", "retrieved_on": 1476215741, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "That's not the kind of work I do either. I consider myself to be a documentary style photographer. But I have also found that so many people need some direction and posing to not just feel lost and confused about what they should be doing. You would be surprised how many people can't just pretend the camera isn't there. That's what I had been working for with people but they have struggled to be natural. My favorite sessions are family traditions and experiences- baking cookies, going to the pumpkin patch, playing at the park. But while everyone favors natural pictures I have found almost no one willing to pay for them because they think they can just take them themselves.", "controversiality": 0, "created_utc": 1475245470, "distinguished": null, "edited": false, "gilded": 0, "id": "d88b8u1", "link_id": "t3_552n6t", "parent_id": "t1_d87hh6u", "retrieved_on": 1476215956, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "That's kind of how I feel too, haha. Although I pull out my camera and document a lot of our daily life. That's kind of the niche I wanted to fill- professional quality photos for walls but also family photo albums. The way I imagine it, families will always prefer to look through albums and have hose tangible memories, I can't picture a family plugging in a USB drive to a computer when they feel like looking through family pictures - or searching through billions of cell pictures stored in a very unorganized way on a computer. ", "controversiality": 0, "created_utc": 1475245670, "distinguished": null, "edited": false, "gilded": 0, "id": "d88bdtd", "link_id": "t3_552n6t", "parent_id": "t1_d87gkrh", "retrieved_on": 1476216060, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "There are so many better ways to take family photos, I'm sorry that's all you seem to see near you. It breaks my heart. I see it too. The photography world is just saturated with businesses and not all photographers have the right skill sets for every session or every family.  ", "controversiality": 0, "created_utc": 1475245766, "distinguished": null, "edited": false, "gilded": 0, "id": "d88bg7x", "link_id": "t3_552n6t", "parent_id": "t1_d87is7m", "retrieved_on": 1476216108, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly! I hate hat commercial crap. \n\nI love the idea of the informal family session. I have done some in people's homes before. I actually got to be at home with a family the morning of their little girls 1st birthday and it was super sweet. They knew there would be a billion people and pictures at her party later in the day, but they wanted a way to remember how they celebrated her first year with just them. No posing, just natural sweetness, lots of snuggles, and a ornery one year old :-)", "controversiality": 0, "created_utc": 1475245967, "distinguished": null, "edited": false, "gilded": 0, "id": "d88bl5n", "link_id": "t3_552n6t", "parent_id": "t1_d87jhf3", "retrieved_on": 1476216214, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you just use your cell phone? ", "controversiality": 0, "created_utc": 1475246058, "distinguished": null, "edited": false, "gilded": 0, "id": "d88bneq", "link_id": "t3_552n6t", "parent_id": "t1_d87nvvv", "retrieved_on": 1476216260, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "It definitely wouldn't be the same. A mini session is pretty fast paced and a little less personal with the way many people run them. That's why I'm trying to think outside the box a little bit with how to approach them. Because I fear a short time line and very limited results. Some kids and some families just need more time to warm up and feel natural and that's how it should be. Not like lining up for school pictures, fake smiling, and moving on. ", "controversiality": 0, "created_utc": 1475246172, "distinguished": null, "edited": false, "gilded": 0, "id": "d88bq99", "link_id": "t3_552n6t", "parent_id": "t1_d87q018", "retrieved_on": 1476216319, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "That's awesome that you recognize that! That's one of my pushes for some informal family sessions- normal family moments and memory making is super important, but if you want great pictures of it the best thing you can do is find someone else to take them for you so that your whole family is together in the images. If someone's behind the camera they don't get to be a part of it. It's like the same issue with being a tourist- you spend so much time trying to take pictures to remember your trip that you forget to enjoy your trip while it is happening. ", "controversiality": 0, "created_utc": 1475246336, "distinguished": null, "edited": false, "gilded": 0, "id": "d88buci", "link_id": "t3_552n6t", "parent_id": "t1_d87rw9f", "retrieved_on": 1476216404, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "I have seen a lot of people say the prices are just too unreasonable for their budget, do you mind me asking what the prices are that you see that are unreasonable? My prices aren't astronomical, but they are not dirt cheap, but I include a lot for people who book with me- complementary albums, digital copies and printing rights. It's important to me that people don't just get pictures taken, but that they have their pictures- whether that's a photo book or prints delivered to their door. We all love social media, but how many of us print our own photos on the regular? ", "controversiality": 0, "created_utc": 1475246545, "distinguished": null, "edited": false, "gilded": 0, "id": "d88bzry", "link_id": "t3_552n6t", "parent_id": "t1_d87rzop", "retrieved_on": 1476216516, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "I think they're fun, but like I commented somewhere else in the thread, I think if you don't offer them you won't get clients who like them, and if you do, you'll develop a client base that does. Since you dislike them, don't offer them, and your client base probably won't develop as wanting them...but they might ask you for them, in which case you can always evaluate again later!", "controversiality": 0, "created_utc": 1475246577, "distinguished": null, "edited": false, "gilded": 0, "id": "d88c0md", "link_id": "t3_552n6t", "parent_id": "t1_d88ayfx", "retrieved_on": 1476216533, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my goodness, right? \nBest thing I did for myself was photograph my son's first haircut, first birthday shopping trip, first pumpkin carving, first Christmas cookies and tree decorating. He was just so little and curious. I look through those images and weep over my big boy. I didn't really focus on his age so much as his milestones. ", "controversiality": 0, "created_utc": 1475246671, "distinguished": null, "edited": false, "gilded": 0, "id": "d88c31m", "link_id": "t3_552n6t", "parent_id": "t1_d8812qy", "retrieved_on": 1476216586, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Very true, very true. I have been open for like a year now, and I just feel the struggle of advertising for sessions that are out of the norm for his area. People \"get\" that themed mini session thing, but they struggle with \"family fun sessions\" which were my take on a summer mini session - playing, having fun, doing family activities together (park, water gun fight, camping, fishing). The struggle is real. ", "controversiality": 0, "created_utc": 1475246889, "distinguished": null, "edited": false, "gilded": 0, "id": "d88c8kb", "link_id": "t3_552n6t", "parent_id": "t1_d88c0md", "retrieved_on": 1476216702, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hajisaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "As a former photog, I can say that during the first year, we marketed a lot more for the every three months interval (usually tied in with a package from maternity/newborn) because kids change so fast in that time. Then we tried to make sure we saw people yearly afterward. Some folks did twice a year (Easter &amp; Christmas, usually). Once clients have a larger family, the children become harder to capture in the \"whole family\" portrait so we'd do sessions where we'd get the kids separately and \"hope\" for a group pic where everyone was looking at the camera together and smiling. \n\nWhen you book your sessions, try to ask what their end goal of the portraits will be. Are they looking for their holiday card? Do they want something to hang on the wall? Photo gifts? That way you can tailor the session to making sure they get what they want (and upsell in the specific products to go with the goal in the process). \n\nDon't forget, too, that every client is different and their aesthetic may not always match up with yours. If you can get a feel for what they've already had done and/or liked (or not liked) with previous photographers, you can work with those expectations rather than against them. \n\nBeen there, so feel free to PM me directly if you have any questions. :)", "controversiality": 0, "created_utc": 1475247902, "distinguished": null, "edited": false, "gilded": 0, "id": "d88cyyr", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476217265, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "EightyHM", "author_flair_css_class": null, "author_flair_text": null, "body": "The photographer we use charges $150 for a 30 minute session (18 pictures) and $200 for a 40 minute session (30 pictures). \n\nHer mini sessions are usually around $125 for 20 minutes and 12 pictures. \n\nShe is the cheapest photographer in our area so that's why I use her haha", "controversiality": 0, "created_utc": 1475247917, "distinguished": null, "edited": false, "gilded": 0, "id": "d88czch", "link_id": "t3_552n6t", "parent_id": "t1_d88bzry", "retrieved_on": 1476217272, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/12, 1/15", "body": "My husband is a sales manager and I teach flute lessons. I'm still a young teacher but when I first started having a proper studio after grad school, I had a hard time being firm about practice requirements and such because I was thinking too much about how busy each family was. My husband was a great help to me in realizing pretty much what I've said above. Nobody else in these kids' lives was going to advocate for flute or music. Nobody else knows what it takes to be really good at it or how great the rewards are for sticking it out. If I was meek about it, soccer and social studies would always win and they'd never even know what they were missing out on. I'm still working on it and refining it cause it's hard and communicating it well is hard too! And not all my families are on board with it but I've noticed an increase in the respect they treat me with if nothing else.", "controversiality": 0, "created_utc": 1475248235, "distinguished": null, "edited": false, "gilded": 0, "id": "d88d7n6", "link_id": "t3_552n6t", "parent_id": "t1_d88atj0", "retrieved_on": 1476217479, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ladyhallow", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes. Some day I hope to have a nice camera (just for personal use) but for now cell phone it is.", "controversiality": 0, "created_utc": 1475249500, "distinguished": null, "edited": false, "gilded": 0, "id": "d88e5l7", "link_id": "t3_552n6t", "parent_id": "t1_d88bneq", "retrieved_on": 1476218185, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "I hear you. I am very new to photography and am really struggling just to get people to let me take their photo. It is really hard to walk the line between \"I want to do this because I enjoy it\" and \"I want to make money doing this,\" and then what you are willing to stretch to do to hit whichever goal you are aiming for.", "controversiality": 0, "created_utc": 1475250578, "distinguished": null, "edited": false, "gilded": 0, "id": "d88eyou", "link_id": "t3_552n6t", "parent_id": "t1_d88c8kb", "retrieved_on": 1476218787, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, that's pretty close to what it should be, but even that is on the high end for my local area. It stinks how variable it is. A good photographer should be well worth that. ", "controversiality": 0, "created_utc": 1475251385, "distinguished": null, "edited": false, "gilded": 0, "id": "d88fkmk", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476219235, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah it seems to weed out the people who don't value the service and you for providing it. ", "controversiality": 0, "created_utc": 1475251528, "distinguished": null, "edited": false, "gilded": 0, "id": "d88foil", "link_id": "t3_552n6t", "parent_id": "t1_d88d7n6", "retrieved_on": 1476219314, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "Exactly! Your love for it makes you susceptible to being under-valued and taken advantage of, but if you swing to hard the other way (which I did) then you don't have enough of a customer base or enough visibility to build one. I know by dropping prices or changing offerings I will be drawing in customers that aren't my ideal customer, but I don't know how else to build the visibility I need to draw in my ideal customers. The struggle is so very real. ", "controversiality": 0, "created_utc": 1475251690, "distinguished": null, "edited": false, "gilded": 0, "id": "d88fswe", "link_id": "t3_552n6t", "parent_id": "t1_d88eyou", "retrieved_on": 1476219404, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KateAWP", "author_flair_css_class": null, "author_flair_text": null, "body": "That's great advice thank you!!!", "controversiality": 0, "created_utc": 1475251752, "distinguished": null, "edited": false, "gilded": 0, "id": "d88fuj6", "link_id": "t3_552n6t", "parent_id": "t1_d88cyyr", "retrieved_on": 1476219436, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "I used to do freelance illustration, and also ran into the issue that if you undervalue your work, you miss out on some customers who would pay more and think your work must suck if you don't charge ENOUGH. It's such a hard thing to start a business, regardless of the medium. \n\nI feel uncomfortable having prices right now, since I struggle to find subjects. But I'm recognizing that it's important to have a set rate, too. ", "controversiality": 0, "created_utc": 1475252675, "distinguished": null, "edited": false, "gilded": 0, "id": "d88gjxi", "link_id": "t3_552n6t", "parent_id": "t1_d88fswe", "retrieved_on": 1476219958, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BabyJaysMom", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't plan milestones but that's what our phones are for, all the little things he learns and does every day. But each month I have a different and adorable photo shoot for him with props and everything. Last month was ALL THE BALLOONS themed and the month prior was ALL THE FRUITS and the month before that was ALL THE BUBBLES (bathtime). Really he got a kick out of it and I have fantastic and professional photos of my boy growing. I love it. ❤", "controversiality": 0, "created_utc": 1475257635, "distinguished": null, "edited": false, "gilded": 0, "id": "d88kcu0", "link_id": "t3_552n6t", "parent_id": "t1_d88c31m", "retrieved_on": 1476222787, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "StarDancin", "author_flair_css_class": null, "author_flair_text": null, "body": "In all honesty, I hardly ever have professional shots taken. Family requested I take professional photos within a year of his birth, and thats been about it as far as professional shots go. I am just not into spending cash for photos that are going to get buried. I don't even really do photo Christmas cards, so I'm kinda the exception I think. I do have a tumblr of photos that all family can access, and every so often I print a bunch off and mail off to grandparents, but that's about it. ", "controversiality": 0, "created_utc": 1475275546, "distinguished": null, "edited": false, "gilded": 0, "id": "d88x1bz", "link_id": "t3_552n6t", "parent_id": "t3_552n6t", "retrieved_on": 1476231998, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}