{"submission": {"author": "jmt1111", "author_created_utc": 1459363229, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_wrg4z", "contest_mode": false, "created_utc": 1476370112, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/57amcv/my_wife_is_struggling_with_being_at_home_with_our/", "gilded": 0, "id": "57amcv", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 62, "over_18": false, "permalink": "/r/Mommit/comments/57amcv/my_wife_is_struggling_with_being_at_home_with_our/", "retrieved_on": 1480229517, "score": 30, "secure_media_embed": {}, "selftext": "Hi everyone, to preface our son was born late September and for a week after the birth my wife's parents were here and she basically treated them as slave labor when I went back to work (non-stop chores and cooking, looking after dogs, etc) and now is trying to do the same thing to my mom.  \n\nWhen I talk with her about it she always says she needs a break from the baby but never gets help from the assistance she has had to do so or even much less take a nap because she considers herself so busy.\n\nI am supposed to take some time off next week to again help out and I already take care of the all the housework, cook for us, etc.  I am at my wits end with the constant complaining and gratification that she needs.  It is not possible for me to do everything even though I know she has minor discomfort (no more than any other first time mom).\n\nI work full time, am up at all feedings time during the night including diaper changes, do the housework, cook meals and still get the talk that I am not doing enough.  In addition, my mom is thinking about leaving for home early as she is so frustrated not being able to take some time with her grandson.\n\nDoes anyone have advice that has been a similar situation as I am in desperate need to try and make things better not only for myself but my wife as well.\n\nThanks Reddit", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "My wife is struggling with being at home with our newborn son and is making family basically slave labor", "url": "https://www.reddit.com/r/Mommit/comments/57amcv/my_wife_is_struggling_with_being_at_home_with_our/"}, "comments": [{"author": "layingaguy", "author_flair_css_class": null, "author_flair_text": null, "body": "Is this relatively normal behaviour for her? I mean was she a little high maintenance before baby? Could she be experiencing postpartum depression and not realizing it? Are there some new mommy groups she could get out to to speak to other new moms? ", "controversiality": 0, "created_utc": 1476370508, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qaylq", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478573228, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RockyMountainMama", "author_flair_css_class": null, "author_flair_text": null, "body": "It's only been a few weeks. Becoming a mom is such a major transition. Maybe give her a little longer to ease into things. In the meanwhile, would it be possible to hire something like Merry Maids to come once or twice? ", "controversiality": 0, "created_utc": 1476370870, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qb8ta", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478573364, "score": 25, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "No, it is not normal behavior for her.  She would make dinner basically all the time, help me with chores, etc and was usually upbeat.  That has definitely trended downwards from being 6 months pregnant when she would no longer go out with to me functions, movies/entertainment.  I realized she was not dealing with being pregnant as well as other first time pregnancies when we went to classes and others were functioning much more", "controversiality": 1, "created_utc": 1476370907, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qb9u2", "link_id": "t3_57amcv", "parent_id": "t1_d8qaylq", "retrieved_on": 1478573378, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "Once the family leaves, our house cleaning service will be coming once every two weeks again as it used to.  I agree she may need more time but it's difficult and I want to try and make things better for her", "controversiality": 0, "created_utc": 1476371020, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qbcyb", "link_id": "t3_57amcv", "parent_id": "t1_d8qb8ta", "retrieved_on": 1478573419, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SassafrassMcGee", "author_flair_css_class": null, "author_flair_text": null, "body": "Aside from the physical adjustments that have to be made after introducing a baby into the world, both in terms of her body and her surroundings, the hormonal changes that women experience after delivery are drastic. There could be a chance that she is suffering from post-partum depression. Here's a link with some symptoms which sound like some of the issues your wife has been having.\n\nhttp://www.babycenter.com/0_postpartum-depression-and-anxiety_227.bc\n\nI know it may be difficult because you feel like your wife is sloughing her responsibility off on you and your family, but try to be as supportive as you can. If you think that there may be some likelihood that her issues are related to PPD, have her talk to her OBGYN or her GP to figure out what steps she can take to help.", "controversiality": 0, "created_utc": 1476371183, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qbhka", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478573480, "score": 107, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "layingaguy", "author_flair_css_class": null, "author_flair_text": null, "body": "I would for sure see her OBGYN or doctor. My spouse was given sort of a \"things to look for\" list by the nurses after I had my first. Postpartum depression or anxiety can come in many forms. For myself it didn't hit until I had my second child and was more anxiety than depression but I felt it changing the way I thought about a lot of things. Check into it for sure!", "controversiality": 0, "created_utc": 1476371256, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qbjma", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478573508, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "She is going to the dr again on Friday and I will be unable to attend, however I know she feels she is just normal and would put on a different face at the doctor so I doubt she would ever bring it up", "controversiality": 0, "created_utc": 1476371738, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qbxcp", "link_id": "t3_57amcv", "parent_id": "t1_d8qbjma", "retrieved_on": 1478573692, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MarianneDashwood", "author_flair_css_class": null, "author_flair_text": null, "body": "She may have postpartum depression but she also may just be dealing with the overwhelming feeling that she is responsible for keeping another human alive 24 hours per day. \n\nWith my first son, the most exhausting part for me was the knowledge that it doesn't end-- I knew this before I had a baby, but I didn't really KNOW it. The other thing that I think is really insane for first time moms is that no one ever really lets you know that life will feel normal in a few months. So that beginning feeling of \"I have to keep this kid alive, I always feel like crying, I can't remember my old life\"-- I just assumed that was forever. \n\nI didn't have family support, just my husband, so I didn't delegate, but if I had had parents or in-laws....not going to lie, with that first kid I would have probably tossed him to the first adult who was willing. With my subsequent children, I've had no problem because I know all of that physical, mental, social, and emotional chaos is temporary. \n\nI would recommend a mom group, but I also don't think even mom groups really delve into what some first time moms need to hear, which is, \"this totally sucks, and if continued to suck this bad forever, no one would do it a second time. Everything is going to seem better, normal, and happy in a few months. I know you cannot imagine that that's true, but it really will happen. Also some people don't even like their babies at first, and they still later form all the bonds and love they're supposed to feel. Don't worry. Just get through the day. You have forgotten what normal feels like. It's coming back soon.\" \n\n\nAnd get meds if needed. Meds, sleep, showers, and conversation with other adults.", "controversiality": 0, "created_utc": 1476372664, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qcnzu", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478574047, "score": 19, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Snail_lady", "author_flair_css_class": null, "author_flair_text": null, "body": "This needs to be higher up. I had SEVERE ppd after my first was born. I denied it for a year and it damn near broke my family. I finally went on medication and started seeing a therapist and it was like night and day. ", "controversiality": 0, "created_utc": 1476372679, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qcofy", "link_id": "t3_57amcv", "parent_id": "t1_d8qbhka", "retrieved_on": 1478574053, "score": 23, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SassafrassMcGee", "author_flair_css_class": null, "author_flair_text": null, "body": "I had similar issues.\nI went to therapy, got on some medication, and evened out quite a bit. My son's father was not supportive in any way, however, and it led to the demise of our relationship.\nRather than accepting that what I was dealing with was a legitimate issue, he blamed me for being lazy and became increasingly abusive over the following year. I knew by my son's first birthday that I was going to have to get out of the relationship, and that only exacerbated my issues.\nIt's too bad that people can't acknowledge mental illness in the same way they do physical illness. \nUnfortunately, when it comes to PPD, it's something men will never be able to fully understand.", "controversiality": 0, "created_utc": 1476373328, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qd78x", "link_id": "t3_57amcv", "parent_id": "t1_d8qcofy", "retrieved_on": 1478574305, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ProfessorMMcGonagall", "author_flair_css_class": null, "author_flair_text": null, "body": "You have a baby that is not even a month old.  Did your wife have a vaginal delivery or a C-section?\n\nPeople who come to help with the baby after delivery *should* be helping.  They should be doing things around the house, cleaning, cooking, and allowing your wife to rest and recover.  Even if she did not have surgery, she still went through a lot medically and physically speaking. Your Mom may have come to visit and spend time with her grandson, but that is not what your wife needs, and that's not what the baby needs.  Your wife should be allowed to bond with her own child above your Mother.  The baby needs your wife, and your wife only right now.\n\nWhat do you expect your wife to do? Hand off her brand new baby to someone else so that she can cook and clean and do chores?  If your wife nursing or bottle feeding?  \n\nTaking care of a newborn is very, very hard.  Cut your wife some slack, and maybe don't side with your Mom on this one.  If she came by just to get baby cuddles, that's not what a new Mom needs.", "controversiality": 0, "created_utc": 1476373620, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qdfuz", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478574420, "score": 76, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Toswin", "author_flair_css_class": "red", "author_flair_text": "James T. 9/20/13", "body": "This sounds very much like Postpartum depression plus some depression during the pregnancy. I was the exact same way. You have to sit her down and talk with her, without getting frustrated, which will be very difficult. \n\nMy husband had the same issue with me, and reasoning with me was extremely hard for him because I was legitimately being unreasonable. Postpartum depression is more common than one would think. Shes got a lot going on with Hormones, caring for the baby, sore breasts, sore vagina, and just being attached to a little human all day that can't survive without you. It's overwhelming to say the least. \n\nBefore you talk to her, set up a game plan. Instead of saying \"I am upset that I am doing this, this\" and immediately going into what is wrong with her, try it from this angle. Say \"I am worried about you, are you ok? Do you want to talk about it?\" if she says she is fine, go with \"No you're not, you are not smiling, your crying a lot, you are disinterested in activities, and quite frankly your being extremely mean to everyone around you. I'm not mad, I am genuinely worried about you because this isn't normal. I think you need to talk to your OB about Postpartum depression, or me about it. I am here for you, I love you and I want to support you, but you are making me feel inadequate and hurting my feelings a lot too. I know that you are struggling, I am too, and I want to work on this with you so that we are on the same page. I need you too.\" \n\nLet her know you are hurting, and you understand that shes got a lot going on, but that you need her just as much as she needs you too. \n\n&lt;3 &lt;3 I hope she gets some help, postpartum depression is honestly the worst and can present itself in a lot of different ways. I knew enough was enough when I was laying in the bathtub crying while my son was screaming in the other room and my husband came in and said \"You need to call your doctor.\" ", "controversiality": 0, "created_utc": 1476373698, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qdi5f", "link_id": "t3_57amcv", "parent_id": "t1_d8qb9u2", "retrieved_on": 1478574451, "score": 25, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey I totally agree and thanks for the comment.  For the record I have told my mom what she needs to be doing to help out, if she doesn't like it well she can leave and she can think about it for several months.  My wife had a vaginal delivery and is breast feeding.  I am cutting her lots of slack hence me doing as much as I possibly can by doing chores, cooking cleaning, being up at night, etc", "controversiality": 0, "created_utc": 1476373905, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qdo96", "link_id": "t3_57amcv", "parent_id": "t1_d8qdfuz", "retrieved_on": 1478574533, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "It could be PPD but it can also take a good 6 weeks to recover physically, emotionally, and hormonal from pregnancy. Also, if someone is visiting and staying with you after you have a baby, they should help out around the house, so the mother and baby can be together. They are not slave labor, they are helping a new mom recover from pregnancy and birth. So unless your wife asked rudely, or never said thank you, I see no problem with expecting them to help. ", "controversiality": 0, "created_utc": 1476374179, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qdwai", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478574641, "score": 33, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "This is going to be hard for both of you. Keeping a tiny human alive is exhausting. New moms need support, their body literally squeezed a watermelon through a lemon sized hole. ", "controversiality": 0, "created_utc": 1476374369, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qe1w2", "link_id": "t3_57amcv", "parent_id": "t1_d8qdo96", "retrieved_on": 1478574717, "score": 19, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Snail_lady", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry that happened to you. Hopefully you're in a better, healthier, happier place now. \n\nI'm currently pregnant with number 2 and I'm terrified of the ppd coming back but I feel better prepared with what to look for and I won't wait a year before getting help. ", "controversiality": 0, "created_utc": 1476374371, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qe1yj", "link_id": "t3_57amcv", "parent_id": "t1_d8qd78x", "retrieved_on": 1478574718, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "Your wife may have a postpartum mood disorder so I hope she's seeing her GYN regularly. GYNs and midwives can spot this stuff even if the mom tries to hide it, but your wife still needs to be as honest as possible. \n\nAlso I recommend couples therapy for the two of you. This is a major change to your relationship, and it's a time when resentment can really build. If your wife is feeling paranoid then she may already resent her situation, but even if she's not, she may have very set ideas for how things \"should\" be at this time and wants everyone else to tow the line.\n\nAs for the recovery, I had a \"normal\" birth and felt like I'd been hit by a train physically, emotionally, and mentally. I was basically crazy. Nothing I did or said made any sense. Be aware that the person you're talking to may not be able to see things rationally at all (I strongly suggest not telling her this), so that line of argument won't work for you I'm afraid. It's all about compassion, time, and getting her the help she needs.", "controversiality": 0, "created_utc": 1476374429, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qe3q2", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478574742, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "es88", "author_flair_css_class": null, "author_flair_text": null, "body": "If your baby was born late September then baby is no more than 3 or 4 weeks old right? Is your wife breastfeeding? Asking grandparents who come visit so soon after baby is born to do basic chores, make meals, and take care of pets isn't \"slave labor\" in my opinion. That's absolutely what people who come to visit should be doing especially if mom is breastfeeding. What did they expect to be doing during these visits? I also noticed that you seemed to brush off her physical recovery as \"minor discomfort\" that is just like every other mom. This doesn't mean it is easy. She has had 9 months of physical toll on her body as she has grown another human, culminating in an extremely physically taxing event (birth) followed by insane postpartum hormones and her body is now working extra hard to literally provide the nourishment to keep another human alive. Regardless of how normal her experience is, this is all very very exhausting! I get it, you are exhausted too. You feel like you are doing everything. Because you are. You are doing everything you possibly can! But honestly from your post it sounds like you have little empathy for your wife's situation and believe she isn't doing everything she can too. It is very common after birth for each parent to believe they are doing it all and that their partner isn't pulling their weight. The reality is that you are both giving 150% and it's still not enough to do everything you did before you brought this tiny human home. My suggestion is to find some empathy for your wife, have a conversation with her about how you're both doing your best and you both need to appreciate the other and let some things go. The older baby gets, the easier things will become. You're only 3 weeks into this. It sounds like what you and your wife both need is a little more empathy and willingness to cut each other some slack.", "controversiality": 0, "created_utc": 1476374870, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qegpl", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478574914, "score": 125, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SassafrassMcGee", "author_flair_css_class": null, "author_flair_text": null, "body": "It's been 6 years. I've been great. My son is great!\nI hope #2 is better for you! Good luck!", "controversiality": 0, "created_utc": 1476374934, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qeinh", "link_id": "t3_57amcv", "parent_id": "t1_d8qe1yj", "retrieved_on": 1478574940, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "smutsmutsmut", "author_flair_css_class": null, "author_flair_text": null, "body": "If I could make one suggestion, do not compare what she's going through with what others may or may not be going through. I see you do it a few times: \"I realized she was not dealing with being pregnant as well as other first time pregnancies\" and \"even though I know she has minor discomfort (no more than any other first time mom).\" \n\nWhat she's going through is very real and legitimate to her. Even if her reaction seems drastic TO YOU, that doesn't change the fact that she perceives it a certain way. Yes, it does sound like she's struggling and that PPD is likely a factor, but talking about it IN THIS WAY is damaging.\n\nI slipped into PPD and it made things HARD. Regular, ordinary, everyday things. Until my husband understood that maybe there was an issue bigger than just baby blues, he would come at me with all these \"should\"s and \"other people\"s and it made me feel even worse. (As a side note, also, you have no idea what other people are going through behind closed doors, so to assume that other people fare better, and that you wife should be reacting XYZ way, you just don't know enough to say that.) \n\nTry to be understanding of what she's going through yet firm in suggesting that she might benefit from some therapy and/or help. But leave the comparisons out of it.", "controversiality": 0, "created_utc": 1476374951, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qej55", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478574946, "score": 48, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Snail_lady", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks! Glad you are doing well!", "controversiality": 0, "created_utc": 1476376504, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qfsy2", "link_id": "t3_57amcv", "parent_id": "t1_d8qeinh", "retrieved_on": 1478575556, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Stormieleigh", "author_flair_css_class": null, "author_flair_text": null, "body": "I think the \"being a first time mom\" is a poor excuse. It's right on up there with \"I'm pms-ing\" and \"I'm pregnant\".\nI'm a first time mom. I had my baby in the middle of July. There ended up being a complication (he pooped in the womb) and ended up getting a c-section. \nYet I still got up for feedings (nursing so I had too), for diaper changes, did the laundry, caring for the dog and sugar glider, cooking and cleaning, shopping etc. Sure the surgery made it hurt a little, but I still did what needed to be done. Still had time to sleep/nap. Still had time to bond with the baby. And still let other bond with him as well. \nJust started working full time again, so now having a little bit of help form the father is very much appreciated.\nCaring for a newborn and doing everyday tasks is NOT as hard as what everyone tries to make it seem. \nOr maybe it is and I'm just 1% that it's been super easy for. ", "controversiality": 0, "created_utc": 1476376680, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qfxxm", "link_id": "t3_57amcv", "parent_id": "t1_d8qdfuz", "retrieved_on": 1478575624, "score": -56, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for the comment and I totally agree that we could cut each other some more slack to help out.  My post may have come off a little disingenuous in regards to her pain, but I do sympathize and make sure she is taking her medication regularly and trying to recover to back to some normal state that makes her happy", "controversiality": 1, "created_utc": 1476377073, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qg9bu", "link_id": "t3_57amcv", "parent_id": "t1_d8qegpl", "retrieved_on": 1478575776, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you and I agree that we should not be comparing but those comparisons came from her and her talking with a few other friends she has that recently gave birth.  I want to be as supportive as possible and would never compare her to someone else because I know I don't know exactly what she is going through and could make things much worse", "controversiality": 0, "created_utc": 1476377182, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qgciw", "link_id": "t3_57amcv", "parent_id": "t1_d8qej55", "retrieved_on": 1478575819, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmt1111", "author_flair_css_class": null, "author_flair_text": null, "body": "That is great to hear and I am very happy for you.  If I were to ever mention this I am sure she would have a freak out that I even would bring up such a thing", "controversiality": 0, "created_utc": 1476377275, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qgf81", "link_id": "t3_57amcv", "parent_id": "t1_d8qfxxm", "retrieved_on": 1478575856, "score": -10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "princess-heya", "author_flair_css_class": null, "author_flair_text": null, "body": "I hope you can show her a little patience.  To assume she has no more discomfort than any other new mom is incorrect.  I have given birth 3 times and each one has had a different recovery. \n\nGive her time, and support.  It's a very difficult transition for anyone, and I am personally glad she is assertive enough to ask for help.  ", "controversiality": 0, "created_utc": 1476377300, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qgg0b", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478575866, "score": 24, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "turkproof", "author_flair_css_class": "purple", "author_flair_text": "How baby? HOW BABY?!", "body": "&gt; minor discomfort (no more than any other first time mom)\n\nhahahahahaHAHAHAHAHAHAHA H A H A H A H A **H A H A**", "controversiality": 0, "created_utc": 1476377637, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qgpzc", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478575998, "score": 88, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "Personally I'm on your wife's side here. She's still recovering from birth and her hormones are all over the place. Visitors after birth aren't and shouldn't be there for baby cuddles, they should be there for helping out mom - cooking, cleaning, running errands. If your mom isn't willing to do that, it's fine and she should go home because your wife isn't going to be playing host. \n\nAs for you, great job on stepping up and being supportive by doing extra housework and getting up at night. Try to remember that you're both quite sleep deprived, but on top of that, she's got crazy hormones messing with her mental state. It should even out somewhat after a few months. If it doesn't, definitely be on the lookout for post partum depression.", "controversiality": 0, "created_utc": 1476378578, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qhhob", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478576369, "score": 33, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "elysians", "author_flair_css_class": null, "author_flair_text": null, "body": "Not everyone heals as quickly or easily, though. Why do you assume OP's wife had the same or easier experience and has the same kind of body you do?", "controversiality": 0, "created_utc": 1476380161, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qitn4", "link_id": "t3_57amcv", "parent_id": "t1_d8qfxxm", "retrieved_on": 1478577011, "score": 36, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "elysians", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in the same boat as other commenters, people who assume they will \"give mom a break\" by caring for a newborn when they visit are ignorant (or have forgotten) that new moms don't usually need a break from their baby because the newborn is physically dependent on her for everything (in some cases, even sleeping peacefully), especially during the earliest breastfeeding days. What mom DOES need a break from is everything else that doesn't involve the baby: the cooking, the cleaning, the pets, the housework, the other kids. It's a pretty ice-cold reality check and I wish more dads, families, and in-laws were told prior to birth that for the first few months, it's Mom who takes care of baby because that's what baby needs. Everyone else usually takes care of Mom.", "controversiality": 0, "created_utc": 1476380303, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qixz5", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478577068, "score": 33, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "small_flower", "author_flair_css_class": null, "author_flair_text": null, "body": "Auch, the first few weeks, hell, months, are hard! Very, very hard. I have two kids now, and I didn´t recover until at least 6 weeks after birth physically, which is the normal time to take. With my second, I had my SO, my mother in law or my mother at home to help around with cooking, cleaning etc etc. \n\nIt's normal for at least 6 weeks to be able to depend solely on family and your SO to recover. No matter how 'normal' the discomfort is, in other cultures its normal a whole family helps the woman and baby the first weeks after. \n\nAfter 4 to 5 weeks, your LO may become more clingy, and less sleepy. There will come a time it is very, very hard to be home alone with your baby all day. There may be days she won't get anything done because the baby may cry all day and you need to give her a break.\n\nI know you feel like you're doing it all - you are - but assuming your wife would be on her feet after 3 weeks is not realistic. She will probably still bleed, she'll feel sore, tired, worn out and very, very tired. I see some people suggest PPD, but I think it's very normal after 3 weeks to feel not ok at all.\n\nFor me, personally, I always feel ok, never get sick when the rest is, but after labor I feel crappy for like weeks. With my first and my second, I went to bed at 8pm, slept, fed, slept, fed, slept, fed, etc. During the day, baby was crying, clingy, demanding, exhausting, and the circle doesn't end. \n\nIf your wife is still like this around 3 months, then there may be an other problem, but right know, it's really quite normal. \n\nBecoming a parent is exhausting for the both of you and I really hope you can figure it out. Babies are little life suckers in the first few months. Hang in there and it'll get better!", "controversiality": 0, "created_utc": 1476380555, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qj5je", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478577169, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_purple", "author_flair_css_class": null, "author_flair_text": null, "body": "Even if she doesn't have PPD it can take weeks to not feel miserable. Maybe let the house go a little bit until everyone is feeling more normal again. It won't hurt anything to be messy for a month or two and then you both can focus more on the baby and more importantly... sleep. ", "controversiality": 0, "created_utc": 1476380803, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qjczg", "link_id": "t3_57amcv", "parent_id": "t1_d8qdo96", "retrieved_on": 1478577270, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Stormieleigh", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not assuming anything about his wife. Which is why I didn't mention her.\nEvery other person is saying \"see a therapist\". Well, yeah. She definitely should. No point in repeating what a hundred other people are saying.\nI was terrified of becoming a parent because every single person seemed to say how hard and scary it is. \nMy personal experience is the complete opposite. Also threw in my opinion of the \"first time mom\" excuse (which, yes, could have been left out).", "controversiality": 0, "created_utc": 1476380997, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qjisv", "link_id": "t3_57amcv", "parent_id": "t1_d8qitn4", "retrieved_on": 1478577347, "score": -17, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sjb1985", "author_flair_css_class": null, "author_flair_text": null, "body": "I just think the first month was sooo hard. I breastfed, and there's not a lot else you can do when breastfeeding. If your mom is visiting in that time period, it is 100% acceptable that she be asked to pick up the slack and you need to too. Honestly, have you tried r/daddit? They might be able to guide you in their experience. I got two weeks with my husband. That was the only help I got and let me tell you this, that wasn't enough to keep our house standards up (constant visitors). So I would sit down with your wife and if you feel overwhelmed, she does too (obviously). I would suggest sitting down and asking her what things can be put on the back burner until needed. \n\nPS. if she feels your Mom isn't helpful then she probably feels uncomfortable with asking her to do things but still wants to maintain a nice house for the guest. Maybe it's time to let Mom go home - then your wife doesn't have to worry about messes or cleaning. She can just focus on baby and trying to take care of herself too.", "controversiality": 0, "created_utc": 1476381583, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qk08a", "link_id": "t3_57amcv", "parent_id": "t1_d8qg9bu", "retrieved_on": 1478577580, "score": 34, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crazyape123", "author_flair_css_class": null, "author_flair_text": null, "body": "At a month post-partum I still couldn't sit on hard surfaces comfortably. I would bleed heavier the more I tried to do. Pooping was scary and painful, every single time. Add in breastfeeding, the pain, uncertainty, and constant boob time. I literally sat at home and breastfed my child for the first two months. People visited often and I went grocery shopping, that's it. \n\nThis is hard. It's hard for your wife. It's hard for you and your relationship with your family. Set expectations a little lower, the housework can wait, buy paper plates and put off cleaning for a bit. Talk to your wife and make a game-plan to tackle each of your needs. This time will pass and looking back it will be just a blip amongst lots of baby cuddles.", "controversiality": 0, "created_utc": 1476381783, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qk63y", "link_id": "t3_57amcv", "parent_id": "t1_d8qdo96", "retrieved_on": 1478577659, "score": 39, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crazyape123", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Still had time to sleep/nap.\n\nHa. My kiddo woke up every 45 minutes on the dot. Just as I was falling asleep. It was torture.\n\nYou know, it's almost like people experience things differently.", "controversiality": 0, "created_utc": 1476381908, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qk9sk", "link_id": "t3_57amcv", "parent_id": "t1_d8qfxxm", "retrieved_on": 1478577708, "score": 38, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "chgdiapers", "author_flair_css_class": null, "author_flair_text": null, "body": "Late September, as in she just birthed a tiny human 2 weeks ago?  It's not \"minor discomfort\" in my experience.\n\nAside from the physical, it's emotionally draining, isolating and just plain hard.  She may need to be screened for PPD.", "controversiality": 0, "created_utc": 1476382667, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qkw5u", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478578006, "score": 18, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sweat-It-Out", "author_flair_css_class": null, "author_flair_text": null, "body": "Sounds like PPD to me. I had hormone issues causing severe depression not realizing it for the first year of my sons life. But I was on the other end of the spectrum, I didn't let anyone help me \"because I'm the mom and I have to do everything myself\" it is exhausting. It ended up spiraling to near psychosis because I refused to get help with my depression. I would be delicate when approaching her about the PPD if you have not already done so and nudge her to speak with her doctor about it. This is a hard time and is trying on all involved but the one who gets damaged the most by it will be your relationship and baby. It sounds like you are doing a great job of being there for her as far as helping around the house and being as patient as possible. Another thing to remember breastfeeding is hard and that first month sucks (the entire experience of breastfeeding for the first year was god awful for me but that is beside the point). She may be having depression as well when her milk comes down when feeding, I know I did. Long story short, have her speak to her doctor about PPD. Take the baby so she can go be by herself for at least 30 minutes a day and make her go into another room away from the baby or out of the house (it will do her good, I promise) and just continue to be there for her. You got this! :) ", "controversiality": 0, "created_utc": 1476382883, "distinguished": null, "edited": false, "gilded": 0, "id": "d8ql2mk", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478578092, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;Hi everyone, to preface our son was born late September and for a week after the birth my wife's parents were here and she basically treated them as slave labor when I went back to work (non-stop chores and cooking, looking after dogs, etc) and now is trying to do the same thing to my mom.  \n\nYou know, in some parts of the world, the mother's one and only job for the first 6 weeks after birth is to stay in bed with the baby while grandparents on both sides care for all household responsibilities, but carry on....\n\n&gt;When I talk with her about it she always says she needs a break from the baby but never gets help from the assistance she has had to do so or even much less take a nap because she considers herself so busy.\n\nYes, she's busy. Every second of the day she is responsible for keeping a helpless human alive. In the first 6 weeks, milk supply is still building, and at times baby may legitimately need to nurse every 45 minutes (or even more frequently). It's really hard to fit naps into that schedule. And chronic sleep deprivation makes EVERYTHING seem worse. \n\n&gt;I am supposed to take some time off next week to again help out and I already take care of the all the housework, cook for us, etc.  \n\nHow much housework is there? Why isn't your mom helping? I'll tell you what I tell anyonewho feels like they are drowning in housework: *hire help.* **But for heaven's sake don't use this to pressure your bruised, still-bleeding wife to do more chores.**\n\n&gt;I am at my wits end with the constant complaining and gratification that she needs.  \n\nThere's one clear solution to this. Deal with it. Practice your own coping skills. Be kinder. Practice empathy, and understand that the hormonal tsunami your wife is dealing with right now, along with the chronic sleep deprivation can make her feel irritable, angry, and depressed... and that this can develop into PPD. Which is treatable and temporary. In the meantime, be kinder. \n\n&gt;It is not possible for me to do everything even though I know she has minor discomfort (no more than any other first time mom).\n\nAre you fucking kidding me??? Have you even stopped to consider what pregnancy, childbirth, and breastfeeding can do to your body? Here's a hint: it's not minor. And in case you haven't heard me the other two times I mentioned it: **chronic sleep deprivation is a classic torture technique for a reason.**\n\n&gt; my mom is thinking about leaving for home early as she is so frustrated not being able to take some time with her grandson.\n\nYour mother needs to get her priorities straight. At 3-4 weeks postpartum, grandma's main job is to make life easier for mom and dad, not to spend time with the baby. There will be many years for her to bond with her grandkid(s). While mom is still trying to establish nursing, grandma has to take a step back and do what's actually *helpful.* This is about the baby's *need* for milk and bonding with mom, not about grandma's *want* to enjoy the fun parts about newborns and still be a houseguest who is waited upon. \n\nOn second thought, if your mom is truly acting as petty and selfish as your description sounds, your wife might be relieved by her departure. \n\nTo sum up: it's hard to be a new dad. It's hard to be a new mom. Grandparents need to be actively helpful or get out of the way. You need be your wife's biggest cheerleader and source of reassurance right now. It usually gets better, but your attitude is almost certain to make it far worse. ", "controversiality": 0, "created_utc": 1476384386, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qmbf8", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478578699, "score": 26, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Stormieleigh", "author_flair_css_class": null, "author_flair_text": null, "body": "Omg! No. Freaking. Way. Sorry, I had no idea.\nI'm pretty sure the words \"my personal experience\", we're thrown in though? At least once? ", "controversiality": 0, "created_utc": 1476384457, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qmdjz", "link_id": "t3_57amcv", "parent_id": "t1_d8qk9sk", "retrieved_on": 1478578728, "score": -35, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "breizybee", "author_flair_css_class": null, "author_flair_text": null, "body": "I think everyone else has done a good job answering your post.  I would add that what made a big difference with my husband and I when we had our first was figuring out a sleep schedule.  As I was breastfeeding there was really nothing he could do for the middle of night feedings so I moved into the guest room with the baby for the first 2-3 months.  He was working full time while I was not so this worked for us.  I then had him take over after 5:30 am until he had to go to work so I could get an extra chunk of sleep before he left.  By him getting sleep at night he was much more help before and after work when I needed to take a break.  If we were both constantly exhausted everything got much worse.  We also had an agreement if it was a horrible night and I needed I break I would wake him up.  Just remember those first three months will be the hardest of your life and be gentle with each other.", "controversiality": 0, "created_utc": 1476385488, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qn88r", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478579156, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "This. The week or two after I gave birth we had family that visited the area and not once did they ever come over and offer to bring a meal, do a load of laundry, hold the baby, etc. however with a newborn we were expected to be up and out of the house by noon everyday to visit where they were staying. We were both too tired to be offended though. We decided with the second, we will not be allowing this to happen again and people will have to come over. I was breastfeeding, tired from labor, still bleeding- and I still had to pretty myself up and leave the house with a nice outfit and a happy baby because if he wasn't happy, they wouldn't hold him..like wtf!!", "controversiality": 0, "created_utc": 1476385975, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qnmkd", "link_id": "t3_57amcv", "parent_id": "t1_d8qegpl", "retrieved_on": 1478579349, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Wish_Away", "author_flair_css_class": null, "author_flair_text": null, "body": "Sorry buddy, but you don't get a prize for doing what you should be doing after your wife gave birth...you're cooking? Doing diaper changes? You should be. She's keeping a newborn (barely a month old, I assume?) alive every day AND entertaining your mom. Also, expecting help from guests during this time period is absolutely okay.   ", "controversiality": 0, "created_utc": 1476387458, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qouqq", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478579939, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1476389014, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qq4bm", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478580549, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "beaniepie", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I could upvote this more. \"Minor\"", "controversiality": 0, "created_utc": 1476389647, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qqmbb", "link_id": "t3_57amcv", "parent_id": "t1_d8qgpzc", "retrieved_on": 1478580790, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Inappropriatenurse", "author_flair_css_class": null, "author_flair_text": null, "body": "Screw that sanctimonious bs \"oh it's not as hard as everyone makes it out to be\". Good for you, you want a cookie? Other people may have hard time and your comment does nothing to help the OP, it's only self serving. \n\nOP: Every new mother has to find her groove, she needs time. 4 weeks is no where near enough time for even an adequate breast milk supply and routine to be established. She's still bleeding, probably sore, probably overwhelmed with responsibility. So are you. You're allowed these feelings too. Let the housework go. Let the meals go. Let what you can, go. Simplify your life as best you can and try to hang on. It does get better, but for every asshole telling you \"it's so easy for me\" there's 100 more women who admit it's not so easy and it takes weeks, even months before you start to see the light. Have patience with your wife and yourself. It does get better. ", "controversiality": 0, "created_utc": 1476389927, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qqucw", "link_id": "t3_57amcv", "parent_id": "t1_d8qfxxm", "retrieved_on": 1478580896, "score": 22, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RegularOwl", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I have told my mom what she needs to be doing to help out, if she doesn't like it well she can leave and she can think about it for several months.\n\n\nJesus, I mean, is your mom refusing to help at all? I don't think it's actually selfish for her to want to spend *some* time with her new grandchild, especially since it sounds like from your OP that she actually is doing quite a bit.", "controversiality": 0, "created_utc": 1476390287, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qr4vo", "link_id": "t3_57amcv", "parent_id": "t1_d8qdo96", "retrieved_on": 1478581036, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Dragynwing", "author_flair_css_class": null, "author_flair_text": null, "body": "Regarding the discomfort, I too am a FTM. I had a normal (whatever that is!) vaginal birth on July 4. It took me at least 5 weeks to walk normally and not be in pain. I had 2nd degree tears and was on pain meds but by the end of the prescription, sitting and standing were still uncomfortable. I went back to work at 8 weeks but it was very, very difficult and I wish I could have waited 4 more weeks.\n\nAlso, is the baby sleeping in y'all's room? I am amazed at how little sleep I get. I can barely function some days. Other days, I just power through work but I literally fall asleep in the middle of dinner most nights. I'm used to operating on less than 6 hours of sleep but it with a baby, I am never really at rest. I can hear him begin to fuss from a mile away. I have bolted up out of bed moments before he woke up because I am that in tune to him. It's constant, even at 16 weeks!\n\nI loved my baby from the get go but I did not really start to like him until 4 weeks of age. He was just so demanding and I was so tired! I mean, I've been carrying him for 9 months. When do I get to rest? Lol....never!\n\nIt was hard on my husband, too. He has done amazingly well but we are able to order in a lot of meals and we aren't super clean. The dishes are done, the laundry is done, the floor and bathrooms are clean but our tables are hella cluttered! We're both kind of okay with that and we come together to clean when we have the energy.\n\nWhen my MIL visits, she goes into Super Nanny Mode. She enjoys cleaning and taking care of house stuff as well as playing with her grandson! It took me some time but I'm finally comfortable letting her do what she wants and the woman wants to clean! \n\nCould you look into hiring infrequent help? Someone to come over every now and then and do the basics until your wife is more recovered? I think it could help you both out a lot.", "controversiality": 0, "created_utc": 1476391476, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qs3kt", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478581499, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "usherova", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, she had a human growing in her for 9 months and your baby is month old and you believe that your wife sucks as she \"considers herself as busy\"? Man, that is so cruel of you! You compare your wife to other ftms and are still disappointed? You are annoyed that she shares with you? I really don't get you...\n\nMy advice- grow a pair and help your wife. Provide her with water, food, change diapers, run errands. Stop comparing her to other ftms. Support her and don't treat her as a spoiled brat. Newborns eat and poo a lot, adjusting is hard, healing takes time.\n\nI had a c section, my husband spent 7 weeks at home with me taking care of me feeding the baby and I can assure you that still finding time to take a shower or eat with a very hungry newborn seemed like a mission impossible as he wanted to be nursed constantly. For the first 2 months of my son's life I basically lived in my bed as all he wanted to do was to eat and sleep on me. It got better but the beginning was overwhelming. I get that you are tired, but so is she and you deny her right to feel that way. Please work on your empathy.", "controversiality": 0, "created_utc": 1476396444, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qvwdg", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478583329, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "daymcn", "author_flair_css_class": null, "author_flair_text": null, "body": "What medication is she on? Did she have a couple section?\n\nIt's not you or your wife job to play host to visiting family, esp the first month (or 3, those are the hardest times getting established and used to the life change of now having a little person forever with you) you will never be \"normal\" again, and just when you think you are getting the hang of it something will change. Welcome to parent hood!", "controversiality": 0, "created_utc": 1476400615, "distinguished": null, "edited": false, "gilded": 0, "id": "d8qywhe", "link_id": "t3_57amcv", "parent_id": "t1_d8qg9bu", "retrieved_on": 1478584769, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sigbyrue", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes yes yes and yes. ", "controversiality": 0, "created_utc": 1476404367, "distinguished": null, "edited": false, "gilded": 0, "id": "d8r1kwj", "link_id": "t3_57amcv", "parent_id": "t1_d8qmbf8", "retrieved_on": 1478586053, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tommys_mommy", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;No point in repeating what a hundred other people are saying.\n\n\nSo maybe next time don't say anything at all. Yours might be the least helpful, most self-serving content I've ever read.\n\n", "controversiality": 0, "created_utc": 1476405643, "distinguished": null, "edited": false, "gilded": 0, "id": "d8r2iav", "link_id": "t3_57amcv", "parent_id": "t1_d8qjisv", "retrieved_on": 1478586505, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ibelurkin", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think \"doing as much as I possibly can by doing chores, cooking, cleaning, being up at night\" is cutting her any slack. She is healing from giving birth, feeding the baby constantly and taking care of the baby while you have visitors. I'm sure you aren't meaning to but I guarantee she can sense that you are upset with her not helping with the house and since you are referring to her having family help (which is what they should be doing) as slave labor it's probably very apparent to her. ", "controversiality": 0, "created_utc": 1476415411, "distinguished": null, "edited": false, "gilded": 0, "id": "d8r9z57", "link_id": "t3_57amcv", "parent_id": "t1_d8qdo96", "retrieved_on": 1478590084, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MiniMePlease", "author_flair_css_class": null, "author_flair_text": null, "body": "This comment says it all. 3 or 4 weeks after having my baby I felt like I was treading water, just trying to keep myself afloat. I was still in pain and bleeding. I was breastfeeding ALL the time. I felt like I was getting nothing done (laundry, cleaning, cooking) and it made me feel terrible and useless. Looking back I also now realize I was struggling with some postpartum anxiety and depression which can make you feel like you can't do anything.\n\nYour wife needs a lot of help right now. It's wonderful if you parents can provide that, but if they can't or don't want to then they shouldn't be visiting. \n\nIt sounds like you're already looking at your situation a little differently and want to cut her some slack. I felt very alone at first because I felt like my husband just could not see my point of view and how much I was struggling. We both had to adjust to our new life, and it was very difficult at first. Now at 16 months life is completely different. Everyone sleeps more and we're a much better team.", "controversiality": 0, "created_utc": 1476459014, "distinguished": null, "edited": false, "gilded": 0, "id": "d8rucy5", "link_id": "t3_57amcv", "parent_id": "t1_d8qegpl", "retrieved_on": 1478599917, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MiniMePlease", "author_flair_css_class": null, "author_flair_text": null, "body": "\"Buy paper plates and put off cleaning for a bit.\"\n\nThis! I started to look at things with a \"triage\" point-of-view. What do I really need to do right now? Maybe a load of laundry with 10 items in it. Maybe wash one dish. Everything else can wait for a bit.", "controversiality": 0, "created_utc": 1476459187, "distinguished": null, "edited": false, "gilded": 0, "id": "d8rui53", "link_id": "t3_57amcv", "parent_id": "t1_d8qk63y", "retrieved_on": 1478599986, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep! Any visitor (grandma included) needs to be there to help! And any extra help where the mom can just sit and chill with baby bc THeY are the ones that need to bond the most, not grandma", "controversiality": 0, "created_utc": 1476481056, "distinguished": null, "edited": false, "gilded": 0, "id": "d8sbvqy", "link_id": "t3_57amcv", "parent_id": "t1_d8qdfuz", "retrieved_on": 1478608369, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "If I were you I'd drop the being up at night with them. With our son I breastfed too so I was up all night w him nursing and doing diapers (though honestly- baby only needs like 2 diapers a night) while dad slept. Then he'd go to work in the morning and I'd sleep while baby slept and have my mom come over to hold him while I got a nap in. Doing household chores and cooking sounds great! She's got it good! Night wakings for you sound unfair and a little necessary", "controversiality": 0, "created_utc": 1476481245, "distinguished": null, "edited": false, "gilded": 0, "id": "d8sc0hq", "link_id": "t3_57amcv", "parent_id": "t1_d8qdo96", "retrieved_on": 1478608431, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "*unnecessary", "controversiality": 0, "created_utc": 1476481260, "distinguished": null, "edited": false, "gilded": 0, "id": "d8sc0ve", "link_id": "t3_57amcv", "parent_id": "t1_d8sc0hq", "retrieved_on": 1478608436, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok why aren't we talking now about the sugar glider?? I have always wanted one of those!!", "controversiality": 0, "created_utc": 1476481424, "distinguished": null, "edited": false, "gilded": 0, "id": "d8sc4x1", "link_id": "t3_57amcv", "parent_id": "t1_d8qfxxm", "retrieved_on": 1478608490, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "seraphin22", "author_flair_css_class": null, "author_flair_text": null, "body": "I was a wreck the first few months after having a baby. Hormones + new life schedules and being physically needed all the time...my husband and I argued a lot.\n\nIt is normal to be critical of the other spouse after a baby is born, because it is two people trying to do the same job and the other person doesn't do it \"the right way\", so toes get stepped on and expectations cross wires. \n\nGive it a few more months to settle into a good routine and past the new baby stage. ", "controversiality": 0, "created_utc": 1476537696, "distinguished": null, "edited": false, "gilded": 0, "id": "d8t0qqg", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478620438, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "homehunter1", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;I know she has minor discomfort (no more than any other first time mom)\n\nthis must be trolling... ", "controversiality": 0, "created_utc": 1476764046, "distinguished": null, "edited": false, "gilded": 0, "id": "d8wsumn", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478688234, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "homehunter1", "author_flair_css_class": null, "author_flair_text": null, "body": "ok- saw more of your comments. Not a troll I presume.\n\nYour wife is not breast feeding - and probably exhausted. My baby could not keep anything down, no formula nothing for 18 long months. I had to nurse her every 1/2 to 45 mts because she had to have small meals and could not lay her down, she slept on my chest for pretty much all that time. I would have loved to have help from my husband, soon to be ex...", "controversiality": 0, "created_utc": 1476764321, "distinguished": null, "edited": false, "gilded": 0, "id": "d8wt01j", "link_id": "t3_57amcv", "parent_id": "t3_57amcv", "retrieved_on": 1478688306, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}