{"submission": {"author": "siranal", "author_created_utc": 1388177582, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_ejcat", "contest_mode": false, "created_utc": 1477540747, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/59m1tn/just_had_baby_3_days_ago_not_attached_to_her/", "gilded": 0, "id": "59m1tn", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 57, "over_18": false, "permalink": "/r/Mommit/comments/59m1tn/just_had_baby_3_days_ago_not_attached_to_her/", "retrieved_on": 1480276930, "score": 70, "secure_media_embed": {}, "selftext": "I feel incredibly guilty finally letting it out but I have to vent. \nSince last October my husband and I decided to start trying to have a baby. I wanted nothing more and we felt ready. We stopped using protection. \n\nOn Valentine's Day of this year I found out I was pregnant. We were so excited. Husband was thrilled. \n\nThe closer my due date approached and the bigger I got I started regretting it. The pregnancy wasn't even hard. I had morning sickness but overall my symptoms were non existent. I had an easy pregnancy. \n\nBut the thought of a baby now seemed like a bad idea. After the baby shower when I had all her stuff in her room I wasn't even happy. It just kept feeling more and more real and I was dreading the delivery day. (I was terrified of delivering)\n\nFinally on Sunday she came. When I held her for the first time I was just happy that labor was over. I cried when I saw her. And I felt like maybe now having met her my fears and feelings would disappear. \n\nI was wrong. 3 days later and I'm not attached to her at all. She feels like a burden and I feel like the worst person in the world for bringing her into this life. I see her and I just apologize and cry to her. I thought I wanted her more than anything but I wish I could go back in time and tell my husband I don't want kids. \n\nLuckily my husband has been amazing with her. He doesn't know about my feelings. \n\nI feel horrible and I don't know what to do. Any words of encouragement? Am I a bad person?", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "Just had baby 3 days ago, not attached to her whatsoever.", "url": "https://www.reddit.com/r/Mommit/comments/59m1tn/just_had_baby_3_days_ago_not_attached_to_her/"}, "comments": [{"author": "rainydaybear", "author_flair_css_class": null, "author_flair_text": null, "body": "It's OK, I promise you are not the only one who doesn't fall in love at first sight. Your life has just changed dramatically and you are still in shock. It took me, and a lot of other moms and dads a long time to bond. Some it's the first smile, others it's when you finally have a few solid hours sleep and a shower to feel yourself again. But not to worry, before you know it your heart will beat only for them. You will love your partner in a whole different way seeing them be a loving parent. For me it was week 6 when I felt like everything was going to be OK. For my husband it was when our daughter smiled in response to him. He needed the interaction. Long story short, it's normal, you are doing great, you've got this! \nEdit: your hormones are wired wild stuff right now so let the nurses test you for PPD, sometimes it starts before birth, and it's really hard to admit you need help. But that is also normal for some, and it's not permanent. ", "controversiality": 0, "created_utc": 1477541171, "distinguished": null, "edited": 1477541367, "gilded": 0, "id": "d99k4p1", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478911194, "score": 61, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Did you consider yourself having postpartum depression?", "controversiality": 0, "created_utc": 1477541375, "distinguished": null, "edited": false, "gilded": 0, "id": "d99k8s5", "link_id": "t3_59m1tn", "parent_id": "t1_d99k4p1", "retrieved_on": 1478911248, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "freeschooler", "author_flair_css_class": null, "author_flair_text": null, "body": "Crying, hopelessness, guilt, and difficulty bonding with your baby are all flagship symptoms of post-partum depression. Please talk to your doctor (and your husband!), you don't have to go through this alone or without help. PPD does not make you a bad person or a bad mother, the hormonal changes due to pregnancy and birth can cause *intense* shifts in mental state, this is a *medical* issue that is warping how you experience your life.", "controversiality": 0, "created_utc": 1477541924, "distinguished": null, "edited": false, "gilded": 0, "id": "d99kjue", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478911395, "score": 37, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/12, 1/15", "body": "She *is* a burden. It's ok to acknowledge that! She just also has some good points. Everyone reacts to becoming a parent differently. I was pretty fascinated by my kids and definitely felt protective but it was nothing I could call love until around 4 months when their personality was more known. Your doctor should screen you for PPD at your followup checks. Be honest in your answers and get help if you need it. But \"just\" baby blues are very common also and will pass with time. Tell your husband. You're there to be a team and right now you're the team member needing a shoulder to lean on.", "controversiality": 0, "created_utc": 1477542218, "distinguished": null, "edited": false, "gilded": 0, "id": "d99kpsl", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478911474, "score": 24, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cosmicbody", "author_flair_css_class": null, "author_flair_text": null, "body": "Definitely get checked for post partumn depresion but also just remember that you may be mourning the loss of your old self. \n\nI don't want to diminish your feelings but I felt the same way for months after I gave birth. I couldn't bond with my baby until I went through the grieving process from having lost my \"single person hood\" because after baby it's always you and baby and you can't just do whatever anymore. I still mourn sometimes too but now that I've been through the grieving process I can bond with my baby without thinking of everything I lost. \n\nAnother reason could be that you aren't bonding because right now your baby has no personality. This was another hurdle I had to overcome. I didn't see her as a person until made her smile for the first time. \n\nDefinitely talk to a doctor, probably go see a therapist. Also, it might be scary but you should tell your SO so you can get all the support you need. ", "controversiality": 0, "created_utc": 1477543141, "distinguished": null, "edited": false, "gilded": 0, "id": "d99l7yl", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478911716, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ckreon", "author_flair_css_class": null, "author_flair_text": null, "body": "My wife and I both had PPD to varying extents.\n\nWe got through it leaning on each other while we adjusted to our new lives. I don't necessarily want to de-emphasize the severity of PPD, but usually it's just your mind throwing a tantrum about losing so much freedom and independence. If you and your partner communicate well, take advantage of that and talk through stuff. It is calming to and distracting to talk with someone.\n\nIf you don't communicate well, or have more severe PPD, definitely consider some counseling to help.\n\nEither way, what you're feeling is normal, and I promise in 3 - 6 months your daughter will start winning you over (it's their number one job as a baby). By next year you will have a strong bond and a definite love for your child, and will even miss her when your away (at first I was thrilled to be away from that huge burden, and admittedly, getting away will always be great, but you will find yourself wanting to come back after a few hours instead of binging on all the freedom you can get).\n\nCheck back with us in a few months - until then keep your head up, and your shoulder to the wheel.", "controversiality": 1, "created_utc": 1477544896, "distinguished": null, "edited": false, "gilded": 0, "id": "d99m3lx", "link_id": "t3_59m1tn", "parent_id": "t1_d99k8s5", "retrieved_on": 1478912141, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kolpinoc", "author_flair_css_class": null, "author_flair_text": null, "body": "I wasn't attached to my 1st child for a while. Being a new Mom is such a foreign thing. Don't be so hard on yourself. She's still a stranger! Do look into possible PPD, though. I finally got help for it after months and months. With my 2nd daughter there was *some* attachment, but that lasted for 4 months because then I went through a harrowing divorce that took half my time with her. With my 3rd baby, my only son, the attachment was instantaneous and is still still going strong 6 weeks later. I've only developed Post Partum Anxiety with him!", "controversiality": 0, "created_utc": 1477547192, "distinguished": null, "edited": false, "gilded": 0, "id": "d99n4lp", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478912644, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NoFriendsWithSalad", "author_flair_css_class": null, "author_flair_text": null, "body": "Took me about 3 weeks to start to feel a bond. Longer to feel truly maternal. I also had a significant bout of baby blues for about 2 weeks - i cried ALL THE TIME. But i think i was able to distinguish it wasnt PPD because i didnt want to hurt her or myself, it was just such a huge hormone crash from pregnancy to post-partum. Look after yourself, if you do think its leaning towards PPD get help. But the bond will come, give yourself time :)", "controversiality": 0, "created_utc": 1477548232, "distinguished": null, "edited": false, "gilded": 0, "id": "d99njug", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478912847, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh yeah, it takes a while.   This is a total stranger, who by the way is very demanding, tiring, loud, dirty and tedious.   Don't buy into the \"cultural wisdom\" of love at first sight.   It may happen to some mothers, but for lots of mothers it takes some time.   \n\nAlso, not everyone loves babies.   I eventually bonded with mine but I'm glad mine grew up to be interesting, fun, and mostly independent kids whom I now love more than anything else and whom I would lay down my life for in an instant.    Babies on the other hand are annoying and I'm glad that phase is over.\n\nFinally, do everything you can to get some sleep.   Sleep deprivation will make you depressed and ill.\n\nYou're fine, you're normal.... now hand your kid to your gem of a husband and take a nice 2-hour nap!", "controversiality": 0, "created_utc": 1477548711, "distinguished": null, "edited": 1477620360, "gilded": 0, "id": "d99nqg8", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478912935, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": null, "author_flair_text": null, "body": "Or just sleep deprivation.   See if you can get someone to take the baby for a while while you sleep.", "controversiality": 0, "created_utc": 1477548874, "distinguished": null, "edited": false, "gilded": 0, "id": "d99nsop", "link_id": "t3_59m1tn", "parent_id": "t1_d99kjue", "retrieved_on": 1478912965, "score": 14, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Franr1991", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't feel bad. Its a huge change, one you think you're prepared for but never will be. I had a c section with my son and I dont really remember the first 3-4 days of his life. Apparently I didn't pick him up or really look at him. Everyone was really worried but it did come. Give yourself time. Your body has just been through a huge physical trauma and your hormones will be all over the place. Talk to your health visitor/midwife when they visit you and they'll be able to help. Dont feel bad, its a very daunting and scary thing but I'm sure youll be amazing. :) ", "controversiality": 0, "created_utc": 1477550346, "distinguished": null, "edited": false, "gilded": 0, "id": "d99obzw", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478913224, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sweet_chick283", "author_flair_css_class": null, "author_flair_text": null, "body": "This is completely normal. You have NOTHING to feel guilty about. Your body has just been through a huge amount of trauma and shock; you are sleep deprived; your life has changed forever. This invariably creates a huge amount of emotion - fear, angst, concern for the future - and these emotions trigger the release of adrenaline, which prevents the oxytocin (aka the bonding chemical) getting to the brain.\n\nWhen I had my baby, I saw a psychiatrist - I am a classic type A personality, and knew that I would be a prime candidate for PND/PNA. She told me that it takes the average - the AVERAGE mother - 8 weeks before she loves her child; some mothers (especially where the baby is cranky/colicky) take 8 months. Acknowledging the emotions of fear (and anger and stress etc) as they are and accepting that they are there because you have just been through a huge event is the best thing you can do to help them pass- and when they pass, they make room for the love to come in.\n\nI remember before I gave birth, I confided in my mother that I was terrified that I wouldn't love my baby. She then went on to give me the best piece of advice I have ever received from anyone - love is a verb. It's what you do. The emotional part of feeling all warm and bondy and squishy is the cherry on top of love - but if you feed and nurture and protect your child, you are showing them love, even if you don't have the nice feeling. If you trust that it will come eventually, it will.\n\n*big internet hugs* trust yourself. The fact that you want to love your baby and bond with them means that you are a great mother.", "controversiality": 0, "created_utc": 1477551456, "distinguished": null, "edited": false, "gilded": 0, "id": "d99opm6", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478913405, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "readybaby2", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not the person you asked, but hopefully my response might be helpful too. I didn't consider that I had PPD because the things I was upset about seemed valid. It wasn't until I got out of it that I figured out what was going on, that the depth of my feelings was out of whack. I definitely didn't bond with my son right away (not for months) and I cried pretty much every day because I thought I'd ruined our lives; even though we BOTH wanted to have a baby, I took full responsibility for the perceived mistake. It felt absolutely awful. \n\nI really encourage you to speak to your husband and, if not him, your doctor. Your hormones are at peek fluctuation right now, so there may be something that can help. ", "controversiality": 0, "created_utc": 1477551933, "distinguished": null, "edited": false, "gilded": 0, "id": "d99ovcv", "link_id": "t3_59m1tn", "parent_id": "t1_d99k8s5", "retrieved_on": 1478913483, "score": 20, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Fleeece16", "author_flair_css_class": null, "author_flair_text": null, "body": "It's okay and you definitely aren't a bad person. When my baby was 3 days old I had a lot of similar feelings. I remember staring at her, crying because a part of me wished I could take her to one of those safe  baby drop off places, but knowing I couldn't because my husband loved her. I felt like a horrible mother and she deserved to be raised by someone better than me. I regretted bringing her into this world.  I don't think I have ppd (my baby is still young, she's 12 weeks) because the feelings went away quickly, maybe after a week or so. I think it was just an intense bout of the baby blues. I hope you feel better quickly too. If you're  still feeling like this in a couple weeks, maybe have a conversation with your dr about ppd? In the meantime I found it helpful to \"fake it\" until it became more natural - talking to her, singing to her, etc. I started feeling more connected and bonded to her when she started smiling in response. \n\nPlease know you're not alone and having these thoughts does not make you a bad person or mother. It's an incredibly difficult adjustment emotionally, physically and mentally. It's okay to grieve your old self and it's okay to feel that it's unfair things are so hard. Be gentle with yourself. Don't be afraid to reach out for help, especially if things don't start to feel a little better and / or you suspect ppd. ", "controversiality": 0, "created_utc": 1477553772, "distinguished": null, "edited": false, "gilded": 0, "id": "d99pg24", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478913758, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "With all due respect, I think you're confusing normal \"baby blues\" with PPD. PPD usually lasts much longer than baby blues, and the severity of symptoms and impact on quality of life are much greater. It is dangerous to advertise PPD as normal, because many moms already do not seek treatment or help. If you feel your emotions, thoughts, and actions are concerning or out of the norm, it is best to consult your doctor/midwife for their professional opinion! I say this an an OB nurse who has seen some scary cases of PPD/PPA. This is a great article that touches on [the difference between baby blues/PPD.](https://www.seleni.org/advice-support/article/the-difference-between-the-baby-blues-and-postpartum-depression)\n\n", "controversiality": 0, "created_utc": 1477556888, "distinguished": null, "edited": 1477559789, "gilded": 0, "id": "d99qe33", "link_id": "t3_59m1tn", "parent_id": "t1_d99m3lx", "retrieved_on": 1478914212, "score": 22, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meeshh", "author_flair_css_class": null, "author_flair_text": null, "body": "Please reach out to your provider if you are concerned with how you are feeling. These feelings can be so very normal, but the severity and coping mechanisms you have can only be assessed by a trained professional. Crazy drops in hormones mixed with the drastic changes and losses of your precious life can be just the right concoction for baby blues (very common)  or PPD (less common). Don't feel ashamed for having these feelings, so many of us have felt them too.", "controversiality": 0, "created_utc": 1477557186, "distinguished": null, "edited": false, "gilded": 0, "id": "d99qh4i", "link_id": "t3_59m1tn", "parent_id": "t1_d99k8s5", "retrieved_on": 1478914252, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thelizziepants", "author_flair_css_class": null, "author_flair_text": null, "body": "It gets better, I promise. \n\nThe early days suck. Your body is exhausted from growing a baby, delivering a baby, then the demanding newborn feeding/changing/comforting schedule. Your hormones are everywhere and sleep deprivation is truly torture. But, it gets better.\n\nWith my son I loved him and wanted to care for him but didn't feel the connection I feel now. Now that he is 2.5 I can honestly say I love him more each day. He constantly amazes me and we have a much much stronger bond. I don't know when it happened but I realized that he needs me, I am the best to care for him and I would do anything in the world because I am the best at knowing what he needs. I think that confidence and bond come with time and making it through some hard parenting moments.\n\nYou two are still getting to know each other and you will gain more confidence as you become the one who knows them best. You will also see them turn for you because they trust you. They also become more interactive in the next couple months and when they smile because of you, you feel like all the gross poop and all the work is completely worth it.\n\nNewborns are so hard, especially if your own birth recovery takes some time. Hang in there. Take care of yourself. This phase is not like the rest but you will make it through and be stronger because of it.\n", "controversiality": 0, "created_utc": 1477558300, "distinguished": null, "edited": false, "gilded": 0, "id": "d99qsip", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478914404, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thelizziepants", "author_flair_css_class": null, "author_flair_text": null, "body": "This! People underestimate how basic self care is needed.\n\nIn motherhood it's more important than ever. Your body is depleted in so many ways from pregnancy. Eat well, drink water, make hygiene and some of your old routines a priority, take care of yourself in a way that makes you feel on top of your day, and SLEEP. If this isn't helping, don't feel ashamed and reach out for help to your doctor. There is no shame caring for yourself or asking for help. It's not selfish if it makes you a better mom.\n\nIt's easier said than done but to do it, you have to let somethings go and focus on your top priorities right now: your care and caring for baby. ", "controversiality": 0, "created_utc": 1477559076, "distinguished": null, "edited": false, "gilded": 0, "id": "d99r03s", "link_id": "t3_59m1tn", "parent_id": "t1_d99nsop", "retrieved_on": 1478914505, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "GregorianDelorian", "author_flair_css_class": null, "author_flair_text": null, "body": "3 days in was the worst for me - honestly it felt as if I'd fallen into a dark pit that I would never get out of. Things are waaaay better at 2 weeks. Not easier, you feel so much different without hormones raging through you. One thing to focus on is that it does NOT make you a bad mother to feel this way - it's normal, and you need to be gentle with yourself. ", "controversiality": 0, "created_utc": 1477565984, "distinguished": null, "edited": false, "gilded": 0, "id": "d99t06b", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478915482, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Chloebean", "author_flair_css_class": null, "author_flair_text": null, "body": "It took me until 8 weeks before I got the feeling of \"I'd walk through fire for you.\" That doesnt' mean you're a bad mom -- you're not going to neglect her or not love her in some way just because you're not 100 percent attached. \n\nBefore I had my little guy, I read this: The baby is a stranger. You don't know their personality, you don't know anything about them. Why would you necessarily fall in love at first sight? It can take time. ", "controversiality": 0, "created_utc": 1477566388, "distinguished": null, "edited": false, "gilded": 0, "id": "d99t4z4", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478915547, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dropastory", "author_flair_css_class": null, "author_flair_text": null, "body": "Ppd can also start during pregnancy - perinatal mood disorder. OP should definitely talk with her doc about how she is feeling and reach out for help. ", "controversiality": 0, "created_utc": 1477569214, "distinguished": null, "edited": false, "gilded": 0, "id": "d99u7b2", "link_id": "t3_59m1tn", "parent_id": "t1_d99kjue", "retrieved_on": 1478916057, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "GooseCharmer", "author_flair_css_class": null, "author_flair_text": null, "body": "Everyone has said what I'd want to say to you (better than how I could say it) but just want to chime in as one more to the list of people who went through what you are going through! Got better by maybe week 4-5? And then completely better by month 4 I think. Hang in there ❤️", "controversiality": 0, "created_utc": 1477571568, "distinguished": null, "edited": false, "gilded": 0, "id": "d99v9zz", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478916576, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Feydid", "author_flair_css_class": null, "author_flair_text": null, "body": "I know a lot of people are saying PPD but it's too soon for that. At this point it's the baby blues. You are going through monumental hormonal changes and she is still a tiny stranger to you. You'll bond eventually.  It took me 4 months or so. The hype the movies sell on that magic moment you first lay eyes on your brand new baby, it's hogwash. Be gentle with yourself. Go through the motions of momming. You'll get there. And if in a few weeks you still feel like crap, talk to your gyno and get screened for PPD. Zoloft and Welbutrin have been my bff since I had my daughter 2.5 years ago. ", "controversiality": 0, "created_utc": 1477572821, "distinguished": null, "edited": false, "gilded": 0, "id": "d99vxr6", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478916893, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rainbowghosts", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't attach right away. I just felt like I was in over my head for a solid year. Now she's two and she's my homie.", "controversiality": 0, "created_utc": 1477573224, "distinguished": null, "edited": false, "gilded": 0, "id": "d99w5tb", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478917001, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Wolf_Mommy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is a normal thing!!  You are not a bad person. As others have already said, this is the biggest change in your life. Change is always stressful and we respond in different ways to stress. You won't always feel like this. This is a very vulnerable time for you emotionally. You need to be taken care of too!  \n\nI would for sure bring this up with your healthcare provider, so they can keep an eye out for PPD/PPP/PPA, etc but really, *REALLY* you are **not** a bad person. Give it time, let yourself adjust, know that you are a good person and you will find your place in this new world of Mamahood. ", "controversiality": 0, "created_utc": 1477574347, "distinguished": null, "edited": false, "gilded": 0, "id": "d99wtm6", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478917318, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your response. ", "controversiality": 0, "created_utc": 1477575702, "distinguished": null, "edited": false, "gilded": 0, "id": "d99xo1g", "link_id": "t3_59m1tn", "parent_id": "t1_d99ovcv", "retrieved_on": 1478917723, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you", "controversiality": 0, "created_utc": 1477575778, "distinguished": null, "edited": false, "gilded": 0, "id": "d99xps8", "link_id": "t3_59m1tn", "parent_id": "t1_d99qh4i", "retrieved_on": 1478917746, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes I think it's PPD I'm suffering from. I will talk to my doctor about it at my next appointment. Thank you. ", "controversiality": 0, "created_utc": 1477575921, "distinguished": null, "edited": false, "gilded": 0, "id": "d99xt40", "link_id": "t3_59m1tn", "parent_id": "t1_d99kjue", "retrieved_on": 1478917791, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your response, all these moms are really helping. ", "controversiality": 0, "created_utc": 1477576037, "distinguished": null, "edited": false, "gilded": 0, "id": "d99xvr3", "link_id": "t3_59m1tn", "parent_id": "t1_d99nqg8", "retrieved_on": 1478917826, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for those words ", "controversiality": 0, "created_utc": 1477576125, "distinguished": null, "edited": false, "gilded": 0, "id": "d99xxt6", "link_id": "t3_59m1tn", "parent_id": "t1_d99opm6", "retrieved_on": 1478917854, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WaitingForPlayer3", "author_flair_css_class": null, "author_flair_text": null, "body": "I had my baby Sunday as well! While I do feel attached to her (albeit not incredibly attached) I can commiserate with a lot of what you said.\n\nYesterday in particular was a horrible day for me. My husband worked late so it was just me and the baby all day until he got home at ~11pm. I cried and cried and cried. Often for no reason, often because I felt like between feeding and changing I didn't even have time to use the bathroom or eat. \n\nI'm trying to look forward to when my hormones aren't so wonky that I can enjoy the process a little more. Right now it's easy to default to \"why did I do this\" mode.\n\nDefinitely keep your husband in the loop. I've been very open with mine about how I'm feeling and he takes her when he can so that I can have a minute to myself. Baby needs you, but you need to have a support person, too. ", "controversiality": 0, "created_utc": 1477576212, "distinguished": null, "edited": false, "gilded": 0, "id": "d99xzwf", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478917881, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you. I feel so much better knowing I'm not alone. ", "controversiality": 0, "created_utc": 1477576276, "distinguished": null, "edited": false, "gilded": 0, "id": "d99y1g7", "link_id": "t3_59m1tn", "parent_id": "t1_d99wtm6", "retrieved_on": 1478917902, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gillybilly", "author_flair_css_class": "lightcoral", "author_flair_text": "Mum x 4", "body": "What you feel is so normal. Especially on day three! Even if you had an instant kick in the face moment of bonding at birth, you would feel this way on day three. I believe instant bonding is a myth. I have 4, I have never experienced it. \nHormones and fear, and stress and pain and all the other stuff you've been through are bloody tough! You are in a very delicate state right now. You are in survival mode. \n My advice, (drawn from my own experiences) hold her as much as you can. Look at her as much as you can. Wrap both of you in a blanket and just be with her. \nI felt like this the first time. Long story short, everything worked out really well.  You are  bringing a stranger home to share your life. It takes time to get in to the groove.  \nEverything is gonna be fine!", "controversiality": 0, "created_utc": 1477576640, "distinguished": null, "edited": false, "gilded": 0, "id": "d99yaat", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478918021, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "germanspacetime", "author_flair_css_class": null, "author_flair_text": null, "body": "You're not a bad person! It took me almost a year to really bond with my daughter. I just don't like babies. I never have, and people tell you it's different when it's yours. That's not always the case. I had an easy pregnancy and she was an easy baby, but we're so much closer now that she's a toddler, and can talk and has some independence. Your feelings are valid and normal, sometimes it just takes an minute. I have a friend who is the most people loving, heartfelt, wonderful woman, and she warned me when I was pregnant that it took her 8 months to really fall in love with her daughter. \n\nI think people should tell you PPD is an inevitability rather than something that might happen. I saw someone else post about how they didn't think they had PPD bc they were sad/worried about valid things. I was the same way, but looking back I definitely had it and should have sought help. You just went through a big change, but you can do it! Soon you'll be spamming facebook like the rest of us. ;)", "controversiality": 0, "created_utc": 1477576709, "distinguished": null, "edited": false, "gilded": 0, "id": "d99ybyk", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478918042, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "toastNcheeze", "author_flair_css_class": null, "author_flair_text": null, "body": "And when is that? In like 5 weeks? No, call your provider now, sweetie. ", "controversiality": 0, "created_utc": 1477578925, "distinguished": null, "edited": false, "gilded": 0, "id": "d99zvz3", "link_id": "t3_59m1tn", "parent_id": "t1_d99xt40", "retrieved_on": 1478918787, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yarsteph", "author_flair_css_class": null, "author_flair_text": null, "body": "I cried after my first because I was completely exhausted and this was my life now and I'll never go back to what it was. IT GETS BETTER. Take a shower, get some sleep, get some sunshine, take some fish oil, EAT. Take care of yourself. Those feelings will come. ", "controversiality": 0, "created_utc": 1477579746, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a0ij1", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478919107, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sendCookiesSTAT", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt very similar.  Having a baby seemed like a great idea, but the closer I got, the more anxious I felt.  After all, having a baby is a big change and brings on a lot of responsibility.  After my son was born, he was just a needy little blob to me.  I thought he was cute and I hoped to bond with him one day, but it did NOT happen right away for me.  In fact, I think the bond came slowly over the first year or two.\n\nLooking back now, I may have had mild PPD.  It's difficult to tell because the hormonal changes and anxiety about such a big life change are normal after birth.   I had the support of my husband and I kept him up to date with how I was feeling, but it never got \"bad enough\" that I went for treatment.  The advice I generally got was that if I felt like I could do the things I wanted to do: eat, sleep, etc, then it was probably something that would pass on it's own.  However, if my sadness/confusion/stress/etc was keeping me from living my life (as best as I could as a new mom), then that could be resolved with medication until my body re-adjusted.\n\nGood luck to you- you are 100% NOT a bad person and what you are feeling is very common.  Talk to your husband about how you feel and keep your doctor in the loop.  If you need medication to help you, they will likely know this before you do (thanks hormones!), so lean on them for now.", "controversiality": 0, "created_utc": 1477579824, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a0kpm", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478919136, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rwiwy", "author_flair_css_class": null, "author_flair_text": null, "body": "Three days out was when I completely fell apart. The surge of emotions was insane. I cried a lot for probably a week and tried to keep it together as everything felt wrong. I had wanted to be a mom for my whole life, yet I was so upset. I didn't feel like she was my baby, I felt very detached from her. It got better around 3 weeks. I was feeling better after surgery, we were getting a rhythm down. One day I just looked at her and my heart felt like it might break out of my chest it had gotten so big. \n\nIf you are worried it might be ppd, even slightly, you should talk to someone. If not, know that, like everyone else said, you are completely normal to not completely adore your baby yet. Birth is a trauma, no matter which way you do it. Cut yourself some slack and try to find some joy in these early days. Your baby will be growing fast and you'll miss these days in a few months. \n\nKeep your chin up, we're all here for you too!", "controversiality": 0, "created_utc": 1477581880, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a275h", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478919915, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "You are not a bad person. I felt like this with my son - now he's 2 years old and he is the best thing in my life. In my case, I had some pretty severe post-partum depression (though I think I still may not have instantly bonded even without PPD - newborns are really tough and don't give much back, they can be hard to love unconditionally and instantly!). I suggest talking to your doctor or looking into a PPD support group to see if maybe that's what's goiong on.", "controversiality": 0, "created_utc": 1477583013, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a34ch", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478920361, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "I *thought* I liked babies... they are fun to hold for awhile. The constant poopy diapers, the sleepless nights, the nursing struggles, and getting virtually nothing back from them for months? Yeah, let's just say I'm glad that part is over! I love my toddler more than I can express now but I don't know if I can ever do that baby part over again. Everything you said is spot on for me too.", "controversiality": 0, "created_utc": 1477583165, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a38wt", "link_id": "t3_59m1tn", "parent_id": "t1_d99nqg8", "retrieved_on": 1478920422, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1477583779, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a3r92", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478920667, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "I struggled bonding with my daughter. I remember getting home and feeling so underwhelmed by her birth, and by her. I felt guilty for bring her into the world, and I could not understand how some children suffer from day 1 and she was by chance lucky to avoid that. It took me a good few weeks to really bond with her. For me, breastfeeding made hold her close and forced me to interact with her when I really didnt want to. Gradually I came out of the haze and the guilt, and was able to bond. If you arent nursing, make sure you hold your daughter, skin to skin, when you can. That will get your oxytocin going hopefully. It can take a good 6 weeks to recover from the experience. If you still dont feel any better, please talk to your doctor. If you are worried you may hurt yourself or your baby, please seek help immediately. ", "controversiality": 0, "created_utc": 1477587175, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a6jr6", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478922014, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "freeschooler", "author_flair_css_class": null, "author_flair_text": null, "body": "Good luck.", "controversiality": 0, "created_utc": 1477587486, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a6t1g", "link_id": "t3_59m1tn", "parent_id": "t1_d99xt40", "retrieved_on": 1478922137, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WPAtx", "author_flair_css_class": null, "author_flair_text": null, "body": "I promise it's okay.\n\nI had heard this happens so often, so I was ready for it and think that helped me deal with it, but it's definitely confusing when you hear all of the \"love at first sight\" bullshit, and you're over here like...I don't even know who this kid is?\n\nBut then around 6 weeks, they start smiling...and eventually they start really interacting with you and then they start calling you mama and everything gets so much better. I think we shouldn't put so much pressure on moms to feel a connection to a newborn. It just isn't reasonable.\n\nBabies are SO hard, and at first, they don't really give anything back...it's a one-way relationship and they're the only ones benefitting. Eventually, though, the relationship becomes more balanced and the rewards grow on your end tremendously.", "controversiality": 0, "created_utc": 1477590862, "distinguished": null, "edited": false, "gilded": 0, "id": "d9a9mt2", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478923498, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MrsKasen", "author_flair_css_class": null, "author_flair_text": null, "body": "The best thing our birthing instructor ever did was talk about our love stories. We thought it was just a \"get to know you\" exercise and shared how each couple met and ultimately feel in love. Some couples hated each other for years, others had one partner who felt love sooner than the other, some feel madly in love at first sight and so on. It wasn't until after we finished that our instructor looked at us and said \"I had PPD after having my twins. I didn't fall in love with my twins for 6 months and then I fell in love with them at different times.\" See, we have this expectation that mothers and babies should all be Cinderella/love at first sight type stories but we would never expect that from a life partner. Many many MANY women and men do not feel immediately connected to their children. Give yourself time and be honest with your husband and doctors. Talking about it can help so much. ", "controversiality": 0, "created_utc": 1477598721, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ag6ow", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478926645, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Yo_Yo_Burrito", "author_flair_css_class": null, "author_flair_text": null, "body": "These feelings are pretty normal during pregnancy and the first several weeks after having the baby. Your hormones are so out of wack right now but they will adjust back to normal. \nThe first month or two is the hardest but once you all get used to each other and adjust to the new life, you'll be fine. I had these feelings after I had my Son.. I asked myself, \"what was I thinking having a baby!\" \"I dont think we were ready yet\" and I felt terrible about it but after a few weeks they did go away and I realized how awesome having my own baby was! \nMy Son is almost 2 now and he is our WHOLE LIFE! He is soo fun to be around and I am soo thankful to have him and be his Mother. These feelings should subside as you get used to being a parent but I would suggest speaking with your doctor about these feelings. A lot of people have PPD right after baby and your doctor can help you get through this time. \n\nStay strong Momma! You can do this!! ", "controversiality": 0, "created_utc": 1477599974, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ah74y", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478927131, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sageberrytree", "author_flair_css_class": null, "author_flair_text": null, "body": "I had ppd that started while I was pregnant with my second. Looking back, I can see that it began while I was pregnant. I kept thinking that she wouldn't make it. I thought it was usual \"intrusive  thoughts\" and brushed it off. But I remember being just gobsmacked that she arrived.  \n\nAlone in my room I looked at her and was just thinking \"well now what? \" \n\nIt got pretty bad before it got better. I don't think I really bonded with her for 6 months. But I did.  And now I can't imagine life without either of them. \n\nPlease, speak up. To someone.  A counselor, your Dr., someone.  If you need help,  sooner is so much better. \n\n\n", "controversiality": 0, "created_utc": 1477600644, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ahqcx", "link_id": "t3_59m1tn", "parent_id": "t1_d99xo1g", "retrieved_on": 1478927387, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rainydaybear", "author_flair_css_class": null, "author_flair_text": null, "body": "In hindsight yes I think I did. The nurses did a questionnaire and told me I was on the cusp, they called it baby blues not full PPD. I never had harmful thoughts but I had dread. There was a lot of stuff on social media about children going through trauma or suffering and just the headline of an article would set me off for hours of saddness. Or if I was walking down the sidewalk with my baby I would be petrified a car would jump the curb and kill us both. So dark thoughts but not self harming, just easily triggered saddness. I practiced some meditation most nights and my husband took the baby for a solid 4 hour stretch most nights so I could just shower, sleep, or go out alone. After a couple months I felt like the 6 weeks after her birth, or even 3 months, was like an out of body experience. I don't remember a lot of details, just extreme joy, extreme saddness, extreme emotional spectrum.", "controversiality": 0, "created_utc": 1477610832, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ap3jo", "link_id": "t3_59m1tn", "parent_id": "t1_d99k8s5", "retrieved_on": 1478930931, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rainydaybear", "author_flair_css_class": null, "author_flair_text": null, "body": "This is true, there is a blurry line between baby blues and PPD and OP should seek out a doc to discuss her specific symptoms.", "controversiality": 0, "created_utc": 1477611054, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ap8zt", "link_id": "t3_59m1tn", "parent_id": "t1_d99qe33", "retrieved_on": 1478931004, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": null, "author_flair_text": null, "body": "Sleep deprivation is commonly used by torturers.   It's serious stuff.   Before people go off and spend money and time on doctors and meds, they really need to start by doing everything they can to some rest and see if that helps.", "controversiality": 0, "created_utc": 1477620505, "distinguished": null, "edited": false, "gilded": 0, "id": "d9avs5q", "link_id": "t3_59m1tn", "parent_id": "t1_d99r03s", "retrieved_on": 1478934144, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "seraphin22", "author_flair_css_class": null, "author_flair_text": null, "body": "Prenatal depression is a thing (I had it), it is similar to postpartum depression, and can carry forward. Right now your hormones are insane, this is the worst week physically and emotionally, so give yourself a break because you've been through a lot. You've just had a baby, it's okay. Just tell your GP, if it gets worse call and tell them you need in ASAP. No they won't take the baby away, \"worst\" they'd do is some antidepressants. \n\nA lot of moms find 4 months to be the real bonding month. I was about the same. ", "controversiality": 0, "created_utc": 1477626472, "distinguished": null, "edited": false, "gilded": 0, "id": "d9azoqp", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478936037, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "You're going to be a wonderful mama! When a child is born, a mother also is born. You're *both* new at this and learning. One day it'll hit you like a ton of bricks how much you love your baby. I was 3 weeks out when all of the sudden I felt overwhelmed with love for my little one", "controversiality": 0, "created_utc": 1477627677, "distinguished": null, "edited": false, "gilded": 0, "id": "d9b0dwq", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478936372, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "I second this, you could very well just need time to adjust and rest a bit to get into a groove but it's well worth getting checked out. \nGood luck and big Internet hugs", "controversiality": 0, "created_utc": 1477634746, "distinguished": null, "edited": false, "gilded": 0, "id": "d9b3uno", "link_id": "t3_59m1tn", "parent_id": "t1_d99zvz3", "retrieved_on": 1478938041, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "I second this, you could very well just need time to adjust and rest a bit to get into a groove but it's well worth getting checked out. \nGood luck and big Internet hugs", "controversiality": 0, "created_utc": 1477634746, "distinguished": null, "edited": false, "gilded": 0, "id": "d9b3uo5", "link_id": "t3_59m1tn", "parent_id": "t1_d99zvz3", "retrieved_on": 1478938041, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dedicednu", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, hon, don't worry! Three days is a blink of an eye and what you're feeling is normal. There'll be moments of regrets and guilt. Just let it pass and continue one day at a time.\n\nI didn't feel that all consuming love for my child until two MONTHS. You're both strangers and need to get use to each other. She's new to the world and you're new to being a mom. Your whole world changed over night! Of course there's going to be some negative reactions.\n\nThings get sooo much better and easier once the newborn stage is over. Just keep going, mama, and take a deep breath! ", "controversiality": 0, "created_utc": 1477680890, "distinguished": null, "edited": false, "gilded": 0, "id": "d9bszyb", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1478950252, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "theamazingkaley", "author_flair_css_class": null, "author_flair_text": null, "body": "I needed to read this today; several days of an 18 month old not listening and seriously invading my physical space has taken its toll. It really is a verb somedays", "controversiality": 0, "created_utc": 1477792340, "distinguished": null, "edited": false, "gilded": 0, "id": "d9dgvhs", "link_id": "t3_59m1tn", "parent_id": "t1_d99opm6", "retrieved_on": 1478979185, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "zhiface", "author_flair_css_class": null, "author_flair_text": null, "body": "Just wondering how you're feeling? Did you get the chance to talk to someone about it yet and did you tell your husband or a family member?", "controversiality": 0, "created_utc": 1477944969, "distinguished": null, "edited": false, "gilded": 0, "id": "d9fupwb", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1479020791, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pola_Xray", "author_flair_css_class": null, "author_flair_text": null, "body": "Same. the first few days are terrifying. you are NOT a bad person. give yourself time to get to know her. ", "controversiality": 0, "created_utc": 1477948545, "distinguished": null, "edited": false, "gilded": 0, "id": "d9fxsq3", "link_id": "t3_59m1tn", "parent_id": "t3_59m1tn", "retrieved_on": 1479022344, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siranal", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm feeling a little better. I talked to my husband who has been understanding and has helped. I noticed I get extremely anxious being alone in our room at night so I've been avoiding that. Thank you for asking though. I'm sure it will slowly get better ", "controversiality": 0, "created_utc": 1477957198, "distinguished": null, "edited": false, "gilded": 0, "id": "d9g48vq", "link_id": "t3_59m1tn", "parent_id": "t1_d9fupwb", "retrieved_on": 1479025449, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}