{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "contest_mode": false, "created_utc": 1478977663, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/5clvqt/mil_always_wanting_xmas_at_her_house_how_do_i/", "gilded": 0, "id": "5clvqt", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 65, "over_18": false, "permalink": "/r/Mommit/comments/5clvqt/mil_always_wanting_xmas_at_her_house_how_do_i/", "retrieved_on": 1484229760, "score": 62, "secure_media_embed": {}, "selftext": "Ok so we're a new family.. my son is 3 and my daughter is 18 months. We've been going to mil house for Christmas and every year she asks me to give her an idea list of toys for the kids. (She does this for bdays too) No problem! She wants to buy and we're kind of poor so it's a win-win! \n\nExcept she never buys anything off of my list. She buys obnoxious, age inappropriate toys. Plastic crap. I'm stay home with the kids and I've put a lot of thought into my lists each time... and each time I have to hold back my disappointment and anger with her inconsideration! \n\nWe've also set up a 529 savings plan for our kids and they haven't deposited one penny! She always opts for useless toys instead of their future.\n\nI feel like she just looks and me and my husband as children as well. She gets to feed her shopping addiction, get all the credit for santa coming to HER house, and gets to snub me and make me powerless. \n\nI'll admit I'm way to passive and nice and I don't want to cause any negative feelings towards the holidays or myself.. am I just ungrateful? Should I just shrug it off? I'm kind of dreading this Christmas. And how do I address the college savings plan?", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "MIL always wanting xmas at her house.. how do I change our tradition?", "url": "https://www.reddit.com/r/Mommit/comments/5clvqt/mil_always_wanting_xmas_at_her_house_how_do_i/"}, "comments": [{"author": "freyascats", "author_flair_css_class": null, "author_flair_text": null, "body": "My family (when i was a baby) used to travel to my grandmother's for xmas... until kid number 2 appeared. Then it became much more sensible for her to come to us. If you're happy to host, I recommend saying that with two children it doesn't make sense to all go over there when they could come to you. And then stick to your guns.", "controversiality": 0, "created_utc": 1478977939, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xgpx1", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481426962, "score": 34, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mrspuff", "author_flair_css_class": null, "author_flair_text": null, "body": "A gift is chosen by the giver. You accept it and thank them. If they ask, give them a list of stuff that the kids don't care that much about and have Santa leave the stuff you want to give them at your house. You can't force them to put money into the kids' college accounts.  Tbh, I think it would be quite rude to even ask. I also think it's kind of late in the year to change the tradition for this Christmas, but while you are there you could talk about having them come to you next year. ", "controversiality": 0, "created_utc": 1478979082, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xhh8u", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481427370, "score": 31, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree. I just find it passive aggressive on her end to act like I have a say in what she buys-what comes into my home, then acts like we never even had the conversation. Makes me wonder if she has something against me? We're very pleasant to eachother. I've always thanked her and never straight up asked for money for their college.. i just feel she's being selfish in a way. Idk.", "controversiality": 0, "created_utc": 1478980555, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xigcl", "link_id": "t3_5clvqt", "parent_id": "t1_d9xhh8u", "retrieved_on": 1481427936, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jeshef", "author_flair_css_class": null, "author_flair_text": null, "body": "/r/JUSTNOMIL ", "controversiality": 0, "created_utc": 1478980817, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ximik", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481428051, "score": 32, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "devinesigns", "author_flair_css_class": null, "author_flair_text": null, "body": "I will give you the best advice someone gave me when I was getting married: You can't change the behavior of other adults,  only how you react to it.\n\nYou know this is how she is, so give up on hoping she's suddenly going to behave differently. Stop sending her lists she won't use- tell her \"I'm sure they'll love whatever you pick out\" then do what you want with the gifts. Stop going there for Christmas. Tell her you're changing traditions and the family wants to spend Christmas at home with Santa coming to their own house. Invite her if you want, or see her later that day/another day.\n\nPart of being an adult and a parent is learning to stop caring about other people's approval, especially our parents. You have a family of your own now- do what works for them and if anyone gets butthurt over it that's their problem. There are some great books about setting boundaries.", "controversiality": 0, "created_utc": 1478982167, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xjhyr", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481428512, "score": 214, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RafeHaab", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't celebrate Christmas at her house. Do it at yours. Tell her to either buy from your list, or be rejected from next christmas onwards.\n\nBefore this, talk about this with your husband. You need to be on the same page. Both of you need to be present when you talk to her.\n\nThe alternative is asking her for gift cards instead of gifts, and then buy your children the gifts yourself.", "controversiality": 1, "created_utc": 1478982443, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xjog6", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481428617, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "You, your husband the your kids are your immediate family now. Have your husband tell her hat next Christmas you guys will host. Go ahead and discuss amongst yourselves food options so that you will have that ready when it comes up. Suggest you split the cooking or whatever. We do finger foods for Christmas. Sausage balls, cheese, crackers, deviled eggs, veggie tray, pig in the blankets, bean salad, fruit and desert type stuff. And we host. It's way more important to me that we have a fun Christmas than a food heavy, traveled filled one \n\nRemember. It's okay to say no ", "controversiality": 0, "created_utc": 1478982751, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xjvkz", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481428728, "score": 15, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "OliviaEversea", "author_flair_css_class": "blue", "author_flair_text": "JB 07/2012", "body": "Do what I did and say: \n\nI'm having Christmas in our own house this year. We will see you either just before or on Boxing Day. \n\nJust have a Christmas with just you, your partner and the little ones. ", "controversiality": 0, "created_utc": 1478983322, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xk928", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481428924, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dinahsaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "My MIL used to buy each kid at least 5 shit toys for Christmas and their birthday, even with a list that I gave her.  So one year I let the kids play with 1 toy, and made sure all of the other toys remained in their individual packaging, saying \"Oh, we already have one of those.\"  She asked me what I was going to do with the unopened toys, and I told her I would donate them to Toys for Tots.  She kept them and returned them herself.  She no longer buys shit toys.\n\nYou and husband are going to going to have to put your foot down and tell her you're doing Santa at your home.", "controversiality": 0, "created_utc": 1478984383, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xkyi0", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481429282, "score": 18, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mrspuff", "author_flair_css_class": null, "author_flair_text": null, "body": "You might be right, but there is not much you can do about that.  I bet she is in it for the immediate gratification she will get from seeing the kids' eyes light up when they see the plastic crap toys.", "controversiality": 0, "created_utc": 1478984970, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xlcge", "link_id": "t3_5clvqt", "parent_id": "t1_d9xigcl", "retrieved_on": 1481429498, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1478985687, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xltea", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481429723, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": "brown", "author_flair_text": "Two kids", "body": "They're gifts.   You need to suck it up, grow up, and be grateful.   ", "controversiality": 1, "created_utc": 1478985731, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xluep", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481429736, "score": -1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": "brown", "author_flair_text": "Two kids", "body": "She is, and so are you.   The question is, who is better-behaved, you or her.\n\nThat said, you don't have to have xmas at her house.    There will probably be blowback if you announce a change of plans so be prepared.    Part of growing up finally and having kids is learning how to deal with blowback from other adults.", "controversiality": 0, "created_utc": 1478985846, "distinguished": null, "edited": 1479063446, "gilded": 0, "id": "d9xlx1v", "link_id": "t3_5clvqt", "parent_id": "t1_d9xigcl", "retrieved_on": 1481429771, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ren_san", "author_flair_css_class": null, "author_flair_text": null, "body": "Having good manners is not equivalent to sacrificing everything you want to keep others from being disappointed. You get to decide how you celebrate Christmas. Two years does not a \"tradition\" make, and getting two young kids and all their crap together to go over there is ridiculous if you don't want to be doing it. Have your husband tell her now (no, two MONTHS in advance is not too late!) that she is invited to your house for [insert festivities] on [insert days/times] and you will be doing [insert festivities] at your home as a family this year. If she is invited to everything, fine. If not, FINE. It is NOT rude to make your own plans and invite her when it suits you. Even if this \"tradition\" had been ongoing for thirty years it's still your perogative to say \"thanks but no thanks\" to her invitation this year. \n\nAs far as the junky plastic crap toys, we have the same problem. When she ask what to get the kids, I have an Amazon wishlist all set up. When she asks if specific toys would be good, I explain why or why not. We still get the same junky, plastic crap that the kids might enjoy for a couple of months if it doesn't break first. I've learned to just say \"thanks\" and let it go, and chuck it when it breaks. Sometimes the crap she gives us becomes a \"grandma's house toy\" so she can see how it feels to have plastic junk take over her house. Otherwise, there is no solution that isn't ungrateful and rude.", "controversiality": 0, "created_utc": 1478986940, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xmmnd", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481430137, "score": 29, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Celesticle", "author_flair_css_class": null, "author_flair_text": null, "body": "Here's what I did with my MIL and my own family once we had kids, Christmas is at our house. Full stop. If anyone wants to see us Christmas Day, they come here. Annoying, loud, horrible toys? She's welcome to give them to the kids, but they live at her house not mine. \n\nI give her all the other holidays she enjoys going overboard on, Easter specifically comes to mind, but Christmas is mine. The other thing that truly helped me with this was my husband. We are on the same page and have been since the birth of our son. He helped me set the boundaries and eventually MIL got used to it even though it was a huge change for her. ", "controversiality": 0, "created_utc": 1478987503, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xmzus", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481430352, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1478993031, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xqih9", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481432206, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "silverpixiefly", "author_flair_css_class": null, "author_flair_text": null, "body": "Ha ha ha. I thought that is where I was. ", "controversiality": 0, "created_utc": 1478996837, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xt0j2", "link_id": "t3_5clvqt", "parent_id": "t1_d9ximik", "retrieved_on": 1481433431, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "liamquips", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think it's too late at all to change. Tell her you'd like to do xmas at your house this year as just a family, maybe offer to visit later in the day. \n\nAs for gifts, it's a bit ridiculous they ask for a list and don't use it, but I see nothing malicious there- just ignorance. Maybe say, \" oh were you unable to find such and such from the list? I think I saw it at a and b stores. \" depending on how they reply you'll better understand the thinking behind the choices they made regarding presents. At the end of the day it's their decision to gift whatever they like. It's their money. It may be foolish to buy a toy that will break and the kid won't enjoy that long, but mil gets to make that decision because it's her money. It's not unreasonable to talk to her when you give her the list and say \"I chose x and y because the brand is really durable\" or because child really loves ponies right now or because it's something the kids will get lots of use out of for years. They also have no obligation to pay into a college fund for your kids. ", "controversiality": 0, "created_utc": 1478998512, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xu5fa", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481434033, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ninjamama32", "author_flair_css_class": null, "author_flair_text": null, "body": "Isn't it infuriating? My MIL does the same stuff. Asks for a list and never buys anything on it. I wonder what I even bother coming up with a list...\n\n She also spends a ton on clothes, asking what sizes the kids wear. And she ALWAYS buys the wrong sizes. I even text it to her, so she can't claim she forgot what I told her. So aggravating. They also haven't contributed to the kids 529 accounts even though \"education is the most important thing!\" \n\nAll I can suggest is to stay home on Christmas day (we started this when kids were your kid's ages). You get to start your own traditions...that is the good part of being an adult and a parent. Also, remember that they will not buy what you suggest. And remind yourself that ultimately it isn't important.  It is a good way to teach your kids proper manners.", "controversiality": 0, "created_utc": 1478998795, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xubw0", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481434120, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1479000814, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xvng2", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481434805, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "I try to remind myself that even though I feel irritated (and often very rightfully so), there are so many people who truly have terrible, vicious family members. In the end, my family loves my kids and I try to put it in perspective. As someone else stated, I have tried various methods and come to the conclusion that the behavior won't change. I try not to let it get to me. ", "controversiality": 0, "created_utc": 1479001054, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xvtb5", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481434894, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "username_8", "author_flair_css_class": null, "author_flair_text": null, "body": "So this right here. My mom asks for lists and then gets whatever she wants and is usually not on the list. So accept it for what it is, save all the awesome things on the list for you guys. When my mom asks for a list I only give a general idea of what the kids are interested in and then she can do whatever she wants. \n\nAs for tradition, well you are a family you get to create your own traditions now. We only go to my parents every other Christmas. We always invite them down on the year we are home, they have yet to come.  If they lived in town we would do our own thing in the morning first and then go over there or they come over. That is what we do with my in-laws on the year we are home.\n\nAs for the savings if family or friends give the kiddos money put it in there. But unless they asked you to set something up so they can put money in I personally would not be expecting any.\n\nBest of luck.", "controversiality": 0, "created_utc": 1479001717, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xw9hk", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481435111, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "noushieboushie", "author_flair_css_class": null, "author_flair_text": null, "body": "We do Christmas Eve at the MIL's house, and Christmas Day at home. Decide what you want to do and lay it out for her kindly, but clearly, and don't waver. On the gift thing, I would stop giving her lists and accept her gifts graciously. And donate what you don't want in the home. I have also said, \"that will be a perfect toy to keep at Grandma's house for when we visit!\" for those toys that I will not have in my house.", "controversiality": 0, "created_utc": 1479003465, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xxeue", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481435668, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1479004106, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xxurf", "link_id": "t3_5clvqt", "parent_id": "t1_d9xmmnd", "retrieved_on": 1481435902, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gdolly", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't agree that she should have to adhere to a list for Christmas presents.. Or that anyone should.\nShe honestly bought a toy specifically because she cares and thought it would bring them joy. How do your children feel about the presents? I hope on their end at least that they genuinely feel thankful and that they say it.\nIt's the same for people who become so enraged when people don't buy directly off their baby registry. Why be so salty when someone went out of their way to do something nice?\nI'm saying this out of honesty. \nThere are children who don't get much for Christmas and other holidays, or have family members who don't even care to give them presents. \nI just don't buy into that mindset that it's such a terrible  thing. If you hate the toys that much toy can always donate them to kids that will appreciate them. \nI'd also be mortified asking my mother or MIL to pay for any of my kids college. ", "controversiality": 0, "created_utc": 1479004178, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xxwh7", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481435925, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't send her a gift list. She can't piss you off if you don't give her any ammo. Don't address the college savings plan, either; it will just come across as begging for money, and if she can't even manage to buy them decent gifts when she asks you to send her a list, there's no way in hell she's going to take that well or do anything about it. \n\nBasically, lower your expectations. As in, have none. \n\nThis year, tell her that Christmas will be at your house, on X day, at X time. Invite her, but make sure she knows that this is Christmas for you and your kids this year and that you won't be coming to a second Christmas at her house or anyone else's. If they come, fine. If not, whatever!\n\nI think this is the only way.", "controversiality": 0, "created_utc": 1479005040, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xygxp", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481436199, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jeshef", "author_flair_css_class": null, "author_flair_text": null, "body": "Me too!", "controversiality": 0, "created_utc": 1479005964, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xz2u4", "link_id": "t3_5clvqt", "parent_id": "t1_d9xt0j2", "retrieved_on": 1481436507, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jeshef", "author_flair_css_class": null, "author_flair_text": null, "body": "I did a similar thing then started keeping the toys grandma bought at her house for my kid to play with when we were there. She stopped getting the annoying toys that made lots of sounds or had tons of parts or broke easily. ", "controversiality": 0, "created_utc": 1479006189, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xz81h", "link_id": "t3_5clvqt", "parent_id": "t1_d9xkyi0", "retrieved_on": 1481436602, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jeshef", "author_flair_css_class": null, "author_flair_text": null, "body": "Leave the shitty toys at her house for them to play with. It works for us. ", "controversiality": 0, "created_utc": 1479006278, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xza16", "link_id": "t3_5clvqt", "parent_id": "t1_d9xigcl", "retrieved_on": 1481436629, "score": 11, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "HornOfDagoth", "author_flair_css_class": null, "author_flair_text": null, "body": "If you are way too passive and nice, sounds like you know what you need to do! Time to work on those things. Being passive and nice isn't inherently bad, but you do need to be able to advocate for your family. \n\nWe have an almost two year old and another baby due soonish. We always went to MIL's for Christmas and a cookie party before that (and did not really enjoy them most of the time - very stressful). She moved out of state and last year's holidays were miserable, and her Halloween party this year was absolutely miserable for all three of us. \n\nMy husband and I talked about what we wanted our future to look like for future holidays; we want to see our family if possible, but want to stay closer to home than MIL's house. We don't want our kids miserable for holidays and we are ready to make the call for them even though we weren't for ourselves. \n\nWe agreed on what we wanted; we agreed on talking to MIL together in person about it; we tried to reassure her that we love her and want to be with her, and our decision about what was best for our family had nothing to do with how much we love her. \n\nIt went poorly and we are still dealing with some of the fallout. MIL and one SIL think I've brainwashed my husband and the other SIL because I encouraged us to communicate, advocate for ourselves, and be respectful about it. \n\nPeople who are disrespectful of others - or just people who are very used to a certain tradition - will always be upset at things changing or you asking to be respected. It sucks but there's no way around doing it if you want to be not-miserable from being disrespected for years. \n\nThe bottom line is that your family comes first. Being assertive is hard when you don't know how to do it and have no practice. But you can do it, and you will get through any drama that results!", "controversiality": 0, "created_utc": 1479006344, "distinguished": null, "edited": false, "gilded": 0, "id": "d9xzbiq", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481436648, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "vtlatria", "author_flair_css_class": null, "author_flair_text": null, "body": "assume best intentions. my inlaws love plastic electronic toys because back in the day those were the expensive type of toys they couldn't buy for their kids. now they have disposable income and they want to treat their grandchild. \n\nit's possible that your MIL isn't trying to disregard your lists, maybe she thinks she's upgrading it.\n\nthere's already a lot of good advice in here about claiming the holiday, leaving toys at grandma's house etc. but i also see a lot of ultimatums and such and it seems like that's a little much. it would be awesome if they wanted to contribute to the 529 but these are gifts, you don't get to mandate what is given.  ", "controversiality": 0, "created_utc": 1479010168, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y1qqu", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481437896, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "vtlatria", "author_flair_css_class": null, "author_flair_text": null, "body": "easier convo is - 'please let me know if you get anything from the list so i know not to duplicate. thanks!'", "controversiality": 0, "created_utc": 1479010555, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y1zyi", "link_id": "t3_5clvqt", "parent_id": "t1_d9xu5fa", "retrieved_on": 1481438018, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[deleted]", "controversiality": 0, "created_utc": 1479011116, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y2cv0", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481438189, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "snowsilk", "author_flair_css_class": null, "author_flair_text": null, "body": "Have to agree here unfortunately. \n\nWe'd love contributions to her college education fund but instead get expensive girly clothing that isn't dealt to our taste and that our LO can probably only wear a few times. \n\nUnfortunately, I think we just have to deal with it. A lot of people gift thinking about what they derive pleasure from. Everyone loves buying cute baby clothing (except me!). Giving money to a college fund is super sensible but doesn't give that jolt of pleasure from seeing a baby wear something cute or play with something you chose. Sad but true!\n\nWe keep unwanted gifts in their original boxes and either sell, regift, or donate. ", "controversiality": 0, "created_utc": 1479011249, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y2fwm", "link_id": "t3_5clvqt", "parent_id": "t1_d9xhh8u", "retrieved_on": 1481438230, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cmcg1227", "author_flair_css_class": null, "author_flair_text": null, "body": "Once my parents/aunts and uncles started having kids, we did Christmas as such: Christmas morning was spent at our individual homes. Santa came to our houses. Then after breakfast/presents/church, we all headed to Grandma and Grandpa's for more presents and an early dinner.\n\nIf you and your husband want to do Christmas at your house, just say so. Tell her, were doing Christmas as a family at our home this year. Consider offering to come over in the afternoon, or on Christmas Eve. You don't have to do that though.", "controversiality": 0, "created_utc": 1479018011, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y65gy", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481440082, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "witnge", "author_flair_css_class": null, "author_flair_text": null, "body": "You can't control other people. \n\nA nice way to change where you spend Christmas is to simply say you're going to spend it as a family at your own place and have an idea of when you could spend some time with them (no idea how close / far they live from you).\n\nIn terms of presents just be thankful she wants to get your children stuff. When you say she gets age inappropriate toys does she buy things too young or too old? She may just be excited about the toy and not realise your child is too young for it or perhaps in her eyes her grandchildren are young and would like the toy. If she's buying to old perhaps say something like \"wow that looks fun child will have fun with that in  few months/years\" if she's buying too young it's a bit trickier but perhaps a quiet word when she asks for the list that your kids have moved on from xyz and perhaps might like something that they'll enjoy for a while.\n\nAs for not contributing to their education funds she probably thinks it's a long way off and isn't as fun and grandparents want to be fun. If you really don't like her gifts you could return or sell them and put the money away.", "controversiality": 0, "created_utc": 1479019630, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y6xad", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481440500, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "batgirl2393", "author_flair_css_class": "blue", "author_flair_text": "Renley Alexander 3.12.15, 2 angels", "body": "I might spend too much time on r/justnomil but this sounds like something my mil would do to annoy me. You can't make people put away money for your kids to go to college but if she has a list of things your kids want/need and she asked for that list there's no reason for her to stray from it. I'd definitely start making her gifts you don't want at home toys that stay at grandma's. Also, it's not too late to tell her Christmas is at your house this year so you and hubby need to get on the same page to make that happen from now on. I'm sure you and the kids will feel more comfortable celebrating at home and they'll probably like Santa coming to their home instead of grandma's.\n\nEdits because I'm tired and apparently can't type...", "controversiality": 0, "created_utc": 1479021125, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y7kjw", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481440828, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Stinkycheesemanz", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, thank you that was something I really needed to hear! ", "controversiality": 0, "created_utc": 1479021756, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y7tfk", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481440951, "score": 9, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pinkjello", "author_flair_css_class": null, "author_flair_text": null, "body": "I think a lot of your complaints are valid (especially spending Christmas at your house), but I'm in complete disagreement about the 529 contribution. Kids don't enjoy receiving \"money for college\" for Christmas. That gift is more for you as a parent (if you're planning on paying for college) than it is for the kid. Grandparents like giving gifts that bring joy to their grandkids... Do you honestly think your kids wish there were more in their 529s? That's even less fun than getting socks. \n\nAlso, your MIL is asking for gift *ideas*, but ultimately, unless she's violating some boundaries that you've told her about (no plastic crap), part of the joy of gift giving is her picking out what she wants. ", "controversiality": 0, "created_utc": 1479022145, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y7yt1", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481441022, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nicqui", "author_flair_css_class": null, "author_flair_text": null, "body": "My mother, who LOVES my 1 year old, said \"college money? That's so boring\" when I told her that's the only thing he needed for his birthday and Xmas.\n\nPerhaps you can request a gift receipt? I return anything I don't want in my house (noisy toys).", "controversiality": 0, "created_utc": 1479022931, "distinguished": null, "edited": false, "gilded": 0, "id": "d9y89dw", "link_id": "t3_5clvqt", "parent_id": "t1_d9xigcl", "retrieved_on": 1481441163, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with you about the college fund, but I don't think it's too late to change the Christmas tradition. If no set plans have been made, it's six weeks way, still time to let her know.", "controversiality": 0, "created_utc": 1479031405, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yat3k", "link_id": "t3_5clvqt", "parent_id": "t1_d9xhh8u", "retrieved_on": 1481442448, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "Is the tradition that you want to change the location of Christmas, or that she buys the Santa gifts?", "controversiality": 0, "created_utc": 1479031459, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yatla", "link_id": "t3_5clvqt", "parent_id": "t1_d9xigcl", "retrieved_on": 1481442454, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Sometimes the crap she gives us becomes a \"grandma's house toy\" so she can see how it feels to have plastic junk take over her house. Otherwise, there is no solution that isn't ungrateful and rude.\n\nThis is a great bit of advice. I reckon you could warn her that you ahead of time that you don't have space for anything big but if she sees something she really likes then it's fine to keep it at her house and the kids can play with it there.", "controversiality": 0, "created_utc": 1479031820, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yax3d", "link_id": "t3_5clvqt", "parent_id": "t1_d9xmmnd", "retrieved_on": 1481442501, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I don't agree that she should have to adhere to a list for Christmas presents.. Or that anyone should.\n\nTotally true, but at the same time don't ask for a list if you know you're not going to follow it?", "controversiality": 0, "created_utc": 1479032023, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yaz11", "link_id": "t3_5clvqt", "parent_id": "t1_d9xxwh7", "retrieved_on": 1481442527, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yuna1881", "author_flair_css_class": "blue", "author_flair_text": "Alex Ray 9/17/11", "body": "Yes! Couldn't agree with this more!! I make wish lists every year too, I stopped getting upset when MIL and my own mother go off said lists and get annoying crap for my kid. He's their grandchild and I can't control everything they do. You will become much much happier when you let things like this go, and it will make them happier and less stubborn about things that may matter a little more. One of the absolute key things to surviving a difficult MIL is learning to choose your battles and learning when to let things go. ", "controversiality": 0, "created_utc": 1479035993, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yc0b9", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481443040, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Wolf_Mommy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is absolutely great advice. So good. ", "controversiality": 0, "created_utc": 1479042005, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ydq6m", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481443898, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "devinesigns", "author_flair_css_class": null, "author_flair_text": null, "body": "They're words I've had to live by because my own parents pull all kinds of crap! When I stopped trying to control the outcome /rely on them to do anything the way I expect, our relationship improved dramatically.  And in turn, they've stopped trying to tell me what you do because they know I won't listen!", "controversiality": 0, "created_utc": 1479043197, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ye4ph", "link_id": "t3_5clvqt", "parent_id": "t1_d9y7tfk", "retrieved_on": 1481444092, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "devinesigns", "author_flair_css_class": null, "author_flair_text": null, "body": "Some people are just like that. My parents always ask for lists and never follow them. Most irritating,  they'll buy things super similar and the same price but not the actual thing requested. So I don't give lists anymore. They've asked for my daughter's  529 account info to make a contribution, I've send it 3x and no deposits, not that I'd expect them to follow through. As someone said upthread, my expectations are zero so I'm never disappointed! ", "controversiality": 0, "created_utc": 1479043564, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ye9ax", "link_id": "t3_5clvqt", "parent_id": "t1_d9xigcl", "retrieved_on": 1481444154, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "BellaLou324", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in the same boat, sort of, but I don't want to upset anyone, and I don't really mind the traveling for Christmas. We do Santa at our house though, and then say that Santa dropped other toys off at grandmas for him and his cousins. A lot of that stays there. \n\nAs for the list, I have a wishlist for my son with about 30 fun, open-ended educational toys, and my mom immediately said they're all boring. So I've decided to add one or two \"fun, flashy\" toys that I can tolerate. If she's going to spend money, I'd rather it be on something sort of okay. ", "controversiality": 0, "created_utc": 1479045506, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yeziy", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481444523, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheCarzilla", "author_flair_css_class": null, "author_flair_text": null, "body": "Your MIL doesn't have to give your kids a darn thing. It's your job to save and send them to college. It's your job to provide whatever kind of toys you want them playing with. Don't like what MIL gives? Donate it to charity after the holidays. Be grateful she loves your little ones enough to go shopping for them. I feel the same way about the plastic junk my inlaws give to my kids. But you know what? My kids have fun opening the gifts, my inlaws have fun shopping for them, and again-- they don't *need* to buy them anything, but it's nice that they care enough to! Whenever a birthday or holiday is coming up, I pack a box for Goodwill to make room for whatever comes next. ", "controversiality": 0, "created_utc": 1479045830, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yf469", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481444591, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheCarzilla", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with you!! I hate that you got downvoted. Gifts are not mandatory and entirely up to the gift giver. Sounds like someone should get a lump of coal this year, and I don't mean MIL. ", "controversiality": 0, "created_utc": 1479046765, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yfifz", "link_id": "t3_5clvqt", "parent_id": "t1_d9xluep", "retrieved_on": 1481444798, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! Solid advice and I definitely need to set some boundaries. ", "controversiality": 0, "created_utc": 1479048791, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ygfx7", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481445287, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gdolly", "author_flair_css_class": null, "author_flair_text": null, "body": "A list is there for a general idea not exactly to follow it. Besides that it's not even the first time OP has posted about lists and registries. She makes them for birthdays as well. It seems to me she just wants to control what people buy for her kids, and seemingly gets annoyed when they don't follow her lists. \n* edit, some words\n", "controversiality": 0, "created_utc": 1479053908, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yj8b7", "link_id": "t3_5clvqt", "parent_id": "t1_d9yaz11", "retrieved_on": 1481446720, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "JoNightshade", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, same thing here! Since both of our parents are within driving distance we are happy to come out later on Christmas day or the day after, but Christmas morning with Santa, etc. is at our house. We've also said they're welcome to come here if they want to see all the waking-up-and-discovering-gifts thing, but so far neither set of grandparents has taken us up on the offer. ;) ", "controversiality": 0, "created_utc": 1479055047, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yjy3t", "link_id": "t3_5clvqt", "parent_id": "t1_d9xmzus", "retrieved_on": 1481447064, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "Speak up!!! Make sure Santa comes to YOUR house too. We usually do Christmas morning at our house, opening all the Santa and mama/papa gifts, and then mid-morning we go to Grandpa's. \n\nBuy all the presents you want for your kids and be grateful for whatever she gets, or else ask for no gifts. You can't *make* people buy stuff, you are *asking*. \n\nAlso, for the 529 savings plan, my mom set one of these up and from that year on I never received a gift from my grandparents again. All they did was contribute $50 to the savings plan. Christmas and birthdays. For a kid? Terrible gift, I was disappointed every year. I think these things should be separate from gifts.", "controversiality": 0, "created_utc": 1479056089, "distinguished": null, "edited": 1479056437, "gilded": 0, "id": "d9ykmp5", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481447436, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with your mother, it is boring! :) My grandparents stopped giving presents and only starting contributing to my college savings and I hated it. It was super disappointing as a kid to never get a gift from my grandparents, Christmas and birthdays. I think that sort of thing should be separate or in addition to a gift.", "controversiality": 0, "created_utc": 1479056639, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ykzt2", "link_id": "t3_5clvqt", "parent_id": "t1_d9y89dw", "retrieved_on": 1481447619, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kacke0525", "author_flair_css_class": null, "author_flair_text": null, "body": "/u/devinesigns pretty much covers everything you need to know/do.\n\nMy addition is to tell MIL that with two kids of your own, and the oldest becoming more aware, you want to have your own Christmas, *at your house*. Like DS said, if you don't mind, invite MIL to join you for Christmas, or offer to go to her house later in the day. Or even do Christmas at MILs on Christmas Eve.", "controversiality": 0, "created_utc": 1479058618, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ymbza", "link_id": "t3_5clvqt", "parent_id": "t1_d9ygfx7", "retrieved_on": 1481448317, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Celesticle", "author_flair_css_class": null, "author_flair_text": null, "body": "I end up with a house full of people. My mom comes down Christmas Eve and my unmarried brothers sleep over too, my inlaws live only a few miles away so they come for breakfast and to witness Santa. I cook breakfast, lunch, and dinner, but I won't leave my house Christmas Day. We are the only ones with kids so the way we see it, everyone else is a hell of a lot more mobile than we are. Thankfully, I get along very well with my inlaws and my husband loves my family. He hangs out with my brothers regularly. If there was conflict, I might be more reluctant to host. ", "controversiality": 0, "created_utc": 1479059343, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ymuch", "link_id": "t3_5clvqt", "parent_id": "t1_d9yjy3t", "retrieved_on": 1481448607, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "8 yr old boy &amp; 4.5 yr old girl", "body": "As a fellow complainer of the \"why do they even ask if they don't care\" variety of gift-giver, actually asking for a list and then disregarding it is something I feel uncomfortable about.\n\n", "controversiality": 0, "created_utc": 1479060445, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ynmlh", "link_id": "t3_5clvqt", "parent_id": "t1_d9yj8b7", "retrieved_on": 1481449018, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "When my oldest turned 3 and we suddenly moved much closer to my in-laws, I put my foot down that Santa Claus absolutely comes to OUR house, not the grandparents. I said it was really important for when she started talking to her friends about it, but I was also honest about how important it was for ME. I never got to do Santa as a child, so I'm doing it for the first time ever with my own children, and I get to make these rules. The grandparents got to raise their own kids, and now it's my turn -- and I said so, possibly in gentler language. \n\nThe key is not to care if there are hurt feelings. This is important for you and your family. Also, tell your MIL when she inevitably asks for the Xmas list how frustrating it is for you to put in the work of making a list when she never seems to even consult it. ", "controversiality": 0, "created_utc": 1479061671, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yok5m", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481449486, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": "brown", "author_flair_text": "Two kids", "body": "Thanks!   It's okay, I knew I was going to be downvoted, but I figured I'd be a mom about manners, and I'm used to \"downvotes\" (from my kids, about homework, bedtime, screen use....).\n\nIn-laws are not your personal bank for one thing, so you don't get to choose where they put their money; and being a brat about what they give your kids is setting a pretty bad example for said kids.   It's just nasty and meanspirited.\n", "controversiality": 0, "created_utc": 1479063164, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ypriq", "link_id": "t3_5clvqt", "parent_id": "t1_d9yfifz", "retrieved_on": 1481450112, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "chefymum", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish our extended family would read this thread. My in-laws are pretty insistent that they want us and all grandkids to stay at their house Christmas Eve so they can give santa presents. My sister is single without kids and lives 4.5+ hours away from the rest of our family and she always complains that no one comes to visit her and just because she's single doesn't mean she should always be the one who has to travel....um, ya okay I'll pack up my family of five (with three under 5) plus 2 dogs and drive 4.5 hours to go try to fit 5 adults and 3 kids into 3 tiny bedrooms. ", "controversiality": 0, "created_utc": 1479063251, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yptz2", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481450145, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tojesussincerely", "author_flair_css_class": null, "author_flair_text": null, "body": "I have the kids each make an Amazon wishlist for bdays and Christmas. I have found that I can't force them to buy from it, because what they do with their money is their own business. But at the same time they can't force me to keep any of it, because what I do with my house, and precious limited storage space, is my own business. So i deal with the gifts for the day and donate what we don't want to keep. If they have a complaint, I stick firmly to \"if you don't stick to the list, I can't promise it's going to work with our  family/lifestyle.\" But, we still have to be gracious about it. Thank yous are a must, put a smile on, but don't feel obligated to make the stuff stickh around.", "controversiality": 0, "created_utc": 1479063329, "distinguished": null, "edited": false, "gilded": 0, "id": "d9ypw7q", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481450174, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mburke1124", "author_flair_css_class": null, "author_flair_text": null, "body": "You shouldn't say anything to her, your husband needs too. Id also make sure he leaves your name out of it when talks to her. ", "controversiality": 0, "created_utc": 1479064028, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yqg4a", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481450453, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheyDontMakeSunday", "author_flair_css_class": null, "author_flair_text": null, "body": "If you're looking for a way to remain passive and get what you want, it isn't going to happen. But your husband should be going to bat for the both of you on this one since it's his mother. \n\nIt isn't unreasonable for you guys to want to host. In our family, the ones with the kids make the rules for holidays, because it's about making it good for THEM more than anyone else. You and your husband can say, \"We're staying home this year and we'd love to have you guys come over - a few hours if you have other plans, or come for the whole day, we'd love to have you guys here.\" If she wants to see you guys, she'll come. She might crank about it at first but if she shows up and gives it a real shot, that's the important part. \n\nThe questions at the end - you are being a little ungrateful, because the main thing is whether or not she's being a good grandma. She might not do it your way, but is she good to the kids? You can sell off/donate a lot of the plastic crap. We slide ours right into a tote in the closet at the end of the day on Christmas, and they never miss it. Don't shrug it off, make a plan and stick to it. And as for the college plan, you can't force her to pay into it. That isn't what brings her joy, and it's her money. Just let that part of it go.", "controversiality": 0, "created_utc": 1479064535, "distinguished": null, "edited": false, "gilded": 0, "id": "d9yqv6b", "link_id": "t3_5clvqt", "parent_id": "t3_5clvqt", "retrieved_on": 1481450674, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess that's the thing, OP isn't just asking for people to buy off a list, MIL is asking for a list and ignoring it. A key distinction. ", "controversiality": 0, "created_utc": 1479112362, "distinguished": null, "edited": 1479117163, "gilded": 0, "id": "d9zlkkj", "link_id": "t3_5clvqt", "parent_id": "t1_d9ynmlh", "retrieved_on": 1481466144, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ElderflowerGin", "author_flair_css_class": null, "author_flair_text": null, "body": "So much this. \n\nI try to do this with my MIL but tend to not see it through. \n\nNew Years resolution? MY family, MY way. ", "controversiality": 0, "created_utc": 1479243049, "distinguished": null, "edited": false, "gilded": 0, "id": "da1rwol", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481504298, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes. This. You are the adult so you get to make your own choices about how you interact with other people.\n\nThere are always consequences for the choices you make - OP's not happy in her current situation because she's chosen the less confrontational path. But if she does confront MIL, she is choosing to make waves: which choice is the best one? \n\nThe one that gives you the best long term solution, in my opinion. Setting boundaries and standing up for yourself is nearly always the best long term solution.", "controversiality": 0, "created_utc": 1479331906, "distinguished": null, "edited": false, "gilded": 0, "id": "da3b2wb", "link_id": "t3_5clvqt", "parent_id": "t1_d9xjhyr", "retrieved_on": 1481531560, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}