{"submission": {"author": "dbhammel", "author_created_utc": 1445605690, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_ree5c", "contest_mode": false, "created_utc": 1480697143, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/5g496z/the_great_diaper_debate/", "gilded": 0, "id": "5g496z", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 61, "over_18": false, "permalink": "/r/Mommit/comments/5g496z/the_great_diaper_debate/", "retrieved_on": 1484297280, "score": 23, "secure_media_embed": {}, "selftext": "Ok guys, my wife and I are going to have a baby real soon and we've figured out just about everything (as much as we can haha) except the diaper situation.  We're pretty torn on going cloth or disposable.  We like that cloth are cheaper and we can use them for future kids but we're worried about the extra work and how it will go with the kid in day care in the future.  \n\nFrom what we've read the environmental factor isn't significant since the water used to wash the cloth diapers mostly off sets the lack of land fill with disposable.  So the benefit would mostly be the cost difference. Thoughts?", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "The great diaper debate", "url": "https://www.reddit.com/r/Mommit/comments/5g496z/the_great_diaper_debate/"}, "comments": [{"author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "8 yr old boy &amp; 4.5 yr old girl", "body": "The biggest factor was: could I wash a load of these bad boys each day?\n\nWhile yes, we did cloth and it was great.\n\nWhile no, we did paper and it was great.\n\nDaycare should be just fine with cloth diapers. Just provide enough cleans and a place for them to store the dirties and send them home.", "controversiality": 0, "created_utc": 1480698196, "distinguished": null, "edited": false, "gilded": 0, "id": "dapc7bp", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483420488, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Traziness", "author_flair_css_class": null, "author_flair_text": null, "body": "One thing not mentioned often is portability- when out and about, at a friend's place, the mall, etc... your baby poops and now you have to dump a diaper in one of these locations and then cart home the cloth in a plastic baggie to be washed at home. Actually, you would also do this with a pee diaper, so it's going to happen a lot. Now you've just added a plastic baggie to the landfill, unless you want to also wash plastic bags to be re-used, and that adds to the work involved as well. The alternative is using a hard plastic container (like an empty wipes bin) to carry home the dirty diapers,  but that takes up a huge amount of space in your already full baby bag.\nUltimately, it's more a preference thing- if you can stand handling poop &amp; pee directly with your hands then either one is an option. But by the end of diapering your child you'll have wayyyy too much of that no matter which method you choose. ", "controversiality": 1, "created_utc": 1480698926, "distinguished": null, "edited": false, "gilded": 0, "id": "dapctur", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483420814, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "orantte", "author_flair_css_class": null, "author_flair_text": null, "body": "In case it helps, I'll tell you about my experience. I spent $150 on a full set of alva cloth diapers and additional inserts. This is a lower cost cloth brand that uses a shell and liner. The major brands can cost much more. \n\nWith many modern cloth diapers it comes in 2 parts and you can change out just the insert (just like a pad) if there is little pee or poo stain but didn't get on the whole thing. Washing it is very easy, especially before like 6 months and the breastmilk/formula poo just dissolves in the wash. As they get older and eat food, you have to remove large poos before washing. The diaper sprayer device is popular but we never had one.\n\nAnyway it was easy to do the first few months but then our baby started being more active, I went back to work part time, and caregivers (both our relatives and babysitters) didn't like non-disposables at all, many refused or didn't treat them properly, and when we switched to part time daycare cloth was banned basically everywhere we asked around us. I think more expensive daycares accept it but we had a certain budget. So we abandoned it completely around a year. I wish we would have stuck with it more, because cloth kids tend to potty train faster. \n\nI still think we saved a little for using cloth when we did. Baby #2 is on the way and we will use these again as long as convenient. ", "controversiality": 0, "created_utc": 1480699827, "distinguished": null, "edited": 1480708519, "gilded": 0, "id": "dapdm5f", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483421198, "score": 10, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "littlemissp23", "author_flair_css_class": null, "author_flair_text": null, "body": "I may try cloth with #2, but with #1 it's hard enough just to figure out life with baby.  There is SO much output early on.  Daycare changes them every 2 hours no matter what, and will go off schedule if the see/hear/obv poop.  That's 6-8 cloth things I would have to send a day, plus more at home.  \n\nMaybe keep an eye out for a used lot of cloth diapers online, i see them quite often in great condition.  Once you are used to having a baby, you could give it a shot.\n\nAlso, i can barely keep up with laundry for myself and my husband and baby vomit, let alone add DAILY diaper wash.  Right now, at least.", "controversiality": 0, "created_utc": 1480699916, "distinguished": null, "edited": false, "gilded": 0, "id": "dapdoz6", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483421243, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gluestick05", "author_flair_css_class": null, "author_flair_text": null, "body": "When we did cloth I carried a smallish wet bag.  We had enough and did frequent enough washes that it wasn't a big deal!", "controversiality": 0, "created_utc": 1480700241, "distinguished": null, "edited": false, "gilded": 0, "id": "dapdz82", "link_id": "t3_5g496z", "parent_id": "t1_dapctur", "retrieved_on": 1483421379, "score": 13, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kitten_Fiddle", "author_flair_css_class": null, "author_flair_text": null, "body": "You washed every day? May I ask why?", "controversiality": 0, "created_utc": 1480700593, "distinguished": null, "edited": false, "gilded": 0, "id": "dapeai5", "link_id": "t3_5g496z", "parent_id": "t1_dapc7bp", "retrieved_on": 1483421533, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gluestick05", "author_flair_css_class": null, "author_flair_text": null, "body": "We did cloth until we started solids.  My husband and I both really liked it for a new baby--I feel like there was less irritation, less garbage, and it gave the baby a nice fat bum handle to grip onto.  The washing was not a super big deal at the time since it was easy to do while babywearing, which is pretty much all I did before my son was 3 months.  I got all of our prefolds used at about half price.  I was able to sell them for the same cost.\n\nWe switched to disposables when we started solids and increased my office days.  I didn't want to bring a load of poop diapers that needed to be rinsed back home at the end of the day.  My son also blazed through the sizes, and it gets harder to find larger used diapers in good condition.  So the cost savings aspect was not as big a factor as we were hoping it might be.\n\nI'd definitely give it a shot if you're interested--just don't spend a crazy amount of money or stockpile until you know you're sticking with it.", "controversiality": 0, "created_utc": 1480700596, "distinguished": null, "edited": false, "gilded": 0, "id": "dapealw", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483421534, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "icecreammandrake", "author_flair_css_class": null, "author_flair_text": null, "body": "We use a mix of both cloth and disposables, which is another option to consider.\n\nCloth is our regular day-to-day diaper (and our daycare has no problem using them) and I would say the pros for cloth are:\n\n- Environmental factors (I'd argue it's still significant)\n- Less diaper rash, in my experience.\n- Better containment / less blowouts.\n\nThere's little to no cost savings for us, because we pay for a service. Works well for us, but has it's own pros and cons of course.\n\nWe use disposables for overnight, and longer outings during the day (to avoid lugging around dirty cloth diapers). \nAlso weirdly when Grandma looks after our kid she uses disposables because she \"can't figure out\" our cloth diapers, despite having cloth diapered her own two babies... go figure.\n\n", "controversiality": 0, "created_utc": 1480700655, "distinguished": null, "edited": false, "gilded": 0, "id": "dapecgu", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483421564, "score": 12, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kitten_Fiddle", "author_flair_css_class": null, "author_flair_text": null, "body": "Second starting with disposables while getting used to life with a newborn.\n\nWhy is everyone washing daily?\n\nAlso, the more often daycare changes diapers, the more economical cloth becomes. Buying used is awesome (so much cheaper) and your baby is quite literally going to poop on them anyway.", "controversiality": 0, "created_utc": 1480700721, "distinguished": null, "edited": false, "gilded": 0, "id": "dapeeib", "link_id": "t3_5g496z", "parent_id": "t1_dapdoz6", "retrieved_on": 1483421598, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "devinesigns", "author_flair_css_class": null, "author_flair_text": null, "body": "We tried cloth but it was a never ending cycle of troubleshooting. I preferred all in ones cause they're less to deal with, laundry wise. But we'd get random leaks so unless we tried a whole batch of a different diaper, we couldn't know for sure what the problem was, cause the leaks happened at unpredictable times. Then she developed an umbilical hernia so disposables fit much better and I sold my cloth.\n\nI've known lots of families who did cloth at home and disposables when they were out.", "controversiality": 0, "created_utc": 1480702474, "distinguished": null, "edited": false, "gilded": 0, "id": "dapfxrn", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483422381, "score": 5, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MarianneDashwood", "author_flair_css_class": null, "author_flair_text": null, "body": "This was a great option for our family as well-- it's not all or nothing: you can do both. And in the end, if you don't use cloth often enough to feel you've really gotten the investment out of it, you can sell them for at least half as much as you paid for them.", "controversiality": 0, "created_utc": 1480702632, "distinguished": null, "edited": false, "gilded": 0, "id": "dapg2or", "link_id": "t3_5g496z", "parent_id": "t1_dapecgu", "retrieved_on": 1483422447, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mudkipmurron", "author_flair_css_class": null, "author_flair_text": null, "body": "Cloth is easy as long as you have a wash plan which is pretty simple. I have 50 diapers (mostly Alvas so like $5 a piece) and wash 2 times a week, so it isn't really any extra work. I did disposables the first 4 months and in my opinion cloth is easier because your baby doesn't poop on clothes and themselves really. We needed a bath because of explosive poop regularly in disposables (still do when we use them on vacation) and we have only had poop leak once in cloth.", "controversiality": 0, "created_utc": 1480703205, "distinguished": null, "edited": false, "gilded": 0, "id": "dapgkti", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483422695, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mudkipmurron", "author_flair_css_class": null, "author_flair_text": null, "body": "Wet bags are what you use to take care of dirty diapers when out, they take up no space and are nice to have even with disposable for gross clothes and stuff. ", "controversiality": 0, "created_utc": 1480703430, "distinguished": null, "edited": false, "gilded": 0, "id": "dapgs06", "link_id": "t3_5g496z", "parent_id": "t1_dapctur", "retrieved_on": 1483422791, "score": 8, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Glocktastic", "author_flair_css_class": null, "author_flair_text": null, "body": "Wanted to ask if it was a typo that caregivers didn't like disposable or cloth? Daycare banned disposable diapers?", "controversiality": 0, "created_utc": 1480703658, "distinguished": null, "edited": false, "gilded": 0, "id": "dapgz41", "link_id": "t3_5g496z", "parent_id": "t1_dapdm5f", "retrieved_on": 1483422885, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tkbear305", "author_flair_css_class": null, "author_flair_text": null, "body": "check out r/clothdiaps and http://www.fluffloveuniversity.com/\n\nthe water vs. landfill is not a valid comparison for eco factor\nthe cost of plastic diapers vs. soap+water+cloth diapers is still enormous.", "controversiality": 0, "created_utc": 1480704004, "distinguished": null, "edited": false, "gilded": 0, "id": "daph9u4", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483423028, "score": 16, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "butguyssrsly", "author_flair_css_class": null, "author_flair_text": null, "body": "We have done a mix for both of our kids. We love, love, love our Alvas, but disposable is better for babysitters and travel. Our washer is good, so they clean up pretty easily and then we just hang them to dry. Maybe start with a small stash of cheaper cloth. And try the different kinds to see which you prefer (AIO, AI2, covers, etc.)", "controversiality": 0, "created_utc": 1480705016, "distinguished": null, "edited": false, "gilded": 0, "id": "dapi57o", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483423486, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "8 yr old boy &amp; 4.5 yr old girl", "body": "A) to maintain the routine and supply\n\nB) because poop stains if you don't, or it did if I didn't", "controversiality": 0, "created_utc": 1480705022, "distinguished": null, "edited": false, "gilded": 0, "id": "dapi5e0", "link_id": "t3_5g496z", "parent_id": "t1_dapeai5", "retrieved_on": 1483423488, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "8 yr old boy &amp; 4.5 yr old girl", "body": "It reads like a typo; like disposable is ok but cloth is high end (daycare-wise).", "controversiality": 0, "created_utc": 1480705252, "distinguished": null, "edited": false, "gilded": 0, "id": "dapicij", "link_id": "t3_5g496z", "parent_id": "t1_dapgz41", "retrieved_on": 1483423590, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KKEB", "author_flair_css_class": null, "author_flair_text": null, "body": "Environmentally friendly disposables? We used Earth's Best. We subscribed through Amazon mom to save money. They also seemed to irritate my daughter less than Pampers (our go to grab at the convenience store if we ran out)", "controversiality": 0, "created_utc": 1480706849, "distinguished": null, "edited": false, "gilded": 0, "id": "dapjpew", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483424279, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dedicednu", "author_flair_css_class": null, "author_flair_text": null, "body": "We tried cloth diapers but my son constantly broke out with a rash even without soiling them. We tried different types of cloth diapers but in the end figured it wasn't worth the hassle and switched to disposable. No rash since. \n\nAnd cloth was a little bit of a hassle, which is why most go with disposables. If they pooped, you had to empty it into the toilet, sometimes using a squirt bottle to get the sticky bits. Then they all went through the washer by themselves, but first they had to go through a pre rinse before a regular washing cycle. Then the added laundry to be folded and put away. If you want to cloth out in public, then you have to bring a wet bag to haul them all back home. \n\nBiggest drawback of disposables is that it gets pretty expensive. \n\nSometimes you can find some used at thrift stores or on local buy/sell/trade groups. I'd try that first before investing in new ones.", "controversiality": 0, "created_utc": 1480706854, "distinguished": null, "edited": false, "gilded": 0, "id": "dapjpkj", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483424281, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "projectilemango", "author_flair_css_class": null, "author_flair_text": null, "body": "Environmentally they are still better. Yes you are using water to clean them, but water is used in the creation of each disposable. I think using water in terms of washing is better than a diaper taking longer to decompose in a landfill. Water is more renewable to me than a landfill. \n\nIf you can afford getting all in ones, that will save so much time. But I have all sorts of different kinds of cloth that the work too me is worth the savings. Even when it gets to solid food poop. We use a diaper spray and I think it is totally worth it!\n\nAs for daycares, where I live, they will use cloth if you provide it. But I still have to pay for the cost of diapers/wipes (only $2/day for our place). It really just depends and I'd ask around now if it will impact your decision. ", "controversiality": 0, "created_utc": 1480707104, "distinguished": null, "edited": false, "gilded": 0, "id": "dapjx8x", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483424414, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "orantte", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, I do have a typo, corrected it now, I meant non-disposables.. daycares banned cloth diapers. ", "controversiality": 0, "created_utc": 1480708480, "distinguished": null, "edited": false, "gilded": 0, "id": "dapl2ut", "link_id": "t3_5g496z", "parent_id": "t1_dapgz41", "retrieved_on": 1483425026, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iviolent", "author_flair_css_class": null, "author_flair_text": null, "body": "I have cloth and disposable.\n\nCloth ones are in a garbage bag in the closet. The mess, the smell, and the inconvenience just aren't worth it to me. I gave it a fair shot. \n\nDisposables are great. I use store brand or Luvs during the day (saves money) and Pampers during the night since they're more absorbent and higher quality.", "controversiality": 0, "created_utc": 1480710586, "distinguished": null, "edited": false, "gilded": 0, "id": "dapmu2n", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483425891, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "idkwhatdoyouwannaeat", "author_flair_css_class": null, "author_flair_text": null, "body": "I will second both those resources. Really helpful places. \n\nCloth during the day works really well for us. We use prefolds/covers on weekends and pockets at daycare. We use disposables at night because she sleeps longer in them. We wash every other day, sometimes every third day. \n\nA toilet sprayer is a helpful tool once solids start. ", "controversiality": 0, "created_utc": 1480711008, "distinguished": null, "edited": false, "gilded": 0, "id": "dapn6qn", "link_id": "t3_5g496z", "parent_id": "t1_daph9u4", "retrieved_on": 1483426062, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hyperventilate", "author_flair_css_class": "lightcoral", "author_flair_text": "Babby Born 06/08/16", "body": "I use both.\n\nCloth go on during the day. She wears a disposable diaper at night or when we're travelling/visiting friends/whatever.\n\nI have not noticed a mess or a smell with my cloth diapers, they're one extra load of laundry I do every two days and it's not that difficult. I toss 'em in the dryer and I reset them (put the liner back in them) and that's pretty much it, I drop 'em in a drawer once I get back into the nursery.\n\nI love my cloth diapers.\n\nETA: I use FuzziBunz. They're pocket diapers that grow with your little one from birth til potty training.", "controversiality": 0, "created_utc": 1480711130, "distinguished": null, "edited": false, "gilded": 0, "id": "dapnaen", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483426110, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "controversiality": 0, "created_utc": 1480711860, "distinguished": null, "edited": false, "gilded": 0, "id": "dapnw74", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483426414, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tabathafortis", "author_flair_css_class": null, "author_flair_text": null, "body": "I've never worked for a daycare that was allowed by the state licensing board to keep cloth diapers on property.", "controversiality": 0, "created_utc": 1480712604, "distinguished": null, "edited": false, "gilded": 0, "id": "dapoi7b", "link_id": "t3_5g496z", "parent_id": "t1_dapc7bp", "retrieved_on": 1483426716, "score": 7, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "veronicacrank", "author_flair_css_class": "lightcoral", "author_flair_text": "Lilian Heather 25/01/14", "body": "I wanted to do cloth but ended up with disposable because of convenience and ease. We were living in the UK when girl1 was born and while we had a combo washer/tumble dryer, the dryer was rubbish so we hung up all of our clothes to dry and the barrel was small so we were doing laundry every day or every other day.  Adding in another person plus her diapers was just not going to work for us. With disposables, it was no muss no fuss.  We got lucky with Pampers Swaddlers and wipes and will be doing the same for girl2 who will be here within the next 6-7 weeks. They do get expensive, we pay about $33 a box and for our almost 3 year old (who refuses to potty train) a box lasts about a month, but it's worth it for the ease and simplicity of them. ", "controversiality": 0, "created_utc": 1480712617, "distinguished": null, "edited": false, "gilded": 0, "id": "dapoik2", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483426721, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "WPAtx", "author_flair_css_class": null, "author_flair_text": null, "body": "Our son was home all day with my husband every day until he was 1, and then started preschool 3 days a week for 4 hours a day. Until he was 1, we did cloth no problem and liked it a lot.\n\nOnce he started preschool, where they did not allow cloth, we found it much more difficult to do cloth at home too. We didn't ever have enough diapers for a full load when we needed to run the wash, but you can't just have dirty diapers sitting around for days on end. So, for us, it wasn't worth it to continue cloth during the time he was home. I would just factor in that sort of thing when figuring it out.", "controversiality": 0, "created_utc": 1480713962, "distinguished": null, "edited": false, "gilded": 0, "id": "dapplcn", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483427250, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MidnightSG", "author_flair_css_class": null, "author_flair_text": null, "body": "In my experience only the super pricey daycares accept them. We checked out nearly all the daycares around us and only the crazy expensive montessori center accepted them. None of the others even accepted kids that wore them. :-/ ", "controversiality": 0, "created_utc": 1480714123, "distinguished": null, "edited": false, "gilded": 0, "id": "dapppyp", "link_id": "t3_5g496z", "parent_id": "t1_dapoi7b", "retrieved_on": 1483427324, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tabathafortis", "author_flair_css_class": null, "author_flair_text": null, "body": "I worked for Primrose for a while and they're pretty much the top of the line. I'm pretty sure it's a state licensing thing, to be honest. Keeping contained fecal matter is a biohazard.", "controversiality": 0, "created_utc": 1480714231, "distinguished": null, "edited": false, "gilded": 0, "id": "dappt26", "link_id": "t3_5g496z", "parent_id": "t1_dapppyp", "retrieved_on": 1483427366, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nogiraffetattoo", "author_flair_css_class": null, "author_flair_text": null, "body": "The major environmental problem with cloth diapers is actually from growing and processing cotton. The water used to clean them is pretty negligible comparatively. The processing is what usually ends up making it an environmental wash. \n\nFinancially, you might save a little bit overall on cloth. There are a lot of reviews about this online. Depends on costs of water/electricity/gas in your location, and how much you have to wash. I read about one woman who was washing each load 2-3x. (I don't remember why exactly, but it sounded insane to me.) \n\nBecause the environmental impact is similar, and the financial savings were not extreme, and also factoring in convenience, we are going with disposables. \n\nAlso, because we used the Amazon baby registry and have Amazon prime, and our friends/family purchased over a certain dollar amount from our registry, we got $200 in free diapers from Amazon (maybe $250? I can't quite remember). I ended up spending $5 on almost 1000 diapers. ", "controversiality": 0, "created_utc": 1480715471, "distinguished": null, "edited": false, "gilded": 0, "id": "dapqsht", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483427861, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "arronsky", "author_flair_css_class": null, "author_flair_text": null, "body": "Have lots of extra time and energy to deal with poop? Don't mind destroying washers, dryers, sinks and tubs with poop, everywhere all the time? \n\nI can't imagine cloth diapers if you can afford not to. The benefits are nonexistent and you won't see someone with more than one baby in diapers use them. Novelty for the west. ", "controversiality": 1, "created_utc": 1480715627, "distinguished": null, "edited": false, "gilded": 0, "id": "dapqwy3", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483427921, "score": -2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "I wash a load of diapers every 2-3 days. I use prefolds and a snappi with covers. I dont care about poop stains, and if they are really bad, hanging them in the sun, and it gets them out. I use Tide Original powder as it works best if you have any weird issues like ammonia buildup. It goes warm rinse, hot wash, cold rinse, warm rinse. Dry on high heat, hang covers to dry. \n\nETA:  I dont find it much extra work since kids mean tons of laundry anyway. ", "controversiality": 0, "created_utc": 1480716906, "distinguished": null, "edited": false, "gilded": 0, "id": "daprwdn", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483428437, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sunny_California_Sky", "author_flair_css_class": null, "author_flair_text": null, "body": "Parenting is hard enough, make it easier, get pampers and a diaper genie.", "controversiality": 0, "created_utc": 1480718354, "distinguished": null, "edited": false, "gilded": 0, "id": "dapsze2", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483428978, "score": 6, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Citruslatifolia", "author_flair_css_class": null, "author_flair_text": null, "body": "I did some research and almost went with cloth, but ended up using disposables. According to my research (which was 2 years ago):\n\n- Assuming you're buying new, cloth will certainly be financially worth it if you use them with more than one child (there was a good chance we'd only have one). Of course, you can buy used and resell, which offsets costs.\n\n- Environmentally, cloth is better if you air dry them. If you use a tumble drier, it about comes out even. (This goes against what others have said in the comments, and I can't cite sources, right now, so I'd recommend checking this.)\n\nBecause these factors didn't indicate a huge advantage, in our case, and we don't have a good support network where we live, we decided to go the easy route. I know quite a few people who manage to use cloth diapers and love them.", "controversiality": 0, "created_utc": 1480720675, "distinguished": null, "edited": false, "gilded": 0, "id": "dapunom", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483429802, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "loopbaby", "author_flair_css_class": null, "author_flair_text": null, "body": "so interesting because every time I put a cloth diaper on my kid he had a diaper rash in like a day. There were other reasons they really didn't really work for us, but this was the thing that killed my motivation to keep trying after 3 times of doing cloth, getting a rash, switching back until he healed, and going back. All my props to people who can make it work though. I hate all the $ and trash all going down the bin with the disposables.", "controversiality": 0, "created_utc": 1480720927, "distinguished": null, "edited": false, "gilded": 0, "id": "daputzi", "link_id": "t3_5g496z", "parent_id": "t1_dapecgu", "retrieved_on": 1483429885, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "loopbaby", "author_flair_css_class": null, "author_flair_text": null, "body": "me too with the rash :(", "controversiality": 0, "created_utc": 1480721038, "distinguished": null, "edited": false, "gilded": 0, "id": "dapuwq1", "link_id": "t3_5g496z", "parent_id": "t1_dapjpkj", "retrieved_on": 1483429922, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree to keep your options open according to circumstance. Babies poop with great variation in frequency. Mine was a 10-15 a day pooper. I never understood the \"heavy nappy\" thing - ie how you tell if a nappy is full or not, when there's only \"invisible\" urine it it - because all of my baby's nappies were brown (or yellow - the \"poop rainbow\" of a newborn!)\n\nSo for me, disposables were a life saver. Laundering 10-15 cloth/day would have been a miserable drudge. \n\nI did look into compostables which to my mind are even more eco friendly than cloth, but you need a commercial nappy composting service in your area, and there wasn't one in ours. ", "controversiality": 0, "created_utc": 1480721420, "distinguished": null, "edited": false, "gilded": 0, "id": "dapv640", "link_id": "t3_5g496z", "parent_id": "t1_dapealw", "retrieved_on": 1483430051, "score": 4, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "knottydana", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey all the best for your upcoming arrival. \nJust to add (have read some comments but not all), but you can do both!\nEven if you just use one cloth diaper a week, that is saving 52 a year from the landfill. ", "controversiality": 0, "created_utc": 1480721995, "distinguished": null, "edited": false, "gilded": 0, "id": "dapvk26", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483430260, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "blueharpy", "author_flair_css_class": null, "author_flair_text": null, "body": "I really wanted to do reusable diapers, but I had a bad/traumatic birth, long recovery, and live in an apartment building with basement laundry room. It just wasn't feasible in that instance.\n\nIf you do disposables, recommend you subscribe with Amazon Family, they come to you, no running out, no last minute store trips, and I personally couldn't beat the price locally unless Costco had a sale.", "controversiality": 0, "created_utc": 1480722801, "distinguished": null, "edited": false, "gilded": 0, "id": "dapw3po", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483430556, "score": 3, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TheyDontMakeSunday", "author_flair_css_class": null, "author_flair_text": null, "body": "Whatever you choose, I suggest having a couple of the alternative in the house. You'll run out of disposables at 1 a.m. during a snowstorm, or you'll realize you used the last of the cloth and need to finish other loads of laundry in order to even get to the diapers. \n\nI will say that cloth wipes are fantastic, esp for newborns with the tarry poop. Warm water on flannel is all you need. ", "controversiality": 0, "created_utc": 1480724240, "distinguished": null, "edited": false, "gilded": 0, "id": "dapx1i9", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483431014, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bonsc", "author_flair_css_class": null, "author_flair_text": null, "body": "Maybe some awesome diaper prints can help make up your mind. I just got [these](https://imgur.com/gallery/rH6RS) in the mail yesterday. ", "controversiality": 0, "created_utc": 1480724940, "distinguished": null, "edited": false, "gilded": 0, "id": "dapxhr8", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483431241, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Thymeofyourlift", "author_flair_css_class": null, "author_flair_text": null, "body": "D.C. And NH are the only states that require a DRs note, all other states allow them. ", "controversiality": 0, "created_utc": 1480726127, "distinguished": null, "edited": false, "gilded": 0, "id": "dapy93p", "link_id": "t3_5g496z", "parent_id": "t1_dappt26", "retrieved_on": 1483431636, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Thymeofyourlift", "author_flair_css_class": null, "author_flair_text": null, "body": "The rash probably had something to do with the way you were washing them? ", "controversiality": 0, "created_utc": 1480726337, "distinguished": null, "edited": false, "gilded": 0, "id": "dapydxy", "link_id": "t3_5g496z", "parent_id": "t1_daputzi", "retrieved_on": 1483431700, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Majestic_Forest", "author_flair_css_class": null, "author_flair_text": null, "body": "Check out elimination communication, our son is a year and we usually only use three diapers a day now ", "controversiality": 0, "created_utc": 1480728225, "distinguished": null, "edited": false, "gilded": 0, "id": "dapzkdt", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483432297, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ninjamama32", "author_flair_css_class": null, "author_flair_text": null, "body": "I use cloth (am on kid 3). It can be a pain sometimes, and we have taken brief  \"breaks\" when we used disposables for a week or two. We also use disposables for the first month or two after the baby is born. \n\nI stay home, but have not had an issue with preschool or the daycares that I interviewed. I am even still using some diapers that I used on my oldest (some have worn out).", "controversiality": 0, "created_utc": 1480732899, "distinguished": null, "edited": false, "gilded": 0, "id": "daq2d7j", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483433706, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "-____-_-_-_--_____--", "author_flair_css_class": null, "author_flair_text": null, "body": "I used disposable with my daughter. This was mainly because I thought it would be time consuming washing them and keeping up on that. I've been a single mom since day 1, constantly working trying to make ends meet and when I was home I just wanted to spend that time with her instead of washing diapers.\n\nThat being said, if the situation was different, I probably would've at least given cloth a try. If it doesn't work out you can always make the switch to disposable. It doesn't hurt that I found this etsy store that sales super adorable geeky themed cloth diapers. It's called SeamsGeeky if you're into that sort of thing, btw. \n\nBut yeah, if it's a concern of yours I'd probably buy a few cloth and see how it works out and if you don't like it just switch to disposable. There's no rule stating you have to stick to one.", "controversiality": 0, "created_utc": 1480732903, "distinguished": null, "edited": false, "gilded": 0, "id": "daq2dat", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483433708, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dreezyforsheezy", "author_flair_css_class": "orange", "author_flair_text": "Boy Jan 12, 2014; Baby2 June 2016", "body": "Lol. Wat? Destroyed washers? Not used on more than one baby? Pretty sure that was all of the entire world like 50 years ago, east or west. ", "controversiality": 0, "created_utc": 1480733566, "distinguished": null, "edited": false, "gilded": 0, "id": "daq2rk5", "link_id": "t3_5g496z", "parent_id": "t1_dapqwy3", "retrieved_on": 1483433931, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kitten_Fiddle", "author_flair_css_class": null, "author_flair_text": null, "body": "I just wash every three days. I haven't had undue issues with poop staining, but I scrape/dump as soon as the poop occurs. I was really surprised to hear people wash every day because where I live, most people wash every 2 or 3 days, although some people try to stretch it longer.\n\nI will admit I did buy extra diapers so I wouldn't have to wash as often, but given how long it takes to do the diaper wash I'd never be able to do other laundry if I washed them every day!", "controversiality": 0, "created_utc": 1480734095, "distinguished": null, "edited": false, "gilded": 0, "id": "daq32ox", "link_id": "t3_5g496z", "parent_id": "t1_dapi5e0", "retrieved_on": 1483434081, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jintana", "author_flair_css_class": "purple", "author_flair_text": "8 yr old boy &amp; 4.5 yr old girl", "body": "There're a few possible variables: machine, detergents, water quality, diaper brand. But consistently, if I forgot to wash poop, I could count on there being a stain.", "controversiality": 0, "created_utc": 1480734189, "distinguished": null, "edited": false, "gilded": 0, "id": "daq34oo", "link_id": "t3_5g496z", "parent_id": "t1_daq32ox", "retrieved_on": 1483434107, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pinktoothbrush", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't comment on the daycare situation.. but.. we did disposables for a month. I couldn't stand them. Cloth was so easy, even with the washing. So quick to put away, I just put the inserts in a pile and the covers in a pile in his drawer. Even traveling, I had no issues. I have about 30 bumgenius 4.0s, with 5 hempbabies inserts for overnights. Wash about every 3 days. Made my own cloth wipes from flannel, all you need is to wet them with warm water. \n  \nWe only use diapers overnight now, did elimination communication and my son was daytime potty trained just after 2 years old. I really think the cloth diapers helped with that.\n  \nI smile to myself when I see people in line at the store with $70 worth of disposables.. I can't even imagine.", "controversiality": 0, "created_utc": 1480740791, "distinguished": null, "edited": false, "gilded": 0, "id": "daq6w44", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483435999, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "blueeyesofthesiren", "author_flair_css_class": "purple", "author_flair_text": "Mom to two under 4...", "body": "Random question, have you tried an all HOBF diaper for night?\n\nI've heard they're amazing with absorbtion.", "controversiality": 0, "created_utc": 1480745317, "distinguished": null, "edited": false, "gilded": 0, "id": "daq96xi", "link_id": "t3_5g496z", "parent_id": "t1_dapn6qn", "retrieved_on": 1483437167, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "blueeyesofthesiren", "author_flair_css_class": "purple", "author_flair_text": "Mom to two under 4...", "body": "I know multiple people with two that cloth diaper. My best friend is about to pop with twins and fully intends to cloth diaper after cloth diapering two singletons before with it.", "controversiality": 0, "created_utc": 1480745675, "distinguished": null, "edited": false, "gilded": 0, "id": "daq9cs6", "link_id": "t3_5g496z", "parent_id": "t1_dapqwy3", "retrieved_on": 1483437244, "score": 2, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "idkwhatdoyouwannaeat", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not sure what and HOBF diaper is...", "controversiality": 0, "created_utc": 1480770981, "distinguished": null, "edited": false, "gilded": 0, "id": "daqh29w", "link_id": "t3_5g496z", "parent_id": "t1_daq96xi", "retrieved_on": 1483441100, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "blueeyesofthesiren", "author_flair_css_class": "purple", "author_flair_text": "Mom to two under 4...", "body": "Heavy organic bamboo fiber. Suppose to be super absorbent. I know a ton of moms that use it for over night. Well that and fleece made diapers.", "controversiality": 0, "created_utc": 1480782033, "distinguished": null, "edited": false, "gilded": 0, "id": "daqmmbu", "link_id": "t3_5g496z", "parent_id": "t1_daqh29w", "retrieved_on": 1483443841, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "We found a day care before we decided on diapers, and our daycare will only do disposables, so that was that. Plus we're only having one kid so the cost difference isn't that big, and at this point in our lives we have more money than time.", "controversiality": 0, "created_utc": 1480782670, "distinguished": null, "edited": false, "gilded": 0, "id": "daqn0hg", "link_id": "t3_5g496z", "parent_id": "t3_5g496z", "retrieved_on": 1483444048, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "icecreammandrake", "author_flair_css_class": null, "author_flair_text": null, "body": "I've definitely heard both. My own experience has been that cloth gives my kid less rash, but of course ymmv!", "controversiality": 0, "created_utc": 1480809071, "distinguished": null, "edited": false, "gilded": 0, "id": "dar4wv6", "link_id": "t3_5g496z", "parent_id": "t1_daputzi", "retrieved_on": 1483452943, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "arronsky", "author_flair_css_class": null, "author_flair_text": null, "body": "Why do they do that? An excess or lack of money? An excess of time? Why overcomplicate your life for no benefit to the child or environment ? It makes absolutely no sense. ", "controversiality": 0, "created_utc": 1480815541, "distinguished": null, "edited": false, "gilded": 0, "id": "dar96f1", "link_id": "t3_5g496z", "parent_id": "t1_daq9cs6", "retrieved_on": 1483455098, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "blueeyesofthesiren", "author_flair_css_class": "purple", "author_flair_text": "Mom to two under 4...", "body": "It actually can benefit the child. Cloth is more breathable so causes less rashes. Some kids are allergic to the chemicals used in sposies so cloth is the only choice because you can control the detergent used.\n\nMy friend makes the diapers for a living so it makes sense to use her own product. Yes they can be a bit pricey but the people who pay for the pricier ones have the money to do so. They appreciate their little one having a cute bum.\n\nIt's a choice just like breastfeeding vs FF feeding, you do what is best and what works for YOUR family. I did what I had to do for my family.", "controversiality": 0, "created_utc": 1480816705, "distinguished": null, "edited": false, "gilded": 0, "id": "dar9xza", "link_id": "t3_5g496z", "parent_id": "t1_dar96f1", "retrieved_on": 1483455469, "score": 0, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mimama58", "author_flair_css_class": null, "author_flair_text": null, "body": "I CDed two (disposables at daycare); even at night- I used wool covers.  My last one though....his skin is soooo sensitive!!! He got a yeast infection as a newborn that was so bad that the first Rx cream didn't fix it, had to get something stronger.  Once I got that cleared up, I tried cloth again and his rash came roaring back in like 2 hours.  I took a break from cloth and his rash never came back.  Months later I tried cloth again and his rash was so awful that puss filled blisters formed.  Sacrificing my baby's health wasn't worth it.  I had gotten my money's worth with the first two using cloth, and honestly with 3 boys, I can't handle more laundry!!", "controversiality": 0, "created_utc": 1480893293, "distinguished": null, "edited": false, "gilded": 0, "id": "dasgvb9", "link_id": "t3_5g496z", "parent_id": "t1_dar4wv6", "retrieved_on": 1483476725, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}