{"submission": {"author": "ZenMommy", "author_created_utc": 1380664425, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_dcng0", "brand_safe": false, "contest_mode": false, "created_utc": 1483887961, "domain": "self.Mommit", "edited": 1483916385, "full_link": "https://www.reddit.com/r/Mommit/comments/5mr7wr/hi_im_zenmommy_and_i_study_the_neural_processes/", "gilded": 0, "id": "5mr7wr", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 145, "over_18": false, "permalink": "/r/Mommit/comments/5mr7wr/hi_im_zenmommy_and_i_study_the_neural_processes/", "retrieved_on": 1489413318, "score": 52, "secure_media_embed": {}, "selftext": "Hello! Thanks to all your questions and suggestions that I do an AMA, here I am to answer all your questions about language and reading development, starting from the first ba-ba-ma's to learning multiple languages! \n\nI'm half way through my doctoral work, studying the relationship between the written word and how it directly influences certain mental states in people, like anger, empathy, memory retention, etc. Starting from 6 months in utero, the human fetus can hear language as distinct sounds and begins to learn their parent's accents! Their first babbles are already influenced by the dominant language heard around them. And they understand words, long before they can speak them! So how do you know your baby is on track? When should you be worried or push for evaluation? What kind of words are most useful to teach first? When are their brains ready for certain ideas, like feelings and emotions? \n\nI know for myself, my research helped me as a parent, to not stress about some things, to facilitate my children's verbal and reading development, and to make my life waaay easier! So if you have any questions about how the brain actually works when it's learning to talk and read, what's a normal developmental phase for your child, and if your kid is ever going to start saying something comprehensible, ask away! \n\nPlease post your questions and I'll be live from 1 - 3 p.m. CST to chat and answer! I'm so happy to have a chance to give back to this special community. This place was my happy place during my first pregnancy and when I was figuring out what the heck to do with my baby now that she was born! Thank you for that!\n\nEdit: Okay, I spent WAY more time on this than I intended - kudos to my lovely husband who took the kids for the afternoon! Thank you all for your questions, I really enjoyed this. Feel free to keep posting questions, I'll check back every once in a while for a few days and try to get to you all. You're all awesome mothers who clearly  love your children and care for them deeply! They are lucky to have you as their mothers!", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "self", "title": "Hi! I'm ZenMommy and I study the neural processes of the learning brain, focusing on language and reading development! AMA!", "url": "https://www.reddit.com/r/Mommit/comments/5mr7wr/hi_im_zenmommy_and_i_study_the_neural_processes/"}, "comments": [{"author": "Yours_Dearly", "author_flair_css_class": null, "author_flair_text": null, "body": "What are some books/articles/resources you would recommend to learn more about the brain development of children? This subject highly interests me but I've never actually taken the time to study it. Now that I have 1 year old twin boys, who are learning like crazy, I would love to know more about how their brains are working and what they are capable of learning at this point!! Thanks!! ", "created_utc": 1483889580, "id": "dc5pnll", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "futurecompanion11", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi do you have any research you could share about young toddlers and learning multiple languages? We have a 15 month old and my husband is really pushing for her to learn German. He speaks a lot of German to her but I know very little German. He wants me to learn German so we can both speak to her in mostly German. I have little interest in learning another language but I'm trying a little. What would the chances of her actually becoming somewhat fluent in German in our situation? Also I feel like its confusing to her. She's learned some words in English and some in German. My husband will often correct her English word with a German word and I'm just happy she's learning the word at all. ", "created_utc": 1483891491, "id": "dc5qtzg", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Majestic_Forest", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the ama, I have a thirteen month old son who will sit with his books for over an hour some days, he started babbling mama dada around six months, now he can clearly say almost five words and is obviously trying very hard to pronounce more. He also understands a huge amount of words and phrases, does this all sound like he is exactly on track in terms of speech development? \n\nAlso wondering when it would be beneficial to introduce him to flash cards for various things like math and words.", "created_utc": 1483892472, "id": "dc5rh26", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "UnicornToots", "author_flair_css_class": "purple", "author_flair_text": "Baby Girl - 09.07.15", "body": "What causes a baby/toddler to go from understanding the word to saying it? Do they know how to say it, and choose not to until a certain point? Is it something more neurological than that?\n\nI sometimes find myself getting frustrated because I know my daughter (16 months) knows so, so many words but doesn't speak them. For example: she points at her milk, I ask her, \"Do you want milk?\", she nods, I ask her to say \"milk\", and she either shakes her head, says something else, or gets mad. Is she doing this because she's still learning, or that she just doesn't want to?", "created_utc": 1483893190, "id": "dc5ryk5", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dis_ismysn", "author_flair_css_class": null, "author_flair_text": null, "body": "Hello and thank you for the AMA! \n\nI'm currently 36 weeks pregnant with our first child. We live in the US, but my husband is from Mexico and obviously Spanish was his first language. We are both bilingual and want to raise our daughter to be bilingual as well. \n\nWhat is the best way to do this? Should my husband speak to her in Spanish only and I speak to her in English only? Can we go back and forth? How can we raise her speaking both languages without delaying her developmentally? Obviously she will be attending an English speaking school one day, and we want her to be comfortable in Spanish and English before that point. ", "created_utc": 1483893407, "id": "dc5s3tv", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alfalfasprout", "author_flair_css_class": null, "author_flair_text": null, "body": "This is timely! I've been worrying nonstop about my 13 month old daughter's language development lately, maybe you can reassure me. She doesn't say any words yet. She babbles dada regularly but it's not specific. She also is not able to respond to simple instructions (e.g where is the ball?) We speak 90% English at home and maybe 10% French. I've made her an appointment with a speech language pathologist for an assessment but they don't have any appointments until March so I'm just worrying until then. \n\nI'm particularly concerned because she will be the youngest in the class with a December birthday so I just really don't want to let her fall behind. Which brings me to an actual question, do kids who start speaking later tend to catch up to others by some age or will they generally be behind from then on? \n\nAlso, it's nice to see other moms mid-PhD! Mine is in Physics. ", "created_utc": 1483893419, "id": "dc5s44q", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jazzmuffin", "author_flair_css_class": null, "author_flair_text": null, "body": "Not an expert here, but children learn very quickly. We are a Spanish and English bilingual home as well and my son is learning primarily Spanish first. My husband and I speak to each other in English so I know my son is picking up some English just by listening, but we speak to him in Spanish. He will be in two in March and has an excellent vocabulary in Spanish and knows some words in English. For us, we are  not concerned with him learning English as much as we want him to have a good Spanish foundation. He will have friends in school who speak only English and that will develop fine. \nWe are making these decisions also based upon what we've seen with out nieces. They learned only Spanish until school and picked up enough English to communicate very well within the first school year. ", "created_utc": 1483895868, "id": "dc5ttp8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5s3tv", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jazzmuffin", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for doing this AMA. I have a son who will be two in March. We are a bilingual family (Spanish and English with both parent fluent in both languages). I feel that my son has an excellent vocabulary for his age 60+ understood words and also repeats words he hears but does not comprehend every day. We are speaking to him about 95% in Spanish and 5% in English, but my husband and I speak English to each other. So I hope this isn't confusing him to hear us speak differently to each other (?). Main question: when is developmentally appropriate for children to be forming sentences? He can communicate his wants and needs and even some emotions very well verbally but doesn't use sentences yet. At what age should they be able to make phrases and sentences?  For example: he can say the names of items he wants or can say verbs that he wants to but doesn't connect them. ", "created_utc": 1483896489, "id": "dc5ua6x", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "whenwillthewaitend", "author_flair_css_class": null, "author_flair_text": null, "body": "Is it true that it's better for babies to avoid the sing-song \"baby talk\" and speak to them as if they were an adult? Once they get old enough to start talking it seems like it would be better to talk to them like an adult but does it make a difference when they're babies and not speaking yet? I've heard that it delays proper language development. But then I read another article saying it makes it easier for babies to pick up the \"essential\" parts of words and phrases so \"baby talk\" actually helps them develop language. And now I have no idea what to do.", "created_utc": 1483898110, "id": "dc5vhkl", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Amap0la", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for doing an AMA! I am hoping to raise my child dual language. Our plan is to have my husband speak Arabic and I will be English. Obviously my child will be around me more as he is working during the day until she is old enough that I think I could bring her to our store daily. Have you any experience with this method? I know it's pretty common. I also plan to supplement with Arabic tv programming every now and again. Will this be clear to the child? Not overly confusing ? And suggestions? Thanks !", "created_utc": 1483898836, "id": "dc5w1a1", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Antisera", "author_flair_css_class": null, "author_flair_text": null, "body": "When should I start to be concerned about pronunciation? My 18 month old has a lot of words, but she pronounces them wrong. We translate for her to other people, and always repeat after her the correct way to say the word. Is there anything else we can do?", "created_utc": 1483900104, "id": "dc5x17u", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "babyelephants2", "author_flair_css_class": null, "author_flair_text": null, "body": "What are your favorite tips on how to facilitate your baby's development. Any life hacks on how to easily incorporate some good techniques into daily routine?", "created_utc": 1483900145, "id": "dc5x2fz", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "aleii1", "author_flair_css_class": null, "author_flair_text": null, "body": "Is speech delay partially due to genetics?  Multiple kids in my family have had delay/needed speech therapy (no medical reason).  \n\nAnd finally, any thoughts related to encouraging children to speak with new people?  My son will not say a word to well-meaning people we encounter, such as when the cashier asks him simple questions like how old he is or if he likes being a big brother, even with me right there encouraging him to respond.", "created_utc": 1483900337, "id": "dc5x82p", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for doing this AMA! I have an 18 month old who had a few words but has regressed and not said anything in 2 months. He just babbles like a much younger baby. Is this concerning? The wait list for speech therapy where I live is 6 months long so its something we need to work on at home.", "created_utc": 1483900592, "id": "dc5xfbw", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I love seeing questions about bilingual families! [In many parts of the world, it’s impossible *not* to raise your child multi-lingually.]( http://www.mnn.com/lifestyle/arts-culture/stories/9-of-the-worlds-most-multilingual-countries) For example, in India, you learn your local dialect, maybe the one from the neighbouring state, and then Hindi and English. So to put you at ease, raising a bilingual child will not delay them developmentally at all. This is actual a very normal thing for humans to do. You can both go back and forth as much as you can. There is no rule for the brain that one object can only be connected to one group of sounds. If you introduce that fact that one object is simply called two different sounds and both work equally well, your child will unquestioningly learn that. There is no need to translate one language through another.\n Is there a language that will be the “dominant” one in the future? For example, is she going to be surrounded mostly by English speakers and have to go to school/work/career in English? If this is the case, once both languages have been established and the child is in English school, I recommend mostly using the “less important” language at home, to ensure that both are kept up. As she gets older, be sure to specifically introduce her to the stories, art, history, and culture of the less-used language, to ensure that many connections between language and the world around her are made in the brain. The stronger and bigger the web of neural connections between the language and the things she sees and experiences is, the more likely she’ll keep the connection to the language.\nReading is absolutely one of the best things you can do for her. Do you have any bilingual Spanish/English books for children?  \n[This is one of my favorite resources for bilingual parents]( http://www.linguisticsociety.org/resource/faq-raising-bilingual-children) Feel free to PM me if you have any questions that this webpage can’t answer for you! \n", "created_utc": 1483901580, "id": "dc5y8kf", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5s3tv", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.linguisticsociety.org/resource/faq-raising-bilingual-children"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Both my children have December birthdays too! Your child’s babbling is her trying to communicate, which is great! Does she point, gesture, or use her hands/body to help talk if, for example, she wants something specific? What is important to consider is not so much if she is *talking*, but if she is *communicating*. I’m happy to hear you’ve made an appointment already. If there is a problem, it’s important to begin therapies as soon as possible. The younger a brain is, the easier it is for them to make new neural connections, changing old habits and learning new ones. \nNow, it’s difficult to predict whether or not your child may have a temporary or permanent delay. It’s about a 50/50 chance either way. The reason for this is that there are SO many factors involved, including the reasons for the delay, and significantly, the parents’ involvement in addressing it. You’re already doing the best thing you can do by getting her that appointment. Day-to-day, I just encourage you to read a lot, keep her screen time super minimal, and play with her as much as possible. When we are playing and having fun, our brains light up like fireworks, and we’re absorbing information very intently. Playing is the most natural form of learning! With my own children, while I do babble like a maniac, narrating everything as I go, I also, especially when they are less than 2 years old, took the time to listen to their babbling. In order for them to want to talk, they need to feel like people like to listen to them. \nWhen narrating or just talking about an activity you are doing, try not to focus on objects as much as what you think she’s experiencing with her body and senses. For example, the playdough feels smooth, soft, and squishy. The colour is less important than what she feels, because what she is feeling is the dominant sensation in this experience. Singing, dancing, blowing bubbles, making silly faces together, etc. are all fun ways of learning to communicate and exercising mouth and face muscles, which helps bring attention to them.\nAnecdotally, my husband was a slow talker. He didn’t really say much before his 3rd birthday. He’s terrifyingly brilliant and makes medical robots for brain surgery now. Turns out, he was just really taking everything in and thinking very hard about it!\n[Check out this article by Rhea Paul. It’s about children a little older than yours, but you may find it a helpful resource!]( http://journals.lww.com/topicsinlanguagedisorders/Citation/1991/11040/Profiles_of_toddlers_with_slow_expressive_language.3.aspx)\nAll the best in your studies!\n", "created_utc": 1483901613, "id": "dc5y9lf", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5s44q", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://journals.lww.com/topicsinlanguagedisorders/Citation/1991/11040/Profiles_of_toddlers_with_slow_expressive_language.3.aspx"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Your son has excellent communication skills for his age! Building sentences is not something that happens all at once, but incrementally. So we start with just single words (ball), start to make 2-3 word combinations (have ball!), they become more complicated (I want have ball! Me! Me!), the grammar starts to kick in as they notice patterns in other people’s speech, and they eventually end up with “My good sir, if it is not an inconvenience, may I trouble you to hand me that ball?”\n\n What is important is that he is on this learning spectrum, headed towards increased complexity. Developing sentences is a skill that begins to develop around 18 months in early talkers. By 24 months, we should see some small combinations happening, and by 2.5 years, things that sound like sentences but can still be totally grammatically incorrect. I’m wondering if it wouldn’t benefit him to hear you both say long sentences to each other in whatever his dominant language is. Reading together is super important. Ideally, it should happen twice a day at least. \n\n\nAre you in the U.S? If he isn’t putting little 2-5 word phrases together by 2.5 years, I recommend getting an assessment done by the great people at your state’s Early Intervention program. (Any Americans here with experience with them or a good link?)\n", "created_utc": 1483901664, "id": "dc5yb6f", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ua6x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, this is a great question! Thanks so much for asking! I had a heart attack the first time I noticed this in my children. In my case, it’s because I was responding wrongly to her. We don’t need to *teach* our children how to talk, so much as they just learn from their environment. I’m going to use the example you describe with your daughter, because I was making the same mistakes. The goal is “communication”. So your daughter gets an A+ for wanting something, figuring out how to make you understand it, and then getting it! But wait! There’s a trap! First, before she can get the thing that she wants and has communicated successfully about, she has to pass a test and make her mouth say “milk”. So at that point, it’s really understandable that she’s a little frustrated and refusing to play your game. So she’s still learning, she doesn’t want to say it, because from her perspective, she’s already communicated successfully. \n\n\nSo what I did, that worked well, was to focus on their perspective. The next time, try getting excited that what she did worked. “You want milk! Mommy listened to you! Here’s your milk. Mmm, cold, wet milk. Milk tastes good in your mouth!” We’re repeating “milk”, because obviously it would be really handy for her to learn that word; it’s one that she is showing a lot of interest in. Keep the whole experience positive and fun. I bet you that within a few weeks of changing how you interact verbally with her, she’ll start spontaneously opening up and using her words more. If she feels like it’s stressful and important, and like there’s a test to pass before she gets what she wanted, she’ll shut down much faster, as her little nervous system quickly gets overwhelmed at this age.  \nYour daughter sounds like a very smart, determined little person! \n", "created_utc": 1483901722, "id": "dc5ycx8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ryk5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1483901791, "id": "dc5yezf", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5rh26", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is perfectly normal at this age, and you are doing exactly what you should be doing. Simply repeat it correctly and calmly, without any insinuation that they are doing anything wrong. Over the next 6 months, you should see an improvement. The first place you’ll notice this is when she REALLY wants something. My son (now 2) called his bottle “ba-bow” for about 8 months. We’re phasing out the bottle, and at one point, he REALLY wanted it. Suddenly, clear as a bell, he says “BOTTLE! BOT-TLE NOW!” The next day, it was back to ba-bow, but we knew that if it was important to him, he could pronounce it very clearly indeed!\n\n If there are no improvements in clarity in the next six months, and all external factors like enlarged tonsils/adenoids, tongue tie, and hearing issues have been eliminated, I would recommend getting an assessment done by a speech pathologist. Right now, for her age, her pronunciation sounds typical from what you describe.", "created_utc": 1483901839, "id": "dc5ygee", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5x17u", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Ah yes, I think I could write a whole webpage just about this controversy. The confusion here often stems from people meaning different things when they say “baby-talk” To be clear, constantly using “baby-talk”, like not using proper words at all, just sounds, calling things the wrong sounds (train=choochoo, bottle=baba, blanket=mumu, etc.) is going to delay proper language development, as you’re essentially teaching your child a nonsense language first. \n\n\nHowever, “baby-talk”, also know as “motherese” or “parentese” is very beneficial and helpful. It’s a manner of talking, including tone (high), intensity (soft, yet excited), and full vocabulary (train=train), that we seem to have naturally developed as a species, as this phenomenon seems to be nearly universal (Now *that’s* a topic for a doctoral thesis!). While speaking parentese, we tend to drag out vowel sounds, which are physically the easiest sounds to make, drawing the baby’s attention to them and kick-starting language development. [There’s an older article by Marcia Barinaga about this, that is still very correct and relevant; check it out!]( http://science.sciencemag.org/content/277/5326/641)\n", "created_utc": 1483901875, "id": "dc5yhg7", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5vhkl", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://science.sciencemag.org/content/277/5326/641"}, {"author": "Antisera", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "created_utc": 1483902190, "id": "dc5yqov", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ygee", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Are you currently in a dominantly-English speaking country? \n\nAt 15 months, I would take a big deep breath and just not worry about this for a while. I was raised German-English bilingual as well, and with a father who speaks German and a mother who speaks English! It would be fun and helpful for you to learn German along with your daughter, but if you want her to learn both languages, both need to be spoken. At all costs, please avoid \"correcting\" the languages. All the brain needs to know is that THING or object over there (like this table for example) can be referrred to using two different groups of sounds (table and Tisch). The brain is perfectly capable of learning this. After all, language is full of synonyms! It's important that the learning process remains fun and interesting. There should be no hint of \"correcting\" English to German or the other way. That will just make her feel like she's doing something wrong, and delay her learning. \n\nIf you both keep steadily interacting with her in both languages in a positive way, with lots of books and games in both languages, she will gain a foundation in both languages. This is exactly the stage you want her in, until about 4 years old, where the brain will natrually begin to categorize and seperate the languages to increasing degrees. \n\n[Here's a pdf from McGill University on raising bilingual children](http://www.psych.mcgill.ca/perpg/fac/genesee/A%20Short%20Guide%20to%20Raising%20Children%20Bilingually.pdf) and a great one from [the Linguistic Society of America](http://www.linguisticsociety.org/sites/default/files/Bilingual_Child.pdf) that may answer some of your questions. \n\nFeel free to PM me if you have anything else specific to ask! German and English are very complementary languages. German is very concise and English is very context-based so they encourage very different kinds of expression. ", "created_utc": 1483902574, "id": "dc5z3cy", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5qtzg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.linguisticsociety.org/sites/default/files/Bilingual_Child.pdf"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi Everyone! I'm live and typing as fast as I can! Just some background info: I currently have a 2 year old and a 5 year old who have been the unwitting recipients of my research for their whole lives, poor things! I'm seeing a lot of requests for general resources and bilingual resources, so I'll address those as I can, but I may just edit the OP and add some links in for the purposes of brevity!\n\nThanks so much for all your interest and great questions!", "created_utc": 1483902737, "id": "dc5z8nv", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dis_ismysn", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much! Spanish will definitely be the less used language as she gets older and interacts with people besides us and family. \n\nA follow up to this that may sound silly: my husband has a very heavy accent when he speaks English. Will this affect her understanding/differentiation of Spanish, English, and English spoken with a heavy Spanish accent? ", "created_utc": 1483902884, "id": "dc5zd8w", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5y8kf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "liseux", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! We have been trying to get my son to do some sign language since he's too young to say much, and you just made me\nRealize we have been doing it wrong. ", "created_utc": 1483903019, "id": "dc5zhhy", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ycx8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "whenwillthewaitend", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you! That's very helpful and informative! I appreciate you taking the time to respond. :)", "created_utc": 1483903308, "id": "dc5zq1v", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5yhg7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jazzmuffin", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm betting it probably would help if his dad and I spoke longer sentences in Spanish to each other. That is something we likely lack on. \nI think we are getting there with two words phrases (though the only ones I can think that he says yet is like \"Papi, go!\" Or \"no, Luna\" to the dog). Thank you! I'll keep an eye out for progression. ", "created_utc": 1483903322, "id": "dc5zqir", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5yb6f", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "liseux", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you have a resource for language milestones?\n\nMy son is 17 months (as of today actually) and he doesn't speak much (he says dog and dada and a few other words occasionally)  He babbles a ton and is very social and perceptive so I hadn't worried until I realized other kids are saying a lot more than him. ", "created_utc": 1483903341, "id": "dc5zr1c", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Caribosa", "author_flair_css_class": null, "author_flair_text": null, "body": "This is all very interesting, thank you for this AMA! \n\nThere are already a bunch of questions about bilingualism but I wanted to ask one as well.\n\nMy daughter is 18 months (on Wednesday) and we are raising her bilingual French/English via the OPOL (one parent one language) system. We live in an area of Canada that is majority English, so common language outside the home and mostly within the home is English with the exception of my husband speaking to her in only French.\n\nDespite all of that, she has been an early talker. She had her first word (a French word - chat) at 10 months, had about 12 words by 1 year old and now at 18 months probably about 60 over both languages (I stopped counting) and has started putting together simple sentences (2 and even the occasional 3 word sentence). She has a handful of signs as well we started at around 6 months she still uses, now in conjunction with the word as well. She will say \"eat\" and also do the eat sign at the same time.\n\n*The con is she has already started to talk back with some sass so don't be too jealous!!*\n\nI guess my question is even tough she is being raised bilingually (although not 50/50 by any stretch, more like 80/20) her language hasn't been delayed at all, quite the opposite. Is this common, or unrelated to the second language? Gut feeling, she is just focusing on social and language as a priority for her. She was a late crawler (9 months) walked late-normal (13 months) and still isn't climbing on furniture or anything at 18 months (still crawls up stairs/doesn't use her feet, goes backwards down the stairs, etc.)\n\nSecondary question, how can I keep encouraging her language development? I talk to her and she loves books, but it seems like the words she is learning are really just words she is most interested in learning. Example as chat as her first word (cat) she loves the kitties!\n\nAlso, I saw your answer to Antiserra about pronunciation and we have the same issue and approach it in a similar way, repeat the word back to her correctly but not indicating it was wrong. Good to know that is the right thing.", "created_utc": 1483903477, "id": "dc5zv8i", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "My go-to recommendation is Steven Pinker's \"How the Mind Works\". The most relevantt information is going to be in the first 1/3 of the book, I suspect. \n\nSolid research into actual brain development is just beginning to take off, now that we finally have the tools and technology to see inside the brain and find out if our 1000s of theories are actually true. I'm actually very frustrated with the lack of accessible books explaining to parents without neuorology degrees, just what's actually happening in the children's brains and what they are ready for. \n\nNow I can give you an unprofessional summary, gathered from 100s of articles of approximately what's up in your children's brains right now:\n\nThey are going off like *fireworks*. Imprortantly, their emotional abilities are growing by leaps and bounds (hello tantrums!), as they learn that they can *want* something, as well as *need* something. So they can learn the difference between need and want, even though that's a tough one. They are very ready to put words to all those facial expressions they see on people's faces. Mirror neurons are strongly actively, causing their brains and bodies to directly reflect their environments, so they are ready to have the seeds of empathy planted. We play a game we call \"statues\" with our children, where we say \"happy face!\" and make an exagerated happy face. (Or sad, angry, surprised, waiting, goofy, etc.) The kids have a great time making silly faces, and learn to pay attention to other people's faces and feelings, as well as their own. \n\nI'm sorry, I wish I had better resources to point you towards. I find it so frustrating that I haven't been able to find a good developmental parenting book that actually goes through the phases of brain development and ties them to what our children are ready to learn. Have my expectations grounded in actual facts would be very relieving! My info on this is mostly cobbled together from years of research and hundreds of sources. I'm seriously contemplating throwing a website together myself at this point. ", "created_utc": 1483903511, "id": "dc5zwc3", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5pnll", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi!\n\nMy son is learning two languages simultaneously (I speak to him in English and my husband speaks to him in French).  My son has a speech delay and we are waiting to see a speech therapist (we've been on a wait-list since June 2016).  \n\nIs there anything that I can do in the meantime to help him speak more?  We constantly repeat ourselves, try to engage him as much as we can, and read lots of books.  He understands us completely but has a major roadblock when it comes to talking, he mostly talks in gibberish still.  It's almost as if he has no interest in talking.  He says a lot of words (not very clearly but we understand) and two phrases (get down and all done).  Do you have any tips for parents of late talkers and when we should be concerned?  \n\nThanks for your time!", "created_utc": 1483903546, "id": "dc5zxl6", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Caribosa", "author_flair_css_class": null, "author_flair_text": null, "body": "Similarly here, my husband speaks to our daughter (18 months) in French. \n\nI would suggest having him still do that, but perhaps change the wording a bit. For example, if she says milk he would say \"oui, c'est du lait en francais\" not correcting, but sort of... supplementing? Saying yes that is the word, but it is also *this* in German. ", "created_utc": 1483903740, "id": "dc603ha", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5qtzg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi! I'm sorry, how old is he, and what is the dominant language in your home and country?", "created_utc": 1483903927, "id": "dc60947", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5zxl6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "From what you say, I suspect that you're doing the right things AND that she has a natural proclivity. My daughter is also very orally advanced, but had some major motor skills delays. So much of her brain was focussed on communicating that she just didn't have any interest in learning how to throw a ball. \n\nYou've hit on a key to learning though! The words she is learning are definitely the words that belong to the stuff she's interested in. This is the most natural and helpful mental state to be in when learning! The key here is, to not only encourage interest in the things she is already indicating that she likes, but to stretch that interest further. Your own excitement and interest are most important here. We are hardwired to notice that if someone else is interested in something and focussing on it, we should get right up in there and learn something too.  By stretching, I mean that from \"chat\" we can talk about fur, what is it, how does it feel, do we have fur? no we have skin! Cats have tails! Do we have tails? What other animals have tails?\n\nDo you see how I kind of built a context net, starting with CAT in the middle? This way, her interest is there naturally from the start, but now stretched to noticing interesting things about the cat, learning about differences, and then on to other animals with tails...and so on and so forth. \n\nDancing and singing are invaluable tools to help reinforce and expand language. Never be afraid to sing to your child, even if you sound like a drunk frog. Your voice is the very first and most primal connection your child has to language, and is the most beautiful sound for them. (Until they are 2.5 and yell at you to be quiet because \"you're breaking my song with your voice!!!\" - that one stung a little, I'll admit)\n\nAre you able to enroll your child in a French Immersion program? They are ubiqutous in our province, and really develop strong bilingualism in the community. ", "created_utc": 1483904552, "id": "dc60s4e", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5zv8i", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lov_liv", "author_flair_css_class": null, "author_flair_text": null, "body": "Check out Bright From the Start, by Dr. Jill Stamm, co-founder of New Directions Institute for Infant Brain Development at Arizona State University.\n\nBright from the Start: The Simple, Science-Backed Way to Nurture Your Child's Developing Mind from Birth to Age 3 https://www.amazon.com/dp/159240362X/ref=cm_sw_r_cp_api_EAPCybQYA6Z71", "created_utc": 1483904813, "id": "dc60zhu", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5pnll", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.amazon.com/dp/159240362X/ref=cm_sw_r_cp_api_EAPCybQYA6Z71"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "[Milestones: Normal Speech and Development Across the Lifespan by Oller et al.](https://books.google.ca/books?hl=en&amp;lr=&amp;id=y9szBwAAQBAJ&amp;oi=fnd&amp;pg=PR5&amp;dq=language+milestones+chart&amp;ots=swZRpDDAUo&amp;sig=swi2bGiOrGgLeq7jJu03XqTqLj0#v=onepage&amp;q=language%20milestones%20chart&amp;f=false) is THE most comprehansive resource you will find. It's hefty, so just use the link I gave here to search the book for specific issues. \n\n[Here is a much easier-to-use resource](http://www.asha.org/public/speech/development/chart/) \n\nKeep in mind that the milestones here are just on *average*, for the language development of monolingual children. And if something you read hear worries you, I always encourage parents to raise their concerns and push for assessment by a speech pathologist SOONER rather than later. The earlier you start therapies, the younger the brain, and the easier it is to relearn or learn new skills. \n\nAnd as always, lots of reading and singing and playing helps! The fact that he's social and communicating is very encouraging. There's a good chance that he understands considerably more than he can say, and may have a large leap forward during the next growth spurt that happens around 18 months. ", "created_utc": 1483905277, "id": "dc61cn7", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5zr1c", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.asha.org/public/speech/development/chart/"}, {"author": "Caribosa", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much this is great info and tips! We are looking at doing some extra-curriculars in French and also French immersion. Even though we are in Alberta, just being in Canada has great opportunities to learn French. As well as FaceTime with Grand-maman!\n\nHer daycare is in English but the ladies have pretty thick accents, although that hasn't seemed to make a difference in her speech at all.", "created_utc": 1483905282, "id": "dc61css", "link_id": "t3_5mr7wr", "parent_id": "t1_dc60s4e", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "futurecompanion11", "author_flair_css_class": null, "author_flair_text": null, "body": "We are in an English speaking country and my husband Is self taught German, but he has learned really well and is always practicing. I'm trying to learn, I'm open to it but I just can't dedicate to it as much as my husband is. We are using movies, books, and trying to get some TV shows in German as well. Thank you! We will try to keep it fun and hopefully it'll all work out. I will have my husband message some questions if he has any. He's very interested in this subject!", "created_utc": 1483905540, "id": "dc61k6h", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5z3cy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Caribosa", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is 18 months and an early talker, her daycare ladies all have thick Punjabi/Urdu/other Indian dialect accents and it hasn't made a difference in her speech at all.\n\nJust anecdotally :)", "created_utc": 1483905551, "id": "dc61kh3", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5zd8w", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NatskuLovester", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't know if I'm too late to this (can't be arsed to figure out time zones) but can you point towards any good resources for raising bilingual children? I have an almost 6 year old who is bilingual but I want to be sure her English (non-dominant language) doesn't suffer as she gets older and spends less time with me.", "created_utc": 1483905606, "id": "dc61m0g", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "My best guess is that while this may make for some funny stories later, it probably wont affect his understanding. My mother speaks with a strong British accent, so at home, we only heard German and British English, causing us all to develop heavy British/German accents. By the end of Kindergarten, we had all reverted to the norm. English is a very versatile language, and is understandable in all sorts of chopped up and convoluted dialects!\n\nLanguages are just our brains' evolved skill to share our thoughts with other people. So while it may be a little more challenging for her to sort out and categorize the different sounds into discrete groups that have information and importance attached to them, communication will win in the end. For our brains, the language is irrelevant, we just want to communicate so much!", "created_utc": 1483905902, "id": "dc61uxn", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5zd8w", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "PorkMeImJewish", "author_flair_css_class": null, "author_flair_text": null, "body": "Hello! Thanks for doing this AMA - I saw brief mention about tongue ties - definitely curious to know how these can impact speech development and how can we tell if they have them?\n\nAlso, our niece and nephews go to Speech at school (this is on both sides of family) - what can we do to prevent our kids from having this happen/emphasize pronunciations with them without making it seem like everything they say is wrong? \n\nOh and for a bilingual/trilingual question - I speak English/Spanish and we want our boys to learn Hebrew - how can we incorporate all of these - Hebrew is the biggest concern!\n\nThanks!", "created_utc": 1483905953, "id": "dc61wel", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "How did I forget about this? Yes! Double recommend it!", "created_utc": 1483906017, "id": "dc61yde", "link_id": "t3_5mr7wr", "parent_id": "t1_dc60zhu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, whatever language they are taught in school will quickly become the dominant one. To maintain multiple languages, focussing on the non-school one at home is essential. ", "created_utc": 1483906437, "id": "dc62amw", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ttp8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "He's 26 months. We're in Canada, so English is the most dominant language here. My husband and I speak English to each other. As I said, I speak English to our son and my husband speaks French to him.\n\nThanks!", "created_utc": 1483906741, "id": "dc62jju", "link_id": "t3_5mr7wr", "parent_id": "t1_dc60947", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "madamquidam", "author_flair_css_class": null, "author_flair_text": null, "body": "This is such great advice, and we received similar instruction from our speech therapist. Totally worked. We made it a more positive environment for my son to try words instead of \"quizzing\" him and we've already seen drastic improvements!", "created_utc": 1483906886, "id": "dc62nsm", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ycx8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "At 20 months, the average child's attention span is about 3 nanoseconds! (NOT a scientific estimate.) So it's very normal for them not to be super interested in books. \n\nMusic, singing, and dance are wonderful language tools. What's most important is that the parents narrate and talk to their children. Incorporate her into as many household chores as you can, and talk about what you are touching, describe your actions (Let's clean the table! The table is messy. Messy table! Yucky! Clean it with a cloth. Wipe, wipe wipe. Now it's clean! Yay! etc.) The more she hears and *experiences* language, the easier it is for her to learn. \n\nThere are also some books that seem to work for kids. Sandra Boynton's books seem to be very attractive and fun for them, as well as books they can touch and do stuff in, like lift the flaps. When you're reading, point to the things in the pictures as you reference them, and take time to look at the pictures and talk about other things too. Make it part of  your routine, without exception. For example, I always read to them while they eat their morning snack, and they always get a bedtime story. She will quickly get used to it and begin to expect it, which is wonderful. Does your local library have any Nursery Rhyme Times or story groups for children your age?", "created_utc": 1483906899, "id": "dc62o83", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5x2fz", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "liseux", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for the thorough response!", "created_utc": 1483906921, "id": "dc62ot8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc61cn7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "geraniumseeds", "author_flair_css_class": null, "author_flair_text": null, "body": "Hello! I have a question about raising a kid tri-lingually. I am mostly fluent in Spanish, and my husband is mostly fluent in Polish (my family is Mexican-American, his is Polish). We have a baby due in May.\n\nWe were thinking about having my husband learn more Spanish so we could speak Spanish to the baby, but I think it would be neat if the kid also knew Polish.\n\nDo you think it's possible for a baby to gain a foundation in three languages without causing speech delays?", "created_utc": 1483907077, "id": "dc62tq6", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "liseux", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you notice a difference between boys and girls' language development? What about children who are more physically active?", "created_utc": 1483907266, "id": "dc62zal", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi! This is really common here in Canada. It's call the One Parent One Language (OPOL) system, maybe u/Caribosa would be willing to chat with you, as she has first-hand experience with this!\n\nThe brain, in its infant state, really doesn't care about languages at ll. It just wants to communicate! So your child's brain will just naturally absorb both languages, and sort out the differences between the two of them later. It will be helpful if they hear you and your husband speak longer sentences in both languages if possible, so they are exposed not just to vocabulary but also sentence structure and grammar evenly. \n\nTV may be helpful after a few years, but it does nothing really for learning language. Children learn best when they are really interacting and experiencing IN that language, not just passively watching. Their brains need to be engaged, not entertained. I suggest finding english-arabic children's books (easy to find online) and arabic games as well. \n\n[This may be a helpful resource for you](http://www.multilingualchildren.org/getting_started/language_system.html)(http://www.multilingualchildren.org/getting_started/language_system.html) moving forward. ", "created_utc": 1483907518, "id": "dc636qf", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5w1a1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.multilingualchildren.org/getting_started/language_system.html"}, {"author": "archaeogeek", "author_flair_css_class": null, "author_flair_text": null, "body": "My 7 year old has recently been diagnosed with dyslexia. He enjoys audiobooks, having books read to him, and reading himself in short concentrated bursts. We are doing our best to get him \"content\" in many ways he can use it- documentaries, dyslexic-special books that help read to him, etc. \n\nIt's clear he sees things differently- but I'm forever wondering what ELSE is affected by his dyslexic brain. I'm reading like crazy to learn more, but would be interested to know if scholars are working on dyslexia. \n\nThanks!", "created_utc": 1483907691, "id": "dc63btd", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "miumiumiau", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi there, thanks for doing this! We're raising our son bilingual in Germany. House language is English, the father speaks English with our son and I speak German to him. Son also speaks German in daycare.\nOur son is now 2 years and 5 months and he is far from able to express himself on the level of his peers in daycare. He somehow developed a secret code by mixing German and English words. He'll say e.g. \"gwink\" for Getränk/drink, \"gellow\" for yellow/gelb and \"gwün\" for green/grün. \nAfter a few days we usually figure out what he means and we'll repeat the correct word in our respective language. Daycare meanwhile is breathing down our neck to send him to speech therapy yet our pediatrician says he'll have time until he is three as many boys are late talkers. \nWhat do you think?", "created_utc": 1483907961, "id": "dc63jky", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! There is quite a bit of evidence that speech delays and disorders can be due to genetics. [Check this article out that researches one family with a genetic link to their speech disorder](http://onlinelibrary.wiley.com/doi/10.1111/j.1469-8749.1990.tb16948.x/full) I'm not sure if there is genetic testing avilable to confirm this is the situation with your family, but it would be very useful for future generations of your family to get this confirmed. Perhaps looking into a referral to a genetist would be worth it for you all. \n\nYour second question is a tough one, because this behaviour is strongly linked to personality. I have two minds about this. My daughter is very verbal, but also highly anxious, so she doesn't like to talk to people she doesn't feel mentally and emotionally connected to and comfortable with. If your son has a speech delay, there could be an added layer of stress to already stressful public interactions for him. I'd ask him first, at a different time, what talking to people he doesn't know feels like for him. You can pretend and play little scenarios, where he asks you questions that strangers have asked him, and you answer, and then switch roles. What's most important is that his stress and anxiety are reduced. Stress and speech are inextricably linked, as when we are stressed, our brain shuts down electrical and chemical activity in the lobes we need for communication, and activates the lower lobes and brain stem, left over from when we were all lizards. So we're good at fighting, fleeing and freezing (maybe what your son is doing), but not good at clearly communicating our thoughts through language. Stress also causes your breathing to rise into the top of your lungs, you breath through your mouth, your muscles in your face, jaw, and throat tighten, so it's not only neurologically difficult to talk, but straight up physically harder. \n\nPerhaps, just protect him right now, if strangers talk to him, and let him know that it's okay for him to not want to talk to them. I just ask my daughter \" Do you want to talk to the nice man, or would you like me to answer for you?\" As his confidence grows, he'll begin to want to say things on his own.  \n\n", "created_utc": 1483908285, "id": "dc63sqb", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5x82p", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://onlinelibrary.wiley.com/doi/10.1111/j.1469-8749.1990.tb16948.x/full"}, {"author": "elleandmia", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for doing this AMA. Good luck with the rest of your study! \n\nI am worried about my 22 month olds speech development. She will babble constantly but only knows about 7 words. And sometimes they are not complete - like waa for water and doe for dog. I dont believe she has trouble with her hearing given how much she undetstands. It is simply amazing! And I have heard that she isnt saying much because she doesnt *need* to say much. When asking for water she will point to her cup and say waa and I will say 'oh, you want your water. It is good to have lots of water on a hot day. Water water water' while pointing but it ends up being fruatrating for both of us because like you said in another comment, she has already communicated and I just want her to say it *dammit*. \n\nIs it time for speech therapy? What else can I do?", "created_utc": 1483908378, "id": "dc63vfp", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Never to late! I'll probably go through this AMA and end up answering everyone in the end. =)\n\nMaintaining an already established language requires that there be continued NEW interesting things to explore in that language. Music and songs are great for this, reading and books are obligatory, incorporating country-of-English traditions into your family life and doing them in English is very helpful (for example, we are primary English in our family now, but we celebrate Dec. 6th as Sankt Nikolaus Tag, and everything about it in German). Games, Music, comedy, humour are all great vehicles for maintaining language. [This book is very informative and easy to read.](https://www.amazon.ca/Maintaining-Your-Second-Language-interpreters/dp/0997305401) I think it's focus may be on translators and interpretors, but the suggestions would work well for you too. \n\nApps and games in English will be VERY useful for you moving forward. Our familiy's favorite apps to reinforce English are the Endless Alphabet and Endless ABCs from Originator. They should be easy to find in the Play Store. \n\nWhat is the dominant language in your current country?", "created_utc": 1483908838, "id": "dc6489v", "link_id": "t3_5mr7wr", "parent_id": "t1_dc61m0g", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.amazon.ca/Maintaining-Your-Second-Language-interpreters/dp/0997305401"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "No problem! You sound like a very engaged and empathetic mother. It's clear that you pay good attention to what the world is like from her perspective, which gives you many clues as to what is best for her. As long as learning is fun, learning is easy! ", "created_utc": 1483908972, "id": "dc64c0u", "link_id": "t3_5mr7wr", "parent_id": "t1_dc61css", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NatskuLovester", "author_flair_css_class": null, "author_flair_text": null, "body": "Dominant language is Finnish so completely different language family than English which I suppose makes it easier in some ways. \n\nThanks, will see if I can get that book. I've learnt Finnish as a second language too (although heard it from infancy) so will help me too.\n\nI try and incorporate English traditions such as Guy Fawkes Day into our life and only read stories in English to her. Am currently trying to teach her to read in English myself with the ordinary parents' guide to teaching reading but she lost interest after the first lesson and I don't want to push it. Mostly we stick to English-language tv too but some she prefers in Finnish (we just have Netflix so with kid's programmes there's the option to switch to the dubbed version)\n\nShall have to look up some apps. The key thing is I don't want American English apps because I want her to learn British English but so many apps are American.", "created_utc": 1483909471, "id": "dc64pu8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6489v", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "From what you write here, I see she comprehends and communicates well, which is the fundamental underlying skill to learning to speak. I honestly don't want to say too much, because I'm not a doctor and cannot diagnose, but at this stage, I'd certainly get her assessed by a speech pathologist. Especially with language and speech, the earlier the child, the younger the brain, and the greater success at therapies. They will also be able to help you as parents to develop some specialized approaches in your home to reinforce the therapies, which really reduces stress and tension about this. \n\nYou are doing a great job, never doubt that. Learning to talk is a process, a spectrum of learning, and your daughter is on that spectrum. She may just need a little more support to move on to the next stage. A detailed assessment by a speech pathologist will help you all to get there. Speech delays that are unrelated to intelligence levels and hearing are not uncommon. It's a tricky thing to learn, and one of the very last abilities we've evolved as humans, so in the grand scheme of things, we've been a species for millions of years, but just started REALLY talking in the last couple 100,000 years. That's just the blink of an eye on the evolutionary scale, so we're not as good at it yet as we are at running or eating. ", "created_utc": 1483909490, "id": "dc64qe6", "link_id": "t3_5mr7wr", "parent_id": "t1_dc63vfp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "babyelephants2", "author_flair_css_class": null, "author_flair_text": null, "body": "Awesome! 3 nanoseconds is spot on...haha. I do LOVE the Boyton's books! I work full time so I don't get to take her to library programs - I really wish I could. But I do really like the reminder to describe all of my actions. My husband and I are both introverted so it takes a lot of effort to make sure we are doing that. Thank you so much for this AMA - I love all of your responses!", "created_utc": 1483909493, "id": "dc64qgq", "link_id": "t3_5mr7wr", "parent_id": "t1_dc62o83", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "saramathison", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you very much for doing this! I asked in another thread about perceived regression. It seems like my 15 month old will learn a word, say it a lot for a week, then will stop. Am I imagining that or have you heard of this before? \n\nalso, thank you so much for the books and other resources you mentioned! ", "created_utc": 1483909605, "id": "dc64tki", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Rare_Aphid", "author_flair_css_class": null, "author_flair_text": null, "body": "I love this thread. For context for my question, I'm 20 weeks pregnant.\n\nI was wondering if you had any insight on parents learning a language with the baby? A lot of your questions are about parents where one is already fluent, but that isn't our case at all.\n\nMy husband and I are both slowly learning Finnish and a little bit of Russian, and we're going to stock up on baby books in Finnish, Russian and English. We live in America, where mostly English is spoken, so I'm not concerned about him learning English.\n\nShould we not bother until one of us is closer to being fluent? Ever since I got pregnant I stopped studying because I'm just too tired, and without me to bounce sentences off of my husband has also slowed down his learning of Finnish.", "created_utc": 1483909950, "id": "dc653b1", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm wondering if you don't have more of a daycare problem than speech problem on your hands. That little code is adorable! It indicates some fascinating neural processes happening in his brain! Linguistically, English is the bastard child of a gang-bang involving German, French, Anglo, Old Norsk, a little bit of proto-Danish, some Latin, Arabic and a smattering of languages from people who were conquered so long ago that we've forgotten where they came from. It's not suprising to see that his brain just mashed the two languages together. For example, Licht, and light are for all intents are purposes, identical words. English just stopped pronounceing \"gh\" like the German \"ch\" and lifted the vowel up a bit. \n\nReading books in the seperate languages will help reinforce the distinctions, but I suspect that your pediatrician is right and he just needs time and exposure to both languages to sort it out. Could your Kinderarzt write the daycare a letter telling them to cool it? If this is still a problem at 3 years, I'd defintely get an assessment, but it's a little early to tell right now. ", "created_utc": 1483909950, "id": "dc653c2", "link_id": "t3_5mr7wr", "parent_id": "t1_dc63jky", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Caribosa", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much!\n\nAnother question just out of curiosity. My daughter often calls a cow \"moo\" or ducks \"quack quack\" instead of their actual names. \n\nI think this is common but what is the reasoning behind it?", "created_utc": 1483910218, "id": "dc65b08", "link_id": "t3_5mr7wr", "parent_id": "t1_dc64c0u", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Steven Pinker's book How the Mind Works has a *super* great chapter on how the brain gets all wired up to talk, and why dyslexia is a thing. It's just fascinating! Reading and writing is a crazy-new evolved skill that is essentially hijacking the parts of our brain we used to use for noticing (or reading) everything in our environment, so it's not surprising that our poor brains get wired differently sometimes. \n\nThere are some studies, but not nearly enough. We've actually just developed the right technolgies to even test these theories in the last 5 years or so, so you'll probably see a lot of new research coming out in the enxt few years. \n\n[This study addresses executive functioning in children with dyslexia](http://www.ingentaconnect.com/content/jws/dys/2005/00000011/00000002/art00003). The research concludes that there are indications that impaired working memory, innappropriate reactions under stress, and impaired problem solving skills may all be additional aspects of the dyslexic brain. So if it seems like your child has a hard time obeying you or carrying out even simple tasks, it may be that his short-term memory just literally isn't kicking in at that point, so he's not doing it to be annoying, but because he can't do anything else. \n\nHere are two more links that may help point you in the right direction: \n\n[Article 1](http://onlinelibrary.wiley.com/doi/10.1002/dys.278/abstract)\n\n[Article 2](https://www.researchgate.net/profile/John_Stein/publication/238767671_Impaired_neuronal_timing_in_developmental_dyslexia_-_The_magnocellular_hypothesis/links/0deec52cc2301b6de4000000.pdf)\n\n\nI've just thought of this, but there may even be subreddits of scholars that work with this, or just other parents with resources too! All the best! Your son is lucky to have such a caring and proactive parent!", "created_utc": 1483910639, "id": "dc65mun", "link_id": "t3_5mr7wr", "parent_id": "t1_dc63btd", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.researchgate.net/profile/John_Stein/publication/238767671_Impaired_neuronal_timing_in_developmental_dyslexia_-_The_magnocellular_hypothesis/links/0deec52cc2301b6de4000000.pdf"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes and maybe. \n\nThere is a giant bulldozer-load of research indicating that male and female brains learn language differently. With both sexes, there is a wide range of normal and a huge overlap. So in practice, what this means, is just be a little more patient and interactive with boys. \n\nPhysical activity in and of itself is no indicator of language learning one way or the other. But little brains often focus on one kind of activity for a while, and get pretty good at it, before trying out something new. So anecdotally, my daughter was a frighteningy early talker, but quite delayed with motor skills. So she belongs someone on the far ends of the spectrums of learning for both those things. My son, raised the same way, is a little advanced for gross motor skills, very advanced for fine motor skills, and also an early talker, although not to the extent of his sister. So their brains are just focussing on different things at different times.\n\nThat said, physical activity is an incredible learning tool. Neurally bonding an *action* or *experience* to the sound of a *word* is a very strong form of learning. Fun movement (as opposed to stressed movement) can really support and reinforce language skills. ", "created_utc": 1483911103, "id": "dc66025", "link_id": "t3_5mr7wr", "parent_id": "t1_dc62zal", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! This isn't a very scientific link, but check out these [multilingual countries](http://www.mnn.com/lifestyle/arts-culture/stories/9-of-the-worlds-most-multilingual-countries) . It is the norm in most parts of the world to learn two or more languages. In fact, America, with over 70% of it's population only speaking one language is pretty much the exception in the whole world. \n\nExposure to all languages through singing, nursery ryhmes, games, dancing, reading, telling stories, etc. will help reinforce all 3 languages and keep them current. [This is a cute website with great resources for parents of multilingual children](http://bilingualmonkeys.com/maintaining-your-second-language/)", "created_utc": 1483911394, "id": "dc668il", "link_id": "t3_5mr7wr", "parent_id": "t1_dc62tq6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://bilingualmonkeys.com/maintaining-your-second-language/"}, {"author": "elleandmia", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for the reassurance", "created_utc": 1483911422, "id": "dc669e8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc64qe6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Tongue Ties physically impact speech development by anchoring the tongue lower and tighter in the mouth. In the brain, the muscle movements in the mouth/tongue/cheeks/throat, etc. are neurally tied to the sounds of the words being produced. If your child sticks out their tongue and it has a little heart shape at the end instead of rounded end, then your child may have a tongue tie. It's best to get it checked by a pediatrician if you suspect one. \n\nYour second question is really important. How we speak is so personal and emotional, and I agree, it's essential to develop a teaching/encouraging method that does not make the child feel singled out or like they are doing something wrong. THe most important factor here is going to be you. You must be unfailingly patient and kind, no matter how many times you have to repeat something. Do you know any of those songs, [like this one by Raffi](https://www.youtube.com/watch?v=oacQL7UQtlk) that plays with the various sounds of words? These kinds of songs are just amazing practice, and most importantly, fun! \n\nIf there is a genetic component to the speech issue, then there is nothing you can do to prevent it, but a lot you can do to help your child navigate the world with this little extra challenge. I'd recommend talking to your siblings and seeing what their speech pathologists are doing for their kids. There may be a specific group of pronounciation issues that is predominant in your family, which my general advice wouldn't address. \n\nFor the trilingualism thing, check out [this website!] The author originally wrote the book for translators, but so many parents needed it for their bilingual homes that they developed the website too. ", "created_utc": 1483912143, "id": "dc66tzw", "link_id": "t3_5mr7wr", "parent_id": "t1_dc61wel", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.youtube.com/watch?v=oacQL7UQtlk"}, {"author": "Sillybuny", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi, my partner and I intend to raise our kids bilingually (French and English) and will not be using the OPOL system.\n\nI will likely be speaking to or in front of the children in both French and English (at different times). I'm fluent in English but my skills and accent are not as good as those of a native; could this be detrimental, knowing our kids will otherwise have access to English natives and native material? \n\nWe intend to teach the kids baby sign language when they are infant to facilitate communication before they are verbal. How will this be affected by raising them bilingually? Would we teach one sign that corresponds to 2 words?", "created_utc": 1483912218, "id": "dc66w6w", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "miumiumiau", "author_flair_css_class": null, "author_flair_text": null, "body": "\nThanks for your insightful response! He indeed pronounces Licht/light mixed as well. He'll pronounce the first two letters in German and the remainder in English, so it sounds like \"Leeht\".\n\nPhew, you are spot on with the daycare. They don't understand English so they don't notice that he is trying to communicate in English with them. For them he is still babbling incoherently. \n\nWe're alternating bedtime routine daily, so one day books and songs in English, the next day in German. Yet, he won't repeat words when we read to him or do puzzles or play with his animal toys with him. \n\nWe noticed however on a long train trip, that he will repeat words after the hosts of those unboxing / surprise eggs videos on youtube (I know, they are so annoying!). We now let him watch approx. 15 minutes daily while we prepare dinner and surprisingly his command of colors in English has become much better than in German. Since nowadays everyone is cautioning against letting toddlers watch youtube and we are afraid that one day, there might be a video in the cue he shouldn't be watching, we are looking for something to replace it with. \n \nHave you come across any apps that would be beneficial to toddler speech development? \n\n", "created_utc": 1483912489, "id": "dc6742l", "link_id": "t3_5mr7wr", "parent_id": "t1_dc653c2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Did you know that in other languages, like Japanese, those ARE the real words for the animals? English is special and a little silly when it comes to animal and food vocabulary. If English was normal, a pig WOULD be an oink-oink. But, the Normans invaded, and the food they ate, (the rich people food, especially meat/animals) developed Norman names. So we raise pigs, but we eat pork. We raise cows, but eat beef. So basically, our words got all mixed up and complicated because people kept conquering England for about 1500 years and screwed up the natural language evolution. ", "created_utc": 1483912498, "id": "dc674b8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc65b08", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh wow, respect! Finnish is VERY difficult, because it's actually a linguistic unicorn and unrelated, even to the Skandinavian languages around it. I know many languages, but Finnish scares the pants off me. \n\nFOr teaching reading in English, just do it like you would in Finnish. Start by showing her the letters and the sounds they make (The names of the letters or ABCs are irrelevant, dont' worry about them until later.) Then find easy to read books with words that repeat, and focus on finding the letters in the page. For example, just look for \"s\" and make all the SSSSS sounds on the page. Then find things in the pictures that have the SSS sound in them. Then slowly expand to incorporate more letter/sounds every time you read the story. Don't make it a lesson, just a cozy reading time together. \n\nThe American vs English english is tough. We speak Canadian, which is distinct from both! In the end, I'd go with whatever version is taught in her school. ", "created_utc": 1483912948, "id": "dc67huw", "link_id": "t3_5mr7wr", "parent_id": "t1_dc64pu8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I had the same problem - I'm totally fine being surrounded by books and not talking for days! It took me a couple weeks, but in the end, your brain just gets used to it. Next thing you know, you're out shopping *without* your children, and you STILL find yourself babbling about random stuff in public. ", "created_utc": 1483913032, "id": "dc67k9g", "link_id": "t3_5mr7wr", "parent_id": "t1_dc64qgq", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I've heard of this, and seen it in both my children. Is the word gone *forever*, or do you just not hear it as frequently? In other words, is his learning stalled completely?\n\nI would say that if in general, his speech development is moving in the right direction, his vocabulary is increasing, he eventually moves from 1 word to combining 2-3 words together (around 1.5-2 years), and that he continues to actively communicate with you, there's nothing to worry about. \n\nWe're not legally allowed to stuff toddlers into fMRI machines, so it's hard to get proof, but I suspect that during the initial learning stages, the brain just gets excited about it's new words, and plays with it a lot until it gets another new shiny word, and focuses on that instead. ", "created_utc": 1483913311, "id": "dc67sfc", "link_id": "t3_5mr7wr", "parent_id": "t1_dc64tki", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is learning German with our children! I think it's just a great way to learn a language, and it's fun for the children too. In the future, you can do things like learn 3 breakfast foods, and then make a game where during breakfast, you can only use those words for the food. \n\nIf you're tired (and at 20 weeks *I hear you!*), just scale down to a more passive learning. Watch Finnish and Russian TV, with subtitles in *those* languages so you see and hear the words. Listen to music , read poetry, look at their art and culture. Make some finnish and Russian foods. Every neural link you make in your brain that connects you to the new language and embeds it more firmly is a step in the right direction. There's no stress or timeline. We learn language throughout our whole lives!", "created_utc": 1483913554, "id": "dc67zsp", "link_id": "t3_5mr7wr", "parent_id": "t1_dc653b1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NatskuLovester", "author_flair_css_class": null, "author_flair_text": null, "body": "British English is taught in school but kids usually learn American English from telly which annoys me. I'm hoping she'll qualify for mother tongue lessons in English though as a 2nd generation immigrant.\n\nFinnish is bloody difficult but luckily I heard it all my life even though I didn't speak it so it came easily to me (and my pronunciation is pretty good). Ok will try that with reading, she really wants to know how to read but doesn't like the effort of learning.", "created_utc": 1483913825, "id": "dc687u3", "link_id": "t3_5mr7wr", "parent_id": "t1_dc67huw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CupofTia", "author_flair_css_class": "red", "author_flair_text": "#2-Lilly Rose coming 1/17", "body": "Hi! Thanks for this. My son is 16 months and babbles non stop, communicates well (pointing etc), and follows directions. But he doesn't TALK-he really only says about 3-4 words? I don't know. \n\nHe says \"ball\" and \"book\" which are both \"boo\" but he uses them appropriately. He says dada. He may say other things but it's hard to understand or isn't reproducible. He mimicks really well so if I ask him to say \"word\" he will say something really close to \"word\" but only that one time. \n\nI don't know what \"counts\" and what doesn't and I'm starting to worry. We talk to him non stop and expand on words as you've suggested in other comments, we sing constantly, he gets a book every day. Is he just waiting to do it on his own time? I don't want him to fall behind. ", "created_utc": 1483914224, "id": "dc68jsm", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "English is a very flexible language, and your differences in pronounciation are honestly probably not worse than a Newfoundlander talking to someone from southern Manitoba, even with an accent. So I wouldn't worry about it at all. \n\nWhen you are teaching your child sign language, this has nothing to do with verbal languages at all. Imagine \"milk\" in your head. This concept exists without any sounds attached to it. Whenyou are teaching a child sign language, you attach that mental concept of milk to an visual action. So for example, when you child is nursing, put your hand where they can see it, and sign for milk. You can say it in either language; it's not important at this stage. What important is that they feel and taste milk, and see/do the hand motion. Sign \"diaper\" *during\" diaper changes. Sign \"mama\" while holding them and pointing to yourself. Sign \"bedtime\" while you get them ready for bed. \n\nSign language is it's own, seperate form of physical/visual communication that does not need any spoken language at all. ", "created_utc": 1483914252, "id": "dc68kli", "link_id": "t3_5mr7wr", "parent_id": "t1_dc66w6w", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "English is a very flexible language, and your differences in pronounciation are honestly probably not worse than a Newfoundlander talking to someone from southern Manitoba, even with an accent. So I wouldn't worry about it at all. \n\nWhen you are teaching your child sign language, this has nothing to do with verbal languages at all. Imagine \"milk\" in your head. This concept exists without any sounds attached to it. Whenyou are teaching a child sign language, you attach that mental concept of milk to an visual action. So for example, when you child is nursing, put your hand where they can see it, and sign for milk. You can say it in either language; it's not important at this stage. What important is that they feel and taste milk, and see/do the hand motion. Sign \"diaper\" *during\" diaper changes. Sign \"mama\" while holding them and pointing to yourself. Sign \"bedtime\" while you get them ready for bed. \n\nSign language is it's own, seperate form of physical/visual communication that does not need any spoken language at all. ", "created_utc": 1483914252, "id": "dc68klj", "link_id": "t3_5mr7wr", "parent_id": "t1_dc66w6w", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "English is a very flexible language, and your differences in pronounciation are honestly probably not worse than a Newfoundlander talking to someone from southern Manitoba, even with an accent. So I wouldn't worry about it at all. \n\nWhen you are teaching your child sign language, this has nothing to do with verbal languages at all. Imagine \"milk\" in your head. This concept exists without any sounds attached to it. Whenyou are teaching a child sign language, you attach that mental concept of milk to an visual action. So for example, when you child is nursing, put your hand where they can see it, and sign for milk. You can say it in either language; it's not important at this stage. What important is that they feel and taste milk, and see/do the hand motion. Sign \"diaper\" *during\" diaper changes. Sign \"mama\" while holding them and pointing to yourself. Sign \"bedtime\" while you get them ready for bed. \n\nSign language is it's own, seperate form of physical/visual communication that does not need any spoken language at all. ", "created_utc": 1483914252, "id": "dc68klk", "link_id": "t3_5mr7wr", "parent_id": "t1_dc66w6w", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "omg_kittensaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm wondering if my daughter's language use is normal. I think she's okay, but my daycare has approached me because she apparently doesn't speak there very much at all.\n\nShe turned two just a couple of days ago. At home, she talks a fair bit. She can say a couple of three word phases (NAME sit down, NAME socks off), can name a bunch of foods, animals, vehicles, activities, states (scared, itchy), etc. She's really physical at communicating sometimes (e.g. will say \"cuddle\", then cuddle me, then say \"cuddle\", then will run to cuddle her dad, and repeat this maybe ten times in a row, etc).\n\nBut apparently at care (4 days a week), she doesn't talk much at all. They approached us a couple of times with concerns about her \"lack\" of speech. Is there something I can do to encourage her to speak more outside our home? I've also noticed that she doesn't talk a lot if we have guests over. Which to be honest, we don't do very often.\n\nWhat can I do to help her? Is this normal behavior? Thank you very much in advance for any advice you can give! ", "created_utc": 1483914462, "id": "dc68qql", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "No, I'm sorry, I haven't! There doesn't seem to be a lot of overlap between appdevelopers and experts in toddler speech development! =)\n\nMy 2 year old has loved the Endless Alphabet app since he was 1.5 years old. When you touch the letters, they say the sounds the letters make, like \"A\" sounds like ah ah ah, so that should help train his brain to differentiate between the sounds. My 5 year old love the Endless Reader app now too!", "created_utc": 1483914509, "id": "dc68s4i", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6742l", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sillybuny", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks, that makes a lot of sense. ", "created_utc": 1483914529, "id": "dc68srb", "link_id": "t3_5mr7wr", "parent_id": "t1_dc68klj", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Amap0la", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for the response! I had never really thought of it as a need to communicate instead more like actively learning a language since that is my only other dual language experience :P  That is really interesting.  I have also bought some books that are dual so my husband can read them etc.  ", "created_utc": 1483914581, "id": "dc68uct", "link_id": "t3_5mr7wr", "parent_id": "t1_dc636qf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is the same - she wants to skip over the hard learning process and go right to the fun adventures! We use the Endless Alphabet and Endless Reader apps by originator, which are great learning tools and in line with how the brain neurologically learns how to read. \n\nGood luck! My brother's starting a family in Finnland too soon, so I've been preparing a little, to help him out. ", "created_utc": 1483914650, "id": "dc68wde", "link_id": "t3_5mr7wr", "parent_id": "t1_dc687u3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "At 16 months, he sounds like he's on track. It's not uncommon for boys to be a little later. Does he have strong motor skills and is he very active? It could be that his brain is just focussing on that area right now.  If he's 2 years old, has a vocabulary of less than 15 words, and isn't linking 2-3 words together, that's when I would worry. Check out [this link] for guidelines on regular development. If you are worried, it's always better to just go get it checked out and have an assessment done by a speech pathologist. ", "created_utc": 1483914880, "id": "dc693jn", "link_id": "t3_5mr7wr", "parent_id": "t1_dc68jsm", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "From what you describe, your daughter's speech and language development sounds very appropriate for her age. Because her unwillingness to speak is situational (ie. not because she *can't* but because she *won't*), it's probably the environment that is the problem. Has she been going to daycare very long? She may just be overwhelmed by everything that is going on, and not feel as comfortable as she does at home. \n\nStress/anxiety and not talking go hand in hand. I'm sorry I can't find it at the moment, but in another thread, I describe the physical and neurological changes that happen in our bodies when we are stressed that affect our ability to talk. I'm guessing she's feeling overwhelmed, and her brain is so focussed on other things that it's just not prioritizing talking. This is perfectly normal. Is there any way you can help her be more comfortable in various social situations? If you help her with this, I would expect the speech issue to disappear.  ", "created_utc": 1483916259, "id": "dc6aab2", "link_id": "t3_5mr7wr", "parent_id": "t1_dc68qql", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Caribosa", "author_flair_css_class": null, "author_flair_text": null, "body": "Super interesting, thank you!", "created_utc": 1483916456, "id": "dc6agfj", "link_id": "t3_5mr7wr", "parent_id": "t1_dc674b8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry, I have to get to dinner, but your question is important to me, and I intend to answer within the next 24 hours. I just want to check some resources for you guys. ", "created_utc": 1483916488, "id": "dc6ahen", "link_id": "t3_5mr7wr", "parent_id": "t1_dc62jju", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "PorkMeImJewish", "author_flair_css_class": null, "author_flair_text": null, "body": "This is amazing. Thank you so so much!!", "created_utc": 1483916673, "id": "dc6amxs", "link_id": "t3_5mr7wr", "parent_id": "t1_dc66tzw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "saramathison", "author_flair_css_class": null, "author_flair_text": null, "body": "I think I've heard that word once since the week it was the favorite. But, he is still seeming to move forward. Still trying to communicate, but, lots of babbling and things that sound like they could be sentences, haha, but as of right now, few actual words. I am not too worried, yet, I am going to take your advice from your other answers and watch. Thank you so much, this has been an outstanding AMA! ", "created_utc": 1483917373, "id": "dc6b9kf", "link_id": "t3_5mr7wr", "parent_id": "t1_dc67sfc", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gwinevak", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for doing this! I had Six years of speech therapy as a child to correct pronunciation and worry my daughter will have issues too . Anywho! My daughter is 2 months old, so i know we're really early.  I want to introduce signing basic signs to help her communicate (I'll be learning the signs right along with her! ) but no where says what age to begin the introduction.  When would be a good time to introduce baby signing? \n\nAlso, i easily get sick of twinkle twinkle and other nursery rhyme songs. Can i sing any old songs to her? I've been doing a few disney songs and country sons her and there to save my sanity but should i focus more on lullabies?\n\nAlso 2, we often have the tv on while playing with her and feeding her and such. Will hearing people talk in tv help or hinder her in any way? I'm trying really hard to up my talking to her but geez, it's tough to hold a one sided conversation and say anything more than \"hi cutie\" and teasing her about being wiggly. (Along with this, we also watch with subtitles on... will this confuse her as she gets older? )\n\nSorry for so many questions! Ftm and kind of lost. Good luck with your degree! ", "created_utc": 1483921003, "id": "dc6ea47", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks so much! No rush at all.\n\nIt should also be noted that I am a full-time SAHM so he mostly interacts in English but often has an easier time saying French words. Our doctor suggested speech therapy last year because my son wasn't meeting his speech milestones. I asked if my son should be screened for ASD but his doctor said no. I also asked the speech therapist we saw last year (in order to get into a government funded program for speech therapy, the kids need a referral) and she said he doesn't seem to be on the spectrum. He has good social interaction, eye contact, etc.., if that helps. \n\nStill, I have to admit, I am a little stressed out about the whole speech delay.\n", "created_utc": 1483923776, "id": "dc6gmom", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6ahen", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cloneciel", "author_flair_css_class": null, "author_flair_text": null, "body": "Heya! I'm late to the party, sorry :(. You had quite the success here and I can see why, all your answers are so great!\n\nI think I've read every question here, and quite a lot are talking about bilingual households.\n\nMy question is more about a trilingual household! Sorry for the lenght, it's just that I feel a bit of backstory could help you help me :D.\n\nMy boyfriend is French speaking, but fluent in Japanese because his mother is japanese. I'm from France so french is my mothertongue, but I've been learning english since I was 3y.o at school, and lived in the states for a while. We live in Belgium, where it's important to speak French, Dutch, and good to know english. \n\n\nMy boyfriend really wants our son to know Japanese as it's his heritage, his name will be a japanese name, and I'm all for it. I've tried to learn japanese a bit, but besides really really REALLY basic things, I can't really hold a conversation. However, I can say easy things like \"Are you hungry?\" \"Does this taste good?\" and I have a little bit of vocabulary for like animals, fruits, vegetables.\n\nI on the other hand, would really like our boy to know english because of how useful it is in our current world. We watch all our movies in english, I read english books, I also think in english half if not more of the time. I'll switch to english half sentence if the french word doesn't come easily. My boyfriend understands english perfectly and speaks it, but has more of a \"just out of high school\" level with a heavy accent when he speaks it.\n\nBut with this, comes the fact that the primary language in our household is french. We speak to each other in french, our family (besides bf's mom) speaks french, the part of the town we live in is mostly french, and second language is dutch, which my boyfriend babbles a bit but I don't at all.\n\nI'm going to be a stay at home mom for at least 2 1/2y until my boy can go to school here. So I'll be the one mostly speaking to him.\n\n\n\nSo I was wondering, with our situation... Is it possible at all to \"teach\" all three languages to our son? I don't want my boyfriend to feel like his japanese heritage will be put aside just because I don't speak japanese much, and I feel he'd secretly be upset if our boy spoke more english words than japanese for example.\nTo that, we can add the fact that english is taught early in our schools, so I was wondering if we shouldn't just focus already on french and japanese, and help him out in english later when he'll learn it in school.\n\nDo you have any tips for this? some advice on how we could proceed?\n\nThanks so much in advance and sorry for such a lenghty comment :D.", "created_utc": 1483924130, "id": "dc6gwkm", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Alright. Speech is actually a pretty tough thing to do. Not a lot of animals communicate like we do, and *none* of them to the extent, depth, and significance that we do. This is a pretty new thing, evolutionarily, and it's perfectly normal for the brain to mess it up sometimes. \n\nI recommend checkout out the first 1/3 of Steven Pinker's \"How the Mind Works\". In these chapters, he lays out just how complicated it actually is for the brain to translate data received through the senses into a verbal expression. He also explains why sometimes, the wiring is wrong and you end up with speech delays or dyslexia, for example. So I want to reassure you that it's nothing you've done or haven't done, it's just because of our fancy, complicated brains. \n\nWhat I would do is call up the referring doctor, and push for your place on that list. Make the case that his lack of speech isn't just a language issue, it's hurting his ability to learn social skills, interact with people his own age and older, that people treat him differently than he should be treated because of his unintelligble speech, etc. You want to make a strong case that even if he's not an emergency, the effects of his speech delay are having ripple repurcussions across his life, which is now causing OTHER developmental issues. Now, I hope I haven't stressed you out by saying this; I just want to help you make the strongest case for your child and get him bumped up that last. \n\nI'll be honest, it is my unprofessional, non-diagnostic, personal opinion that you're right to be worried. A *little* worried. Keep pushing for the speech therapy, because the earlier you can start remedial therapies, the better. I'd also recommend lots of songs and rhymes that break up sound into discrete parts. Somewhere in this thread I linked Raffi's Apple and Bananas song as a good example of a song that breaks up sounds nicely. Clapping ryhmes are also good. When you repeat yourself, try breaking up the words into syllables, and stress the breaks between sounds sometimes. His brain might just need some help breaking the sounds apart, like when you listen to a language you don't know and it's just a stream of babbling sounds. Once you learn it, it's like it snaps into focus, and your brain starts dividing the stream into chunks of words. Everything you are doing is *great*, and exactly what I'd recommend if you weren't. \n\nHave all physical obstacles, like tongue tie and swollen tonsils and adenoids been ruled out? ", "created_utc": 1483925594, "id": "dc6hyvr", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6gmom", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I see you've read my other multilingual comments, so I want add too much. I just want you to know that it's totally possible; it just depends on how much effort you and yoru husband are willing to put into it. \n\nI think I made this recommendation elsewhere, but one of the easiest ways of keeping a language in your life is by dedicating family time to it. So for example, you may make a tradition of picnicking under the cherry blossoms (harumi) in spring, and only speak Japanese or as much as you can manage while you celebrate. Or perhaps do a bedtime story in a different language every night. \n\nI suspect that if you're feeling overwhelmed , it would be totally okay to not stess about the English, because that will for sure be taken care of in the schools. So maybe keep the English exposure a little more low key, to make it easier on yourselves. But your boyfriend needs to brace himself that it is highly, HIGHLY unlikely that your child will speak more Japanese than English, unless you move there. That's just the reality of the linguistic situation in Europe. \n\nGood luck! ", "created_utc": 1483926233, "id": "dc6ig54", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6gwkm", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pclabhardware", "author_flair_css_class": null, "author_flair_text": null, "body": "Any data on how much a second language might delay these milestones? ", "created_utc": 1483927102, "id": "dc6j2tu", "link_id": "t3_5mr7wr", "parent_id": "t1_dc61cn7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "omg_kittensaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "She has been going to the day care for over a year, and there is a lot of consistency of carers there. The only think I can think of in terms of day care issues is that there are a lot of bilingual staff there (we live in a very multicultural area) whose English isn't the best. (I viewed this as a positive when I signed her up with the day care place, because I thought being exposed to different cultures and languages would be great for her. It's mostly Chinese and Vietnamese languages.)\n\nMy husband and I aren't highly social people, especially me, as I get really anxious in social settings. So I suspect she's getting this from me, unfortunately. I will have to come up with some strategies to help her.\n\nThank you very much for your help! ", "created_utc": 1483927376, "id": "dc6j9t1", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6aab2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, your response does stress me out, but it's not your fault. I know that he has good social skills, he loves playing with us, or with other kids, and he's happy and healthy. I have been trying to tell his doctor that there was a problem since he was a year old. I was told by my doctor that the speech therapy clinic doesn't even look at patient files until the child is over 2 years old! Everyone keeps telling me not to worry, that his speech will come, that 15% of babies are later talkers (mostly boys), and that he's met all of his other milestones on time. I am a mom, worrying is part of the job...\n\nUnfortunately, nothing physical has been ruled out and everything is riding on this speech therapy appointment. I contacted the office two weeks ago to see where we were on the wait-list and I never heard back from them. It's really quiet frustrating! \n\nThank you for your time and input, I really appreciate it! I will check out the book you mentioned and try singing some Raffi (Ugh!) songs to my little one tomorrow!", "created_utc": 1483928398, "id": "dc6jzwg", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6hyvr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "American lists are always for monolingual children. Almost the entire rest of the world is pretty multiplingual, so pediatricians in China, for example, are going to have a different metric. \n\nThe argument is still ongoing about multilingual children, and there are a number of reasons for this. What is \"normal\" language development? For some reaons, social scientists that usually run these studies tie language development to an arbitrary age range. This is silly, because we know that we can learn language at any age, and there are way more factors than age in play. What I look for is the learning process, and indications of where they are on it. So if a 2 year old child is in a multilingual environment, has a combined vocabulary of at least 30-40 words, is putting little 2-3 word phrases together, and generally communicating, they are on lthe learning spectrum, headed in the right direction, even if they mix up the languages and have no grasp of grammar. It can *look* like there are language delays in multilingual children, compared to monolingual, but that's because their brains are literally doing twice the work. In my opinion, those \"delays\" are worth it, because they do even out in the end, and you're left with a multilingual instead of a monolingual child, which is very healthy for the brain. \n\nThis is an interesting question though, and I admit that most of my research is carried out in English and German. It would be just fascinating to see what linguists in India and China, where children commonly grow up with 3+ languages, would make of our charts and how they would compare. Thank you for the great question!", "created_utc": 1483929043, "id": "dc6kgcp", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6j2tu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "*Hugs*, it's honestly going to be okay. Seriously, even if he never says a word in his life, there is going to be some great kind of mind-speech interface by the time he's an adult that will just fix the issue. I'm not joking, there's people working on this right now. \n\nFrom my own experience with healthcare systems in BC and Manitoba, in both of them, you have to be persistent and pursuasive to really advocate for your child. I urge you to call again, express what I said, and call your pediatrician too. Be that squeaky wheel! \n\nI knew from the moment my daughter took her first steps that there was something wrong with her legs. I raised it at every single appointment. I talked about it for 4 years, before I finally pursuaded people that I wasn't just a stupid FTM, I actually knew what I was talking about. Turns out, she has a physical deformity and needed physio ASAP to prevent further damage as she grew. Trust your gut! You know him best and you love him the most (for now). Speech issues are very frustrating because the technology to really provide concrete data as to what is happening inside the brain while developing language skills is very brand new, and a lot of the newest research hasn't filtered down into the education system that trains speech pathologists yet. \n\nHang in there, you're doing the right thing! ", "created_utc": 1483929458, "id": "dc6kqu8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6jzwg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I and my daughter both struggle with anxiety. For the smallest children, I really recommend teaching them diaphramatic breathing, as a really great way for calming the nervous system. Even little yoga games that help them focus and make that mind-body connection are very effective. ", "created_utc": 1483929583, "id": "dc6ku4d", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6j9t1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "You can introduce baby signing right now if you like. She won't be able to make the signs until her motor skills are developed enough (6-8 months), but her brain is more than ready to learn the signs. It's important to understand that baby sign language is not taught *through* a verbal language. You want to link an experience directly with the sign. So sign \"milk\" while she is drinking. Sign \"book\" while you read to her. Sign \"Mama\" while she reaches for you. \n\nThere's no magic to nursery rhymes, any simple song in major chords should work fine. Our 2 and 5 year olds are totally into Backstreet Boys right now!!! For kids songs that aren't too annoying, we go with Raffi, Fred Penner, and Bobs and Lolo. \n\nI'm not a fan of having the TV as background noise. I suspect it makes it harder to concentrate on what is important. Plus (this is a parenting tip), if you save TV for when it's REALLY important, it will be your most effective parenting tool. So if you're sick and need to take it easy, having a kid that will be mesmerized by half an hour of TV while you barf in the bathroom is a godsend. If that kid is bored and tries to climb your back while you're barfing instead, that sucks. TV does not teach language or vocabulary and will not help her speech development in any way. To learn how to talk, she needs a human being, right in front of her, so she can connect what she is experiencing in her body, with the focused sound of your voice, and the visual impression of what your face and lips are doing. \n\n2 months old is a kind of boring stage; they're just sort of pooping potatoes. You're probably doing more than enough with her! In about 8 weeks, she'll probably go through a huge growth spurt, (which you'll notice because she'll sleep like *shiiiiiit* for a while). This developmental phase is the one where you'll see a big jump in ability. She will start babbling sounds, and trying to figure out how to control her body to become mobile. \n\nAre there any infant Song/Movement classes like Kindermusik nearby? Kindermusik is crazy expensive, but often community centres and libraries have baby song times for free. These are great experiences for infants, and will give her a peer group to interact with as she gets older. \n\nOh yes, and the subtitles aren't a problem at all. As my daughter reads more fluently, I put them on on purpose, to get her used to matching the sounds of the words with the shapes at the bottom of the screen. \n\n[This is a great chart](http://www.asha.org/public/speech/development/chart/) that you can check out to see where your baby is at as she grows older. \n\nAll the best! You're doing great!", "created_utc": 1483929783, "id": "dc6kzai", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6ea47", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.asha.org/public/speech/development/chart/"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh so sorry I missed your comment! I'm making a note here so I can find you tomorrow and answer properly. ", "created_utc": 1483929849, "id": "dc6l10n", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5xfbw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you :)", "created_utc": 1483930130, "id": "dc6l7zj", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6l10n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "omg_kittensaurus", "author_flair_css_class": null, "author_flair_text": null, "body": "I will look into this asap. Thank you once again! ", "created_utc": 1483930219, "id": "dc6la3t", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6ku4d", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "garfbaby", "author_flair_css_class": null, "author_flair_text": null, "body": "Are there any myths or misconceptions about language development you wish could be cleared up? Any common parenting practices that should be abandoned?", "created_utc": 1483936006, "id": "dc6p6bg", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pastryface", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so late, sorry about that! I saw you talk about doing this yesterday and just found it! My 7 month old yells. I've started to notice that she does it when she wants our attention or if she wants something. I guess, I don't know if she can purposely be doing that right now but it sure seems like it! It's like a loud grunt yell and she moves her whole body. Is this something to be concerned about, like she's manipulating us and I should put a stop to it instead of giving in and picking up the toy or paying attention to her? Are we not interacting with her enough and she is frustrated with us? Or is this just normal? ", "created_utc": 1483938936, "id": "dc6qykv", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "oldvineyzin", "author_flair_css_class": null, "author_flair_text": null, "body": "What's your dissertation topic?", "created_utc": 1483939756, "id": "dc6rfez", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NatskuLovester", "author_flair_css_class": null, "author_flair_text": null, "body": "Good luck to your brother!", "created_utc": 1483940016, "id": "dc6rkgi", "link_id": "t3_5mr7wr", "parent_id": "t1_dc68wde", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "little_green_lamb", "author_flair_css_class": null, "author_flair_text": null, "body": "Ha!  I was just at the grocery store alone, lamenting to myself that my two-year-old wasn't with me because I wanted to show him the purple cabbage, just like the one from his 10 Hungry Rabbits book.  I can't wait to go shopping with him and show him next time!", "created_utc": 1483942634, "id": "dc6sy1a", "link_id": "t3_5mr7wr", "parent_id": "t1_dc67k9g", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "surrogateuterus", "author_flair_css_class": null, "author_flair_text": null, "body": "LTo branch off of that, what about making them say please? My daughter signs more than she verbalizes right now. 18 months, hearing probs. \n\nShe knows the sign please and giggles when we praise her for using it. But tantrums if she doesnt want to. \n\nMy very verbal son was using please and thank you around this age. But i know you arent supposed to compare. But i do want to instill manners in my daughter. ", "created_utc": 1483948569, "id": "dc6vi9s", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ycx8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Please_send_baguette", "author_flair_css_class": null, "author_flair_text": null, "body": "Another multilingualism question. How many languages is too many? I don't plan on artificially pushing additional languages, but I am French, my husband is Dutch, we speak together in English and we live in Germany. We plan on exclusively speaking our respective native languages to the baby (so, a one parent one language setup) and letting daycare and school take care of the environment's language. Is this enough to get to fluency, including literacy, or do we need a more serious game plan?", "created_utc": 1483951512, "id": "dc6wk3g", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rodwadd", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi, parent of Japanese/English bilingual child here.  What you're saying isn't exactly true for Japanese.  There are a few instances where the sound words can be used for the animals themselves, like dogs, cats, and pigs, those aren't the normal words but rather \"baby-talk.\"  It's pretty much the same way that a train can be called a choo-choo in English but it's not the normal word for it.  ", "created_utc": 1483955140, "id": "dc6xptn", "link_id": "t3_5mr7wr", "parent_id": "t1_dc674b8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for clearing that up! ", "created_utc": 1483966537, "id": "dc71neb", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6xptn", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "UnicornToots", "author_flair_css_class": "purple", "author_flair_text": "Baby Girl - 09.07.15", "body": "Thanks for this! I do have one more unrelated question that I wish I had thought of asking sooner!\n\nWhat are your thoughts on sign language being so widely taught to infants? Do you think it helps or hinders oral language development and/or cognition?\n\nI ask because my daughter will sign for things rather than say them. She signs for \"please\" and \"more\" and has been doing so since around 9 months old. It's been 7  months since then and she still won't even come close to saying them. I've heard around the internet and through friends of mine that there is the feeling that sign language will delay speech. Is there any validity to this?", "created_utc": 1483967789, "id": "dc727xu", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ycx8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rodwadd", "author_flair_css_class": null, "author_flair_text": null, "body": "Not at all, thank you very much for this AMA.  Your insight and resources have been invaluable.  ", "created_utc": 1483968611, "id": "dc72mer", "link_id": "t3_5mr7wr", "parent_id": "t1_dc71neb", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Yours_Dearly", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for this information and the examples!!! I appreciate it very much :)", "created_utc": 1483977646, "id": "dc78jcq", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5zwc3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Qwilla", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for doing this AMA! I've read through a lot of the comments here and learned a lot! \n\nI have a few general questions! I have an 18 month old that seems to be really stubborn about talking. She babbles occasionally but doesn't use the words she knows very frequently. She knows about 15 words. We taught her a few ASL signs when she was younger (milk, all done, more, and eat) which she took to immediately. She follows directions (when she wants to) well and is very socially engaged with her little friends at daycare.\n\nMy questions are:\n\n* in your research/experience, have you noticed a trend of talking late in children who develop gross motor skills early? My daughter walked somewhat early and started climbing our couch when she was about 10 months. I've heard several people mention that physical babies/toddlers tend to focus on talking later and wondered if you had seen the same! \n\n* my husband wants to teach our daughter a lot more ASL signs since she uses the ones she knows so consistently but I'm worried that it will delay her speech even more. Of all the words we try to get her to learn, she refuses to say the words that she knows a sign for. What are your thoughts on this? \n\nThank you again!! ", "created_utc": 1483980825, "id": "dc7b59l", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Majestic_Forest", "author_flair_css_class": null, "author_flair_text": null, "body": "Awesome we've actually been doing these things with him in regards to his emotions and ball was actually his first word after mama dada and he screams it all day while playing with one, we're also signing with him which he seems to pick up quickly, I'm glad we're on the right track and I will definitely pass on flash cards! Thanks so much ", "created_utc": 1484001740, "id": "dc7thlx", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5yezf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "All the best! It sounds like you're doing great!", "created_utc": 1484002996, "id": "dc7uj5s", "link_id": "t3_5mr7wr", "parent_id": "t1_dc7thlx", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi there, u/doyouhavehiminblond! Thanks so much for waiting!\n\nSo, I always recommend getting your child on that wait list, because on the off-chance that they *do* need a proper evaluation and therapy, the success rates are better the younger the brain is. However, one of the most important, determining factors in successful therapies is the role of the parents. The child obviously spends most of their time at home, so the home environment clearly very significant. \n\nRegression is always a not good sign, I'm sorry. If you haven't raised this with their pediatrician, I would do so immediately (or tomorrow morning, if their office is closed already.) Regression can be caused by a number of things, none of which I'm really qualified to talk about. He's still communicating and following directions, which means he's on the path of learning, which is great! Let's try to nurture that as much as possible. \n\nFor now, until you get proper assessments done, there are lots of fun things you guys can do together, apart from reading and narrating around him. \n\nBlowing bubbles, blowing those whirly toys, pushing a toy boat across a bowl of water, are all fun activities which activate the mouth and throat muscles. \n\nSinging and moving to music is *very* helpful. Language has its neural origins in music, and evolutionary linguists highly suspect that music came before language. Music and songs also help break words up into little pieces, and rhythm is an excellent tool to help the brain just get used to the sounds, to breaks in sounds, and to playing with sound. \n\nHelp him watch your mouth by positioning yourself in a way that's easy for him to see, while you are talking. \n\nHow is he with eating? Does he feed himself most of the time? Does he have any texture aversions? Is he social or interactive with other children at all? How is he with stimulation, like lots of things happening visually? Is he often overwhelmed, and if yes, when and how does he react?\n\nBecause regression is a factor here, I'm hesitant to suggest more intense therapeutic activities, because they may accidentally aggravate other neurological issues as well. I'm sorry, but I think your very best course of action is to get him thoroughly evaluated by a team of developmental specialists, ASAP. \n\nYou are ABSOLUTELY doing the right thing here. You've noticed an important issue, you care, and you're doing something about it. You're a caring, loving parent and in the end, those things matter more than anything else. Call his pediatrician, tell them that you've noticed a clear regression in verbal development in the last 2 months, and that this is not getting better. Push for an evaluation. Do NOT let them brush this away with an \"oh he's too young to evaluate\". There is evidence of a clear verbal regression here, which can indicate other serious problems. You need more than a speech therapist. \n\nI'm so sorry. I just want to give you a hug. I wish I could have said much nicer things for you to hear. As a parent, I know you definitely didn't want an answer like this. I took the time to do some research and see if there are comparable cases out there, and my recommendation to get him evaluated for developmental issues is the very best advice I can give. Perhaps you'll go through it all only for him to be perfectly normal, but you're still doing the right thing by getting it checked out. \n\n*Hugs*", "created_utc": 1484012248, "id": "dc81qp2", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5xfbw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Based on what you describe, your daughter sounds right on target for her age. She's communicating, interacting, and social, which are all great. \n\nThere does seem to be a trend between early development of gross motor skills and later language development. There's an important difference between language and communication, so the fact that she's figured out ways of communication that are working for her right now is really good. Theoretically, their brains are just focusing on a different skill set at a different time. \n\nSo, because she's obviously a bright little thing, full of personality, I would recommend *against* teaching her more signs. You want her to focus on communicating verbally, with language, and not physically through signs. If you are signing to her still, I would begin to scale back and substitute *only* verbal communication, one word at a time. \n\nYou say she has about 15 words. At this stage of learning a language, she probably understands a good 80% more than she can say. Does she respond to words she doesn't say herself? Can you see that she understands more than she speaks?\n\nLots of reading, singing, clapping rhymes, rhythm and dance movements to music, and very restricted screen time will all help move her in the right direction. \n\nI'd definitely monitor her, and keep an eye out for any regressions, both in language use, and in overall communication. By age 2, you should be looking for a decent vocabulary of about 40+ words and little 2-3 words phrases. If you don't see development in that direction in the next few months, I recommend calling your pediatrician and getting an evaluation. This could well just be a personality thing, and she's just gaming the system by using ASL because she's a clever little person. When her communication needs grow bigger than her current communication abilities, she may just give up and start using her words. ", "created_utc": 1484013839, "id": "dc831na", "link_id": "t3_5mr7wr", "parent_id": "t1_dc7b59l", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "How many is too many....that's a great question and it's totally dependent on very individual factors. As I've mentioned elsewhere in this thread, it's very common in many countries such as India and China to have 4+ languages by adulthood. That doesn't necessarily mean that they learn them all in infancy though. \n\nIf you speak French, and your husband speaks Dutch to her, but you only use English to communicate between you and your husband, then English will not be important to her, and her brain will prioritize figuring out French and Dutch. Knowing Germany (which I do), I don't recommend just leaving German to chance. The way people interact with her will be profoundly affected by her lack of German literacy and language skills, and this in turn will impact her sense of self and her social skills. In my own experience, simply having a slightly different German accent and having a slightly reduced vocabulary caused many people to treat me like I was mentally disabled, despite being very educated and speaking 5 other languages. I actually had to remind my boss that although I may sound stupid to her in German, I'm actually brilliant in several other languages, including ones she didn't speak. \n\nSo where does that leave you? Yes, your child would be totally capable of picking up all 4 languages. They will not be used equally, nor have the same size vocabulary, and as literacy in certain languages is more difficult than others, there will not be equality there either. Bring German into the home, for sure. Keep English as your \"secret parent language\" until she starts school (trust me, you'll want one by the time she's 18 months), and if you go with the OPOL system for French and Dutch, keep in mind that as your child grows older, you need to be careful to make your language and sentence structure more complicated. The one issue I have with the OPOL system, is that because the verbal interactions are not between adults, the child isn't exposed to sophisticated sentence structure and vocabulary, which artificially restricts their fluency at a more immature level. \n\nKeep in mind that learning languages is a life's work. So no worries if she picks up on Dutch really fast, but French seems to lag. Maybe in 15 years she'll do a semester in France, or go to university in an English speaking country, and better her language skills that way. What's important is that with early exposure to the various sounds and grammatical structures, her overall language skills are going to be facilitated in a way that just wouldn't happen if you were not giving her such a rich lingual environment. ", "created_utc": 1484014748, "id": "dc83sok", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6wk3g", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "I research how text (the written word) induces certain mental states in readers, so my specific research reverse-engineers the neural processes of the reading brain to create a text that in theory should stimulate an empathetic mental state in readers. There are very few people in the world who are combining Neuroscience and Literary Theory, which to me sounds crazy, because how can you claim to understand literature if you don't know how the brain works? Reading happens 100% inside your head! This field is gathering interest though, and it's very exciting to contemplate how this field will move forward, given the recent advances in imaging technologies which will enable empirical proof or disproof of many literary theories. ", "created_utc": 1484015038, "id": "dc841gn", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6rfez", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! She's communicating! Yelling, grunting, and making large body movements to communicate is bang-on-target for her age. It's a perfectly normal stage of development. She's testing to see if she talks to you, are you going to listen? Do you even care if she's making sounds? How do you react when she makes different kinds of sounds? All babies are natural born scientists. \n\nShe is not manipulating you in a nefarious way. In fact, she's neurologically incapable of being bad right now. You are already doing the very best thing you can do: listening to her, responding to her, and showing her that verbal communication is a great way for her to get what she wants and needs. In doing so, you reassure her that this is a good skill to have, and that she should keep working on it. You should be hearing a lot of phoneme strings, like maba, gaga,daga, etc. She's just wiring up her brain to connect the thousands of muscles, nerves, tissues, tendons, etc. involved in speaking, to the production of the actual sounds. \n\nShe's perfectly normal. Keep responding to her, keep listening to her. You're on the right track!", "created_utc": 1484015395, "id": "dc84c83", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6qykv", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "There is an important difference between communication and language. \n\nLearning occurs as a spectrum of processes. It's not linear or clean.\n\n\"Normal\" is a HUGE range.  General comparisons to other children are fine; freaking out because her cousin had 10 more words at 13 months is a waste of emotional energy. \n\nTeach sign language by binding the hand motion to an experience, *not* to words. Remember that they can't speak yet!\n\nAnd I actually have like 100 more of these. I should write a blog. ", "created_utc": 1484015624, "id": "dc84it8", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6p6bg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your response!\n\nHe actually has his 18 month check up next week so I was planning on talking about his speech then. My doctor was concerned at his limited speech before so I think he will be helpful in referring my son. The regression does worry be however he rarely used words to begin with.\n\nThose are activities I think he would enjoy thank you! He's a very active kid which is why I think he won't sit still for a book. He also really enjoys music.\n\nHe had trouble eating up until he got molars but now he's a very good eater. He isn't in daycare and usually won't interact with other children. He likes observing older children but is often shy around new people. He likes tv shows with lots of visual stimulation and music. I wouldn't say he gets overwhelmed much. He only cries if he doesn't get what he wants. But in new social situations he clings to us at first. If people get down on the floor with him he opens up and plays well with them.\n \nI will definately be his advocate but due to the health system here (Ontario, Canada) he likely won't see anyone until 24 months. Thanks again for taking the time to reply. Its been upsetting me a lot lately.", "created_utc": 1484016254, "id": "dc851tu", "link_id": "t3_5mr7wr", "parent_id": "t1_dc81qp2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "oldvineyzin", "author_flair_css_class": null, "author_flair_text": null, "body": "So interesting!! How are you researching that, do you do experiments?", "created_utc": 1484018282, "id": "dc86o37", "link_id": "t3_5mr7wr", "parent_id": "t1_dc841gn", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your words of encouragement! \n\nI'm in Ontario, I guess things aren't better with health care here. Honestly, I can't get anyone from the hospital where the speech therapy clinic is held to contact me. I have left messages and emails and they're ignored. I understand that the wait period is long because there are a lot of children with speech therapy needs, I just want an ETA.\n\nI keep bringing up the fact that my son says words, though not very clearly, and says two phrases, and people tell me I am expecting too much from him. He only just turned two, I am overreacting, all kids learn at different paces, etc., etc.. I understand all of that, I just want to help him and ensure that if he does have a problem, that it is addressed in a timely manner!", "created_utc": 1484018859, "id": "dc87456", "link_id": "t3_5mr7wr", "parent_id": "t1_dc6kqu8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pastryface", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh neat! Thank you so much for all your effort on this AMA! ", "created_utc": 1484021014, "id": "dc88ra1", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "garfbaby", "author_flair_css_class": null, "author_flair_text": null, "body": "You should. I'd read it!", "created_utc": 1484030119, "id": "dc8enxb", "link_id": "t3_5mr7wr", "parent_id": "t1_dc84it8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Is she doing this because she's still learning, or that she just doesn't want to?\n\nNot an expert, but some of it might just be toddler boundary pushing and asserting her autonomy. You are pushing her to say the word, so her natural instinct is to say \"No! When I'm ready!\"\n\nI think coaxing kids to do things can backfire a little, better to let them do it in their own time.\n\nhttp://www.janetlansbury.com/2011/07/what-to-do-when-toddlers-say-no/", "created_utc": 1484042421, "id": "dc8j6nu", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5ryk5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.janetlansbury.com/2011/07/what-to-do-when-toddlers-say-no/"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "If you're comfortable sharing, where are you located? I'm in downtown Toronto and about to get a referral for speech therapy for my son. These delays sound awful :(", "created_utc": 1484084312, "id": "dc9c2sn", "link_id": "t3_5mr7wr", "parent_id": "t1_dc87456", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in Ottawa.  We were referred to the \"First Words\" program at the Children's Hospital of Eastern Ontario in June 2016.  My doctor told me that we should expect a long wait due to high demand, so we're not alone, a lot of children have speech delays it seems.  My son is our first and only child, so it's all new to me...", "created_utc": 1484088145, "id": "dc9f5u6", "link_id": "t3_5mr7wr", "parent_id": "t1_dc9c2sn", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so sorry you're having to wait so long. Could you ask to be referred somewhere else as well? Its frustrating that we're left pretty much helpless. I can't even read to my son.", "created_utc": 1484092432, "id": "dc9i7je", "link_id": "t3_5mr7wr", "parent_id": "t1_dc9f5u6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Qwilla", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for your response! The early gross motor/later language development thing is really interesting to me! We will definitely scale back on our sign usage and try to encourage her to learn the words instead. Right now we don't sign to her because she uses the signs she knows unprompted 100% of the time. Any advice on how to encourage her to learn the word instead of signing it? She gets *so angry* if I don't give her milk when she signs for it lol! \n\nShe definitely understands a lot more than she can say, which is why I'm thinking she's just really stubborn! She follows a lot of directions that I would have never thought she'd understand due to her pretty limited vocabulary. She'll run into the bathroom if I tell her it's time to brush her teeth, will climb up on her stool and turn the light off/on if I ask, and run to the fridge if I mention that it's snack time. \n\nThank you for all your suggestions and your time! You've been so helpful! ", "created_utc": 1484104333, "id": "dc9rpfi", "link_id": "t3_5mr7wr", "parent_id": "t1_dc831na", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "twistyabbazabba", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you for asking this!! I have the same thing going on! ", "created_utc": 1484114186, "id": "dc9yn6k", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5x17u", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "She's communicating really effectively with you, so I would just keep teaching her new words, and eventually, she'll substitute the word for her sign on her own. I'm guessing that will happen the first time she wants something but you aren't around to see her sign. She'll figure out that she needs to use her voice and yell for what she wants instead. ", "created_utc": 1484138550, "id": "dca84s1", "link_id": "t3_5mr7wr", "parent_id": "t1_dc9rpfi", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, no!  Why can't you read to him?  Does he not like being read to?\n\nI know it is frustrating and that parents are left to feel pretty much alone and stressed out because of this.  There is help for them, even if it takes a long time to get the help they need.  One thing that helps me is knowing that a lot of boys are late talkers.  My son's doctor even said that my son may even be too \"lazy\" to talk because we do all of his talking for him (if that makes sense).  He also said that it could be that my son is more reserved and shy and doesn't want to talk until he feels comfortable with his speech.  The thing is, he does say words and phrases, even if they aren't super clear, he does know words and we understand him.  Maybe I am expecting too much from him, he is only a little over two years old...", "created_utc": 1484143008, "id": "dcaaijj", "link_id": "t3_5mr7wr", "parent_id": "t1_dc9i7je", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "He throws a tantrum because he wants to rip up the books and generally doesn't pay attention. I keep hearing early intervention is key so I panic knowing I can't give that to him. Private is beyond our budget too sadly. I'm hoping your son starts picking up his speech soon! I agree my son isn't even trying to speak since he doesn't need to. I think not going to daycare has an impact too.", "created_utc": 1484147773, "id": "dcadtua", "link_id": "t3_5mr7wr", "parent_id": "t1_dcaaijj", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "adv3rsely", "author_flair_css_class": null, "author_flair_text": null, "body": "My son loves story time, it is part of our daily routine and bedtime routine. He has tried ripping books before, if we're not careful, he takes them off the shelves and tries to crumple the pages and stuff. Board books are best but he has even managed to rip some of the smaller ones apart by the binding. lol \n\nMy son stays at home with me, i quit my job because daycare in Ottawa was too expensive and it would've been counterproductive for me to keep my job and pay someone else to watch him. Honestly, if I had kept my job, most, if not all, of my paycheque would have gone to daycare fees. I was working as a medical secretary, part-time. I am sure he would have had an easier time using words if he were at a daycare. I do take him to \"drop-in\" playgroups so that he can interact with other children. He loves it! Have you tried that with your little one? The one we go to is completely free and is at a school in our neighbourhood. ", "created_utc": 1484153483, "id": "dcaipuy", "link_id": "t3_5mr7wr", "parent_id": "t1_dcadtua", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "Awww you're lucky!  My son rips up board books too.  I am still trying though!\n\nDaycare is insane in Toronto too so my husband is a SAHD with my son.  He does take him to Early Years occasionally but my son tends to just run off on his own.  I'm hoping as he gets older he will try more to interact with other children.", "created_utc": 1484154331, "id": "dcajhfl", "link_id": "t3_5mr7wr", "parent_id": "t1_dcaipuy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "foxypasty", "author_flair_css_class": null, "author_flair_text": null, "body": "Just throwing in my two cents, I was just redirected from [this thread](https://www.reddit.com/r/Parenting/comments/5n6hwi/parents_of_bilingual_children_hows_that_going_for/) which you may be very interested to read.  My husband is Russian, I am American, and our 26 month old daughter has been learning both languages since birth.  He speaks to her primarily in Russian and I speak to her entirely in English.  In family, we typically speak English with some Russian bits thrown in.  \n\nLike you, I was concerned that this may be confusing for her or delay language acquisition, but it has really be the exact opposite.  She knows each language equally well, knows which family members to speak which to, and can speak in complete (mostly) correct sentences in both languages.  Now my biggest worry is that my husband and child have a secret language to communicate in at that can’t be good ;) Just motivation for me to learn faster.\n", "created_utc": 1484172433, "id": "dcb035i", "link_id": "t3_5mr7wr", "parent_id": "t1_dc5qtzg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.reddit.com/r/Parenting/comments/5n6hwi/parents_of_bilingual_children_hows_that_going_for/"}, {"author": "skryring", "author_flair_css_class": null, "author_flair_text": null, "body": "My 17 month old is in speech therapy for speech delays and it's been determined she still has her tongue thrust as evident by her tongue often sticking out, mouth breathing and pushing her tongue forward when eating (she doesn't have any problems with eating though). \n\nDo you have any tips on how we can work with her tongue thrust? It does cause an issue for the few words she says as she has her tongue out when she talks.", "created_utc": 1484275170, "id": "dccyku9", "link_id": "t3_5mr7wr", "parent_id": "t3_5mr7wr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ZenMommy", "author_flair_css_class": null, "author_flair_text": null, "body": "This is outside of my knowledge areas, I'm sorry. I would so love to help! \n\nSomething did come to my attention in your description. Mouth breathing actually causes a different kind of electrical activity in the brain than breathing through the nose. It heightens the areas of the brain that respond to stress and distress, and signals stress hormones to be released in the body. A major component of successful speech and language learning is calmness, as a tight and taut throat, face, mouth, neck and shoulders make it physically difficult to speak. This can lead to a kind of negative feedback loop, where you are stressed so you can't speak, so you stress out more, and can't speak more, etc. \n\nI recommend trying to get her to mimic you doing nice big diaphragmatic breathing and some really easy yoga poses. My toddler has a blast doing these with me! By helping her breathe through her nose, deep into the lungs, and relaxing on the exhale, speech will be physically and neurologically easier for her. \n\nAll the best!", "created_utc": 1484277833, "id": "dcd0kmt", "link_id": "t3_5mr7wr", "parent_id": "t1_dccyku9", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "soapysong", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi! Checking in from Toronto. Have you been to your local OEYC to see if you enrol and participate in workshops? Often they are led by specialist from other organization that can help. I went to a workshop called \"Baby Talk\" at Adventure Place and the lady who led the workshop was quite helpful in sitting down with each parent and addressing their concerns. ", "created_utc": 1484311361, "id": "dcdghut", "link_id": "t3_5mr7wr", "parent_id": "t1_dc851tu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "I didn't even know they offered classes! Thank you so much. What was the age of babies in that class?", "created_utc": 1484313839, "id": "dcdhq2i", "link_id": "t3_5mr7wr", "parent_id": "t1_dcdghut", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "soapysong", "author_flair_css_class": null, "author_flair_text": null, "body": "It was from 6 months to 2 years I believe. Personally I found that there are a lot of satellite locations that aren't well advertised. If I go on the Ontario gov website I only see \"Don Valley\" listed but in reality there are many satellite locations available such as Willowdale OEYC, Earl Bales etc. I was registered in a program almost every month but I find that the staff are always engaged, have insightful tips and resources and can connect you with other organization that can help. The last program I attended was led by a woman who is currently completing her masters in ECE. I can't remember the name of the organization that led the Baby Talk workshop but I am sure you might be able to find the information at one of the centres!", "created_utc": 1484318351, "id": "dcdkj1x", "link_id": "t3_5mr7wr", "parent_id": "t1_dcdhq2i", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doyouhavehiminblonde", "author_flair_css_class": null, "author_flair_text": null, "body": "Thanks for sharing! It looks like Mothercraft runs some classes near us. This is very helpful. I've been dreading the long wait list for OHIP speech therapy.", "created_utc": 1484318714, "id": "dcdksi4", "link_id": "t3_5mr7wr", "parent_id": "t1_dcdkj1x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}