{"submission": {"author": "stella27113", "author_created_utc": 1438240430, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_p6kf7", "brand_safe": false, "contest_mode": false, "created_utc": 1485526440, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/5qhb1s/toddler_big_belly_and_nonstop_crying/", "gilded": 0, "id": "5qhb1s", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 65, "over_18": false, "permalink": "/r/Mommit/comments/5qhb1s/toddler_big_belly_and_nonstop_crying/", "retrieved_on": 1489480099, "score": 30, "secure_media_embed": {}, "selftext": "I am a first time mom of a girl, born July 21,2014 for reference, so 2.5 yrs old.\n\n\nLately, she has been:\n\n- eating non stop (previously only drank milk by choice, doesn't want to eat etc)\n\n- looks the same but has gotten a big belly ( I'm not worried about her vanity just concerned about this )\n\n\n- she's normal at an average weight and height but I'm concerned about her constant need for milk ( 6-7 180 ml bottles a day mixed with formula) + tiny amounts of frequent food, still a picky eater and requests popcorn 3 times a day, I give her a cup each time\n\n- she has also been crying a lot at every opportunity, I'm a single mom and my mom and I live together to raise her etc, none of us are spoiling her but although I have tried to ignore the crying that's not related to anything serious (she cries when she doesn't want to change her diaper etc), the frequency is making me wonder if this is normal?\n\nI was an only child with zero experience with children and would love other moms advice", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "self", "title": "Toddler big belly and nonstop crying", "url": "https://www.reddit.com/r/Mommit/comments/5qhb1s/toddler_big_belly_and_nonstop_crying/"}, "comments": [{"author": "Babywhale", "author_flair_css_class": null, "author_flair_text": null, "body": "Is she pooping regularly? Could be constipated. Cut down on the popcorn. Cut out the formula all together. Offer her healthy snack foods on a regular basis. Raisins, nuts, cut up cheese and meat cubes, veggies.\n\nHow is your and your families diet? Would help if you guys ate healthy too.\n\nTake her to a doctor.", "created_utc": 1485526794, "id": "dcz6uve", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "We eat very very well, veggies and proteins, nothing out of a box etc.\n\nShe hates regular milk, tried to swap she won't drink it.\n\nPoops regularly.\n\nPopcorn I make her is airpopped no salt FYI\n\nThank you for replying ", "created_utc": 1485527945, "id": "dcz7nz5", "link_id": "t3_5qhb1s", "parent_id": "t1_dcz6uve", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MushyFry", "author_flair_css_class": null, "author_flair_text": null, "body": "even pooping regularly, she may still be constipated. the issue with the popcorn isn't the salt, but rather the high fiber content. if she's not drinking water to help pass it through it can cause digestive upset and constipation. \n\nymmv, but neither of my kids do any kind of alternative milk past breastfeeding/formula. my son will occadionally have coconut or almond milk, but we get calcium from other sources (cheese, broccoli,  yogurt). I'd talk with her pediatrician, but if it were me, id definitely totally cut out formula as suggested above. ", "created_utc": 1485529250, "id": "dcz8n2o", "link_id": "t3_5qhb1s", "parent_id": "t1_dcz7nz5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "warylynx", "author_flair_css_class": null, "author_flair_text": null, "body": "If you are concerned, def go talk to your pediatrician. It never hurts to get a professional option.\n\nMy daughter is 3 and she often gets a belly when she eats a ton. I don't know how she packs in all the food she does, but she gets a significant \"food baby\" when she eats a big meal.\n\nCould the crying and pickiness be related to teething? My daughter's molars started coming in around then and she was a bear to deal with. Smoothies, popsicles and soft foods (bananas) were key on bad days where her teeth really hurt.\n\nIt could also be a growth spurt. The excessive eating coupled with grumpiness (growing pains) sound like a typical growth spurt to me as well. ", "created_utc": 1485529289, "id": "dcz8o64", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siriuslyserious", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is a couple months older than yours. I'm guessing she's constipated, cut out that formula altogether, she's way too old for that now, and you say bottles, try and switch her to a straw sippy cup. \n\nMilk is constipating and she's probably filling up on that. I know it sucks, but give her water instead of milk, only allow milk with meals. If she's thirsty, she should drink it. Try giving her popsicles to get her some non-constipating fluids, you could even try juice, but personally I haven't had luck with that, daughter won't drink it. \n\nYou may want to take her in to the doc, popcorn can cause bowel obstruction, and sounds like she's eating a lot of it.", "created_utc": 1485530130, "id": "dcz9c19", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "I am very glad I posted this, getting excellent info. SHe was breastfed until she was one and then we switched to formula. She drinks 3 bottles in her sleep and as I said earlier 5 during the day. Wish I can skim this completely. I have spoken to her pediatrician but I live in a 3rd world country and access to reliable advice from drs is not available.", "created_utc": 1485531949, "id": "dczau6o", "link_id": "t3_5qhb1s", "parent_id": "t1_dcz8n2o", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; I live in a 3rd world country and access to reliable advice from drs is not available\n\nI did think of growth spurts, didnt realise there would be more teething, she has a full set from what I can see :)\n\n", "created_utc": 1485532015, "id": "dczaw6d", "link_id": "t3_5qhb1s", "parent_id": "t1_dcz8o64", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "I did go to a dr, they suck here, i live in a 3rd world country where they doll out generic advice.\n\nHow do I wean her of bottles? I do feel she is too old but will not drink milk from a sippy cup! I will try again tomorrow. She does drink water but now that you mentioned fluid intake I would say that hers is 80% formula.\n\nThank you", "created_utc": 1485532145, "id": "dczb06x", "link_id": "t3_5qhb1s", "parent_id": "t1_dcz9c19", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "paraakrama", "author_flair_css_class": "purple", "author_flair_text": "Lily, 9/18", "body": "My daughter is nearly 3.5, but I agree with the other posters here.\n\n1) Cut out the formula. She's old enough to be drinking regular milk and she should be at this point. (Check with your pediatrician if you're still unsure, but my doc was pretty firm on this.)\n\n2) Cut way back on the popcorn, it's probably not helping her move her bowels and causing pain.\n\n3) Milk should be with meals, water otherwise if she's thirsty. This is probably keeping her from eating regular meals because she feels full from the milk.\n\n4) Cut out the \"snacking\" behavior and provide full meals with a small healthy snack mid morning and mid afternoon. ", "created_utc": 1485532280, "id": "dczb4af", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree with all your points, I truly dont know how . Tantrum city and fits if she doesnt get her milk.\n\nWas considering slowly starting to wean and use sippy cups alternating with bottle etc.\n\nShe grazes but doesnt eat and demands milk even when she has a meal she likes in front of her, tried to distract her etc she cries.\n\n", "created_utc": 1485532701, "id": "dczbh53", "link_id": "t3_5qhb1s", "parent_id": "t1_dczb4af", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siriuslyserious", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh no, I'm sorry to hear that about the doctors. Well you can wean off the formula by slowly putting less and less of it in with the milk each time you serve it. Eventually she should have no formula mixed in and she shouldn't notice the difference.\n\nThe sippy thing is trickier, they have to figure out how to use it. Straw sippies worked best for my daughter. Start putting the milk in a sippy, make it a really exciting thing. Hype it up, it's a big girl cup, a new cup, so cool! You'll probably have to get her to use it first by putting milk in it, since she'll want that, then when she knows how to use it you can try offer one with water. You've gotta stay strong. My daughter still throws a fit when she wants milk instead of water, but we know milk constipates her and just offer her the water until meal time. We put ice in it, that helps sometimes.", "created_utc": 1485532835, "id": "dczbl74", "link_id": "t3_5qhb1s", "parent_id": "t1_dczb06x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "its ok :)\n\nWe mix formula with water, wow im way off, will switch to mixing it with milk.\n\nThank you so much for the support!", "created_utc": 1485533242, "id": "dczbxhj", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbl74", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "siriuslyserious", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh no mixing formula with water is correct. I was under the impression you were making formula and then putting some formula and some milk in a bottle, is that correct? That's what I mean, mix up the formula with water per usual, then when you give her a bottle/sippy cup, maybe fill it half with milk and the other half formula (which you had prepared with water). Then the next day do a little more than half milk and a little less than half formula. Until eventually you're giving her a bottle/cup that is all milk and no formula. Does that make sense?", "created_utc": 1485533895, "id": "dczchzs", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbxhj", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Babywhale", "author_flair_css_class": null, "author_flair_text": null, "body": "Try regular cups with a straw", "created_utc": 1485534220, "id": "dczcscc", "link_id": "t3_5qhb1s", "parent_id": "t1_dczb06x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Babywhale", "author_flair_css_class": null, "author_flair_text": null, "body": "If you keep giving her what she wants when she tantrums, she will know tantrums work. You just have to start ignoring the tantrum. Or acknowledge her feelings but don't give in. Theres no milk right now, heres some water. And leave it. If she gets thirsty enough she'll drink it eventually. ", "created_utc": 1485534454, "id": "dczczrz", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbh53", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Cut back the milk. She only needs 2-3 servings a day. Too much milk can cause anemia. If she is lactose intolerant, that will cause bloating. My son (18 months) has a dairy sensitivity. If he gets dairy he cant sleep well, and he gets very cranky. Even more, try cutting dairy/formula and give 2-3 servings of almond or coconut milk instead. \n\nTalk to the doctor as well, but you may have to do some experimenting to figure this out. ", "created_utc": 1485534470, "id": "dczd0bo", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Sometimes as parents we have to put up with tantrums when we make changes. It will pass, if you stay strong and consistent. ", "created_utc": 1485534561, "id": "dczd367", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbh53", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "paraakrama", "author_flair_css_class": "purple", "author_flair_text": "Lily, 9/18", "body": "Oh I agree it isn't easy. Kids throw tantrums when they don't get what they want, but you need to be firm. It sucks - a lot, especially in the beginning - but is so necessary for their development both mentally and emotionally. It's a huge growth and learning experience to not get what you want. Once your child becomes used to you being firm, they learn to roll with it. If they continue to think they can whine/throw fits to get what they want, then that's what they'll do. Don't think they won't still try whining on occasion - my daughter certainly does - but it becomes less and less frequent when it doesn't work.\n\nMy daughter was difficult about it for about a week, and when I wouldn't budge, she just started drinking it. Now she even asks for water between meals if she's thirsty! Now if she's had a good day (no fits/tantrums, no time-outs) she's allowed one cup of chocolate milk with her dinner, which is a BIG reward for her.\n\nFor a long time, we let her have a much milk as she wanted during meals (which usually meant she would drink the milk and ignore large parts of the meal) but as long as she was getting the calories, it's ok for a while. Now we're working on eating bits of the meal before she's allowed to have her milk. ", "created_utc": 1485535016, "id": "dczdhha", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbh53", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sjb1985", "author_flair_css_class": null, "author_flair_text": null, "body": "What PP is talking about is weening her off formula. For example when we weened my 1 yo off of breastmilk he was drinking a 6 oz bottle of BM. \nThe first week we mixed 1 oz of whole milk with 5 oz of BM. The next week 2 oz whole milk and 4 oz of BM. The next week 3/3. The following 4/2 then 5/1 and finally you have 6 oz of whole milk.\n\nYou mix the formula as directed, but to the correct measurement for that bottle THEN add the whole milk to whatever she is drinking.\n\nHow many doctors have you seen? I mean reddit is great and everything, but this is not the place to go for medical advice. People are attaching their specific instance to yours and they truly don't know all the details. I get living in a 3rd world country and wanting to do best for your child, but this is not where I would go for advice  medically speaking. WebMD.com, mayoclinic.com are good resources to start, but be careful there as well. Reading too much into something may give you more grief if necessary.", "created_utc": 1485535138, "id": "dczdlcn", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbxhj", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wickywyld", "author_flair_css_class": null, "author_flair_text": null, "body": "It's going to be hard and a lot to go through but you need to stop the bottle while she's sleeping thing. ", "created_utc": 1485535838, "id": "dcze7xp", "link_id": "t3_5qhb1s", "parent_id": "t1_dczau6o", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NuPeper", "author_flair_css_class": null, "author_flair_text": null, "body": "We got rid of bottle by only giving water in bottles and only giving milk in sippy cups (my son cannot use the straw ones) at 2.5 most of her nutrition should be from food not milk (and no formula unless it's made for toddlers, baby formula should be stopped by 1) try different things, even if you don't think she would like it (my kid likes some weird stuff and he's very picky) ", "created_utc": 1485537909, "id": "dczg1u8", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_ShortGirlProblems_", "author_flair_css_class": null, "author_flair_text": null, "body": "As others have said, at that age she doesn't need formula at all.  Ideally, you should have stopped giving formula around 1 year of age.  If she won't drink plain milk, that's ok as long as she's eating other dairy products like cheese and yogurt.  I'd focus first on weaning her off the formula.  It sounds like she's drinking it mixed with milk, so start adding less and less formula over about a week until she's strictly on milk.  I'd also cut down on the amount of milk she's getting.  She shouldn't be drinking more than about 24 oz of milk a day.  She should be drinking mainly water.  Then work on weaning her off the bottle and onto either a straw cup or a regular cup.  The bottles can cause milk to pool around her teeth and lead to tooth decay.  Especially if she's getting them right before or during sleep, without brushing her teeth after the bottle.  Toddlers do normally have a pot belly, since their stomach muscles aren't developed enough to hold it in.  You might try googling images of normal bellies and see if you can compare your toddler to them?  Are her poops ok?  Milk can be really constipating.  I'm sorry you don't feel like you can rely on your doctor - that makes it tough.  Hope this is helpful!  Good luck!", "created_utc": 1485539206, "id": "dczh7e9", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "laidback_hoser", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, I agree. 8 bottles is a lot of milk/formula (calorie-wise) and probably why she might not be hungry for other food during the day. Also terrible for dental health.", "created_utc": 1485539534, "id": "dczhi0i", "link_id": "t3_5qhb1s", "parent_id": "t1_dcze7xp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "laidback_hoser", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, of course she cries. You keep giving in to her every time she cries so she's learned that crying is a way to get what she wants (milk). You will have to endure crying/tantrums to break these habits. You are the parent and you must decide what is best for her. Your child will not starve herself. Eventually, she will eat/drink water as long as you don't give in.", "created_utc": 1485539787, "id": "dczhqho", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbh53", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jeshef", "author_flair_css_class": null, "author_flair_text": null, "body": "Popcorn 3 times a day, and formula. I'd cut both out. Popcorn is a choking hazard and has almost no nutritional value. A child her age doesn't need formula and she's getting way too much milk. Do NOT give her a bottle in bed, it's a choking hazard and will rot her teeth. At 2 1/2 she doesn't need a bottle at all, she should be drinking from a cup. A bottle will impact her tooth development. As for the tantrums if you give in then she's the boss. If you think a toddler throwing a tantrum is hard wait until she's 14 and wants to go to a party with her friends. \n\nIf the stomach issues don't resolve themselves when you cut out the milk, formula and popcorn take her to the doctor.", "created_utc": 1485544592, "id": "dczm2w3", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "nevenoe", "author_flair_css_class": null, "author_flair_text": null, "body": "At 2.5 she definitely does not NEED to eat during the night. There is no reason to feed her. I'm amazed you're still standing after that long without a proper night sleep.\n\nCut it. It will be tough but it's for her own health.\n\nAt that age she needs about 600 ml a day in milk...formula ideally. The rest should be normal food, not too rich in protein...", "created_utc": 1485549581, "id": "dczqhbd", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Platinumizemybody", "author_flair_css_class": null, "author_flair_text": null, "body": "Aside from the stomach issue, the bottles while she's sleeping are really awful for her teeth. It's time to stop that. If she absolutely must have milk in a bottle, do it before she sleeps and brush her teeth after. ", "created_utc": 1485556072, "id": "dczvwxg", "link_id": "t3_5qhb1s", "parent_id": "t1_dczau6o", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "KegelFairy", "author_flair_css_class": null, "author_flair_text": null, "body": "At 2.5 there'll be a bit of a learning curve but she can use regular cups. My daughter (3.5) uses little plastic cups from Ikea, I never fill them more than half full. \n\nMy daughter is a huge sucker for pretty new things. If yours is similar, get her some pretty new sippy cups or regular, little plastic cups and tell her that only water goes in them.", "created_utc": 1485556780, "id": "dczwgr0", "link_id": "t3_5qhb1s", "parent_id": "t1_dczb06x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Skyrena", "author_flair_css_class": null, "author_flair_text": null, "body": "If her belly is distended it could be yeast. My older (now 2years and 3 months) had a distended belly for MONTHS until we realized it was yeast. Some good bacteria like acidophilus could work wonders here. He's a calf and loooves his milk (he gets normal grownup milk in a sippy cup/bottle/normal cup depending on his mood). He only gets two of them per day though. And he knows this is the rule. He'll throw a super tantrum if he thinks there's the tiniest chance that he'll get more. We just sit there staring into space until he stops. Tantrums suck but they'll keep throwing them if they think there's even a remote chance of success. \n\nLike others have said I'd stop with the formula. She might be really gassy from all that milk. \n\nShe's old enough now to be \"reasoned with\". You can have discussions about what's happening and why and she'll understand the gist of it. \"Milk is only for such and such times\", \"Eat this and you can have milk for dessert\", \"No this is the only milk you can have\" etc. We needed to take the hard approach for our boy, he would have chosen milk over anything and everything but we cut the bottles down and tried talking him through it. He's now at a point where he understands \"no, you already had milk. You can have water now\". He still tries to force our hand by screaming bloody murder sometimes but we just don't give in. He's at an age now where I know that if he's hungry or thirsty enough, he will eat and drink what he's given. \n\nOther than that I don't have much advice. If she's eating a lot it could be a growth spurt or she could just be warming up to the idea of food. ", "created_utc": 1485558076, "id": "dczxgkq", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "not_just_amwac", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, with both my two, I was able to wean off formula onto normal milk my mixing their formula with milk to start with, then gradually reducing the amount of formula in it over days or a week or two, I don't remember (bad memory, youngest is 15mo, weaned at 1y).", "created_utc": 1485562556, "id": "dd00px2", "link_id": "t3_5qhb1s", "parent_id": "t1_dczbh53", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you asked the pediatrician?", "created_utc": 1485567667, "id": "dd045nu", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "secretfriend-", "author_flair_css_class": null, "author_flair_text": null, "body": "OK lovely lady, 2.5 year old needs only 12-18 oz (530ml maximum) of milk per day. Give her three meals a day - fruit, bread, cheese, veggies, and meat - and milk with each. Put the milk in a cup.\n\nHumans are remarkably resilient - she will drink, I guarantee you she will not starve. ", "created_utc": 1485573672, "id": "dd07zte", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "My 17 month old twins are pulling this right now. Following.", "created_utc": 1485576711, "id": "dd09t6s", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "My 17 month old twins are pulling this right now. Following.", "created_utc": 1485576711, "id": "dd09t77", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "Third world country, belly distended?\n\nExamine or have examined her stools for signs of intestinal parasites. Animals can carry them and toddlers are not particular about what they put in their mouths.", "created_utc": 1485581498, "id": "dd0cfwu", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pastryface", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is about 8 months old, she just started successfully taking a sippy cup. It took a few weeks to get her used to it. The parenting book suggested by my doctor has monthly schedules in it. So for each age, it tells me when she should be sleeping, what she should be eating, etc. It told me to start introducing the sippy cup at each meal around 6-7 months. It takes a while for them to get used to them and yes there will be messes at first, but that's just part of it! It could take your child a few days, few weeks, or few months to get the hang of it. They are all different. Also, my book and doctor say that by 12 months/1 year they should be completely off of formula and on to whole milk. \n\nAs for easing into sippy cups, I've found a really great one! The main problem is that babies and toddlers have an issue figuring out how to tip the cups up to get the liquid out or they hold them funny. The company Munchkin makes a straw cup that is weighted. So even if they are holding the bottle straight up and down, tipping it to the side, etc, the liquid will still come out. Try getting one of those, and putting some milk on the tip of the straw so that your child can start to realize milk comes from there. Soon enough they will be sucking, just takes time and patience. ", "created_utc": 1485581751, "id": "dd0cke6", "link_id": "t3_5qhb1s", "parent_id": "t1_dczb06x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "derva", "author_flair_css_class": null, "author_flair_text": null, "body": "Agree with all the comments - you can and should wean off formula. It's hard to make these transitions if you aren't sure quite when to do it, and she's your only one.   \n\nAnother way to wean off formula is to start diluting it more - so it doesn't taste as good to her.  Maybe do it steadily - 1 Tbsp water extra in each bottle.  \n\nIf it's more diluted with water it also won't fill her up so she'll feel hungry sooner and the might try the healthy snacks you are offering!\n\nAlso agree re: not offering it between meals or at night.  Milk and formula are filling. I had to stop giving my daughter milk between meals b//c it would fill her up and she wouldn't eat the meal.  \n\n\n\n", "created_utc": 1485583561, "id": "dd0dfwj", "link_id": "t3_5qhb1s", "parent_id": "t3_5qhb1s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "I am working on it thank you so much!", "created_utc": 1485588024, "id": "dd0fbs7", "link_id": "t3_5qhb1s", "parent_id": "t1_dczd0bo", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much for your thoughtful comments, Reddit is just one more resource I wanted to try since I can interact with what I read etc . \n\n", "created_utc": 1485588097, "id": "dd0fcrj", "link_id": "t3_5qhb1s", "parent_id": "t1_dczdlcn", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you will do ", "created_utc": 1485588109, "id": "dd0fcwp", "link_id": "t3_5qhb1s", "parent_id": "t1_dczcscc", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "She's very Similiar, trying soppy cups today, used to use them for water only. Thank you", "created_utc": 1485588146, "id": "dd0fdfb", "link_id": "t3_5qhb1s", "parent_id": "t1_dczwgr0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Hahaha yes I just realized my daughter too can't figure out how to use it, thank you ! ", "created_utc": 1485588184, "id": "dd0fdxp", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0cke6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "The daytime I'm working on but the nighttime will be slightly hard I reckon, until she starts eating enough in the day time as she will cry while asleep and wake up etc ", "created_utc": 1485588236, "id": "dd0fenc", "link_id": "t3_5qhb1s", "parent_id": "t1_dcze7xp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Indeed! Makes a lot of sense thank you!", "created_utc": 1485588285, "id": "dd0ffb9", "link_id": "t3_5qhb1s", "parent_id": "t1_dczhi0i", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Didn't even cross my mind !! Wow thank you ", "created_utc": 1485588323, "id": "dd0ffu1", "link_id": "t3_5qhb1s", "parent_id": "t1_dczvwxg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Love this, starting immediately. Thank you", "created_utc": 1485588353, "id": "dd0fg8h", "link_id": "t3_5qhb1s", "parent_id": "t1_dczczrz", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "My issue is my guilt. I work very long hours and sometimes from home too as well, so my way of balancing is giving in. Dumb strategy. Immediately changing this . Thank you", "created_utc": 1485588400, "id": "dd0fgwa", "link_id": "t3_5qhb1s", "parent_id": "t1_dczd367", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Hahahah this made me smile, thank you and thank you for the support ", "created_utc": 1485588440, "id": "dd0fhh6", "link_id": "t3_5qhb1s", "parent_id": "t1_dczdhha", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Great great great point about the starving. Thank you so much!!", "created_utc": 1485588468, "id": "dd0fhul", "link_id": "t3_5qhb1s", "parent_id": "t1_dczhqho", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you will attempt this!", "created_utc": 1485588485, "id": "dd0fi31", "link_id": "t3_5qhb1s", "parent_id": "t1_dd00px2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "created_utc": 1485588532, "id": "dd0firn", "link_id": "t3_5qhb1s", "parent_id": "t1_dd07zte", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Will do thank you!", "created_utc": 1485588547, "id": "dd0fiyn", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0cfwu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "God help us both", "created_utc": 1485588557, "id": "dd0fj3m", "link_id": "t3_5qhb1s", "parent_id": "t1_dd09t6s", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "Tantrums are easier to manage when they are small. You dont want a 10 year old or teen that tantrums", "created_utc": 1485620209, "id": "dd0rnlw", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0fgwa", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wickywyld", "author_flair_css_class": null, "author_flair_text": null, "body": "You're right, it will be very hard. I saw that you don't have reliable child care info where you are so I don't mean this in a sanctimonious way - Here in the U.S. one of the number one things pediatricians preach is to not prop/allow bottles while sleeping. This could be the source of her issues. Either way good luck!! \n:-)", "created_utc": 1485622589, "id": "dd0t9tf", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0fenc", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "How does a baby sleep thru the night without? I'm dying to have her sleep without waking up for milk :/", "created_utc": 1485626818, "id": "dd0waq5", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0t9tf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "She did really well today when I distracted her or simply refused to fold I was shocked", "created_utc": 1485626859, "id": "dd0wbsj", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0rnlw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Creepella_the_third", "author_flair_css_class": null, "author_flair_text": null, "body": "You never know until you try. Age 3 was a really hard age for my daughter. She had the worst tantrums for about a year, but I stayed consistent and firm. I let my yes be yes, and my no stay no, and there were very clear boundaries and consequences. Dont say anything you dont plan on doing. If you say, we will go home if you dont stop doing that, then you must go home if they dont stop doing that. Just an example. Parenting can be hard, but so rewarding. At 8 years old, my daughter is really well behaved, and I dont get any complaints about her. The hard work pays off. My son is now approaching age 2, and I am reminded that I have to be consistent. ", "created_utc": 1485630012, "id": "dd0ymvf", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0wbsj", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "Feeding/ hunger strike?\nI'm concerned with all the milk and the big tummy that she's going to get constipated. \n\nMy girls just got over what was likely norovirus and they went from the runs to really hard little poops. And they were refusing food a lot prior. \n\nToday I changed things up a bit. I offered them oatmeal with one of their favorite pouches mixed in and milk only in cups with straws. It made it harder to drink. If they wanted a bottle I put water in it. \n\nAfter ten minutes of messing around they ate breakfast (about three tablespoons) and refused milk in the cup.\nLet them play for an hour until they fussed and then gave them water in a bottle again. They wouldn't go for it.\n\nI changed cups and put milk in it and they actually drank maybe 3 Oz each. They played for a bit and started getting really clingy and angry. At that point I gave them another 4 Oz and watered it down up to the 7 Oz mark. \n\nI repeated that a few more times throughout the day, and made them a smoothie with no banana (I call it pouches in a cup because they love pouches) they both had 4-5 Oz each and after that theory appetite seemed to be better. \n\nSo maybe just figure out your schedule and see how you can get her milk amounts sorted and then add water. \n\nTry for a day or two unless she's In pain, and if there isn't a change, talk to your doctor\n\nGood luck, and if you have any solutions please share!! \n\n", "created_utc": 1485664654, "id": "dd1ncm5", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0fj3m", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much!! You sound like you have a PHD in mommyhood :)) #inspired", "created_utc": 1485669842, "id": "dd1qdf5", "link_id": "t3_5qhb1s", "parent_id": "t1_dd1ncm5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "I have found that she is great when I'm firm, she cries a bit then follows my orders. Who knew! ", "created_utc": 1485669913, "id": "dd1qery", "link_id": "t3_5qhb1s", "parent_id": "t1_dd0ymvf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "Awe thanks :) I'm a first time mom too.. I just try stuff until it works, and with twins a lot becomes a crash course fast lol.\n\nYou keep rocking mama!", "created_utc": 1485701964, "id": "dd233el", "link_id": "t3_5qhb1s", "parent_id": "t1_dd1qdf5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh and if she's really gassy a product called ovol helps... you can do use a warm blanky from the dryer on her tummy too or a nice warm bath. \n\nIf she isn't pooping make sure you get her checked :)", "created_utc": 1485702393, "id": "dd23c8q", "link_id": "t3_5qhb1s", "parent_id": "t1_dd1qdf5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Hahhaha,, thank you! You too", "created_utc": 1485882322, "id": "dd5ewdo", "link_id": "t3_5qhb1s", "parent_id": "t1_dd233el", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "stella27113", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!", "created_utc": 1485882332, "id": "dd5ewpz", "link_id": "t3_5qhb1s", "parent_id": "t1_dd23c8q", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}