{"submission": {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": false, "contest_mode": false, "created_utc": 1487006173, "domain": "self.Mommit", "edited": 1487036997, "full_link": "https://www.reddit.com/r/Mommit/comments/5tu3r7/new_mom_having_a_hard_time/", "gilded": 0, "id": "5tu3r7", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 97, "over_18": false, "permalink": "/r/Mommit/comments/5tu3r7/new_mom_having_a_hard_time/", "retrieved_on": 1489540388, "score": 70, "secure_media_embed": {}, "selftext": "[deleted]", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "default", "title": "New mom having a hard time", "url": "https://www.reddit.com/r/Mommit/comments/5tu3r7/new_mom_having_a_hard_time/"}, "comments": [{"author": "seamstress80", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you considered pumping and letting your husband feed the baby? You coud get some sleep that way", "created_utc": 1487006674, "id": "ddp04to", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "coldcatfire", "author_flair_css_class": null, "author_flair_text": null, "body": "I was where you are. It gets better as they get older. Around 3 weeks is when I didn't feel like I wanted to cry every time I had to breastfeed. By then, she'd finally gotten the hang of things (after we saw a lactation consultant to fix her latch), she wasn't eating so darned often and my nipples had toughened up a bit so it wasn't so painful. Also, I use a nipple shield and it made all the difference in getting her to latch on properly and quickly. Make sure to use lots of lanolin if your nipples are getting super sore. I even put ice packs (over my shirt) on my chest to help with the soreness. You can even alternate breasts at each feed to give the other one some time to rest/heal as well. \n\nIf you don't have a rock n play, think about getting one. They're a lifesaver for babies that won't nap anywhere but in your arms. Also, a pack n play can be a cheaper alternative to put right next to your bed for baby to sleep in if you can't find another affordable option. It's not quite as convenient as a co sleeper, but it's close and can be used for all sorts of things as baby gets older (sleeping, changing, playpen, travel crib...).\n\nHang in there, it gets better.", "created_utc": 1487008320, "id": "ddp1kls", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "It's going to get better. There are several things going on here. Day 5 is commonly when milk comes fully in after a c-section; day 5-7 is typically a growth spurt time for newborns, when they want to eat All. The. Time and won't be put down. Have you seen a lactation consultant to make sure he's latching and sucking well? Do you hear him swallow when he nurses? Has he started to gain weight? Do you have any help at home? Are your breasts feeling fuller or exhibiting other signs of your mature milk coming in? These are the things I would ask you if you were my client (I'm a postpartum doula.)\n\nMost urgent need for you right now though is sleep. I urge you to find someone who can come over and hold the baby for you for 3 solid hours so you can start getting some restorative sleep. Feed him right before you lie down, but make sure that your support person *does not disturb you* during your nap. Baby might fuss, but he won't starve during one 2-3 hour period. Your body can't recover from surgery and make plentiful milk if you are this horrifically sleep deprived. Do this every day, and have your husband do it at least once every night (I'm assuming he's at work right now?)\n\nAnd when you wake up, try calling a local postpartum doula or lactation consultant who can make a house call and see if there is some reason outside the norm that baby wants to nurse constantly. Probably nothing's wrong -- but it is good to check that his latch is good and he is effectively removing milk. ", "created_utc": 1487009137, "id": "ddp2ac1", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Vianela30", "author_flair_css_class": null, "author_flair_text": null, "body": "Try placing him on a pillow on your lap, arrange it for minimal discomfort for you and try breastfeeding that way.  BEFORE you do that however, breath deeply.  Drink water, juice.  Close your eyes and breath.  Think about the love you have for him and relax your mind to the best you can at that moment.  Babies feel the mother's tension and get frustrated.  \n\nand listen, if everything fails you still need to make sure that baby is fed.  There's no shame in bottle feeding. \n\nsource:  Successfully breastfeed 6 babies myself.", "created_utc": 1487009269, "id": "ddp2eh8", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mystic_Mama", "author_flair_css_class": "green", "author_flair_text": "Silas 7/30/2016", "body": "My pediatrician when my son was born told me if it comes down to it put baby in the crib and sleep. This is how mothers become too overwhelmed or too sleepy and hurt the baby without meaning to. If nobody can help you I urge you to do this. ", "created_utc": 1487009790, "id": "ddp2uwy", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "Do you think it's possible that maybe a poor diet of the mother is decreasing certain nutrients in the breast milk, and thus the baby keeps wanting to nurse because they're not getting the necessary nutrients?\n\n/u/anonbojackfan1991 can you comment on your health &amp; diet?", "created_utc": 1487009971, "id": "ddp30q6", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp2ac1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "well a nurse practitioner came over for a home visit and the milk is in, he's latching pretty all right and she gave me some guidance for making it better, and he's even starting to gain weight now. \n\nI have some help from my in laws and my husband works but tries to help as much as he can. I just can't stand when he cries and pretty much have to get up. He slept in the crib a few times and for quite awhile but now he seems reluctant to.", "created_utc": 1487010057, "id": "ddp33ee", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp2ac1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Neoitvaluocsol", "author_flair_css_class": null, "author_flair_text": null, "body": "This is pretty normal as they need to cluster feed to tell your body to produce more milk to keep up with the growth.  It won't always be like this.  But to be honest breastfeeding can be difficult for various reasons for weeks in the beginning, partially because you are weak and exhausted and recovering.  And atleast for me personally, although it got easier every week it did take months till it was effortless. \n\nTry to have your support people do everything else for you. Also it may be uncomfortable for the next week or so with the c sec, but once you can lay on your side try the side lying position for feeding. That made a huge difference for me, but I needed about 2 weeks recovery from my csec before I could lay on my side. \n\nIf latching is very difficult or your nipples get too sore you can try a nipple shield. Also keep up with lanolin to prevent soreness. ", "created_utc": 1487010073, "id": "ddp33v9", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "No, I do **not** think this is a possibility. I have many reasons for saying this so confidently, not the least of which is that we currently have *no reason to believe that baby is suffering any nutrient deficiency,* but no time to write it out just now. I'll refer you to Kellymom: http://kellymom.com/nutrition/milk/change-milkfat/", "created_utc": 1487010349, "id": "ddp3cp3", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp30q6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://kellymom.com/nutrition/milk/change-milkfat/"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok, thanks. But that link only covers calories &amp; fat, which could still support my suggestion. If you eat lots of empty calories you'll still feel hungry and want more food. \n\nHere's some info that supports the idea that the mother's diet is very impactful: https://www.reddit.com/r/BabyBumps/comments/4ilwfb/some_of_the_latest_science_on_the_microbiome_in/", "created_utc": 1487010591, "id": "ddp3kd3", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp3cp3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.reddit.com/r/BabyBumps/comments/4ilwfb/some_of_the_latest_science_on_the_microbiome_in/"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;well a nurse practitioner came over for a home visit and the milk is in, he's latching pretty all right and she gave me some guidance for making it better, and he's even starting to gain weight now. \n\nWonderful!! That's what I was hoping to hear. Now you know that he is in no danger of malnourishment if you take dedicated breaks for your sleep. Which you MUST do. \n\n&gt;I just can't stand when he cries and pretty much have to get up. \n\nI understand. Get some ear plugs, white noise, have your friend/mom/husband rock the baby in the other end of the house from where you're sleeping... whatever you have to do to sleep, please do it. This is for your health. This is so your body can heal and make milk. This is to help protect you from developing PPA or PPD (both of which are greatly exacerbated by sleep deprivation).\n\nSpeaking of white noise: have your support person look up the 5 S's for newborn soothing, which are highly effective at helping the baby *not* cry so you can sleep better. \n\n&gt;He slept in the crib a few times and for quite awhile but now he seems reluctant to. \n\nThis is normal newborn behavior. It's frustrating, but normal, and expect it to change several more times over the next few weeks. ♡", "created_utc": 1487010864, "id": "ddp3sz3", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp33ee", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fitmamaem", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you tried using a nipple shield if the latch is poor? Please don't worry it really does get better. He could very well be cluster feeding, or if his latch is poor then he is not sucking out all the milk he needs hence the constant need for him to breastfeed. \n\nThis happened with my son at 3 weeks, he would nurse for an hour and then about 30-60 minutes later need to nurse again, turns out it was due to a poor latch and a tongue tie! In the mean time, try and get rest where you can, call up a lactation consultant, and remember...you got this!", "created_utc": 1487011274, "id": "ddp466x", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Skywalker87", "author_flair_css_class": null, "author_flair_text": null, "body": "With my second son I struggled with milk supply and realized I wasn't taking in enough fat. I upped that and it helped. \n\nIt's really hard as a new mom nursing. Sometimes it feels like it's all on you since your the one feeding the LO. It's ok to be frustrated, just please ask for help as much as you can do you can rest. If your husband comes home from work and offers to take him while you nap PLEASE DO IT!! \n\nIt will get better, he's still so little. Best of luck to you. ", "created_utc": 1487011391, "id": "ddp4a0v", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I understand your intentions are probably good but your comments kind of come off condescending and preachy at a time like this. \n\nCluster feeding is normal and the practitioner said he is starting to gain a little. I trust the scale more than a random internet commentator. ", "created_utc": 1487011483, "id": "ddp4cys", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp3kd3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "First, in your link I see that mom's diet can alter her milk's microbiome, but that has nothing to do with her milk's nutrient content. \n\nSecond, OP is only 5 days postpartum, and her milk is still largely colostrum, which tends to be more uniform in nutrient density than mature milk.\n\nThird, a mother's body generally prioritizes the nutrients in the breastmilk, so that even if a mother is eating poorly, unless she is severely malnourished, her milk will generally be nourishing enough to sustain a healthy baby. \n\nFourth, there is really no such thing as \"empty calories\" in breastmilk. It's not like if you try to fill up on popcorn, not at all. Fat and calories are the only two significant measures of mothers' milk's adequacy. Vitamins can be supplemented, but there's a lot of controversy over whether that's even necessary for an EBF newborn. ", "created_utc": 1487011652, "id": "ddp4ifw", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp3kd3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I put him in the vibrating seat for now with some white noise so I can eat and I'm going to try and have someone come over before my husband gets off work. \n\nThis seems to be helping a bit though he's still fussy. ", "created_utc": 1487011858, "id": "ddp4p14", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp3sz3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah you are right, I need to start calming down a bit more before hunkering down. I think my husband noticed and started just taking over a bit when it happens because he worries. We have gotten the word we don't need to supplement and another commentator says waiting a couple hours will not be detrimental if he's gaining and been eating all night.", "created_utc": 1487012157, "id": "ddp4ync", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp2eh8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm gonna have to look at the nipple shields. Can you get them at basically any general drug store?", "created_utc": 1487012252, "id": "ddp51l8", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp33v9", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pineappleprincess524", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a 6 month old so all of this is still fresh in my mind! The first 3 weeks or so are horrible. I was so tired at points that I was delirious. My scar hurt like crazy mad and my nibbles ended up with scabs.  Oh the pain! It seemed like all my baby wanted to do was nurse and she never wanted to be put down. \nJust take it one hour at a time, maybe even 1/2 hour. I would have to say to myself, I can do this one more hour for sure, what is one hour?!\n\nAfter 6 weeks it was SO much better. The baby was fine with me putting her down and she doesn't eat nearly as much, except for growth spurts. \n\nYou can make it through!!", "created_utc": 1487012286, "id": "ddp52nn", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I put him in the vibrating chair and put on white noise before someone gets here so I can eat. I think I can last a little longer but yeah i need some me time and well crying isn't the end of the world much as I worry about attachment. ", "created_utc": 1487012312, "id": "ddp53in", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp2uwy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "carhootel", "author_flair_css_class": null, "author_flair_text": null, "body": "Already gaining at 5 days old! That's awesome! Super mama milk you got there! \n\nOne thing I've heard before - when the milk starts flowing so do the tears. \n\nLove the idea of getting a protected 3 hr stretch of sleep. \n\nThis time is really hard (and wonderful) and will pass in a haze and you're not evenly remotely supposed to have ANYthing together at this point.", "created_utc": 1487012331, "id": "ddp5442", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp33ee", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; Fat and calories are the only two significant measures of mothers' milk's adequacy\n\nOh come on. You may be right about some of the other stuff, but that statement is ridiculous. ", "created_utc": 1487012422, "id": "ddp5712", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp4ifw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "We're gonna have my husband or someone else visit the OB office and see if they can give me a pump because this is also a good idea and I was told my insurance most likely covers one. ", "created_utc": 1487012465, "id": "ddp58dp", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp04to", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't think so. Cluster feeding at this age is expected and completely normal. My son was nursing almost 24/7 for the first 3 months.", "created_utc": 1487012515, "id": "ddp5a0b", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp30q6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "I rememeber telling myself the same thing...just one more hour. I remeber thinking there was no way I was going to make it to a year. The first few weeks were just awful and on top of it I got thrush. Eventually that \"one more hour\" turned into 2 years!", "created_utc": 1487012992, "id": "ddp5owm", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp52nn", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "This nursing has been literally constant, but he's pooping and peeing plenty so at least I know its working. He just gets so frustrated sometimes he pushes my nipple away and refuses and that's when I get worked up and cry. When he does latch its thankfully pretty good. ", "created_utc": 1487013035, "id": "ddp5q92", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp466x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Neoitvaluocsol", "author_flair_css_class": null, "author_flair_text": null, "body": "Not sure, I know they sell them at target and amazon. Probably at most drug stores. ", "created_utc": 1487013312, "id": "ddp5z2b", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp51l8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487013556, "id": "ddp66rg", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Baby_groot_4_lyfe", "author_flair_css_class": null, "author_flair_text": null, "body": "Please let yourself get some sleep. You're mental health is the most important thing right now (and of course keeping baby alive!). I saw that you don't have a pump yet so I would suggest having you husband give a bottle while you sleep. A bottle won't derail your breastfeeding. It will\nHowever give you some rest and give baby the food they need. Plus it will be fun for dad too! ", "created_utc": 1487014479, "id": "ddp70au", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "perdiitax", "author_flair_css_class": null, "author_flair_text": null, "body": "I got mine from the pharmacy. Different brands come in different shapes and sizes though so you might have to try some different options before you find one that works for you.  \nBut if he's latching ok, and he's drinking well (which he probably is since he's gaining) then i'd give it another couple of days before trying the shields, unless you're in a lot of pain of course, in which case go for it :)  \nI needed shields with my oldest because he had jaundice and kept falling asleep on the boob, and then would be horrible to re-latch. Second baby was a voracious cluster-feeder just like yours seems to be. And for me, after about a week of adjustment there was no more pain or discomfort. Besides the discomfort from lack of sleep, and from sitting down so long during cluster feeding sessions. I watched so much Netflix...  \n \nPlease also check out /r/breastfeeding and /r/beyondthebump, as well as [kellymom](kellymom.com) and (La Leche League)[www.llli.org]. You're not alone. Breastfeeding can be very hard and there are a lot of resources available and people that can support you.", "created_utc": 1487015059, "id": "ddp7iqa", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp51l8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.llli.org"}, {"author": "punitaro", "author_flair_css_class": null, "author_flair_text": null, "body": "I also had a C-section, partially co-slept (changing mat in middle of bed), and exclusively breastfed for the first few months. \n\nYou've been given a ton of great breastfeeding advice, so I can't really add anything there.\n\nI know your LO is young, but if you have a good bf relationship, it might not hurt to try a pacifier when you are desperately tired at night. If they're really hungry, it won't help anyway. But a lot of babies like to suck for comfort, and it could help with that aspect. \n\nWubanub pacifiers are great for NBs because they are easy to find if dropped, and can kinda prop themselves up on the baby's chest so baby can find it a little easier on their own if it falls out.\n\nI don't think I started swaddling until a few weeks old, but I remember that was a big help for sleep from 1-4 months. \n\nCreating a soothing, dark environment for sleep can be very helpful. I found that treating all wake-ups after 6pm as if it is the middle of the night helped a TON for avoiding \"the witching hour\" phenomenon. As in, I needed to stop bringing my daughter into the family room to watch The Bachelor while we bf at 7pm, since it would just rustle her jimmies. I'm sure she was thinking something like \"it's the middle of the night! Put me back to bed you crazy lady!!\" And I'd just be dumbfounded thinking, \"Gee, she's not hungry or poopy, what does she need?\" When the answer turned out to be pretty obvious: peace and quiet. \n\nOh, and sometimes they're just going to cry for no reason, and if you don't feel right setting them down for a bit, to calm your nerves, just throw in some ear plugs! It makes the crying seem much more distant, and helps you to tolerate holding them while they spaz out. Babies make you feel like you're going insane sometimes, but you're not. It's a totally normal feeling. \n\nMy daughter is 1 1/2 now, and just started sleeping in her toddler bed. She is pure delight, and every little bit of misery was totally worth it. I promise! Yeah, I still can't go out for dinner and a movie, but we sure do have a lot of fun together!", "created_utc": 1487015081, "id": "ddp7jgc", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "Good idea, definitely look into getting a pump. Personally, I just fed on demand and only pump maybe a 2 dozen or so times in the 2 years that I nursed my son but this [Madela Hand Pump] (medela hand pump) is awesome. I also has an electric pump but just found the hand pump to be way more convenient. ", "created_utc": 1487015337, "id": "ddp7rr1", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp58dp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Teriyaki_Pterodactyl", "author_flair_css_class": null, "author_flair_text": null, "body": "Unfortunately, there's no magic answer.  [Just this.](http://i.imgur.com/kBhdgRo.gif) Ask for and accept help. Grandmas, grandpas, daddy, aunts, uncles and friends often want to help, but don't know what to do to help. Be specific about what the most helpful thing from them would be, and don't be shy about your needs. Thicken your skin to criticism disguised as helpful tips from them. (They mostly mean well.)  Find out what works for you, baby, and your family. ", "created_utc": 1487015767, "id": "ddp85ee", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://i.imgur.com/kBhdgRo.gif"}, {"author": "PandoraWraith", "author_flair_css_class": null, "author_flair_text": null, "body": "My insurance covered one and in the US they are required to, I believe. I have Providence and I just called my insurance. They shipped me a pump. :)", "created_utc": 1487015808, "id": "ddp86ph", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp58dp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "PandoraWraith", "author_flair_css_class": null, "author_flair_text": null, "body": "It really does get better. My tiny bear ate round the clock for the first two weeks or so. When he pushes away and cries try switching breasts, that's what worked best for us. \n\nTook 5 days for my milk to even start coming in, so as long as he's gaining weight and making plenty of wet diapers (poop varies with breastfed babies) then you're doing wonderfully.\n\nI would definitely have a lactation consultant check for a lip/tongue tie. Mine had one that got caught at 4 weeks and he's been eating SO much better since we got it fixed. :) ", "created_utc": 1487016027, "id": "ddp8dpy", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp5q92", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "frigid_bones", "author_flair_css_class": null, "author_flair_text": null, "body": "Its ok to cry. You've been through a lot. Take it one feeding at a time. Count diapers if you are nervous. At least 5 good wet diapers and 8-12 feeds in 24 hours and you are doing well. He is eating often to boost your supply. Its totally normal, and doesnt mean you are failing at anything. Get someone to hold him for an hour while you nap. Its ok. If you are worried about baby crying, babies are often quiet in a stroller. Get someone to walk baby for an hour while you nap. Then you wont hear baby at all, and baby will be content while in a moving stroller. Fresh air will help baby sleep better too. ", "created_utc": 1487016213, "id": "ddp8jjh", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Girl_on_a_Buffalo", "author_flair_css_class": null, "author_flair_text": null, "body": "What did I miss? I only see cites about diet before birth not while breast feeding. ", "created_utc": 1487016242, "id": "ddp8kh0", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp3kd3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "frigid_bones", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you tried a pacifier. My son wanted to be on me constantly, and a paci really saved my sanity. ", "created_utc": 1487016811, "id": "ddp92nu", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp5q92", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "albvsdvmbledore", "author_flair_css_class": null, "author_flair_text": null, "body": "It absolutely gets better. The first weeks are so hard, + so unexpected. No one could have prepared you for it. Breastfeeding can be so cruel but if you can fret past the difficulties in the beginning it really is worth it. You're not alone, mama. ", "created_utc": 1487017003, "id": "ddp98sv", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "This is seriously unhelpful. Stop playing Dr. Reddit. Please. You're like a new mom's worst nightmare. ", "created_utc": 1487018201, "id": "ddpabp8", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp30q6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah internet doctors are the worst, I'm sorry on their behalf. Imagine these people treating actual patients. \n\nI think you're doing everything completely fine right now. Being a new mom is such a huge shock to your physical, emotional, and mental system. Newborns are so fussy and demanding and it's hard to know what they even want when it comes to feeding (let alone other stuff). I remember the shock of just how difficult breastfeeding was. I never really felt I got the help I needed. My kid survived and so did I, and she's now an awesome toddler, but I still write off those early months as a complete failure. Everyone else says I did great but I don't see it that way.\n\nI would prioritize sleep above everything else. If you become able to pump soon, definitely take advantage of that so that you can skip a feeding or two. I know everyone likes the automatic pumps but I actually found a hand pump was so much more useful, so don't rule those out!\n\n", "created_utc": 1487018522, "id": "ddpam4j", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp4cys", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "Yup, same here. Lots of resources will say to wait few weeks until milk supply is established. We used one from day one and I'm not sure I would have made it without it. He decided around 5 months he wanted nothing to do with it anymore but by that point things were much easier!", "created_utc": 1487018764, "id": "ddpau2z", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp92nu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "frigid_bones", "author_flair_css_class": null, "author_flair_text": null, "body": "I am still breastfeeding him and hes 19 months, so it didnt affect nursing at all for us. ", "created_utc": 1487018887, "id": "ddpay2d", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpau2z", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "That's awesome!! We nursed until he was 2 (this past October). He'd still be nursing now if I let him. I just honestly had enough and was feeling touched out all the time. Plus, he didn't start sleeping through the night until I finally weened him. Now he just peeks in my shirt every now and then and says \"All gone\" with a little pouty face and moves on. I kind of miss it sometimes but it really is nice to just cuddle and watch a movie with him without him   constantly trying to pull out the goods. ", "created_utc": 1487019290, "id": "ddpbb5n", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpay2d", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ReddenedEarth", "author_flair_css_class": null, "author_flair_text": null, "body": "FYI we introduced a bottle of formula at 10 days old and my daughter had no problems going back and forth between breast and bottle. Amongst friends who introduced early we've found \"nipple confusion\" is largely a myth- the people whose kids had trouble was when it was introduced much later. I had to supplement due to very low supply but the upshot was it let my husband take over some night feedings. There is a huge myth that babies must be breast OR formula fed and it's simply not true. They can go back and forth between the two just fine.", "created_utc": 1487019478, "id": "ddpbh5z", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lifebehindadesk", "author_flair_css_class": null, "author_flair_text": null, "body": "When your scar heals a bit, absolutely try side-laying position. It saved my brain. ended up napping alongside kiddo (thats how we ended up cosleeping) and I felt like I actually got some sleep and she could eat whenever the hell she pleased.\n\nIf you're nervous about accidentally falling asleep or whatever, have someone chill in the room with you with a book or something.\n\nIt gets easier, I promise!!", "created_utc": 1487019535, "id": "ddpbiz9", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cey24", "author_flair_css_class": null, "author_flair_text": null, "body": "I have been there my dear. Breastfed for 3 days after having my little one. She was great to latch but just fed for hours and hours. She slept all day in the hospital and would be awake all night feeding. One of the midwives told me she's probably not getting enough milk that's why she's latching for so long. On the 3rd night, I was so tired and sleep deprived, I gave in and gave her a bottle around 3 am. She fell asleep after the feed and gave me 4 hours rest and I didn't try anymore after that. But I'm glad I tried. Breastfeeding may not be for everyone. She's now 3 years old and is a perfectly healthy happy intelligent little kid :) it will get better, you just do what you got to do for you and the baby :) ", "created_utc": 1487019545, "id": "ddpbjc6", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "Hang in there. You are rocking this even if it doesn't feel like it. \n\nFirst week is hardest. Then the next month. By month three life feels like a new normal. \n\nSo. Have your husband hold him ad cry even. Just sleep. Make him go outside for a walk or in the car so you can rest without hearing baby. \n\nHand in there it's going to get easier and more natural feeling. \n\nTry co sleeping so you can rest. \n\nI've had two cesareans and if I forgot my ibuprofen I'd start to feel on edge so don't forget your Tylenol or ibuprofen. It'll keep you comfy and more able to care. \n\n", "created_utc": 1487020567, "id": "ddpcg3f", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thelibrariangirl", "author_flair_css_class": null, "author_flair_text": null, "body": "I know it's probably not helpful but it DOES get better. I was so sure all these things were wrong with me and my baby, that we'd end up needing all these interventions, and just so afraid of doing the wrong things. The only thing that cured this for me was time. The latch pain was excruciating, but it stopped. I learned my baby. I trusted him. If he needed to sleep, he needs sleep. If he needed to be on the boob, then off, then on again, then he did. (I learned this mean gas/poop/burps were brewing and he was uncomfortable, and why he pops on and off.)\n\nAs for sleep... do what you have to do. I sound like a bad mom, but I gave up on \"by the book\" safe. I would feed him in bed then put him on my chest to burp, he would fall asleep and so I did too. We did that for a week, him sleeping on my chest or in my arms because if I put him in the pack and play he would wake up and then I'd have to nurse again to make him go to sleep. He transitioned to a vibrating chair, then a rock and play a friend was done with. Ask around. Try different things. My baby naps in a swing and I'm sure I would've tried that for night as well and slept on the couch had nothing else worked. ", "created_utc": 1487020629, "id": "ddpci5f", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "crazy_cat_broad", "author_flair_css_class": null, "author_flair_text": null, "body": "Once my husband could do a feed or two it was a game changer. ", "created_utc": 1487020914, "id": "ddpcr77", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp58dp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "You can definitly do both. Just wanted to stress that it's pretty important that you pump if you're going to miss feedings. This is especially important in the very beginning when you're still establishing your milk supply. ", "created_utc": 1487021134, "id": "ddpcyfg", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpbh5z", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CocoSparkle", "author_flair_css_class": null, "author_flair_text": null, "body": "Keep strong momma the first few months are the hardest when getting to know your baby. But yes lots of water some good food and rest is what you need to feed that liquid gold to your baby. When I had my baby the lactating consultant told me to try to not wait til the baby is crying and pushing your breast away to feed em. By that time they are so hangry they won't latch on like normal as when you try to feed em before that point. I felt so guilty leaving my baby to shower eat or sleep but if we can't take a small break for ourselves we can't be great moms. Keep on the good work and wishing you a speedy recovery!!", "created_utc": 1487021211, "id": "ddpd0vh", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "frigid_bones", "author_flair_css_class": null, "author_flair_text": null, "body": "2 is my limit. After 1, I cut back to just a few feeds a day. I am down to two feeds and will stay there until he turns 2 or stops on his own first. I nursed my first for 2 years as well. People think nursing past 1 is daunting, but its nice because you can set limits. That said I still feel touched out nursing twice a day sometimes. My older one stopped just 2 weeks before her 2nd birthday, and I was a little hurt because she weaned on her terms. lol. I felt a little rejected. I am sure I will feel the same if my second baby does the same thing. ", "created_utc": 1487021362, "id": "ddpd5mv", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpbb5n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kozinskey", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; when the milk starts flowing so do the tears\n\nI had not heard this before but it's totally on point. ", "created_utc": 1487021604, "id": "ddpddfp", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp5442", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ladybuttstabber", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, mama, you are in the thick of it right now! There's so much great advice here, so I'm just going to say that I remember thinking the same things. I also had a C and wondered why the hell anyone would have more than one kid after going through those first weeks. They are a nightmare... i mean a total freaking shit show, right? You're definitely not alone and it definitely gets better!!! I promise! It's all SO worth it. You're doing great. Keep listening to your intuition - it's probably a bit hard to hear right now because you're tired and delirious, so remember that the first idea you have is probably the right one. Don't overthink things. We're all here pulling for you... you've got this!!!  ", "created_utc": 1487021699, "id": "ddpdgf3", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_TheOtherWoman_", "author_flair_css_class": null, "author_flair_text": null, "body": "I can totally see feeling rejected lol it was on my terms and I was still kind of an emotional wreck. I felt like the worst mom ever. Hormones are a bitch! ", "created_utc": 1487021740, "id": "ddpdhpi", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpd5mv", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kozinskey", "author_flair_css_class": null, "author_flair_text": null, "body": "OP is not asking for you to give her shit over her diet. OP is looking for practical support from other moms who have been there. Your comments are unhelpful and I don't think you belong in this sub.", "created_utc": 1487021752, "id": "ddpdi3i", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp5712", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kozinskey", "author_flair_css_class": null, "author_flair_text": null, "body": "See if you can get the Spectra - many plans cover any double electric pump and the Spectra S1 and S2 are equivalent to hospital grade pumps. Medela PISA also gets great reviews. ", "created_utc": 1487021917, "id": "ddpdnca", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp58dp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lassiemav3n", "author_flair_css_class": null, "author_flair_text": null, "body": "This is a really quick reply because we are about to eat, but I was definitely feeling how you are just under 14 months ago - I haven't read every single reply, but would it be worth getting it confirmed that your baby doesn't have a bit of a tongue tie? That could be affecting latch difficulty and how long he seems to be feeding vs how much milk he's getting during that time. Sorry so rushed, sending you supportive thoughts :)", "created_utc": 1487022163, "id": "ddpdv15", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tehkittehkat", "author_flair_css_class": null, "author_flair_text": null, "body": "The person you're replying to thinks that emerging research on the microbiome is the cause of, and solution to, all medical illness. As someone who's a research scientist who's done microbiome sequencing, and is now working in psychiatric research (ie. complex disease research), they're a nutcase not to be taken seriously.", "created_utc": 1487022677, "id": "ddpeb9i", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp4cys", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alexia_muriel", "author_flair_css_class": null, "author_flair_text": null, "body": "It's hard, it gets better. Mine is 4mo and he would nurse constantly. I felt like I never slept and I felt so poopy after my c-section all I wanted was sleep. Eventually I just started to nurse him while I laid down. I finally got some sleep and started feeling better. I know a lot of people say no cosleeping but there is a line where being too exhausted is more dangerous than napping with a baby on your boob. Trying to recover from major surgery while learning to breastfeed and care for a baby is expert level. You're doing awesome and you will feel better I promise.", "created_utc": 1487023163, "id": "ddpeqde", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "What?? Trying to figure out possible causes for the major problem she's having is bad? What are you guys looking for? Empty support? \n\nProblem: \"I can't sleep\"\n\nAnswer: \"Most urgent need for you right now though is sleep\"\n\nThat's helpful?!", "created_utc": 1487023673, "id": "ddpf5nd", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpabp8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ReddenedEarth", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, if the goal is to exclusively breastfeed you'd have to pump to make up for missed feedings. But if OP wanted to permanently hand over one of those night feedings to her husband, then there's no need to pump and her body will adjust to make enough milk for the remaining feedings she does.\n\nMy goal was never to exclusively breastfeed. The plan was always for my husband to do one night feeding every single night so we'd both be able to get at least one 4-5 hour stretch of sleep at night plus however many hours we got during our night shifts between feeds. I had planned for that one bottle feeding to come from milk I'd pumped, but alas, dismal supply ended that idea. In my situation there was nothing that could be done to up my supply because both my LC and OB agreed it was related to having PCOS aka hormones that don't do their job.", "created_utc": 1487027788, "id": "ddpigwg", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpcyfg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "xansha3", "author_flair_css_class": null, "author_flair_text": null, "body": "Tons of good advice here, not sure if someone mentioned it but Walmart/target sells these gel breast pads called soothies that you put in the fridge and they saved me from quitting breastfeeding. Hang in there, it gets better", "created_utc": 1487028849, "id": "ddpj9px", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "antisocialmedic", "author_flair_css_class": "lightcoral", "author_flair_text": "4yo &amp; 3yo girls", "body": "It sounds like you're pretty adamant against bottle-feeding, but you could always pump and have someone bottle-feed him that while you get a couple of hours of sleep.\n\nIf i hadn't have done that I would have never slept at all during those early days. ", "created_utc": 1487032615, "id": "ddpm2j9", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp4ync", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "benfranklinsmustache", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband I swear by white noise - even now at 9 months pp. The sound sleeper app is amazing and has saved us so many times. ", "created_utc": 1487033417, "id": "ddpmnz8", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp3sz3", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bcgirl99", "author_flair_css_class": "green", "author_flair_text": "3 boys 4, 2, and 11 months", "body": "This is a mom forum. You are clearly not a mom. I'm fairly certain you are not a woman.  Stay in your lane. ", "created_utc": 1487033557, "id": "ddpmroc", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpf5nd", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "zabulon_", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a VERY similar situation. At 4.5 mo now, and it DOES get better.\n\nC-section here and my milk didn't come in until ~6 days after. My baby screamed a lot in he first couple days and it was because he was big (9lbs) and hungry! He had high bilirubin and we decided to give some formula. No matter what the Lactation ladies tell you, you CAN feed formula and then exclusively breast feed. Or feed both. The important thing is baby is FED. I was committed to breastfeeding so I tried to pump every time my SO fed a bottle, even when I was getting almost nothing and try to breast feed first for stimulation. It sounds like your baby is hungry and though your body WILL get there, these early days are so important to early development, I think it's much more important to make sure baby is fed and you are mentally healthy then drive yourself crazy\n\nThe first week was a blur and honestly, BF-ing was one of the most challenging things I've ever attempted. My sleep was poor and patchy but it got better as LO learned to feed and I learned how to help him latch. There were times, especially in the evening when he fed constantly. We both had a lot to learn! So I watched a lot of Netflix! When I was frustrated or tired, my SO would feed a bottle and that helped me rejuvenate and help me recommit for the next day.\n\nI want to also say, don't listen to your mom. They don't remember the beginning days, they just remember when their babies were feeding efficiently every 4 hours and their boobs were full of milk. My mom said the same thing and you know what, LOTS of women have the experience you and I have even if our mothers didn't. And that's ok! Just get baby fed, get yourself sleep and ENJOY your baby. It goes by so fast...\n\nIf you need support or have questions, feel free to dm me or visit r/breastfeeding. Having a support network helped me tremendously!", "created_utc": 1487034391, "id": "ddpndpc", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "I figured as much. I am fairly interested in the microbiome phenomenon, but find all this dietary madness and self proclaimed experts on it to be quite obnoxious. I lived with an adamant and somewhat verbally abusive vegan for awhile so I know how it goes. \n\nI know I shouldn't say, eat cheetos or snack foods all the time, but yeah I'd never heard of unhealthy eating causing breast milk problems.", "created_utc": 1487034953, "id": "ddpnstv", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpeb9i", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "not_so_eloquent", "author_flair_css_class": null, "author_flair_text": null, "body": "Newborns are the WORST. Mine was so difficult I thought I'd break as a person. I can't tell you how many times I had to set him down and just have a good cry in the kitchen. \n\nAnd as cliche as it sounds, it gets better! It really does. Just hang in there.", "created_utc": 1487036484, "id": "ddpoxqd", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't see anything in the sidebar saying this sub is for women/moms only..?", "created_utc": 1487036570, "id": "ddpp01v", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpmroc", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "after a few hours of sleep i feel much better. baby also slept for the 3-4 hours i was out in my sister's and husband's arms. I'm guessing he must feel as frustrated as I do at times, wants to sleep but the need keeps him up. I'd be fussy too if I were going through that! ", "created_utc": 1487036585, "id": "ddpp0g0", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp2ac1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bcgirl99", "author_flair_css_class": "green", "author_flair_text": "3 boys 4, 2, and 11 months", "body": "Save the trip.  Unless your OB said they can give you a lump that's not how the insurance thing works or at least not in my experience.  Contact your insurance and find out their policy.  Usually they require a script from your doctor and then you order one of their approved pumps from an approved vendor.  One of my options was Target but I ended up getting one from an online vendor it was easy. ", "created_utc": 1487036613, "id": "ddpp19k", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp58dp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tootonyourparade", "author_flair_css_class": null, "author_flair_text": null, "body": "You are smack dab in the midst of a massive hormonal shift right now. I'm not trying to invalidate what you're feeling, but after a week or maybe less you will be past the baby blues for the most part and have a more positive outlook. Just give it a few days. Hang in there! ", "created_utc": 1487036961, "id": "ddppaxp", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bcgirl99", "author_flair_css_class": "green", "author_flair_text": "3 boys 4, 2, and 11 months", "body": "It's called Mommit and it is described as a a place for mothers to support each other.  It's not  appropriate for a science enthusiast to butt in and criticize the mother who's struggling and the women trying to help. \n\nBreast feeding and dealing with post partum recovery is complicated.   You're dealing with sleep derivation, hormones, pain and a lot of new mom anxiety. \n\nThere are a lot of things going on and your dietary advice while wel meaning at best is a shot in the dark and you are arguing with women who are either trained or have experienced this first hand.  You're  being disrespectful to OP and the rest of us who on this topic know more than you \n\nYou're been gently told by multiple people that your contribution was  not helpful and yet you persist. So I was a little more overt.  You're being down voted because your comments are viewed as not pertaining to the discussion \n\nI wish you no ill will but seriously  take a hint buddy ", "created_utc": 1487037304, "id": "ddppkk4", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpp01v", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anonbojackfan1991", "author_flair_css_class": null, "author_flair_text": null, "body": "every doctor and nurse I've seen said just go to the OB clinic with my card and they should have them there, but they aren't always right. If not, I might just take up an offer by someone else to pick me up a pump even if its just a little hand one. ", "created_utc": 1487037621, "id": "ddppt9k", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpp19k", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RedditHatesLurkers", "author_flair_css_class": null, "author_flair_text": null, "body": "My little one is 3.5 months old right now, and I, like you had a c-section.  Those early days were difficult and I cried many times, I was so exhausted from not sleeping and nursing all the time.  Many ladies have given you great advice already, but there is one thing that kept me motivated through it all.  Being complimented.  When my LO started gaining, I was told \"Good Work!\" by both the pediatrician and the lactation consultant.  It seems so simple, but those words were so beautiful and meaningful to me and were enough to keep me working at it.  So from one mama to another, Good Work!", "created_utc": 1487037855, "id": "ddppzm7", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Emilia0659", "author_flair_css_class": null, "author_flair_text": null, "body": "Hey there! \nI had my little man almost three weeks ago and I had similar frustrations. \nI took a syringe and put warm formula in it. While he was latching or trying to latch, I would sneak the tip of the syringe in his mouth and give him a bit of formula. It helps trick them into thinking they're nursing without the worry of formula attachment or nipple confusion. \nYour milk will come in soon. Don't worry!", "created_utc": 1487038294, "id": "ddpqbqv", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bcgirl99", "author_flair_css_class": "green", "author_flair_text": "3 boys 4, 2, and 11 months", "body": "That might be based on your insurance or the clinic you're using so maybe I'm just used to where I live and my insurance. They very well could know what your insurance has. ", "created_utc": 1487038690, "id": "ddpqmvn", "link_id": "t3_5tu3r7", "parent_id": "t1_ddppt9k", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cristinann", "author_flair_css_class": null, "author_flair_text": null, "body": "My baby just turned one and we use a white noise machine every night. It is seriously a big help!", "created_utc": 1487039145, "id": "ddpqzem", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpmnz8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SpecialSnoflake", "author_flair_css_class": null, "author_flair_text": null, "body": "The reason to be calm is mirror neurons. I don't know if you have heard of the Borg, but think of yourself still as one person, that's where a newborn's brain actually is developmentally. It's not called the fourth trimester for no reason. Learning and reading about mirrors neurons helped me focus on being relaxed. This stage is not forever. Good luck and congratulations!", "created_utc": 1487039345, "id": "ddpr4xw", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp4ync", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "He might also get a little overstimulated being held all the time. At about two weeks my baby actually wanted to be put down for a few minutes but the transition made him so sad! He'd fuss for maybe one minute then settle down a look around or take a five minute cat nap..long enough for me to pee or heat up a plate of food sometimes. ", "created_utc": 1487041403, "id": "ddpsphq", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp53in", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! My boy spent a week in NICU and we had to bottle feed some formula for reasons, on top of breastfeeding, and he went back and forth no problem. The pediatrician said nipple confusion is not really a thing. Sure, some babies have a preference, but introduction alone won't discourage nursing. We made it six months then I just couldn't handle pumping anymore...but in those early days a little two ounces ready-made formula container saved my sanity so my husband could feed while I napped!", "created_utc": 1487041632, "id": "ddpsvxe", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpbh5z", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "brookelm", "author_flair_css_class": null, "author_flair_text": null, "body": "This makes me so happy to read. Sleep is healing; I hope you get more of it in the days ahead. ♡", "created_utc": 1487043513, "id": "ddpub9o", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpp0g0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt;  It's not appropriate for a science enthusiast to butt in and criticize the mother who's struggling and the women trying to help. \n\nwtf? When did I criticize anyone? I asked whether a certain factor might be the cause of her problems... man... way too much sensitivity here.\n\n&gt;arguing with women who are either trained or have experienced this first hand\n\nI'm not arguing... I **asked** someone who seemed knowledgeable. \n\n&gt; You're being disrespectful to OP and the rest of us who on this topic know more than you \n\nwtf... seriously... what the hell...", "created_utc": 1487044178, "id": "ddpusri", "link_id": "t3_5tu3r7", "parent_id": "t1_ddppkk4", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thisgirlseriously", "author_flair_css_class": null, "author_flair_text": null, "body": "Have you tried checking him for tongue tie?  It can even be a hidden version. I have friends who had the underside of their baby's tongue clipped (drs do this) and the same day HUGE difference in how the baby eats.  Drs do often miss tongue tie so you have to be really persistent sometimes :/. \nAlso I promise it gets easier! Don't be so hard on yourself!", "created_utc": 1487045181, "id": "ddpviya", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "snoogle312", "author_flair_css_class": null, "author_flair_text": null, "body": "My son had a sloppy latch in the beginning and I actually cried many times when I nursed him. I started pumping to give my nipples breaks to allow the blisters he caused to heal. If your breasts feel exhausted from the constant nursing but you want to keep breast feeding I suggest going this route. Pump as much as you can. \n\nSeriously though, you need to sleep. You won't be getting a lot, that's just early motherhood for you, but pump a bottle and let dad watch him for 3 hours while you conk out. Your body won't produce much milk if you don't get any sleep. Not to mention that any amount of weepiness or frustration you have is only going to magnified by 10 if you are this tired.\nExperiment with different nursing positions as your incision heals. I stuck to football style in the beginning when my incision was still fresh, but you'll find that you can get creative with how you nurse, you can even find positions you can get a couple winks in during!\n\nIt all gets better. I know everyone says this, but you need to trust in it right now. As time goes on you'll both be more confident and find your stride. ", "created_utc": 1487045518, "id": "ddpvs8a", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "snoogle312", "author_flair_css_class": null, "author_flair_text": null, "body": "My nipple shields did very little, they ended up being more of a hassle than anything. Apparently the fit is very important, so people often have to try a few brands before they find one that works. I just couldn't be bothered to back then. One of the things I found was that once your nipple becomes sore from a poor latch, it will stay feeling like that for some time. Also, it's possible to have a poor latch that isn't externally visible and still provides adequate milk transfer; this was my big problem. Lactation consultants saw nothing wrong from how my son appeared to be latching, he was gaining weight at a good rate, but I was getting blisters on my nipples so I knew he wasn't latching properly. All you can really do is  reposition them if you feel pain. Try pulling his chin down gently with your thumb with one hand, while inserting your nipple with the other. The hand on the nipple should gently squeeze it to flatten the height of the areola down.", "created_utc": 1487045978, "id": "ddpw4r0", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp51l8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "boringbluesocks", "author_flair_css_class": null, "author_flair_text": null, "body": "IT. GETS. SO. MUCH. BETTER.\nI promise.\nHang in there.\nTry a lactation consultant, even if you had one at the hospital. I had to see one like 3-4 times before we finally got it down, and at one point got so frustrated I kicked my boppy across the room. Try a noise machine to help the baby sleep a little longer. If you can't afford one, you tube has videos you can play. This was our favorite: https://www.youtube.com/watch?v=rVzDnzjvivA.\nTake time for you - whatever time you can get, whenever you can get it.  If you are at your wits end and the baby is crying non-stop and no one is there to help you - it is ok to walk away for a little bit. Whatever you do - don't beat yourself up. ", "created_utc": 1487047022, "id": "ddpwvf0", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "https://www.youtube.com/watch?v=rVzDnzjvivA"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487047170, "id": "ddpwz29", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpusri", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rebel_girl_jaxi", "author_flair_css_class": null, "author_flair_text": null, "body": "The first week I had my daughter home the same thing happened. I couldn't sleep, eat, shower or use the bathroom without her screaming. She fed and fed and fed and fed. And it hurt So, So bad! I was alone, no lartner, 800 miles from my family it was miserable. BUT it got better. Sometime during the second week I started co sleeping with her in my bed. I know everyone says not to but it worked for us. I wish you the best mama. My baby will be 6 this month. ", "created_utc": 1487047248, "id": "ddpx10u", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "leftwinglovechild", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously. \n\nHang in there OP. This is totally normal and you're going to get through it. ", "created_utc": 1487050326, "id": "ddpz0cb", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpddfp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mudkipmurron", "author_flair_css_class": null, "author_flair_text": null, "body": "My biggest advice is just keep going. after the second week bf got so much better!We are still going at 18 months. ", "created_utc": 1487056749, "id": "ddq27fd", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fractalfarmer", "author_flair_css_class": null, "author_flair_text": null, "body": "It sounds more like the baby keeps wanting to nurse because they are a newborn and that's the way newborns are, to be honest. Babies that young feed little and often - their stomachs are tiny, and it's also their main source of comfort. Frequent nursing in the early days is also how supply is established.\n\n Stop trying to scare her over something that's more likely than not a totally normal phase of development.", "created_utc": 1487063806, "id": "ddq4sih", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp30q6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "I've never heard that phrase for it but my mum said that for all 5 of us on day for she was super teary. ", "created_utc": 1487068796, "id": "ddq6bzc", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpddfp", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "It is maybe possible, but there's no reason to think this is at all likely. It's called cluster feeding, and it's really common. ", "created_utc": 1487068914, "id": "ddq6d9a", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp30q6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "But are you in any way qualified to work out what is up? If she gives you her diet what makes you able to tell if it's appropriate for a breastfeeding mother? Or are you just coming in and taking a shot in the dark based on no info, because if that's the case that is very patronising. ", "created_utc": 1487069155, "id": "ddq6fxb", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpf5nd", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Sunna3", "author_flair_css_class": null, "author_flair_text": null, "body": "I second that there is usually a cluster feeding at about 6 days. Have you thought about side lying nursing? It was a life saver for me once I figured it out.  \n\nIt's tough but it gets better.  But maybe try to do something for yourself, too.  Can someone hold baby for you so you can take a shower (if you're up to it)  or have a glass of coffee/tea. \n\nI'd also suggest looking for a La Leche League that's local. We have a bunch of free breastfeeding resources in Des Moines, maybe you have something similar near you. ", "created_utc": 1487072412, "id": "ddq7igv", "link_id": "t3_5tu3r7", "parent_id": "t1_ddp51l8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jemjabella", "author_flair_css_class": null, "author_flair_text": null, "body": "My \"babies\" are 7 and nearly 5 and still sleep with a fan on in their room for the noise. ", "created_utc": 1487072601, "id": "ddq7kt4", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpmnz8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "Bad health and poor diets are very common too though. ", "created_utc": 1487079663, "id": "ddqasqg", "link_id": "t3_5tu3r7", "parent_id": "t1_ddq6d9a", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bcgirl99", "author_flair_css_class": "green", "author_flair_text": "3 boys 4, 2, and 11 months", "body": "So happy that you got sleep!  That plus pumping will be a game changer for you. \n\nOne bit of advice I give all new moms. Be gentle with yourself.  There's this great quote that I think sums up for me one of the biggest challenges of new motherhood. \"It's the picture in our head of how things are supposed to be that screws us up the most\"\n\nIt's not always pretty, we're not always happy to deal with the child/ren  we live so dearly.  Some days it's a total slog.   That's not being a bad mom and it doesn't mean you don't love your baby!\n\nGood luck I really hope things turn around. As far as I can tel you are doing all the right things! ", "created_utc": 1487079753, "id": "ddqaukd", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "Not trying to scare anyone... Jesus...", "created_utc": 1487081685, "id": "ddqc16z", "link_id": "t3_5tu3r7", "parent_id": "t1_ddq4sih", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kari2ten", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm so happy to read that all of these other amazing women have offered you support, and that you have gotten some rest and are feeling better.  I came here to post a link to my favorite postpartum web organization : http://www.postpartum.net/, and to send more love and good luck your way!", "created_utc": 1487082218, "id": "ddqce26", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "url": "http://www.postpartum.net/"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487083809, "id": "ddqdiz2", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpusri", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Kozinskey", "author_flair_css_class": null, "author_flair_text": null, "body": "This is great news! Hang in there and keep figuring out ways to get a few hours of real sleep when you can. \n\nOne thing you'll hear a lot is \"baby's not giving you a hard time, he's having a hard time.\" That helped me a lot in the early days when I was getting frustrated. Being a baby is really hard and they don't know how to express their needs other than crying (or screaming). Baby girl and I definitely had a couple days where I just gave up and we both laid down in my bed and cried at each other. It didn't last forever =)", "created_utc": 1487084203, "id": "ddqdtew", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpp0g0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "toomuchweightloss", "author_flair_css_class": null, "author_flair_text": null, "body": "Then please take it from a moderator of this subreddit that indeed, this is a subreddit for mothers only. I'm not interested in your arguments or posturing, which have frankly derailed this thread enough (even AFTER I had to clean it up once). So this time, I'm pruning back all the way to your original comment. If you start the argument again, you will be banned. ", "created_utc": 1487108125, "id": "ddqytul", "link_id": "t3_5tu3r7", "parent_id": "t1_ddpp01v", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MaximilianKohler", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; indeed, this is a subreddit for mothers only\n\nSounds like an important thing to add to the sidebar.", "created_utc": 1487114276, "id": "ddr41xx", "link_id": "t3_5tu3r7", "parent_id": "t1_ddqytul", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LL1018", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel like I wrote this. I had my son October 18th he's now a few days shy of 4 months. Couple things. \n\n1: I got a C section too, had to because I had an infection.  My healing time was great though, and in the end was happy it happened.\n\n2: I think it was the infection that caused my low milk supply, and looking back I wasn't drinking a lot of water. Those first couple weeks felt like I was in the Twilight Zone.  He was huge at birth, 10 pounds 5 oz.  But he kept losing weight. I took fenugreek and blessed thistle was on Domperidon as well and nothing worked. I started supplementing a bit at a month and after awhile I couldn't handle his hunger and seeing him drop weight.  So at 6 weeks I went to all formula.\n\n3: I felt super guilty for a long time that I stopped breastfeeding.  I was obnoxious and was sure I would have no problems and I felt like less of a mother when I quit, but he started thriving and he now weights 19 pounds.  The fact of the matter is, if you get to that desperate point, you have to do what's best for you, because by helping yourself you are also helping your baby.\n\n4: Quick story, my grandmother lost her first baby in the 40s, she went full term and ended up getting toxemia. The baby died at birth when my grandmother went into a coma for a couple days. Sorry for such a horrible intro, but she had a cousin who had had a baby about a month or so before her. She thought the baby was just a fussy baby, but the baby ended up dying as well around the same time my grandmother's did. He died of starvation, at that time there was no help after you had the baby and people didn't know you could get low supplies. This is why they make Formula, not because if you supplement or solely feed formula you are a bad mother, but because babies would starve without it sometimes. \n\nFed is best, and so it your mental health. Do what's best for you.", "created_utc": 1487172107, "id": "ddrz6zx", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "reynacrystal94", "author_flair_css_class": null, "author_flair_text": null, "body": "Seriously it will get so much easier! And about the side feeding, I wouldn't worry too much if your unable to right now. My daughter is now 2&amp;1/2 months and she just started latching in that position (which makes it easier). It's hard right now but once you hit those 6 weeks you'll realize how special the bonding is between you and your baby. Also the fact that your giving him the healthiest form of food is a great feeling. I'm so thankful I stuck to it especially thinking how you don't have to worry about getting up to warm up a bottle in the middle of the night, you'll actually end up getting more sleep than bottle fed babies since you'll be able to just pop a boob out. Just close your eyes and take a deep breath and tell yourself this is tot the best and will get better, good luck!! ", "created_utc": 1487219166, "id": "ddt284y", "link_id": "t3_5tu3r7", "parent_id": "t3_5tu3r7", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}