{"submission": {"author": "OurBase", "author_created_utc": 1390177949, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_evwpi", "brand_safe": false, "contest_mode": false, "created_utc": 1487446079, "domain": "self.Mommit", "edited": 1487469631, "full_link": "https://www.reddit.com/r/Mommit/comments/5uu4f8/mothers_of_reddit_what_do_you_wish_you_were_told/", "gilded": 0, "id": "5uu4f8", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 95, "over_18": false, "permalink": "/r/Mommit/comments/5uu4f8/mothers_of_reddit_what_do_you_wish_you_were_told/", "retrieved_on": 1489564294, "score": 73, "secure_media_embed": {}, "selftext": "Mothers of Reddit - \n\nMy sister (who is basically half a mother to me - she is the best!) is due in one month. She has been reading up on a lot of books to get ready, but is still pretty nervous about the actual giving birth process.\n\nI was hoping I could do something for her, or get something for her to make that process as painless (but still memorable in a good way) as possible.\n\nBeing a guy myself and quite inexperienced, I am turning to you all for your advice. What would you have like to have been told or what would you like to have had going into your first time giving birth? \n\nThank you!\n\nedit:\nDidn't receive any responses on /r/askreddit, so I'm trying a more specific subreddit. Would really appreciate any advice or suggestion!\n\nsecond edit:\nThank you all so much for each and every post. I'm a bit shocked that it sounds like it hurts a lot more than people make it sound, because honestly it sounds like a lot of people keep telling her it won't be as 'bad' as people say, so it seems like the opposite is kind of true. Learning a lot about small things like padcicles and all the little extras you can do to make things more comfortable. \n\nI will take the time over the coming days to respond to everyones' thoughtful advice and comments, so apologies if you don't get a response right away! I've been checking them on the comments in my spare time on my phone, and the overwhelming number of comments and replies I've received so far is really wonderful. Thank you all so much!\n", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "self", "title": "Mothers Of Reddit, What Do You Wish You Were Told / What Do You Wish You Had - Gift, Type Of Support, Etc. - Going Into Giving Your First Birth?", "url": "https://www.reddit.com/r/Mommit/comments/5uu4f8/mothers_of_reddit_what_do_you_wish_you_were_told/"}, "comments": [{"author": "rstan25", "author_flair_css_class": null, "author_flair_text": null, "body": "Been told: Yeah, your tailbone might break. Or less of the sugar coating and more hard realities about labour and birth. \n\nTo have: Seriously, buy her a really good lip chap. Out of all the stuff I packed in the hospital bag, it was the only thing I used. Your lips get so chapped! ", "created_utc": 1487447458, "id": "ddwv7aq", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "little_green_lamb", "author_flair_css_class": null, "author_flair_text": null, "body": "Has she come across the word \"transition\" to describe a phase of labor?  It comes just before pushing and it feels like you're dying (at least it did, for me).  Very, very painful.  It made me panic and I wish that someone in the room had used that word: transition.  \n\nI ended up with an emergency C section because I begged for a last-minute epidural during the painful part.  You have to sit perfectly still when the needle goes in, and sadly I felt my first urge to push as I was sitting there about to receive the injection.  Essentially I'd made it past the hardest part and gave up too soon.  The medicine threw my body off and I lost the urge to push.\n\nI don't know how you personally can make use of this advice except to pass it on to the mom-to-be and suggest that she put clear instructions in her birth plan requesting that nurses and her support network use the word \"transition\" to explain to her what she's going through if and when she starts to panic.  I often wonder if I'd have been able to summon more strength is somebody had something more meaningful to me than, \"Just breathe.\"\n\nAlso, if anyone in the delivery room is going to be uncomfortable seeing her screaming and cussing and begging for relief, don't have them there in the first place.  My mom cowered in the corner because she'd never seen her brace daughter reduced to such a state, and it really didn't help the vibe that people were so worried for me.\n\nThe nurses and doctors will know if something is actually wrong.  So don't let the woman giving birth freak you out if she seems like she's not gonna make it.  Try to beat in mind that the birthing process is disorienting for her when it gets heavy.  What she needs are calm, confident people who know what she knows about giving birth, people who read the same books, prepared with the same classes, and can use language that will be buried in the back of her head when she needs someone to get through to her that this too shall pass and everything is going well.", "created_utc": 1487447477, "id": "ddwv7qr", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "brookietrout", "author_flair_css_class": null, "author_flair_text": null, "body": "The birth will come and go quickly. I found the things I needed were things for afterwards. \nI really liked a comfortable robe (with pockets)  that I wore a LOT in the first 6 weeks (especially if she is planning on nursing). Or, drop off a few freezer meals or meals in the week(s) after the baby is born since she will be in a sleep deprived haze.\nFor the baby I have little clay hand prints from both my kids that I treasure. The baby will grow SO fast it's a reminder how tiny they were! Or, for something less personal but JUST as appreciated by her; a gift card for a newborn photo shoot with a photographer. It is always a welcome gift (if you do this tell the photog when the baby is due, and remind your sister to book shortly after the baby is born). Good luck!\n", "created_utc": 1487447563, "id": "ddwv9sf", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "tana-ryu", "author_flair_css_class": "red", "author_flair_text": "Mother of Madame Mayhem", "body": "Have her come here. Even if it's just lurking. This is one of the best places to be as well as /r/babybumps.\n\nThat being said, let her know that every mother is different and so is every baby. Nothing is like it is in the movies or books. Make sure she takes care of herself so she can take care of baby too. If you want to help her, go by her house and make dinner or bring food. One of the things I wish was that the only thing I had to worry about was me and my baby. Not laundry or dishes.", "created_utc": 1487447618, "id": "ddwvb3b", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "MrsAl-Molky", "author_flair_css_class": null, "author_flair_text": null, "body": "You will never be the same person again, it will be exhausting and probably the most painful experience of your life, but it will be totally worth it. ", "created_utc": 1487447651, "id": "ddwvbva", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "lather_rinse_repeat_", "author_flair_css_class": null, "author_flair_text": null, "body": "Bake her oatmeal cookies for post-birth. I found a good oatmeal chocolate chip cookie was the perfect thing to eat one-handed while nursing because I was SO hungry while nursing. ", "created_utc": 1487447840, "id": "ddwvgkd", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "dj_meowmix", "author_flair_css_class": null, "author_flair_text": null, "body": "This! Having a portable one handed thing to eat at home in the early weeks helped me so much more than I thought it would. Cookies are a good idea!\n Before my baby came I spent some time preparing some frozen breakfast burritos. They lasted me about two months and I was eating them a lot because of how hungry nursing made me. Heat it up 2 minutes in the microwave, instant healthy food. I packed it with veggies and eggs and used whole wheat tortillas so i didnt feel guilty eating them. It was amazing.", "created_utc": 1487448219, "id": "ddwvpvd", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwvgkd", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "g00d_day_sir", "author_flair_css_class": null, "author_flair_text": null, "body": "Told - No matter what your plan is, how prepared you are - birth will never be what you expect it - don't stress to much about \"knowing\" what it will be like and just lean into the lack of control; more practically - I wish I had been told I could call in for a sleeping pill - I had contractions straight for 3 days and therefore did not sleep for 3 days straight prior to going into labor, not a good way to start things off...\n\nHad - I actually did this - I got a pedicure right around the due date. It cheered me up to look at my toes looking pretty during the beginning of labor when things were less intense", "created_utc": 1487448515, "id": "ddwvx28", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Amypron", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish someone would have been on call to bring me delicious food after birth. I was starving, both times, and the hospital only had shitty snacks because I delivered outside of cafeteria hours. \n\nOther things I liked in the hospital: a pillow from home, slippers, comfy jammy pants. \n\nGoogle search how to make padcicles, if she delivers vaginally. It feels like you've been punched 400 times in the vag for at least a week, and more if you've got stitches. Yikes! ", "created_utc": 1487449152, "id": "ddwwcp0", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "Offer to come do *set list of approved tasks* regularly. Like bring an easy meal, do the dishes, wash/fold laundry (if that is okay with her), hold baby while she showers/naps.\n\n- She needs Tucks pads. They are great for the downtown area after baby.\n- And ridiculously large maxi pads.\n-plain soft, cotton undies she won't care about dumping/ruining\n- Remind her everything in the room is hers! Those bed pads in particular were indispensable.. in fact my two are 3 and 1.5 and we still use the bed pads as drop cloths, potty training anything protectors, and when they were slugs, as tummy time and nakey time mats, sponge bath mats, leaky boob bed protectors, lochia insurance covers, changing mats...\n-the book Eat, Sleep, Poop is really factual and has a great symptom checker and medication dose chart.\n\n\n", "created_utc": 1487450370, "id": "ddwx6bq", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "SashWhitGrabby", "author_flair_css_class": null, "author_flair_text": null, "body": "No one REALLY tells you much.   \n\nThings I wish I had: chopstick, my favorite drink (for after, even if it's just a tea or soda), my own pillow from home, warm socks and a robe.   \n\nHelp that first week or so is nice. Dinner for the new mom and dad. Even if you only stop by for 30 minutes or an hour, that'll give her a break to shower or eat. ", "created_utc": 1487450385, "id": "ddwx6oq", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "matrem_ki", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly? That after the entire event, I didn't give a flying CRAP what had happened. I had my baby. I actually forgot a lot of the details of my labor and had to be told about most of it. The moment I saw her I started crying like a... well... baby! After that? I didn't remember much. Seriously, once I had her *nothing else mattered*. I don't remember what I had been afraid of beforehand. I don't remember if any of it happened. I just remember seeing my little girl. \n\nLater though, I was told that I pooped on my mom. So... there's that.", "created_utc": 1487451173, "id": "ddwxpx6", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "MrsBizzle", "author_flair_css_class": null, "author_flair_text": null, "body": "What I wish someone had told me: Parents have been screwing up for centuries. You'll make mistakes, and it'll be just fine. Kids are insanely resilient and will love you all the same.", "created_utc": 1487452529, "id": "ddwymlx", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "dinozaur91", "author_flair_css_class": null, "author_flair_text": null, "body": "I took a birth class before I had my little girl (only 3 weeks ago, so it's still pretty fresh on my mind). Probably one of the most helpful things I learned was to move around/change positions throughout labor. In fact, going on a short walk with my husband was what really helped me go from early to active labor. \n\nAs far as getting her something...During the actual labor/birth, I guess two things that really helped me were a birthing ball (many places may already have them available) and a warm rice sock that my husband held against my lower back, granted, I did have back labor, but it might still be helpful and relaxing regardless. After the birth, one thing I've relied on a lot is the book Caring for Your Baby and Young Child. It helped put my mind at ease with everything going on with the baby, whether it's cluster feeding, birth marks, or even the color of her poo. \n\nGood luck to your sister! I found birth to be a very intense experience but not scary like I had previously thought it would be. And it's so incredibly rewarding.", "created_utc": 1487454406, "id": "ddwzvr4", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487454659, "id": "ddx01tk", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "tojesussincerely", "author_flair_css_class": null, "author_flair_text": null, "body": "Okay, so we went to the birthing classes and learned all about what it would be like, how it starts slow, how to breathe through it and everything.... And my labor started hard and fast with contractions less than 5 min apart. My baby was born in 2.5 hours. I wish someone had told me that every birth is different so you really can't know what to expect. I kept thinking, this isn't it, this isn't anything like they explained.  But also not to panic because your body knows what it's doing. And that the pain is scary, but it feels so purposeful. And encouragement! Just: you can do it! Would be helpful 🙂", "created_utc": 1487454779, "id": "ddx04nc", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "missamberlee", "author_flair_css_class": null, "author_flair_text": null, "body": "When I checked in, the first thing the nurse did after getting us in our room was hand us a menu and called the cafeteria to place our order since she knew they'd be closed by the time I gave birth. Was very thankful for that. Our room had a mini-fridge too so we kept the food in there until needed.", "created_utc": 1487454890, "id": "ddx07c2", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwwcp0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "missamberlee", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes! I was going to mention chapstick. My lips got so dry they cracked right down the middle. I had to ask a family member to bring me chapstick and throat lozenges. All that heavy breathing will take a toll, unless you have a mercifully quick labor.", "created_utc": 1487455052, "id": "ddx0bgv", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwv7aq", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Perpetualflirt", "author_flair_css_class": null, "author_flair_text": null, "body": "Go with the flow, let go of expectations and plans, bring socks and stretchy clothes, and a white noise machine.", "created_utc": 1487457913, "id": "ddx28r7", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Trexy", "author_flair_css_class": null, "author_flair_text": null, "body": "When I got home from the hospital, a woman from my church came over and deep cleaned our kitchen and bathroom. I am incredibly thankful for this even a year later. \n\nWould your sister be interested in a Tens unit? I had one for my labor and it definitely helped take the edge off for a while. ", "created_utc": 1487458019, "id": "ddx2bcw", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Moraii", "author_flair_css_class": null, "author_flair_text": null, "body": "Nursing pillow for at the hospital.  Whether she bottle feeds or nurses, it will save her sore back.\n\nAlso, an extra pillow from home to sit on in the hospital bed.  Where the bed goes up and down the mattress is thinner, it also happens to be where moms poor abused tailbone will be.  \n\nA towel from home, the hospital ones are horrible.\n\n\nJust all the soft comfy things really.\nHeck, smuggle in a kitten.\n\n\n", "created_utc": 1487458299, "id": "ddx2i5q", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "astrodog88", "author_flair_css_class": null, "author_flair_text": null, "body": "Food that can be microwaved and does not make dirty dishes.\n\nCleaning.\n\nGoing to the grocery store.\n\nLaundry.\n\n", "created_utc": 1487458613, "id": "ddx2psv", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Cryingbabylady", "author_flair_css_class": null, "author_flair_text": null, "body": "I so wish I had found the budget for cleaners. It's hard to budget for but would have been so so nice if I could have someone come and clean. Even if it wasn't my whole house - just the kitchen and the bathroom. \n\nBesides that, I loved freezer meals or freshly cut fruit!", "created_utc": 1487458753, "id": "ddx2t8j", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "daradv", "author_flair_css_class": null, "author_flair_text": null, "body": "This is helpful. Luckily people were telling me about transitioning when it became obvious that I was willing to get the cervix checked 15 min after having the doctor last check me. It was incredibly uncomfortable to be checked because I was laboring sitting up and had to lay down and then the pressure. When I ASKED to be checked they knew it was transition and I went from a 9 to a 10 in about 15 minutes.", "created_utc": 1487460468, "id": "ddx3yw5", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwv7qr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "pleasuretohaveinclas", "author_flair_css_class": null, "author_flair_text": null, "body": "After I had an emergency c section, the things I used the most were a huge cup with a lid for ice water, coconut oil for my nips and the baby's skin, a lightweight long sleeve wrap/robe thing, and that's all I can think of for now.", "created_utc": 1487460659, "id": "ddx43cu", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Tundraww", "author_flair_css_class": null, "author_flair_text": null, "body": "To be honest the only things that I used during labor were ChapStick and slippers. I could have cared less about anything else. I honestly needed more support after. Seriously though on the ChapStick. There is a reason everyone on here is saying that!\n\nHave you thought of making a welcome baby basket? Or a welcome baby diaper bag? \n\n\nI would put items in for mom and baby. If I had a ton of money this would be what I would include as they are items I found the most helpful in the days following the birth. \n\n\n1. Halo snuza GO! Or other such movement\\ breathing monitor. This eased my fear of SIDS. Not entirely but when your exhausted and hormonal that extra safeguard helps. People don't seem to know about these! IT IS MY NUMBER ONE SUGGESTION!\n\n2. Bamboo nursing pads and Avent breast shells. When milk comes in and you are new to breastfeeding nipples get sore. The breast shells keep clothing from rubbing on sore nipples then when they get tougher the bamboo ones are soft and comfortable.\n\n3. Mothers milk tea. Traditional medicines and Yogi both make good ones. I prefer the yogi as it tastes like chamomile.\n\n4. Everyone forgets to get something for the mom. I got a necklace with the birth month stone and cute comfy socks. Can't really wear the necklace yet due to breastfeeding but I love it.\n\n5. CHOCOLATE! And other snacks...esp if breastfeeding. It makes you hungry!\n\n6. Lansinoh. It's lanolin and is awesome for sore nipples.\n\n7. White noise maker. There are lots of different kinds. I have a skip hop moonlight melodies owl. I love it. It has a nightlight that is awesome for night feedings. \n\n8. Baby books! Also some for her. Even puzzle books like sudoku. I'm in the middle of a cluster feed session so literally stuck on the couch for hours. Or net flix subscription.\n\n\n\nPretty much this would be a $200 Plus basket...but you could pick one main item and some lesser ones. \n\n", "created_utc": 1487460966, "id": "ddx4all", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "ninjamama32", "author_flair_css_class": null, "author_flair_text": null, "body": "I definitely agree with hiring a cleaning service for a bit. Some nice things I really liked were the three piece nursing host and a cute hospital bag. It was nice to have something pretty and I have used it a lot since.", "created_utc": 1487462446, "id": "ddx59kg", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Cristinann", "author_flair_css_class": null, "author_flair_text": null, "body": "Aw! That's great that your nurse planned ahead for it. My baby was born at 9:20 pm and we didn't get to our recovery room until 1:15 am, and I hadn't eaten in over 30 hours. My nurse smuggled me a turkey sandwich and little dixie cup of chocolate ice cream from the nurse's lounge. She was a saint. I was craving ice cream so badly while in labor! ", "created_utc": 1487463420, "id": "ddx5vwo", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx07c2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "MrsMaxxMurray", "author_flair_css_class": null, "author_flair_text": null, "body": "Food. Bring her or get delivered food! Thinking about cooking for yourself is the worst. ", "created_utc": 1487463475, "id": "ddx5x56", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "silverpixiefly", "author_flair_css_class": null, "author_flair_text": null, "body": "If your water breaks and it is a *slow leak*, shower and eat first.  The doctor insisted I go straight to the hospital, which makes sense.... but I wasn't having contractions. Once there I couldn't shower nor eat anything but Popsicles. I went in at 6 am and didn't deliver until after 10 pm. I was soooo hungry all day. Makes for crappy labor.", "created_utc": 1487463494, "id": "ddx5xl5", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487463950, "id": "ddx67xt", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "ACoolerUsername", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I had been more up front about my needs and wants for myself and my daughter. I wish my husband had been less of a pushover too. \n\nMy birth experience was pretty bad, I nearly had a seizure from being reclined too far (baby smothering my vena cava) during cervix checks and ended up with an emergency caesarean, which I was an hour late for. I was denied pain medication until I went back for the procedure and thus had a Foley catheter inserted with no lubricant nor pain medication. I still can't pee right. Afterwards, the nurses were rude and demanding and at one point my baby was not brought back to me for two hours after I asked for her (had her sent to the nursery to get some sleep). I was lectured and my baby was pinched (yes, pinched!) by a nurse. I was also denied extra diapers when she had run out and was forced to walk out of the hospital instead of the customary wheelchair. \n\nPlease please please be an advocate for your sister and help her stand up for herself. ", "created_utc": 1487464155, "id": "ddx6ckf", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "dubrow_alert", "author_flair_css_class": null, "author_flair_text": null, "body": "After she gives birth:", "created_utc": 1487464373, "id": "ddx6hjk", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Ren_san", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish someone had told me that my cervix would refuse to dilate until my water broke, that would have saved me a lot of time and pain...\n\nI agree with the top comment, though. The birth is not the issue; even though it's exciting and scary, it's over quickly. ", "created_utc": 1487464990, "id": "ddx6vfu", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "risa123", "author_flair_css_class": null, "author_flair_text": null, "body": "This is exactly what I got on here to write. I also delivered after the cafeteria was closed and after not eating all day I was starving! I still can't believe they don't have options for that. Bring snacks if you know you won't have someone to bring you food. ", "created_utc": 1487465139, "id": "ddx6ywd", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwwcp0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "mirmurmir", "author_flair_css_class": null, "author_flair_text": null, "body": "Pillows and GOOD, filling junk food. I was starving after delivery, all I wanted was a hamburger, but the hospital's were pretty shitty. I would've killed for some jack in the box.", "created_utc": 1487465307, "id": "ddx72qa", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "dubrow_alert", "author_flair_css_class": null, "author_flair_text": null, "body": "Things you could give her after baby is born:\n\n- Food: Snacks, warm meals, etc. Anything so she doesn't have to think about feeding herself because she will be too tired to cook or grocery shop. \n\n- Comfy clothes (robes, nursing tanks, comfy loose pants)\n\n- Time for her to take a nap. Come over to the house, load the baby into a stroller, and go for a little walk or something so she can rest for a minute. Even if you just walk up and down the sidewalk on her street for 30 minutes. That would be helpful. The key is to remove the baby for a little bit. As a mom, you just can't get good sleep with the baby in your vicinity (instincts and whatnot).\n\n- Time to run an errand out of the house if needed. Offer to sit with the baby so she can run to the store for a little bit, or something along those lines, if she needs to get out.\n\n- Help during outings. If she needs to go somewhere and has to bring the baby, offer to accompany her as an extra set of hands.", "created_utc": 1487465413, "id": "ddx7551", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "tinysmommy", "author_flair_css_class": null, "author_flair_text": null, "body": "Post baby? Food. And more food. Bonus if it's homemade or something other than frozen pizza or  fast food. Go to her house and clean the kitchen and do the dishes. Or go over a few days after she's home and bring food and clean something. Do that every week and you'll be the best bro-ham-uncle ever! ", "created_utc": 1487465581, "id": "ddx78yq", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487466801, "id": "ddx81j7", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "missamberlee", "author_flair_css_class": null, "author_flair_text": null, "body": "Wow, 30 hours is a long time with no food! That was nice of your nurse. My labor was only 24 hours, half of which was at the hospital. Everything was done in one room so no having to move for recovery. I definitely recommend doing a maternity ward tour before the birth for anyone new to the hospital. That way you know what to expect, what to bring, and the tour guide can answer any questions you may have. ", "created_utc": 1487466979, "id": "ddx85v8", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx5vwo", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "calamityjane41", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes yes yes to the towel!! I read that on people's hospital bag lists and sort of rolled my eyes but after my first post-birth shower it was like drying off with a piece of paper towel. Next time I will definitely bring my own towel!", "created_utc": 1487467669, "id": "ddx8lqy", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx2i5q", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487468921, "id": "ddx9eu6", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "dropastory", "author_flair_css_class": null, "author_flair_text": null, "body": "I think taking some kind of childbirth class is crucial - at least 12 hours worth. Lamaze is a great option. I did hypnobabies and I had a beautiful, pain free, unmedicated birth with a 10 lbs baby. It was hard work, but I felt super empowered by the whole experience. Books are okay, but a class can give you demos and hands on practice. \n\nAlso, get her a doula if she doesn't have one!! All the research indicates that mothers report experiencing less pain, fewer interventions and better outcomes when they have a doula. \n\nThough the birth is just the beginning, it is a big deal to a lot of women and can be traumatic without good support. It can also be transformative and empowering and an amazing bonding experience for mama, baby and partner. ", "created_utc": 1487469581, "id": "ddx9upr", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "ConvertsToMetric", "author_flair_css_class": null, "author_flair_text": null, "body": "[^(**Mouseover** or **click** to view the metric conversion for this comment)](http://fiddle.jshell.net/ConvertsToMetric/xhk4y5h5/show/light/?10%20lbs%20=%204.5%20kg%0A \"10 lbs = 4.5 kg\nPost feedback in /r/ToMetric\")", "created_utc": 1487469585, "id": "ddx9utc", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx9upr", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public", "url": "http://fiddle.jshell.net/ConvertsToMetric/xhk4y5h5/show/light/?10%20lbs%20=%204.5%20kg%0A"}, {"author": "mistixs", "author_flair_css_class": null, "author_flair_text": null, "body": "&gt; It feels like you've been punched 400 times in the vag for at least a week, and more if you've got stitches. Yikes!\n\nIt amazes me how many people genuinely believe that childbirth is \"only one day of pain\" and then it's all over &amp; it's only positive feelings and joy. \n\nLike, it's just astounding that people can really believe that you can have a *7-pound human being rip its way out of a bodily orifice* and then be in absolutely no pain after.", "created_utc": 1487470339, "id": "ddxaccy", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwwcp0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487471464, "id": "ddxb23f", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwv7aq", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "deept1", "author_flair_css_class": null, "author_flair_text": null, "body": "Also read about toilet paper. The hospital ones are thin and scratchy!", "created_utc": 1487472342, "id": "ddxbna3", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx2i5q", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Angrylillis", "author_flair_css_class": null, "author_flair_text": null, "body": "Honestly, it's jerks like me that spread that sort of nonsense. I come from a long line of easy birthers. Both of my kiddos were small, five and six pounds, and I had really easy labors both times. I stopped taking Advil after day 1. If I wasn't on the internet reading horror stories I might have believed that all women have it so easy. :/", "created_utc": 1487472915, "id": "ddxc06n", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxaccy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "silverpixiefly", "author_flair_css_class": null, "author_flair_text": null, "body": "Mine was not over quickly. Please tell me I am not the only one. ", "created_utc": 1487472936, "id": "ddxc0op", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx6vfu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "The first poop....\n\nNo the first week of poops.", "created_utc": 1487473676, "id": "ddxchsg", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxaccy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Ghibbitude", "author_flair_css_class": null, "author_flair_text": null, "body": "21 and 24 hours of hospital labor respectively here.. x.x\n\nBut in the grand scheme of things, one miserable day is short compared with 6 weeks of healing, 6 months of recovery, and 1 year of infancy.", "created_utc": 1487474030, "id": "ddxcpql", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxc0op", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487474244, "id": "ddxcuho", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx6ckf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "A lactation consultant, a good one, gift certificate would be awesome if she wanted to breastfeed, or a doula for the birth.  Or even just a photographer for the birth, I would have loved.  After, a maid service or meal service or Netflix.", "created_utc": 1487474259, "id": "ddxcutw", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "alexia_muriel", "author_flair_css_class": null, "author_flair_text": null, "body": "I found most people told me about labor but not how common it is to end up getting a c-section! ", "created_utc": 1487475616, "id": "ddxdowf", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx43cu", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LittleTeenyTiny", "author_flair_css_class": null, "author_flair_text": null, "body": "To not be afraid to say no to visitors in the following days post birth. \n\nBe prepared that once that baby leaves your body, it's totally not about you anymore. I was in a lot of pain and no one really cared lol it was kind of weird.\n\nIf you have to use formula get those formula dispensers and fill about 4-5 at night with 4-5 pre filled bottles of water on the night stand so mixing a bottle is super easy. It took us way to long to figure that one out.", "created_utc": 1487476793, "id": "ddxedub", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Maharei", "author_flair_css_class": null, "author_flair_text": null, "body": "If her support person is apt to giving back massages then some relaxing massage oil. I didn't bring oils but my husband and midwife (god bless her) rubbed my back while contractions were setting in until my epidural. I had back labour and decided on pain relief thinking I'd go in without anything.\n\nTo be honest i didn't feel like I needed much at the hospital other than maybe a comfy (but not overly hot) robe and maybe slippers. I used the hospital gown and was pretty much half naked most of the time while too tired to care.\n\nBut to echo previous posters...frozen meals as she will be too tired to cook most likely. \nBran muffins. (Seriously)\nOr a gift for home cleaning service because we ain't got no time for that.\n\nI also enjoyed soaking in the tub with bath bombs..etc once my stitches healed (3rd degree that little bugger). So she may enjoy that too.", "created_utc": 1487477772, "id": "ddxexgr", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "pleasuretohaveinclas", "author_flair_css_class": null, "author_flair_text": null, "body": "19 hours of labor, 3 hours of pushing then a c section. It was rough to say the least.", "created_utc": 1487479848, "id": "ddxg262", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxdowf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "KattyKaos", "author_flair_css_class": null, "author_flair_text": null, "body": "Don't ask just do it post baby. I kept refusing help saying, I'm fine, we're good, it's going great, but come midnight it didn't feel that way. Show up and fold some laundry while you talk. Wash the dishes while you chat. Just show up with a fav lunch or dinner. Just do it. That's the best help a new mom needs. ", "created_utc": 1487479901, "id": "ddxg36c", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Forever_Mrs_Young", "author_flair_css_class": null, "author_flair_text": null, "body": "Buy large comfy granny panties and very thick period pads. It was insane how much I bled over 3 weeks. \n", "created_utc": 1487480334, "id": "ddxgbkk", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Amypron", "author_flair_css_class": null, "author_flair_text": null, "body": "First time, I tore pretty bad, upwards. Fuck that. Second time, it was the nursing cramps. I didn't tear that time, and I hear the uterus shrinking is more painful with subsequent births... I'd have to agree. Both healing experiences were totally different for me. ", "created_utc": 1487481209, "id": "ddxgrxr", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxaccy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "EowynSister-Daughter", "author_flair_css_class": null, "author_flair_text": null, "body": "This. Someone warned me and told me to take stool softener beforehand, but I forgot about it. I nearly cried during the first poop, even after holding it for several days until it nearly fell out. ", "created_utc": 1487481441, "id": "ddxgw5m", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxchsg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "syncopacetic", "author_flair_css_class": null, "author_flair_text": null, "body": "If it hurts like your pubic bones are literally scraping together or your about to split in half after any pain meds wear off, ot whatevs, that might be more than just normal birth pain and actually be Symphysis pubis dysfunction. \n\n\nBasically: Never be afraid to ask if the pain you are in after is odd or too much. I went hours with a nurse belittling me before someone actually realized I was in so much pain my teeth were chattering. I just thought it was s", "created_utc": 1487482545, "id": "ddxhgak", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "annielane", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, this! Set up a time you come each day or each week and be there. In the beginning you can feel like super woman, hormones are powerful, then you crash. Knowing someone would be there at 2 (or whatever) would have been awesome. And make it such that you will come and hold the baby so mom can nap, or do chores, or cook a meal. There is so much to do and shockingly little time for a nursing mom. Work out a list before baby comes, then after baby ask if you can take the baby. If not, just work that list. Don't ask her to make decisions, just do. You are awesome!", "created_utc": 1487484563, "id": "ddxiefp", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxg36c", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "cardifan", "author_flair_css_class": "green", "author_flair_text": "3yo boy", "body": "Told: let the baby stay in the nursery and you SLEEP\n\nHad: hair ties", "created_utc": 1487489441, "id": "ddxkebc", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "maybetodayorwhatever", "author_flair_css_class": null, "author_flair_text": null, "body": "Nobody tells you about silent labour. You won't necessarily know you're in labour. Also, I wish I had brought a portable battery for charging my phone. There weren't any free outlets available in my room. ", "created_utc": 1487494568, "id": "ddxm4f9", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Citruslatifolia", "author_flair_css_class": null, "author_flair_text": null, "body": "A portable phone battery should be in every maternity bag list!", "created_utc": 1487508140, "id": "ddxq421", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxm4f9", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Citruslatifolia", "author_flair_css_class": null, "author_flair_text": null, "body": "Scary birth and pregnancy stories just made me anxious, so I wouldn't recommend going through every scenario, but I do recommend reading up on what may happen from an objective source.\n\nThings I wish I had been told:\n\n- Write a birth plan, but know it may not happen that way. The most important part of my second birth plan was the bit I wrote about being told of possible interventions that might be needed, how much of a chance there was of needing them, being given all the options and time to weigh them and make a decision. During the birth of my first, I felt that the midwives were worried about being supportive rather than informative, while suggesting options for a medicated birth instead of giving me all of the options. The birth plan is there to communicate with the birthing professionals, who may not know you personally, how you deal with stress, what you need to cope, etc. I would recommend writing it with that in mind, instead of writing only what your perfect birth experience would be (which is what I wrote the first time), because the moment you diverge from that plan, it becomes useless.\n\n- Keep moving during the first stage of labour. Lying down/sitting back make the pain worse (in my experience) and puts the baby in a more unfavorable position for birth. Sitting on a birthing ball is good, if it's the correct height (the one in my room was slightly too low for me, so I sat on a stool or walked).\n\n- Somebody explained about transition. The moment I told the midwife I wanted drugs and couldn't do it, she said that she knew I was about to do it because I had just said that. And then I did it, and it was the biggest relief I've ever felt. \n\n- I wish someone had told me about/emphasised cluster feeding. The first night I was home with my first baby (day 3 of his life), he wanted to breastfeed nonstop. I was going crazy from lack of sleep and called the midwives at the hospital, thinking something was wrong. They told me it was normal, he was helping establish my milk supply, and that it would pass soon.\n\n- Talk to a breastfeeding advisor, even if things are going well. They can give you valuable tips and correct slight mistakes. \n\nThings I found useful to have at the birthing centre:\n\n- Pregnancy bra/top in which to give birth. A comfortable, modest one that looked like a sports bra, but much softer. I took the black one, because I wanted a pool birth, and it wouldn't look transparent.\n\n- Shampoo, etc for a nice shower after the birth. Both times I gave birth, the first shower afterwards was heaven. I took a towel, like people recommend, but ended up using the hospital/birth centre's, because blood.\n\n- Flip flops. I knew they kept the place warm, so proper slippers wouldn't be needed, and you don't have to bend down to put on flip flops.\n\n- A portable phone battery!\n\n- Extra, extra sets of baby clothes. My second had 2 meconium poo explosions on our only night at the birth centre, and so used up all 3 sets of clothes before my husband could come back the next morning.\n\n- A dress (suitable for breastfeeding) for the first day. It's one piece and comfortable.\n\nHelpful things for when she's back home:\n\n- Help with household chores. Laundry, cleaning, vacuuming, cooking, doing the dishes, walking the dog...\n\n- Hold the baby while she showers.\n\n- Bring easy to eat food (anything she can eat with one hand or just a fork). Make sure it is filling. Husband and I once took some friends a homemade lasagna which was very appreciated.\n\n- A breastfeeding pillow (also useful for bottle feeding) and a water bottle.", "created_utc": 1487512221, "id": "ddxrn82", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "icontorni", "author_flair_css_class": null, "author_flair_text": null, "body": "One of the best reminders I continually tell myself.  My baby is 2 now.  She will never stop making mistakes, and it is benificial for your niece/nephew to see mommy make mistakes.  Mommy can be happy and nowhere close to perfect!  It is quite the important lesson.  So the guilt I have is more of a dull ache now than that all-encompassing stuff when my kid was a newborn.\n\nAlso, food.  If you are up to it, never stop bringing food when you come over to visit the first month or two.  I ate a lot of takeout the first four or five months.  ", "created_utc": 1487514797, "id": "ddxsumn", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwymlx", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "jem302", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband ordered a pizza to the hospital while I was in labour (lol). After vomiting everything I'd eaten the day before and enduring a 25 hour labour with no food, pizza in the recovery room was pretty awesome. \n\nOtherwise, I absolutely recommend helping her prepare freezer meals or bringing a meal when you visit after the baby is born. We didn't prepare any and really ate like crap for the first few weeks, other than the odd time someone brought something by. ", "created_utc": 1487518224, "id": "ddxupuz", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "sputnik_", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I had a nice electric breast pump. It would have been worth the fee to rent it, I think. I just had a manual hand pump, which took ages to fill one bottle. ", "created_utc": 1487518306, "id": "ddxurld", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "sputnik_", "author_flair_css_class": null, "author_flair_text": null, "body": "Lansinoh would be high on my list. I had no idea nipples could crack and bleed. That stuff was my best friend really lol ", "created_utc": 1487518613, "id": "ddxuyag", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx4all", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LadyJame", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes, food!  After I delivered my daughter, my sister came by and brought me an amazing ham and cheese sub.  I was starving and it was amazing.", "created_utc": 1487520446, "id": "ddxw41r", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwwcp0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "theredvixen", "author_flair_css_class": null, "author_flair_text": null, "body": "My Brother in law went out at 11:00 the night I delivered (delivered 9:59) and brought me back Wendys, I had been in labor since 7:00 that morning. To this day, that is the best burger &amp; fries I have ever had.", "created_utc": 1487523228, "id": "ddxxzyk", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwwcp0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "ROBE IS A MUST. I bought a navy one in case of stains and it's like a t shirt material but thicker, so it covered me without making me too hot. Stayed in it my two days in the hospital after delivery and 9m later I wear it constantly still. AND the belt is attached so you can't lose it!! Got it at Motherhood Maternity, worth every penny. No idea why you can't buy a robe like this anywhere but all I've seen are the fluffy ones that would smother me and baby. ", "created_utc": 1487525428, "id": "ddxzk0k", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwv9sf", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep, I started a stool softener the morning after I delivered. Proud to say (though I'm sure it's partly luck) that poop was a non issue for me. I managed a little happy dance when it required no sweating or tears!", "created_utc": 1487525500, "id": "ddxzlw4", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxgw5m", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "Yes!! So glad I brought my (dark) towel. That first pp shower was so glorious. ", "created_utc": 1487525556, "id": "ddxznci", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx8lqy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Roryab07", "author_flair_css_class": null, "author_flair_text": null, "body": "I tried so hard with my first to have a natural birth with no epidural.  I will sum it up by saying that I had an incredibly long labor and ended up getting it anyways, completely exhausted.  Then I had a five day stay in the hospital with my jaundiced newborn where I barely slept. I talked to my friend who had a similar experience with her first, a drug free attempt that ended in a c-section, and told me how with her second she got the epidural right away and spent her whole labor reading and chatting on the phone, and how much more she enjoyed it.  It made me wonder why I had felt so much pressure to go without an epidural in the first place.  So for number two, I got one as soon as possible and I slept through as much of it as I was able so I didn't have to start of having a newborn by missing a good night's sleep.  I woke up and they told me it was time, and I was like, already?  Had to stay for jaundice with that baby too, and it was so much more enjoyable to have a new baby when I wasn't physically exhausted before they even came out. \n\nThere is a lot of great advice on here that I agree with, and won't take up the space to repeat.  I just wanted to add to the conversation that there can be an awful undercurrent of competition for new parents: epidural vs med free, breast vs bottle, baby wear vs stroller, cosleep vs own room, cry it out vs attachment, and so on, and often each side will make out like they're better than the other.  It helps to be reminded that the most important thing is finding out what works best for your family so everyone can be happy and healthy.  That's not really something you can get someone, but unwavering support and a good perspective go a long way.", "created_utc": 1487525607, "id": "ddxzomb", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "I feel like I had ZERO surprises for labor and our first few days home because I read dozens of birth stories and coming home stories. Of course, I had what I thought was a super easy birth (with epidural) and a chill baby, but little things like small amounts of blood in the first couple of poops, swaddling techniques, having one handed snacks on hand...I could say to myself \"Just what baby bumps promised, here we are!\"", "created_utc": 1487525700, "id": "ddxzr02", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwvb3b", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "Buy her a cup with a lid and ALSO a straw that folds shut. So when she inevitably drops it or knocks it over it can't spill. I have three and that's all I used for months because nursing made me SO thirsty all the time. Even once I weaned, I tried to keep up my water intake to help lose some weight. It's practical, doesn't take up much room, and can be used well after baby isn't a baby. :)", "created_utc": 1487525918, "id": "ddxzwnq", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LoneStarTwinkie", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't recommend enough taking some time to read birth stories. Either on babybumps, podcasts, etc. Most of them are clearly marked if it was traumatic so she can avoid those and sticks to more run-of-the-mill ones. It was beyond helpful for me because in the hospital nothing surprised me. I knew to expect it would take an hour to get my epidural so I requested it a little before I felt I'd reached my limit. Also, if she's trying not to use drugs, something I heard on a podcast was that a woman had her husband time her contractions and once they saw she ran about 45 second each he was able to tell her at 20-30 second later she was halfway done and it was nearing the end. So she could keep focused...45 seconds certainly feels like forever but ten more seconds was something she could mentally handle. Bottom line; there are no bad choices, whatever she wants for herself is a good choice. The most important thing to my mind is having someone in the room who knows her preferences and will make sure the medical staff honors them as much as possible if she's too tired or focused to speak for herself. ", "created_utc": 1487526265, "id": "ddy05ld", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "dieter_the_dino", "author_flair_css_class": null, "author_flair_text": null, "body": "For me, the worst was the first two weeks after the birth. My body was doing all sorts of weird things and we were all adjusting to extreme sleep deprivation. Making sure she is stocked up on frozen meals and anything she can eat one handed would be a huge help. A giant water bottle with a straw is good, too. Also, doing all the non-baby related chores is immensely helpful. Take out the trash, do dishes, do laundry, vacuum, dust, whatever needs to be done. ", "created_utc": 1487526437, "id": "ddy0a2q", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "athwartthelotus", "author_flair_css_class": null, "author_flair_text": null, "body": "After you give birth your lady parts are going to be sore and a bit swollen. More so if she tears a bit. Get some newborn diapers, fill them with water and put them in the freezer (laying open like a feminine pad). When you get home, put one in your panties for a few minutes and it helps a lot with hemoroids, swelling and general discomfort. Throw away when done. They are the best thing I learn and a great way to help with pain management when you don't want to take meds because you're nursing. ", "created_utc": 1487526463, "id": "ddy0arz", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Ladyofthelake26", "author_flair_css_class": null, "author_flair_text": null, "body": "Same here, despite my daughter being a little bigger at 7 pounds 5 oz I found the actual birth to be a breeze (labour was another story) quick, easy, no stitches, no pain and very little bleeding for a day or two. \nAfter the first few days I felt completely normal. \nI did however see a lot of mums struggling in the post partum ward and all the nurses remarked on my easy recovery so I realised I was lucky. ", "created_utc": 1487526790, "id": "ddy0jhg", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxc06n", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "KnightsWhoSayNui", "author_flair_css_class": null, "author_flair_text": null, "body": "I can't decide between hemorrhoids, the gigantic bruise on my thighs or the pee burning on my stitches. \n\nOh, no, wait, the worst of it all was after seven days, when everything started to itch like crazy. Those padcicles were a godsend. \n\nLabor wasn't as bad as I thought it would be though.", "created_utc": 1487527012, "id": "ddy0pgg", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxaccy", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Mammabojamma", "author_flair_css_class": null, "author_flair_text": null, "body": "Do a birthing class or something IN PERSON. I thought I was so smart, taking the online one. Worst decision ever. \n\nI was struggling during labor (I wanted to go all natural), and luckily the labor coach lady( who I would have had the class with if I wasn't so stupid) was walking by and noticed how much pain I was in. She came in and helped me through it, teaching me how to breathe, focus on one point, etc. \n\nI was so grateful she came in, but I was so mad at myself for not just taking the classes in person! ", "created_utc": 1487528068, "id": "ddy1hir", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Lil_Bear", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish I was told that the time between contractions was actually counted from the start of one contraction to the next. So, I really didn't have 2 or 3 minutes to recover between contractions - it was more like 10 seconds. ", "created_utc": 1487528799, "id": "ddy20hn", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "crazy_cat_broad", "author_flair_css_class": null, "author_flair_text": null, "body": "From transition, I mostly remember sobbing and puking, at the same time lol", "created_utc": 1487532930, "id": "ddy50jx", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx3yw5", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "wlea", "author_flair_css_class": null, "author_flair_text": null, "body": "I survived with rubber gloves, diaper cream, a scented candle, and patience. But the hospital had industrial style to and no peribottle. Frightening stuff.", "created_utc": 1487533365, "id": "ddy5brv", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxchsg", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "wlea", "author_flair_css_class": null, "author_flair_text": null, "body": "I made [these](http://www.sweetamandine.com/2013/03/long-live-oatcake.html?m=1) (added chia seeds too) and froze them along with [these](http://www.thekitchn.com/recipe-museli-cookies-recipes-from-the-kitchn-201475) (added seeds and nuts). Worked out great and they lasted quite awhile.", "created_utc": 1487533952, "id": "ddy5qyv", "link_id": "t3_5uu4f8", "parent_id": "t1_ddwvgkd", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public", "url": "http://www.thekitchn.com/recipe-museli-cookies-recipes-from-the-kitchn-201475"}, {"author": "wlea", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I found that watching this [series on birth](https://youtu.be/j7YucfJuziU) (video 1 of 3) by a very entertaining Canadian midwife, Holliday Tyson, helped us understand what to expect without being frightening or preachy.", "created_utc": 1487534254, "id": "ddy5yyc", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public", "url": "https://youtu.be/j7YucfJuziU"}, {"author": "Angrylillis", "author_flair_css_class": null, "author_flair_text": null, "body": "For me it was really helpful to hear the \"this is what normally happens and here are the most common complications\" so I knew what could happen but wasn't freaked out. It was also nice to hear what issues were relevant to me. I'm a normal weight and very active so I was low risk for the stuff they could predict, so my doctor really stressed that because it was my first there were a lot of unknowns, but she could tell me what other women in my condition had happen. ", "created_utc": 1487535883, "id": "ddy75d7", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxb23f", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "jouleheretolearn", "author_flair_css_class": null, "author_flair_text": null, "body": "Bring over food, and offer to watch baby so she can nap or shower or both. There are a lot of good ideas on here, but this one regularly, like if you can plan on doing this at least weekly for the first year or so, she will love you forever.", "created_utc": 1487558708, "id": "ddynh5l", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Amypron", "author_flair_css_class": null, "author_flair_text": null, "body": "Wendy's is crucial! After 12 hours of failed induction, I slammed a double baconator which gave me so much energy for real labor haha. \n", "created_utc": 1487562916, "id": "ddyqcd3", "link_id": "t3_5uu4f8", "parent_id": "t1_ddxxzyk", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Farmers-wife", "author_flair_css_class": null, "author_flair_text": null, "body": "This. Especially number one. The biggest fear is your baby could die while you sleep if I woke up to use the bathroom in middle of night or if anything woke me up I would check on the kids before crawling into bed if I couldn't see or hear them breathing I had to put my hand in front of their face to feel them breath (even when it meant going upstairs when they were older). We at least have a monitor with video and a temperature thing on it I'm so glad hubs chose to get it worth every penny I would have loved an actual thing that goes on them cause that was the biggest fear until they turned one I don't even think about now that they are two. \n\nDefinitely nursing pads and will honestly say I used tissues with a lot of lanolin on between breast and breast pad because it didn't stick to it as much as the pad but pad was still better than the bra against it. \n\nIf she is planning to breastfeed she will most likely need support because it can be extremely hard for some people. Let her know you are there for WHATEVER she chooses and that what matters is the baby is healthy. Either way I had a couple fb groups that had women from around the world and it made me realize that two is actually a more normal age to wean (which makes me realize more why a handful of two year olds I know still have pacifiers) so I actually nursed my guys till a week or two over 2yrs old. I was very glad I nursed that long (especially cause I had to pump after they nursed for the first 10 months) but I was so happy that they were done when we stopped. Nursing will drain her. \n\nPersonally I very rarely drink anything but water but I did enjoy smoothies while nursing because it hey helped fill me up. I didn't get anything for myself nor want anything. I just like having my pictures and videos of them so I would say if she doesn't take pictures make sure someone does even if they are no professional pics taken just having the memories is nice (especially if you sneak a few of her with baby). \n\nNow for me, my guys made me dislike a lot of sweets (plus don't like chocolate to begin with) but if she is nursing she will definitely need quick food and a lot of water.  I watched the whole series of MASH on Netflix and I don't know what all else I watched I just knew that was a big one that I never watched until then because there was nothing else I could do. ", "created_utc": 1487563714, "id": "ddyqve0", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx4all", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Tundraww", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not big on sweets either! Its DARK bitter chocolate for me. The more bitter the better.\n\nI hope I can get to age two with breastfeeding. It sounds like a distant dream. I have until fall when I start full time classes. Hopefully I can pump enough.", "created_utc": 1487638707, "id": "de01eam", "link_id": "t3_5uu4f8", "parent_id": "t1_ddyqve0", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1487643844, "id": "de05a78", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Farmers-wife", "author_flair_css_class": null, "author_flair_text": null, "body": "Yea pumping stinks I had to pump after nursing my guys because when they actually had to \"work\" for milk they would unlatch and scream so I would just set them in boopys on the floor and pump while they drank milk from the last pumping session. Would have been better if the nurses would have listened to the lactation consultants at the hospital and pace fed them but whatever still worked and at least once they started to eat more solids there was more milk stored for morning and evening feed that it was so nice not having to deal with stupid bottles. I think that the 10 months of pumping is what mostly kept me going (plus it was nice in the morning to just sit in the couch and give them milk so they weren't all cranky but so glad that's done). Will say I think somewhere near 1.5 they only got milk in the morning and night I always had my guys on a schedule (obviously if they were hungry they would get milk sooner) but when they were eating solids and over a yr old I had it down to 3 feeds then the two then about 1-2 weeks before they turned two I took it to one morning feed then to none. They did like their milk but they weren't super attached (I was very glad because sometimes it would annoy me because they would scratch me or be pushing me or try pushing their brother and when I they were biting. Nothing more terrifying than when you have two set of teeth possibly ready to bite I was so on end during that phase. ", "created_utc": 1487648253, "id": "de08kcv", "link_id": "t3_5uu4f8", "parent_id": "t1_de01eam", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Tundraww", "author_flair_css_class": null, "author_flair_text": null, "body": "Lol yeah I would not fancy teeth any where near my boobs. Its why my mom stopped nursing me... I would not stop biting.", "created_utc": 1487648802, "id": "de08ybz", "link_id": "t3_5uu4f8", "parent_id": "t1_de08kcv", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "secretfriend-", "author_flair_css_class": null, "author_flair_text": null, "body": "One thing I wish I had gotten was a really nice hospital picture of me and my baby. I got pictures of other people, but there are none of me :(.", "created_utc": 1487726149, "id": "de1oqu3", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Kitten_Fiddle", "author_flair_css_class": null, "author_flair_text": null, "body": "Birth class told me contractions would be for about 1 minute, several minutes apart, then 5 minutes apart, then 3 minutes apart. They did not tell me I might have multiple minute contractions and less than a minute to recover between. For hours. \n\nThey told me it would hurt when the nurses \"massage\" your stomach to help deliver the placenta. Nobody told me just how much it will hurt if you are not delivering the placenta and the hospital staff is starting to worry about hemorrhage.\n\nHowever, after the birth I felt fine (other than tired). I was up and walking around the building to get my own food a couple hours later. It did take weeks to have enough energy to go on a nice long walk.", "created_utc": 1487800094, "id": "de31eni", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "k_tiara_von_lobster", "author_flair_css_class": null, "author_flair_text": null, "body": "**The best piece of advice I received immediately after childbirth: the only people who matter are you, your baby, and your partner.** Taking care of the three of you, making sure you are all fed and rested, will take all of your energy. Forget the outside world. You don't need to post to Facebook or answer emails. If you have a question you can text someone to answer it, but you are not obligated to do anything for anyone outside of your little family.", "created_utc": 1487972033, "id": "de6a43h", "link_id": "t3_5uu4f8", "parent_id": "t3_5uu4f8", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "emiliabeth", "author_flair_css_class": null, "author_flair_text": null, "body": "I second the Tens machine! I freaking loved that thing. ", "created_utc": 1488294150, "id": "debltjs", "link_id": "t3_5uu4f8", "parent_id": "t1_ddx2bcw", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}]}