{"submission": {"author": "adams977", "author_created_utc": 1488134357, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_15r1xc", "brand_safe": false, "contest_mode": false, "created_utc": 1488134560, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/5wblo1/what_was_giving_birth_like/", "gilded": 0, "id": "5wblo1", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 83, "over_18": false, "permalink": "/r/Mommit/comments/5wblo1/what_was_giving_birth_like/", "retrieved_on": 1489590650, "score": 34, "secure_media_embed": {}, "selftext": "[removed]", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "default", "title": "What was giving birth like?", "url": "https://www.reddit.com/r/Mommit/comments/5wblo1/what_was_giving_birth_like/"}, "comments": [{"author": "carnivorous_plant", "author_flair_css_class": null, "author_flair_text": null, "body": "I posted my [birth story](https://www.reddit.com/r/BabyBumps/comments/1k8wu6/birth_story_6_lb_6_oz_baby_boy_38_weeks_6_days_yay/.compact) to /r/babybumps . You way want to search for birth stories in that subreddit. A lot of people post those.", "created_utc": 1488135432, "id": "de8sz3j", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public", "url": "https://www.reddit.com/r/BabyBumps/comments/1k8wu6/birth_story_6_lb_6_oz_baby_boy_38_weeks_6_days_yay/.compact"}, {"author": "CrystalKU", "author_flair_css_class": null, "author_flair_text": null, "body": "I did too, from prospective of c-section and ICU stay. Labor itself feels like a Charlie horse in your gut, that's the simplest way to describe it.", "created_utc": 1488135518, "id": "de8t1fj", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "ImJustAGirl14", "author_flair_css_class": null, "author_flair_text": null, "body": "To a man? I would say like pushing a cantaloupe out of your butt hole while 10 people stood around you to watch. ", "created_utc": 1488136940, "id": "de8u46t", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "sendCookiesSTAT", "author_flair_css_class": null, "author_flair_text": null, "body": "Planned C-Section here, so I can confirm that birth feels very different in different circumstances.  I compare my experience to having my gallbladder removed, except then you bond with the gallbladder afterward and a nurse mashes on your incision repeatedly for a few days.  Eventually you name the gallbladder and you all go home together, bloated, sore, and tired. :-)", "created_utc": 1488137233, "id": "de8uc67", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "gobblenicer", "author_flair_css_class": null, "author_flair_text": null, "body": "Hilarious. Just snorted coffee everywhere.  ", "created_utc": 1488137351, "id": "de8ufd3", "link_id": "t3_5wblo1", "parent_id": "t1_de8u46t", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "ljuvlig", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a natural vaginal delivery. I enjoyed it. I say it was like going to a rave. Getting high and dancing all night. Plus pain, but everybody talks about the pain and nobody talks about the euphoria. \n\n", "created_utc": 1488137476, "id": "de8uip2", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "MissFuzzums", "author_flair_css_class": null, "author_flair_text": null, "body": "When I was being induced, the nurse put her whole arm inside my vagina and proceeded to tell me I'm \"compact\" and my cervix is WAAAAYYY at the back. She then did THREE 180 turns instead of the one she promised...I called her a liar and then went on to say \"What, you're not even going to buy me a drink?\"\n\nSafe to say I get nervous word vomit. \n\nThe rest of the day was a blur....", "created_utc": 1488137938, "id": "de8uv05", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Lurker_wife", "author_flair_css_class": null, "author_flair_text": null, "body": "My two were very different- \n\nFirst was text book waves of contractions that rose up my mid section, tightened and then would subside.  When they became really painful I had an IV dose of meds, then an epidural.  The epidural only took on half my body and I was in agony, pain, cramping, sweating, shaking, etc. Then an IV in my hand for meds.. thought I wasn't going to make it through birth... then they gave me another epidural and I could barely feel myself pushing when it was time.  Complete euphoria.  Had no idea they could place it again. \n\nMy second was stressful, snow storm and contractions that weren't doing more than being obnoxious.  Couldn't go home, so they helped labor along by stripping membranes and eventually pitocin.. got the epidural again (twice again, same problem) and the Pitocin pushed my kiddo out.. I was on the lowest dose possible and I had this feeling that he was on his way out even though I was pretty numb.  I told the doctors he was coming and they didn't believe me.. sure enough one lift of the sheet and he was there!!!\n\n", "created_utc": 1488138108, "id": "de8uzgh", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Beckua", "author_flair_css_class": "purple", "author_flair_text": "4.5, 3, and newborn girls", "body": "I am sure we could all write books on just one birth, so I will try to keep my experience concise.\n\nFirst birth: c-section. Never felt a contraction. Surgery was great. felt like a 30-minute stomach massage. Recovery was awful. I was drugged up for the first three days and my whole body felt broken and weak for a month after. (I'm a baby. I've seen woman handle it better.) Anything that involved abs was difficult. Worst panic attack: took me 15-20 minutes to get into bed the first day I was home. Everything hurt. Then I wake up to the baby crying and think, \"Oh crap. I never thought about how to get OUT of bed!)\n\nSecond birth: medicated V-BAC. I had prodromal labor for a month (lots of false labors. Basically felt like menstrual cramps on steroids.) When it actually was real birth, I got the epidural, fell asleep for four hours and woke up to soft whispering nurses telling me to push. Couldn't feel much, baby was out quickly. Recovery was much better. It took me a good 30 minutes to remember how to pee again. Pooping afterwards is traumatic for about a week or two. (You think you are going to break something.) Pad-sicles were the best thing ever.\n\nThird birth: super fast and completely un-medicated. I had the same super-menstrual cramps pain. They came in waves. Then I had a day of dull aches and my water broke. I am still confused about what to do with this. Every time I contracted, about two cups of fluid came out. I sat on a towel in the car ride. There must be a better way. Anyway, get there, baby came too fast for meds. I remember it being the worst pain ever. (Since then I have had an appendicitis and would compare it to that intensity of pain.) I screamed with the contractions in the last five minutes. At first, the nurses told me not to push, but my body didn't care what they had to say. It was like when you have a sick-ish poop or diarrhea and your body just pushes it out whether you consent or not. It was the same. My muscles were moving on their own. Baby was out after 5 pushes, they stitched me up. It pricked, but that was nothing compared to what I had just gone through. I was shaking uncontrollably for the next 30-40 minutes. My body was in shock, but of course, I was deliriously happy. I felt a special bond with the third one. I can't pinpoint why. I know there must be some science behind it, but I felt like I was super mom and she was super baby. This was the best recovery, too. I bounced by almost immediately. \n\nThe recovery always had month-long bleeding, traumatic poop, need for sitz baths and padsicles, weakened stamina, and physical and mental exhaustion for about a month.\n\nI had the awesome luck not to have PPD, but I definitely had baby blues from time to time. You are exhausted and everything is new and on-the-job learning, but involves a precious, delicate life that now depends on you. So if I hadn't had the support of family and good friends and a great husband, I don't know how I would've gotten through it without going crazy.\n\nPsychologically, the love for my kids just happened. There was that special birthing bond with my third kid, but I loved my other two right away. The smells, the sleepy cuddles, the cute facial expressions... Aw dangit. Now I want another one.\n\nI am a much better mom after three than I was after two, after one, or before any. I had a lot of on-the-job learning and crisis-provoked improvement. I have read a lot of parenting books and met a lot of inspirational mother-friends. I can easily say I am a better person now because of my daughters. Especially when they repeat my passive-aggressive power-plays and I go: oh, yeah. I need to work on that.", "created_utc": 1488138109, "id": "de8uzhg", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "MyDamnCoffee", "author_flair_css_class": null, "author_flair_text": null, "body": "I was induced with no prior contractions or anything. I don't really remember a whole lot. I don't even remember screaming, \"get her out! Get her out!\" My sister told me about the screaming. I just remember it *burning* and that by the time they took out forceps to remove my daughter, I didn't have the strength to keep pushing. Afterwards, I tried to push myself up into a sitting position and my arms wouldn't work. A nurse had to assist me.\n\nI think it's true when they say that your brain blocks out most of the memory because I really don't remember. I was quiet during my contractions. I asked for an epidural after four hours of contractions. They had to give me three epidurals in increasing quantities because it kept wearing off. And there was pressure. A lot of pressure. Like I had to poop really bad and the only way to relieve the pressure was to push but, as I've already stated, in the end I had to have help because I couldn't push her out on my own.", "created_utc": 1488139343, "id": "de8vwsl", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "butguyssrsly", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a similar experience with my first. ", "created_utc": 1488139473, "id": "de8w08m", "link_id": "t3_5wblo1", "parent_id": "t1_de8uip2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Friedfoxfriend", "author_flair_css_class": null, "author_flair_text": null, "body": "The excitement of being 4 on x mas eve. Plus numb legs and the pressure of a bowling ball resting on your butthole. A POP sensation like you just pooped. The most euphoria and joy and pride as if you just won a Nobel prize and gold medal at once. Looking at your baby and feeling like you won the 100 million powerball. ", "created_utc": 1488139547, "id": "de8w2a6", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "knottydana", "author_flair_css_class": null, "author_flair_text": null, "body": "I was fortunate enough to have a natural home birth (planned).\nIt was empowering, calm and incredible. \nDark lighting, private and relaxed environment.\nI had my mum, sister, husband and midwife for the most part and another midwife arrived just before baby was birthed. We shared stories, told jokes and relished in the absolute amazement of the process and my body. ", "created_utc": 1488139750, "id": "de8w7ux", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "graphicrose", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a natural vaginal delivery with pitocin towards the end. The contractions in the beginning were like super bad cramps. When I had been in labor for a few hours the dr decided I wasn't progressing fast enough and put me on pitocin. Things got real after that. The contractions were so strong that I fainted a few times. On a good note, I only remember about 10 minutes of that 3 hour period. After that, it was time to push. Suddenly the room was full of people telling you to ignore the pain of what felt like my pelvis coming out of my butt.", "created_utc": 1488140018, "id": "de8wex9", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "frigid_bones", "author_flair_css_class": null, "author_flair_text": null, "body": "Like pooping out a squishy wet watermelon. But the emotional journey through the pain is very surreal and primal. When labor first starts I think contractions are a lot like putting on The One Ring. One minute you're talking and things are fine the next minute you are sucked into contraction land. Its a place inside yourself that you never new existed. Then the contraction is over and you're back in the normal world again. Soon the two worlds overlap, and then you're in labor land and there is no returning until its over. Then you just focus on each contraction trying your best to stay afloat as the pain hits you in waves. When you mentally can not take it anymore, you think you're gonna die. Its like sinking below a wave. You dont care if you die. At that point its time to push. And this part is not so bad compared to transition. It takes effort but the pain is no worse than before, and you know it will be over soon so it even gives you a burst of energy you didnt know you had. When its over the pain is gone and the endorphins are still coursing. Its better than hiking any mountain or running any race. I know it is because I have done both those things. The rush is just amazing. I was a cackling mad woman when they placed my son upon my chest. It was such a rush, I said to my husband that I could do it again someday, even though labor was 22 hours with 7 hours of transition. Even though I told him to take me out to the parking lot and blow my brains out. So worth it. I had a planned c-section with my first, and my vaginal birth for my second was the better experience. Such a triumph. I could draw on the experience for months after and feel the euphoria and oxytocin course through my veins. It was burned into my brain. The impact is almost faded 2 years later, but I hope to do it again someday. ", "created_utc": 1488140605, "id": "de8wumt", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "CountryBunkin", "author_flair_css_class": null, "author_flair_text": null, "body": "Went to doctors to have my membranes stripped the day before my due date went into labor that evening, on and off contractions through the night (sleeping during the off). was up bright and early the next morning  with very little sleep still having sporadic contractions which felt like mild stomach cramps, laid back down for some rest (hahaha). Got back up with contractions about every seven minutes at which point I decided to get my shower in. Standing caused them to go from every 7 minutes to every 4 very quickly ( I live an hour away from the hospital so a little scary). Got dressed and headed that way, contractions not much worse at this point I could carry on a conversation pausing when they came. By the time I arrived at the hospital I was dilated to an 8. I was still ok for about an hour and a half then they were pretty much constant at that point I would describe it as the most intense stomach cramp ever. Shortly after that I remember telling my nurse I needed to poop a lot and my vagina was on fire. Baby came right after. I had a natural birth so I felt everything and I will admit actually feeling your baby come out of your body is amazing. ", "created_utc": 1488140714, "id": "de8wxk9", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "lyanca", "author_flair_css_class": null, "author_flair_text": null, "body": "After having the stomach flu ", "created_utc": 1488142456, "id": "de8y8ns", "link_id": "t3_5wblo1", "parent_id": "t1_de8u46t", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Pullet", "author_flair_css_class": null, "author_flair_text": null, "body": "Terrifying. No euphoria, before or after. Frustration, self-criticism, and pain. Was 8-10 weeks before I could say the words \"I love you\" to my newborn, even when only she and I were in the room. Nearly destroyed my marriage. Better now, but do not want to do it again. ", "created_utc": 1488144443, "id": "de8zr5m", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "istara", "author_flair_css_class": null, "author_flair_text": null, "body": "A dark glory. \n\nIt made me more aware of the sheer biology that underlies us. \n\nThis process starts, these muscles connect, in a way that you had no clue was possible. Everything working together. A whole system and process just simply lying idle unless it is needed for a birth. Then it takes over. Your body knows what to do without you. \n\nIt was odd. Kind of discovering that your car has this entirely separate engine hidden in its bowels that will only ever awaken and kick in if the main engine breaks down. ", "created_utc": 1488145383, "id": "de90ijf", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "because_dinosaur", "author_flair_css_class": null, "author_flair_text": null, "body": "Radiating, hot, stinging pain coming from the low back in waves. Contractions are like a wave. Calm, no pain then the wave builds and crests before crashing back into calm. Repeat that every few seconds or every few minutes depending on where you are in the process. For me, transition was black and fuzzy. I felt like I was on a different plane from everyone else, it was very trance like.", "created_utc": 1488145839, "id": "de90ve9", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "justdance4me", "author_flair_css_class": null, "author_flair_text": null, "body": "My labour was induced. My last few weeks of pregnancy I was high risk because an ultrasound showed an enlarged ventricle in the brain which ended up being nothing.\n\nHad a very cute resident insert something like a tampon to make cervix soft and then mild contractions started after water broke. Was on pitocin next morning. Labour was all in my lower back! Had my husband and nurse massaging my back during contactions. Pushed for three hours and OB comes in and tells me they need to use the vacuum to help assist. I asked for my headphones so I wouldnt have to hear the suction noise (lol its silent). I also did not feel euphoria as i then had upper back and neck pain that was worse than labour!\n\nAn hour after birth the Nurse tried to get me to pee and take a shower and I fainted in the bathroom almost slamming my head into the ceramic tub. \n\nHad post partum depression for a while afterwards. But I dont regret any of it!!", "created_utc": 1488146665, "id": "de91ikz", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Icanberoberta", "author_flair_css_class": null, "author_flair_text": null, "body": "Great description. The euphoria, it's what I like to say to describe mine.  \nIt's like taking drugs without taking drugs, our bodies are amazing.", "created_utc": 1488146711, "id": "de91jvo", "link_id": "t3_5wblo1", "parent_id": "t1_de8uip2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "all_the_snuggles", "author_flair_css_class": null, "author_flair_text": null, "body": "I had an unmedicated vaginal birth. I remember the urge to push vividly. I couldn't control it. The build up was like a surge or pulse of energy that felt like it was draining from my fingertips down my arms into my chest and down into my uterus. The whole rest of my body was frozen and I was forced to concentrate all of my energy (what very little was left) on each push and I didn't have control over when they were coming or how long I could rest between pushes. After pushing for 2 hours the relief of birth was amazing. I kept saying it must be how it feels to finally die after suffering from injury or disease. There was euphoria and relief and light and the pain was just gone and everything was alright. ", "created_utc": 1488147168, "id": "de91wuk", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "bebop8159", "author_flair_css_class": "red", "author_flair_text": "Ella Rose &lt;3", "body": "Had a natural birth, no meds.  It was super late at night so I kept nearly falling asleep in between contractions for the first couple hours.  Pain was like menstrual cramps at first, mostly in my lower back and hips.  After a few hours, the pain spread to my abdomen.  I actually threw up from the pain at one point.  Then, after one contraction that felt as they had for a couple hours, the next contraction came and I felt my body wanting to push.  Nobody had told me it was time to push so I didn't, but it was actually harder NOT to push than to just feel the pain of the contraction.  A nurse came in soon after that, fussed with some medical apparatus or another and said that they'd check my cervix in an hour (I had been 4 cm dilated on the previous check).  I told her about the whole \"my-body-wants-to-push\" sensation so she checked me (or she had the doctor check... I don't really remember exactly).  I had gone from 4 cm to 8 1/2 cm in about 20 minutes so all of a sudden the doctor and nurses are in this big flurry of activity like \"Oh wow we weren't ready for you to be ready yet!\"  I pushed about a dozen times and out she came, my little girl.  I remember telling them to give me my baby and them saying I'd have her in a moment about five or six times, meanwhile I'm laying there shivering uncontrollably while the doctor is stitching my episiotomy and telling me to hold still.  I kicked him and screamed \"GIVE ME MY BABY GODDAMMIT!\"  They gave her to me and then I quit caring about whatever else it was they were doing.", "created_utc": 1488147190, "id": "de91xh9", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488147284, "id": "de9204d", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "seamstress80", "author_flair_css_class": null, "author_flair_text": null, "body": "Birth hasn't changed me. Motherhood has.\n\nDeep inside my brain, and only since I had my first child and not before, whenever my MIL says to my husband that she gave birth to him (she uses a specific choice of words in my language that implies a vaginal birth), I say to myself, \"no, you didn't\". It was a c-section ahead of time because she didn't want to mess with her lady bits. She didn't want to breastfeed for the same reasons. My FIL had to feed my husband formula with a coffee spoon because he wouldn't take the bottle at the beginning and MIL wouldn't even try breastfeeding.\n\nI feel a bit bad for doing that. Then again, I don't like her too much.\n", "created_utc": 1488147861, "id": "de92gsw", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "figgypie", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah I'm one and done after this experience. Nothing went as I wanted with my both except for the baby part. My LO is only a month old and it's been rough so far. Thank goodness for my in laws stopping by and helping and getting me out of the house once a week.", "created_utc": 1488148151, "id": "de92p2g", "link_id": "t3_5wblo1", "parent_id": "t1_de8zr5m", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488148572, "id": "de931ab", "link_id": "t3_5wblo1", "parent_id": "t1_de8uip2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "unicorncatchers", "author_flair_css_class": null, "author_flair_text": null, "body": "Waves of cramps that overtook my whole body. Couldn't really speak or even think straight during. Pushing was like taking a massive burning poop. The whole ordeal  was super fast from start to finish, under 3 hours, and so emotionally I feel like I didn't really have time to process that the baby was coming. She was just suddenly here. No them for meds at all, and it wasn't really as bad as I though it would be. ", "created_utc": 1488148574, "id": "de931cu", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "Any time I'm asked this question, I just burst out laughing, and continue til I'm on the floor wheezing. ", "created_utc": 1488148617, "id": "de932jr", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Rysona", "author_flair_css_class": null, "author_flair_text": null, "body": "That's about how I felt about my kid sometimes... ", "created_utc": 1488148686, "id": "de934f5", "link_id": "t3_5wblo1", "parent_id": "t1_de8uc67", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "onacloudyday", "author_flair_css_class": null, "author_flair_text": null, "body": "My birth story is on /r/babybumps also. I had a scheduled c-section. It was terrifying beginning to end. I was shaking so hard before that the nurses had to hold me in a bear hug to place the spinal. I was supposed to have a gentle c-section with immediate skin to skin but the delivery was traumatic and he had to go to the NICU right away. Waiting for him to cry were the longest seconds of my life. If not for the beautiful end result I wouldn't recommend it to anyone, but everyone lived and we got through it generally unscathed. Praying for a VBAC next time. ", "created_utc": 1488149220, "id": "de93j3d", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "ThatGreenSolGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Hmmm how to describe it to a man. It's hard since I'm not sure whether I'd equate it to something coming out of your penis or butt. But for me it just felt like my body was angry with me and violently wanted everything inside it out. I puked, I had diarrhea, I didn't want to move. My water broke at home so add in the constant liquid leaking. \n\nMaybe to a man it would feel like your body is angry with you and is trying to flush out an alien parasite. You're stuck in the bathroom like when you have the flu and stuff is coming out both ends. You have a team of people telling you to relax and trying to move you around when you don't want to be moved. Eventually it would feel like pooping out a squishy mass about the size of a football. Your body has never pushed out something that size but miraculously, it fits. Maybe you get tired of pushing and can't get it all the way out and they help with forceps or a suction device. \n\nThere a lot of different ways to birth, some will be traumatic, others will be very easy and peaceful. You don't really know which it will be. This was how I would describe mine to a man though.", "created_utc": 1488149395, "id": "de93nyq", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "pineapple_mango", "author_flair_css_class": null, "author_flair_text": null, "body": "Imagine what you are /u/Pullet said together plus it's been two years and all you have gotten is one day off in October from your kid. \n\nI go crazy sometimes. A lot of the time actually. ", "created_utc": 1488150742, "id": "de94oou", "link_id": "t3_5wblo1", "parent_id": "t1_de92p2g", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488150756, "id": "de94p1y", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "aggravatingyou", "author_flair_css_class": null, "author_flair_text": null, "body": "I posted my 3rd baby's birth story in December, if you want to check it out. ", "created_utc": 1488150906, "id": "de94t60", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "McKellMyBelle", "author_flair_css_class": null, "author_flair_text": null, "body": "Planned C-Section that turned into an emergency C-Section. Almost died on table. It's crazy to think that if I lived in a different time, me or my two kids probably wouldn't have survived.", "created_utc": 1488152296, "id": "de95vr2", "link_id": "t3_5wblo1", "parent_id": "t1_de8uc67", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "-cc0unt-nt", "author_flair_css_class": null, "author_flair_text": null, "body": "Yep. I'd comment on the OP but I can't do better than this", "created_utc": 1488152476, "id": "de960ri", "link_id": "t3_5wblo1", "parent_id": "t1_de8y8ns", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488153624, "id": "de96wbp", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488153812, "id": "de9716i", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488154382, "id": "de97glm", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Caycepanda", "author_flair_css_class": null, "author_flair_text": null, "body": "This is pretty good! I've definitely had poops with stomach cramping that reminded me of transition.  And the uterine ejection reflex is so weird that the only thing I can compare it to is throwing up violently. So yeah, it's like having the stomach flu with an audience and then you don't get to sleep for a few years. ", "created_utc": 1488155092, "id": "de9801g", "link_id": "t3_5wblo1", "parent_id": "t1_de93nyq", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Elcamina", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt so awesome after both of my kids were born. I think had the opposite of postpartum depression, I was on a constant high from the relief that my pregnancy was over and I had actually given birth (twice!). It's very empowering. ", "created_utc": 1488155692, "id": "de98g32", "link_id": "t3_5wblo1", "parent_id": "t1_de8uip2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Danyell619", "author_flair_css_class": null, "author_flair_text": null, "body": "My first started off typical enough.  Contractions coming closer and harder.  By the time I was checked in and in my delivery room I had been invasively inspected by no less than three people, only one of which I had ever met before.  Then it was just a waiting game.  Keeping myself busy and the mind off the pain.  At first it felt like bad diarrhea cramps that involuntary hardened my entire belly. (imagine the feeling of a sit up without doing any work)  later the pain would begin at my back and \"shoot\" through me to the front.  Finally when it got really bad it felt like an honest to goodness electric shock over and over.  When I could take no more I asked for an epidural.  It's hard to say which was worse, the epidural or the contractions.  They sat me up as contractions got worse and quicker and to me NO MATTER WHAT DONT MOVE, because they stuck a very large needle into my spine and, yeah it hurts like hell.  Worst shot I have ever gotten.  Especially since I had to sit perfectly still though what felt like being tazed in my gut.  The epidural gave immediate relief... To one side.  They had missed and double dosed one side of me with no dose to the other.  They shifted the stint and tried again.  Now I had 3 full doses to one side and 1 on the I didnt feel much after that, for a day and a half one the one side.  I could see the contractions happen, but no longer felt it.  When it was time to push I had to work off muscle memory since I couldn't *feel* pushing.  But you engage the same muscles you use to poop, so at least I have been practicing since birth.  The crowning was strange, I could feel the pressure, but no pain.  If you have ever put something almost to big in your mouth and spit it back out, it was similar to that.  I can remember lots of pressure.  Pushing is awkward... You are supposed to put your chin to your chest squeeze your knees up to your chest and go though the motions of a poop (which most women, myself included do on the table, all the medical professionals expect it, you don't really care in the moment or notice really and it's no big deal at all) then relax and repeat till you have a baby in arms.  At the end things were going fast... Too fast.  You see everything needs some time to stretch out and if things go too fast it can cause tearing.  Which is what happened to me.  Luckily it was small and only needed three stitches.  The baby was out, but my work wasn't done just yet.  You have to take a few more pushes to get the placenta out.  Finally they clean and sew (if needed) you back up.  Sometimes you will have the baby on you chest pushing out the placenta and sometimes they clean it off first.  They take out the weirdest scratchy granny panties and stuff them full of a large ice pack wrapped in absorptive material to help everything soothe.  A few moments to feed an get pictures before they take you to the recovery room.  Baby in your lap (my hospital had specific rules about this, the baby had to be carried by the mom while she is wheeled to the room if both are able.  It helps avoiding switching babies)  then you may get to rest for a bit  before they start pushing on you tender stomach every ten minutes and bugging you to eat, pee, poop or fart (not a joke).  This is because your organs are rapidly shifting back into their right places and they want to be sure it all goes back right.  Then maybe the next day, maybe the next week the worst experience comes.  The first real poop.  By this time all hints of pain meds are gone and because of so so many reasons you can be constipated it is a second birth, alone on your toilet.  Fun fact: this causes more hemorrhoids than the actual births do.  And for me a \"fun\" suprise happened a few days later when I sneezed and popped my stitches out.... Not fun.  After that it's no sex and peri bottles rather than toilet paper for a while while everything heals and shrinks back to basically what it was before.  ", "created_utc": 1488155931, "id": "de98mhg", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "janajinx", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a non medicated vaginal birth. The contractions feel like stomach cramps that happen over the entire span of your torso since that is how big the uterus is. After a while I would describe the pain like you're being ripped in half at the waist. When the contraction is happening it's like you are transported to a world inside yourself, you have no sense of time, no idea what anyone is trying to say to you or what is happening around you, all you know is you have to concentrate on getting through that minute of intense pain. Soon you feel like you are in a constant contraction fog. I guess I could relate it to being on ecstasy, except the euphoria and confusion is due to the many hours of pain your have already endured. Staying with the ecstasy metaphor transition would be peaking. Everything was so intense, I can't even recall if I felt pain, the only thing I know that it was the most intense feeling I have ever had, I vomited outside the birthing tub. Then came the pushing part. The contractions didn't really hurt during this stage but Instead they were just an uncontrollable urge to push and felt like I was pushing out the biggest most painful shit of my life. If I pushed too hard it felt like my vagina was going to rip. After the baby comes out everything is just back to normal. I was cheerful, no longer exhausted and best of all nothing hurt anymore. I was able to get out of the tub and walk over to the bed and lie down all while holding my baby who was still attached to me via the umbilical cord. \n", "created_utc": 1488156027, "id": "de98p07", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "sallypiece", "author_flair_css_class": null, "author_flair_text": null, "body": "This is absolutely accurate. The first thing that went though my mind when I pushed my cantaloupe out was \"Oh thank God, it's over.\"", "created_utc": 1488156177, "id": "de98t0q", "link_id": "t3_5wblo1", "parent_id": "t1_de8u46t", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488157012, "id": "de99emv", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "aldeka", "author_flair_css_class": null, "author_flair_text": null, "body": "Like a stomach flu where you vomit every ten minutes. For hours. As the frequency speeds up.\n\nFinally the doctor gives you something and you are no longer vomiting, just dull stomach cramps every few minutes. You don't know why the eff you didn't treat it sooner, except that it's considered more virtuous.\n\nAfter eight hours or more, you cap it off with the biggest poop ever. You tear your butthole open getting it out, though fortunately you can't feel it until after the meds wear off.", "created_utc": 1488157220, "id": "de99jzm", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "liseux", "author_flair_css_class": null, "author_flair_text": null, "body": "Birth was amazing. Beautiful, excruciating, the hardest thing I've ever done. I gave birth naturally with nearly 24 hours of back labor. It was like running a never ending marathon. The contractions felt like a metal ball was expanding and pushing on my spine and bowels. Every two minutes it was if I could feel some sort of unforgiving machinery pushing down on me like a trash compactor. The last 10 hours were a total blur. I can hardly even remember them because I was barely making it through each contraction. I distinctly remember feeling like I wasn't doing a good job because everyone kept telling me to breathe but I couldn't help screaming. Pushing was a relief because I could finally do something with all the pain. There was a purpose in it. I pushed for a couple hours. All sense of modesty was long gone and I remember not caring that people were in the room or that they were holding a mirror so I could see. I could hardly believe that pushing was doing anything but suddenly my son's head was coming out. I remember my music playlist was playing Celine dion's The Prayer and I felt like that gave me peace as I pushed with every muscle in my body. The next day even my fingers were sore. I remember when he crowned I felt a stinging and that's where I tore. Once his head came through, he flopped out and he stared crying. The first thing I said was, \"he's real?!\" My midwife started crying but I was just so so happy. The pain was over and he was in my arms! After experiencing a miscarriage in an ER and dealing with some of that trauma, I was sort of prepared for how hard labor/ birth would be, but this was hard in a productive way, beautiful way. ", "created_utc": 1488159397, "id": "de9b3pr", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "liseux", "author_flair_css_class": null, "author_flair_text": null, "body": "I love this explanation. I can totally relate to the contraction land and then normal land and then suddenly the overlapping of it all. Phew!", "created_utc": 1488159632, "id": "de9b9ic", "link_id": "t3_5wblo1", "parent_id": "t1_de8wumt", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "hulliballoo", "author_flair_css_class": null, "author_flair_text": null, "body": "For me it was like being far too hung over on tequila the next morning and trying to force out that terrible liquid shart. Everything hurts and burns. But once it's out you immediately feel a billion times better and happier than ever. ", "created_utc": 1488159956, "id": "de9bhp1", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "TryingFirstTime", "author_flair_css_class": null, "author_flair_text": null, "body": "Perfect. I was going to write something, but mine is on r/babybumps too.", "created_utc": 1488160141, "id": "de9bm7m", "link_id": "t3_5wblo1", "parent_id": "t1_de8sz3j", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "sneakpeekbot", "author_flair_css_class": null, "author_flair_text": null, "body": "**Here's a sneak peek of [/r/BabyBumps](https://np.reddit.com/r/BabyBumps) using the [top posts](https://np.reddit.com/r/BabyBumps/top/?sort=top&amp;t=year) of the year!**\n\n\\#1: [I don't have a baby bump. But my wife does. Can I post here too? I am terrified almost beyond the capacity for rational thought. Please tell me nice things about having children.](https://np.reddit.com/r/BabyBumps/comments/5jy1a2/i_dont_have_a_baby_bump_but_my_wife_does_can_i/)  \n\\#2: [My husband just quit his job because they told him to \"level set\" me, my professional ambition, and my expectations of how much he'd be around for baby. I couldn't be more f'ing proud.](https://np.reddit.com/r/BabyBumps/comments/4jzm3w/my_husband_just_quit_his_job_because_they_told/)  \n\\#3: [One of the best pregnancy timelapse videos I've seen. Don't swallow watermelon seeds!](http://i.imgur.com/RuJiJ7s.gifv) | [22 comments](https://np.reddit.com/r/BabyBumps/comments/5hdpo6/one_of_the_best_pregnancy_timelapse_videos_ive/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/5lveo6/blacklist/)", "created_utc": 1488160146, "id": "de9bmbb", "link_id": "t3_5wblo1", "parent_id": "t1_de9bm7m", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public", "url": "https://np.reddit.com/r/sneakpeekbot/comments/5lveo6/blacklist/"}, {"author": "jre103087", "author_flair_css_class": null, "author_flair_text": null, "body": "I have 1 via vaginal birth so cant speak to csection or vbac but...\n\nContractions hurt so much. It was like I could feel my pelvic bones grinding against each other. Hell, I swear I heard it a couple of times.\n\nThe epidural hurts even more initially but once the drugs kick in nothing else matters. You feel the needle puncture your skin then can feel the needle digging and searching around in your spine, cue grinding bones again. While my anesthesiologist was administering my epidural and squeezed my nurses hand so hard I was worried (after the fact) that I had hurt her. After the drugs kicked in I told the anesthesiologist that he made women in the hospital happier than any other man present. I have a friend who asked how many proposals he got in a day and he responded \"a lot\".\n\nActually delivery feels like your pushing and straining to get out the biggest and hardest poop in you life. Everything is pushing and pressure. If you have anyone down helping stretch etc it feels like the most intense Indian burn your older sibling/cousin ever gave you. The skin the stretching and burning with no end in sight. \n\nDuring all this pushing and stretching a whole class of med students could come marching through the room and you won't notice or care. Every ounce of you is focused on getting this whole experience over. \n\nWhen the baby is actually delivered we go back to the poop. The relief and amazing feeling you have after pushing and straining your big hard poop and it finally all slides out at once. \n\nI was just telling a friend that delivering a baby is the hardest, grossest, scariest, best, most amazing thing that you'll ever do.  ", "created_utc": 1488160511, "id": "de9bvpz", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "HappyGiraffe", "author_flair_css_class": null, "author_flair_text": null, "body": "I actually think this is a pretty close description. I have a vaginal delivery but I was induced at 42 weeks, so I got the pit for about two hours before they turned it off because WOOOOO was it working fast! I was worried pit meant I would HAVE to have an epidural (which I really did not want because I have a trauma history and really hate feeling numb, especially lower extremities) but I was able to do it with lots of freedom from the hospital staff, who let me eat \"as long as they weren't watching\", walk around, get in and out of the shower, sit on the toilet, etc. \n\nIt was very intense, but I was definitely in some \"other place\" with it. My body and mind were...just on some other level. And when they finally told me I could push, it was like a whole other thing. CHeering, high fiving, joking... it was a crazy. \n\nNot easy. Definitely WORK. But mine was really...fine. And kind of surreal. ", "created_utc": 1488160576, "id": "de9bxch", "link_id": "t3_5wblo1", "parent_id": "t1_de8uip2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "HappyGiraffe", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry it was traumatic for you; were you able to get support that was helpful? My birth was great but the post-partum was truly....not. And it makes me not want another and no one seems to think my reason is \"legitimate\". It's frustrating and I haven't found the right venue for support yet. ", "created_utc": 1488160649, "id": "de9bz7z", "link_id": "t3_5wblo1", "parent_id": "t1_de8zr5m", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "HappyGiraffe", "author_flair_css_class": null, "author_flair_text": null, "body": "Ha, I love that :) World's move lovable gall bladder. ", "created_utc": 1488160705, "id": "de9c0k5", "link_id": "t3_5wblo1", "parent_id": "t1_de8uc67", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "boringbluesocks", "author_flair_css_class": null, "author_flair_text": null, "body": "While telling you  what a great job your doing.", "created_utc": 1488160710, "id": "de9c0pi", "link_id": "t3_5wblo1", "parent_id": "t1_de8u46t", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "marianleatherby", "author_flair_css_class": null, "author_flair_text": null, "body": "Wait how does that happen?", "created_utc": 1488161364, "id": "de9chjn", "link_id": "t3_5wblo1", "parent_id": "t1_de95vr2", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "eetsabanana", "author_flair_css_class": null, "author_flair_text": null, "body": "I was induced and my contractions went from nothing to 1-minute hard contractions over about 20 minutes. Every sixty seconds it felt like every bone in my pelvis breaking. I've never made such primal guttural sounds.  I had the feeling of euphoria when Dr. Feelgood came in with my epidural. I've never wanted to kiss someone so hard.\n", "created_utc": 1488161702, "id": "de9cpuu", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "marianleatherby", "author_flair_css_class": null, "author_flair_text": null, "body": "I posted mine to /r/babybumps last summer. Mostly it was really exhausting, exhaustion more than pain (but also, being really tired of being in pain) led me to cave and get the epidural. Haven't decided whether to try for VBAC.", "created_utc": 1488162173, "id": "de9d1rn", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "orheadswillroll", "author_flair_css_class": null, "author_flair_text": null, "body": "Most accurate explanation I've ever heard. ", "created_utc": 1488162868, "id": "de9djom", "link_id": "t3_5wblo1", "parent_id": "t1_de8wumt", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "McKellMyBelle", "author_flair_css_class": null, "author_flair_text": null, "body": "I was scheduled to have the C Section at 39 weeks but had to go in early because I had super high blood pressure.", "created_utc": 1488164284, "id": "de9ejqa", "link_id": "t3_5wblo1", "parent_id": "t1_de9chjn", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "SaucerSection", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a c- section after laying on my back for 36 hours in induced labor. I would say I felt terrified. The thought of being awake while they cut you open caused me to shake and vomit. I was in tremendous pain already. I lost all time during the actual event so when the baby arrived in the world, I was in shock. It was like ripping a part of you away and then forcing you to take it back. If any of that makes sense. And since there was no \"giving birth\" it took awhile for it to feel real. It didn't register that my body was different, sand baby, for maybe a day. It was traumatic and I suffered some PTSD related feelings for months after. ", "created_utc": 1488166024, "id": "de9frpi", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Pullet", "author_flair_css_class": null, "author_flair_text": null, "body": "Dude, I feel you. My kiddo is 3.5 and the reverberations from the post-partum bs are still going. Do you need an ear?", "created_utc": 1488166733, "id": "de9g8yl", "link_id": "t3_5wblo1", "parent_id": "t1_de94oou", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "makeitbettah", "author_flair_css_class": null, "author_flair_text": null, "body": "I am totally up for being your support if you want. Severe PPD, no desire to do it ever again, planning to change careers next year and extremely excited about it and about the example it sets for my little one: that you can be a mom, and do something you love, and be excited for your future as a family. You are making the right choices for you and this makes you amazing. ", "created_utc": 1488167316, "id": "de9gmxb", "link_id": "t3_5wblo1", "parent_id": "t1_de9bz7z", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Saffron_says", "author_flair_css_class": null, "author_flair_text": null, "body": ".... after the baby and placenta are out... the dr pushes on your abdomen several times to make sure everything is out... feels like all your guts are sloshing out if you. Unbelievable feeling. Like they are just pushing everything you own out of you. \n\nOh and the contractions ... I just kept thinking of the movie \"alien\" . The intensity and pain is beyond wild. Like this alien is in you, twisting and turning and trying to make its way out... ", "created_utc": 1488167331, "id": "de9gna6", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Pullet", "author_flair_css_class": null, "author_flair_text": null, "body": "That is super obnoxious. \nF other people's opinions. \nYou have a venue in me :)", "created_utc": 1488167393, "id": "de9goqo", "link_id": "t3_5wblo1", "parent_id": "t1_de9bz7z", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Pullet", "author_flair_css_class": null, "author_flair_text": null, "body": "Glad you have support! :) honest question: does away time help? When I was at my worst, I hated the offers to watch my kid for me because it implied that I couldn't hack motherhood, thereby confirming my deepest self-criticism. ", "created_utc": 1488167796, "id": "de9gy6x", "link_id": "t3_5wblo1", "parent_id": "t1_de92p2g", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488168036, "id": "de9h3vp", "link_id": "t3_5wblo1", "parent_id": "t1_de9goqo", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "figgypie", "author_flair_css_class": null, "author_flair_text": null, "body": "I need to get out or I feel more depressed. New moms in particular need and deserve some personal time. I feel like I've already lost a lot of myself since I gave birth and having tastes of my previous life helps. ", "created_utc": 1488173177, "id": "de9ke8u", "link_id": "t3_5wblo1", "parent_id": "t1_de9gy6x", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "charleschubb", "author_flair_css_class": null, "author_flair_text": null, "body": "It felt like the worst dump I ever had to take in my life.  I was in labor for 36 hours with my first kid, ended up with a csection.  Tried again for a natural birth with my second child, after 24 hours, I needed a csection.", "created_utc": 1488175959, "id": "de9lx68", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488176836, "id": "de9md1h", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488178555, "id": "de9n5aw", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "WeaverPartyof4", "author_flair_css_class": null, "author_flair_text": null, "body": "First one wasn't bad, most of the labor felt like period pains (I have endometriosis so periods are painful) I ended up needing a c-section and that sucked! \n\nSecond one was quick, I had contractions on and off alll day, went to bed and woke up 3 hours later with excruciatingly painful contractions. Went to the hospital and waited for an OR to clear (was going to have a repeat c-section the following week) and went from 4cm dilated to 10cm in about an hour. Rushed to the delivery room (I was in triage) the birth was quick, the ring of fire is no joke. The placenta coming out is like giving birth again to a bag of jell-o. Being stitched up with no drugs (besides a local numbing agent) was worse than birth. But the worst is having to pee an hour afterwards. My BP dropped while I was on the toilet so I had to have a catheter inserted in my very swollen and freshly stitched nether region. ", "created_utc": 1488191790, "id": "de9rtbd", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488195048, "id": "de9su7t", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Stinkycheesemanz", "author_flair_css_class": null, "author_flair_text": null, "body": "The main thing I remember is all the pressure. Like that feeling before you have to take a giant dump but it's just not quite ready to just slide out. I used this method called hynobirthing and was able to keep myself in a calm place and didn't need any pain meds. Strangely the time seemed to just kind of fade away. But once it was time to push I was super worn out unsure if I would have the energy to go on. Then some how I managed to gather the strength and my son was born. Then, I got the biggest rush of energy in my life and have never been so proud of myself for doing something so amazing. I'm not one of those people who think pregnancy and birth is all rainbows and puppies but it really is quite a miraculous event. ", "created_utc": 1488196874, "id": "de9th9b", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Briannasshh", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm a little late to this but I'm still trying to find ways to describe it. I had back labor the whole time which I can only really describe as 15 hammers hitting you in the back all at the same time every contraction hit. I lifted myself off the bed like I was being exorcised every time I felt it. I got an epidural and it the made everything much less awful. Then I can only describe it as the most unbearable, painful shit of your entire life. Afterwards they laid my daughter directly on me and it felt worth it but I definitely wouldn't ever want to do it again. A lot of people when they talk about it tell you it's painful but that it isn't actually that bad or that it is completely wonderful or something but I felt absolutely none of that. I just felt exhausted and drained.", "created_utc": 1488200869, "id": "de9v5yt", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "marianleatherby", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh, ok! That makes sense (and seems obvious now), I originally thought you meant that once you were in the middle of your scheduled C section it turned into an emergency C section.", "created_utc": 1488202030, "id": "de9vql6", "link_id": "t3_5wblo1", "parent_id": "t1_de9ejqa", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "Stinkycheesemanz", "author_flair_css_class": null, "author_flair_text": null, "body": "I had forgotten about that part! ", "created_utc": 1488202528, "id": "de9vzxv", "link_id": "t3_5wblo1", "parent_id": "t1_de9gna6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "McKellMyBelle", "author_flair_css_class": null, "author_flair_text": null, "body": "Understandable. I was not very clear.", "created_utc": 1488205462, "id": "de9xq7e", "link_id": "t3_5wblo1", "parent_id": "t1_de9vql6", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "EchodemenosEsp", "author_flair_css_class": null, "author_flair_text": null, "body": "One of the worst experiences of my life. My labored lasted 24 hours and didn't go how I imagined at all. I had 16 hours of pitocin and felt completely out of control with what was happening to my body. I got in a really bad place mentally and couldn't seem to snap out of it. I don't know how to describe the pain of contractions, maybe like a the worst Charlie horse you've ever felt localized on your spine / lower back / abdomen? The grand finale after 2.5 hours of pushing on no food and no sleep was several tears (top and bottom) and hemorrhoids that left me walking like a cowboy. It hurt to pee or sit up straight for weeks. The stitches would itch and pull like crazy. Winter kept me shut in the first few weeks after she was born, which led to some crazy baby blues. It's a huge physical and mental toll on your body that lasts far beyond the day of labor. ", "created_utc": 1488206135, "id": "de9y5ww", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "LykkeStrom", "author_flair_css_class": null, "author_flair_text": null, "body": "For nine months", "created_utc": 1488206531, "id": "de9yfq3", "link_id": "t3_5wblo1", "parent_id": "t1_de8y8ns", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "created_utc": 1488214338, "id": "dea4mde", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}, {"author": "forwardseat", "author_flair_css_class": null, "author_flair_text": null, "body": "Mentally/emotionally, it's a weird rush that's hard to explain.  The intensity of it is about like being with a dying person, which sounds really weird, I'm sure, but it's the best I can do - but when I was holding my grandmother's hand, the incredible rush of empathy and mental pain and buildup, and finally, that deep breath out and peace... it was very similar.\n\nPhysically, it's really hard to describe, some of the ladies have done really well, but for a guy the best description of the contractions I can come up with is to imagine stomach flu level cramps, like your insides are twisting around themselves, that comes and goes every few minutes.  Now imagine that happening but no escape or relief, and it progressively gets worse and worse and more frequent until you are just totally exhausted.  Then finally the pressure comes and you can do something about it.  Once you're pushing, it's pretty empowering as you're finally in control of what's going on, the pushing helps with the pain, and the endorphins start to rush.  It's like seeing the finish line of a marathon in front of you and suddenly realizing you're going to make it.  You find energy you didn't know you had.  \n\nWith my first, I was pretty well out of it (It was, no lie, like being out of body there at the end) and when they handed him to me I just felt like I'd been hit by a bus, and why were they giving me this squishy alien thing?  With the second, it just felt like relief, and I actually felt pretty good.  That said, I had epidurals both times (with the first it was as a precaution in case of surgery, so I didn't have as much actual pain relief from it as I did the second time.  With the second I got the epi as I was going into transition, it was faster and more intense than the first time).  \n\n", "created_utc": 1488217512, "id": "dea7j30", "link_id": "t3_5wblo1", "parent_id": "t3_5wblo1", "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_name_prefixed": "r/Mommit", "subreddit_type": "public"}]}