{"submission": {"author": "something_simple1852", "author_created_utc": 1336664502, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_7oqdh", "brand_safe": false, "contest_mode": false, "created_utc": 1493494035, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/68b6w4/help_i_made_a_mistake_choosing_my_babys_name/", "gilded": 0, "id": "68b6w4", "is_self": true, "locked": false, "media_embed": {}, "num_comments": 110, "over_18": false, "permalink": "/r/Mommit/comments/68b6w4/help_i_made_a_mistake_choosing_my_babys_name/", "retrieved_on": 1494648385, "score": 83, "secure_media_embed": {}, "selftext": "Like the title says, I think I made a mistake when choosing my baby's name. My s/o and I battled for a very long time on names before we finally decided on the name Roman for our little boy. Near the end of my pregnancy I started getting cold feet on the name, but pushed aside my feelings thinking that he would come out and the name would work for him despite my fears of it not fitting. Boy, was I wrong. \n\nHe came out and I instantly knew in my gut that we had chosen the wrong name. Still, that was the only name we could agree on for months so I went with it. Now he's almost 4 weeks old and I absolutely HATE it. My s/o says he'll \"earn it\" or \"grow into it\" and I just don't think so. When we chose the name we thought we were going to have a dark haired baby with a dark complexion. Instead we've got this adorable blonde-haired blue-eyed anomaly. I know his features could still change, but i don't think I'll ever be happy with his name. \n\nSeveral people have told me that they like the name, but it doesn't fit him. It hurts my heart every single day that I don't want to say my baby's name out loud and I normally just end up calling him a funny nickname when referring to him. I want to be able to snuggle him and when he cries be able to say \"it's okay, baby's name. Mama's here.\"  It just tastes weird coming out. I almost want to cry typing this. \n\nWhat I'm asking is basically, are there any other mamas out there that have had a similar situation? What did you do about it? Will I ever get used to it? I'm also looking for suggestions on names. I'm in love with the name Liam for him, but his dad hates that, and we're back at square one where we can't agree on anything. I'd like to change it as soon as possible if that's the route we decide to take. I'm adding a couple pictures of the little nugget as well and asking for suggestions from you ladies on names you think might fit. Thanks! \n\n\n[newborn photos](https://imgur.com/gallery/RLI1A)\n", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "self", "title": "Help! I made a mistake choosing my baby's name.", "url": "https://www.reddit.com/r/Mommit/comments/68b6w4/help_i_made_a_mistake_choosing_my_babys_name/"}, "comments": [{"author": "imhereforthat", "author_flair_css_class": null, "author_flair_text": null, "body": "I actually feel the same way but we are three months in so I think it's too late to turn back now. I'm starting to get more used to it.  I have heard of people changing their babies name after a few weeks and I don't think it's that big of a deal personally. Fwiw looking at those pics he totally looks like a Roman to me, but it sounds like you know in your gut what it right! ", "can_gild": true, "created_utc": 1493494530, "distinguished": null, "edited": false, "id": "dgx3iz8", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493494530, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cey24", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, what an absolutely gorgeous little boy! That little smile!\nSecondly, you are not alone mama, I had cold feet about calling my little girl Robyn towards the end of the pregnancy. Especially because our surname also begins with an R. It just seemed strange saying it aloud. But like you, it was a name we both agreed on. And a series of events actually led us to calling her robyn. I was always afraid it wouldn't suit her. Whenever I had to say her full name out loud it just sounded odd. But, it got easier and better. I guess over time you just stop thinking about it and fretting over it. Roman is a gorgeous name. Very unique. And weirdly, though I don't know you or the baby, I do think it suits him. Like, I have a cousin who called her son Tyreke. But Ty is a small skinny white lactose intollorent red head with glasses. Anyways. I hope that you start feeling better about it soon. It really is a fabulous name! Much love! ", "can_gild": true, "created_utc": 1493494645, "distinguished": null, "edited": false, "id": "dgx3lyi", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493494646, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "meginmich", "author_flair_css_class": null, "author_flair_text": null, "body": "I don't have much advice on the name situation but I just want to say he is ADORABLE!! Such a sweetie!!", "can_gild": true, "created_utc": 1493494690, "distinguished": null, "edited": false, "id": "dgx3n46", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493494691, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "thirdpeppermint", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree that he looks like a Roman.", "can_gild": true, "created_utc": 1493494833, "distinguished": null, "edited": false, "id": "dgx3qx0", "link_id": "t3_68b6w4", "parent_id": "t1_dgx3iz8", "retrieved_on": 1493494834, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jeanskismet", "author_flair_css_class": null, "author_flair_text": null, "body": "I kind of felt the same way with my son but he did grow into his name and now I like it.", "can_gild": true, "created_utc": 1493494892, "distinguished": null, "edited": false, "id": "dgx3sh7", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493494893, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alienabuilder", "author_flair_css_class": null, "author_flair_text": null, "body": "What a beautiful baby!\n\nOk so first, I have a Roman in my daughter's preschool, who is blond and blue eyes and wonderful, and visually I find that the name suits him and your son both!\n\nBut that doesn't help.  I'm just an internet stranger.  It's not unheard of to change a baby's name, so if you and your husband can compromise on one, attempt it quickly.  \n\nA strange thought maybe but I don't want you to rule it out... post pregnancy hormones can be a birch and can affect everyone in really unique ways.  PPD can make make otherwise loving mother's feel no attatchment to their babies.  When my own daughter was born it was weeks before I felt like she was really mine (i had been expecting a dark colored mini-me and when she was all dad from day one of was... hard to deal with somehow).  There is a chance these feelings are coming from a place where they aren't actually logical.  You most likely will outgrow them.  \n\nFor what it's worth, I know a mom who adopted and hated the name given to her child, but couldn't change it, and she learned to love it because of the person who it was attached to.  Before you know it, Roman won't be the name of the baby you were expecting,it will be the name of the rambunctious smiling gurgling toddling boy who you have in your arms.  ", "can_gild": true, "created_utc": 1493495790, "distinguished": null, "edited": false, "id": "dgx4fts", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493495791, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Omgahhh", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I had a hell of a time choosing our first daughters name and eventually landed on Kennedy. After we chose it, all these other Kennedy/Kennedi/Kenidees started popping up everywhere and I hated it!!! One lady even put down the way we spelled it. Like WTF, I'm not the one spelling it wrong, lady. Thought about calling her by her middle name. \n\nThen, though, I thought about the reasons we settled on that name: it was both strong and pretty, which is her to a T. I accepted that we named her that and she has really grown into it. \n\nWe did have another daughter though and I made damn sure she had a more uncommon name. (Uncommon in the \"traditional\" spelling) ", "can_gild": true, "created_utc": 1493496388, "distinguished": null, "edited": false, "id": "dgx4v8x", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493496389, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "uterus_at_capacity", "author_flair_css_class": null, "author_flair_text": null, "body": "Me too. ", "can_gild": true, "created_utc": 1493497124, "distinguished": null, "edited": false, "id": "dgx5e4r", "link_id": "t3_68b6w4", "parent_id": "t1_dgx3qx0", "retrieved_on": 1493497125, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaett", "author_flair_css_class": "purple", "author_flair_text": "a 6 year old boogie boy", "body": "granting a name to something or someone is a huge responsibility.  there's always the stigma of \"i knew someone named X and i couldn't stand them\" or \"so and so named *their* kid X and if we do it too we'll look like we're copying them.\"  there's nothing that says you guys can't give him multiple names, or call him by his middle name.  roman looks like it works on him, but he looks more like a michael ian to me... just my random internet stranger's opinion, of course.\n\njust realize that even if you hate the name, eventually you're going to associate it with your child so the name itself won't be nearly as important as the connection to your son.\n\nfortunately for me, ours was a 5 minute conversation on what we'd name our child... damien xavier if it was a boy, raven sophia if it was a girl.  i had some of the same misgivings that you did, and insisted that we have a backup name in case the name didn't fit properly.  i ended up hating the alternative name we chose, so i was glad when it turned out that \"damien\" did fit him.\n\nbut when i first saw my child (5 days after he was born, long story), the first words out of my mouth were \"aww... boogie!\"  the name has stuck and will probably always be his nickname.  so if you find a nickname that fits him that you like, then go with it.", "can_gild": true, "created_utc": 1493498304, "distinguished": null, "edited": false, "id": "dgx684d", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493498305, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SmallVillage", "author_flair_css_class": null, "author_flair_text": null, "body": "What an adorable little chap. He looks like he needs a proper English name like Henry, William, Harry, Oliver, Jack, Charlie, Thomas, Jacob, or James. Sorry, I know I'm not making your predicament any easier.", "can_gild": true, "created_utc": 1493498335, "distinguished": null, "edited": false, "id": "dgx68y6", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493498336, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Gillybilly", "author_flair_css_class": "lightcoral", "author_flair_text": "Mum x 4", "body": "I really like the name Roman, and I think it really suits him. My friends son is named Ronan, and we call him Ro. So cute!\nI felt the same after I named my youngest. He is almost two and his name really suits him now.  Its a lot of pressure naming a baby, you are going to second guess yourself no matter what. \n\n", "can_gild": true, "created_utc": 1493498978, "distinguished": null, "edited": false, "id": "dgx6pis", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493498979, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "danstermeister", "author_flair_css_class": null, "author_flair_text": null, "body": "***ZOMG change it already!!!!***", "can_gild": true, "created_utc": 1493499344, "distinguished": null, "edited": false, "id": "dgx6ylo", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493499345, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "OrganizedSprinkles", "author_flair_css_class": null, "author_flair_text": null, "body": "He kind of looks like a Gordon. He is adorable whatever you choose.", "can_gild": true, "created_utc": 1493499699, "distinguished": null, "edited": false, "id": "dgx77jg", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493499700, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iheartbrainz", "author_flair_css_class": null, "author_flair_text": null, "body": "I adore the name Roman for him!  I think he looks like a little Prince and wouldn't think twice about his name. Can you call him by his middle name for a bit and see if you think he grows into it?", "can_gild": true, "created_utc": 1493499868, "distinguished": null, "edited": false, "id": "dgx7bq0", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493499868, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you so much! Reading about little Tyreke made me laugh so hard! That's amazing.  You all of these comments are making me feel so much better. I'm glad I'm not alone! ", "can_gild": true, "created_utc": 1493500537, "distinguished": null, "edited": false, "id": "dgx7s8b", "link_id": "t3_68b6w4", "parent_id": "t1_dgx3lyi", "retrieved_on": 1493500538, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm starting to get help from all you mamas that I'm going to get used to it. I'm glad I found this sub. Thank you so much!!", "can_gild": true, "created_utc": 1493500633, "distinguished": null, "edited": false, "id": "dgx7ulp", "link_id": "t3_68b6w4", "parent_id": "t1_dgx3iz8", "retrieved_on": 1493500634, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh his dad would NEVER let that happen lol. He hates his middle name with a passion. We never actually agreed on a middle name, so when I was filling out the forms in the hospital it came time to fill in the middle name and I just looked at him and said \"I'm putting in 'Asher'\". And that was that. ", "can_gild": true, "created_utc": 1493500767, "distinguished": null, "edited": false, "id": "dgx7xvu", "link_id": "t3_68b6w4", "parent_id": "t1_dgx7bq0", "retrieved_on": 1493500768, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "lindsaychild", "author_flair_css_class": null, "author_flair_text": null, "body": "For the first few weeks after our oldest, Henry, was born, I called him by his womb nickname but now he's 4, his name suits him perfectly and suits him more as each year passes. It's weird having to get to know this little person you thought you knew. He's an adorable little boy, I'm sure you made the right decision is his name. \n\nPeople will always have an opinion on the names you choose. Just a couple of weeks ago a lady was asking what my twins were called. I told her Evelyn and Dorothy. Her response was \"whatever you do, don't call her Dot, it's such an old lady name\". I told her Dorothy was named after my grandmother so she was named after an old lady and Dot really suits her thank you.", "can_gild": true, "created_utc": 1493500935, "distinguished": null, "edited": false, "id": "dgx822t", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493500936, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "cey24", "author_flair_css_class": null, "author_flair_text": null, "body": "Haha I'm glad it's helping :) you know, you could always have little nickname for him like little Romey or something to that effect, it might stick and make it easier for you :) ", "can_gild": true, "created_utc": 1493500981, "distinguished": null, "edited": false, "id": "dgx837r", "link_id": "t3_68b6w4", "parent_id": "t1_dgx7s8b", "retrieved_on": 1493500982, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Elkay14", "author_flair_css_class": null, "author_flair_text": null, "body": "I had a hard time saying both of my daughters names when they were little. My younger daughter is 3 months and it's still weird  saying her name out loud and usually I call her baby or other nicknames . Don't remember when my first felt and looked like her name to me. ", "can_gild": true, "created_utc": 1493501084, "distinguished": null, "edited": false, "id": "dgx85sz", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493501086, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "This actually helps a lot. Imagining my baby at a preschool age with the name Roman is making me picture a total hooligan that just gets into all kinds of trouble, and that's totally going to be my boy. \n\nAs far as the hormones go that's definitely a thought. I do want to talk about you thinking you'd have a dark mini me. I'm actually the white one in the relationship. His dad is tri racial. He's white, Cuban, and Haitian. Throughout most of my pregnancy he was so happy I was having a boy and would constantly talk about his little \"brown son\" and he was so proud. This is a true \"that baby don't look like me\" scenario for him. He's been nothing but loving of our son, but I can't help but think he might be a little sad that our baby looks absolutely NOTHING like him. He's gotten a little upset when I've asked if our son truly feels like his. Did it take you a long time to adjust? ", "can_gild": true, "created_utc": 1493501449, "distinguished": null, "edited": false, "id": "dgx8f45", "link_id": "t3_68b6w4", "parent_id": "t1_dgx4fts", "retrieved_on": 1493501450, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!! I can't believe I made something so cute. I wonder sometimes if maybe Im biased and just think he's the cutest thing ever because I'm his mom, or if maybe he actually is haha! ", "can_gild": true, "created_utc": 1493501565, "distinguished": null, "edited": false, "id": "dgx8hwk", "link_id": "t3_68b6w4", "parent_id": "t1_dgx3n46", "retrieved_on": 1493501566, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "That's so assuring! ", "can_gild": true, "created_utc": 1493501592, "distinguished": null, "edited": false, "id": "dgx8ijd", "link_id": "t3_68b6w4", "parent_id": "t1_dgx3sh7", "retrieved_on": 1493501593, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "I always wanted a really original sounding name! But after meeting him I really want to call him Ben! There's an awesome show on Hulu with a little boy named Ben and he's just the cutest little thing. ", "can_gild": true, "created_utc": 1493501664, "distinguished": null, "edited": false, "id": "dgx8kcl", "link_id": "t3_68b6w4", "parent_id": "t1_dgx68y6", "retrieved_on": 1493501665, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "Thank you!! I actually was dead set that he was going to be a she before we found out his gender. I loved names like Kennedy and Reagan for a girl! Little presidential names. I liked the name Roman because it seemed strong to me. After reading all of these comments I feel a lot more confident, which is unfortunate because I just convinced his dad a few hours ago that we absolutely had to change it. ", "can_gild": true, "created_utc": 1493501829, "distinguished": null, "edited": false, "id": "dgx8of7", "link_id": "t3_68b6w4", "parent_id": "t1_dgx4v8x", "retrieved_on": 1493501831, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "Dot is adorable! I think it sounds more like a cute little girl than an older lady. Thank you for your comment! ", "can_gild": true, "created_utc": 1493501976, "distinguished": null, "edited": false, "id": "dgx8s2z", "link_id": "t3_68b6w4", "parent_id": "t1_dgx822t", "retrieved_on": 1493501976, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "That's so good to hear! So far I've been calling him little stink, baby, or little man. I think I'm going to give Roman a chance. ", "can_gild": true, "created_utc": 1493502099, "distinguished": null, "edited": false, "id": "dgx8v47", "link_id": "t3_68b6w4", "parent_id": "t1_dgx85sz", "retrieved_on": 1493502100, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "Boogie is so cute! My nickname growing up was \"tooter\" because apparently I was just the gassiest baby ever. My newborn photographer commented saying my little boy was just a \"fart machine\" so maybe we've got a tooter junior on our hands. ", "can_gild": true, "created_utc": 1493502215, "distinguished": null, "edited": false, "id": "dgx8xvj", "link_id": "t3_68b6w4", "parent_id": "t1_dgx684d", "retrieved_on": 1493502215, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DekuHime", "author_flair_css_class": null, "author_flair_text": null, "body": "4 weeks is nothing, definitely not too late to change! My kid is 3 now and I still regret his name. I can at least comfortably say it out loud now but I don't think it suits him at all. You might come to love the name you have but my advice would be to go with something you love now, if having this hanging over you is a big source of stress.", "can_gild": true, "created_utc": 1493502412, "distinguished": null, "edited": false, "id": "dgx92ry", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493502412, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Pethoarder4life", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt the same way about my daughter for a long time. She's a little over a year now and I think her name suits her perfectly. I think my hormones were trying to trick me, honestly. ", "can_gild": true, "created_utc": 1493502453, "distinguished": null, "edited": false, "id": "dgx93va", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493502453, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "GeniusIamnot", "author_flair_css_class": null, "author_flair_text": null, "body": "Your baby is gorgeous! And Roman is a fantastic name. I hope you get to sort this out. But I would keep the name. It's perfect. ", "can_gild": true, "created_utc": 1493502772, "distinguished": null, "edited": false, "id": "dgx9c09", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493502773, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dr_m_hfuhruhurr", "author_flair_css_class": null, "author_flair_text": null, "body": "I believe that Roman is a fantastic name for your son's aesthetic. My go to boy's name is Everett. I had a girl so I never got to use it. I named my daughter something very unusual, and have had a few moments of regret. With that being said, now that her personality has blossomed, I can't imagine her having any other name. And she loves her name, so that's a plus.\n\nEither way, you will make the right call. There is no wrong decision here :) You have this.", "can_gild": true, "created_utc": 1493502855, "distinguished": null, "edited": false, "id": "dgx9e2w", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8f45", "retrieved_on": 1493502856, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "qwirklebee", "author_flair_css_class": null, "author_flair_text": null, "body": "Your baby is adorable! I think we place too much emphasis on names. Both my sister and I changed our names as soon as we turned 18 and my 18 year old son is on the third iteration of his name. He's trying to decide if he wants to legally change it or not. ", "can_gild": true, "created_utc": 1493503213, "distinguished": null, "edited": false, "id": "dgx9mvi", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493503214, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "alienabuilder", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, I can't admit to a biracial baby, by dark coloring I just mean dark hair, eyes.  I DO know that dark skinned babies, black and brown often get darker as they grow. So there is always a chance your son gets darker.  Eyes also often start blue and grow darker too. I can't speak much for your husband's perspective when it comes to race (and i imagine it's especially hard for men, at least I know that baby came out of me and is mine where for him there is room for doubt no matter how improbable he knows it is).\n\n\nI spent my whole pregnancy looking at my baby picture, expecting my kid to be like me, lots of dark hair and chubby cheeks, a tiny little nose.  I expected she'd have brown eyes eventually since those are dominant genes.  When she came out nearly red headed and a clone of her father I was kind of confused.  Her eyes never changed from blue and she stayed blond to this day despite two dark brown haired parents.  I think it was a few months before I really adjusted.  We named her the day she was born so I had to grow into her name and accepting who she was, not to mention all the other stress of motherhood, like breastfeeding.  Today I can't imagine her looking any different,  being named any different, she's beautiful and smart and troublesome and funny.  \n\n\nFunny story, my second child, also a girl, was the baby I had planned for.  Shock of dark hair, big fat face, looked just like me.  I was in awe of her.  She's grown to become a mini me to her big sister, but I really bonded with her differently because she was so obviously mine.  Not better by any means, but differently.  I think there's research out there that shows most babies are born looking like their paternal relatives, it encourages men to bond with the baby because the relation is obvious.  Genetics can be so fascinating! ", "can_gild": true, "created_utc": 1493504531, "distinguished": null, "edited": false, "id": "dgxaivo", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8f45", "retrieved_on": 1493504533, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "hithere90", "author_flair_css_class": null, "author_flair_text": null, "body": "That is one adorable little human! Congrats! And regardless of what you decide, it's a lovely name for a wonderful little person!", "can_gild": true, "created_utc": 1493505201, "distinguished": null, "edited": false, "id": "dgxaz7j", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493505202, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TygrScott", "author_flair_css_class": null, "author_flair_text": null, "body": "Roman is a beautiful baby and the name fits (for me). Welcome to motherhood where questioning everything is normal. ", "can_gild": true, "created_utc": 1493505949, "distinguished": null, "edited": false, "id": "dgxbhb4", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493505950, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "StarlightMum", "author_flair_css_class": null, "author_flair_text": null, "body": "We called our first son Robert, though we always call him Bobby (named after my husband's late grandfather). It took me a while to adjust to the name and I felt like it didn't really suit him in the beginning, so I would always call him Frog. But now at 5 years old, I couldnt think of a name that would suit him more!", "can_gild": true, "created_utc": 1493505979, "distinguished": null, "edited": false, "id": "dgxbi0y", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493505980, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "-_-k", "author_flair_css_class": null, "author_flair_text": null, "body": "He is cute. I can see him as a Roman!!!!! So sweet", "can_gild": true, "created_utc": 1493507195, "distinguished": null, "edited": false, "id": "dgxcbkg", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493507196, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jobie285", "author_flair_css_class": null, "author_flair_text": null, "body": "I found my LO'S name seemed weird early on but got used to it after a few months. I don't know that \"grown up\" names ever sound that normal for babies... ", "can_gild": true, "created_utc": 1493508922, "distinguished": null, "edited": false, "id": "dgxdgcj", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493508923, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jeanskismet", "author_flair_css_class": null, "author_flair_text": null, "body": "When he was first born I was so unsure of his name that I used his middle name.  It was awkward but like I said, He grew into his old fashioned name and it's unique.\n\n  Think about it... besides the fact that your son's name is awesome, there aren't going to be 3 more kids in his class with the same name. ", "can_gild": true, "created_utc": 1493509271, "distinguished": null, "edited": false, "id": "dgxdoft", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8ijd", "retrieved_on": 1493509272, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Icanberoberta", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt this with my daughter. She is six now and her name definitely suits her. Adorable Roman. I like it!", "can_gild": true, "created_utc": 1493509336, "distinguished": null, "edited": false, "id": "dgxdpzm", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493509337, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jeanskismet", "author_flair_css_class": null, "author_flair_text": null, "body": "Roman is a great name and I definitely think it suits him well. He is such a cute little boy!", "can_gild": true, "created_utc": 1493509402, "distinguished": null, "edited": false, "id": "dgxdrip", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8ijd", "retrieved_on": 1493509402, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "harleyqueenzel", "author_flair_css_class": null, "author_flair_text": null, "body": "My youngest son's name is Cameron. I really do not like the name for a lot of personal reasons but it was the only one my boyfriend and I somewhat agreed on. He doesn't look like a Cameron at all. I've yet to warm up to the name. And his middle name is my last name so I can't go by that so I just call him Cam. He's almost 16 months and I really wish I had just said No to the name in the first place.  ", "can_gild": true, "created_utc": 1493509634, "distinguished": null, "edited": false, "id": "dgxdwrw", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493509634, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "katie_g_123", "author_flair_css_class": null, "author_flair_text": null, "body": "Roman is a great name and I do think think you'll get used to it. We both decided on a name for our daughter (thinking she would be fair and red headed) instead a huge dark haired baby turned up and we didn't know what to do! Just like you it was the only name we had agreed on so we went with it but it felt weird at first. Now she's blond (still not red) and we couldn't have picked a more perfect name for her. Despite her looking nothing like either of us (which I struggled with in the beginning) she's now just like an amazing new mate that lives in our house! She's her own little person who has grown into her name and everyone loves it.\n\nDoes Roman have a middle name? You could always use that?\n\nBut if you do want to change it... Eliot? Or Elijah? They're the first names that came to me when I saw those adorable pics x", "can_gild": true, "created_utc": 1493509890, "distinguished": null, "edited": false, "id": "dgxe2p4", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493509891, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "loulabell", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok I came here to say you could change it then looking at the pics he is so a Roman! You could also use his middle name or a nickname if it doesn't feel right!", "can_gild": true, "created_utc": 1493509966, "distinguished": null, "edited": false, "id": "dgxe4eo", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493509966, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sweetchelsearae", "author_flair_css_class": null, "author_flair_text": null, "body": "Omg, he totally looks like a Roman! I think it fits, mama! I hope it grows on you and you feel better about it!", "can_gild": true, "created_utc": 1493510279, "distinguished": null, "edited": false, "id": "dgxebpc", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493510279, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TedKoppelganger", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, he's ADORABLE. Congrats on that. Secondly, I love the name Roman and I think it suits him! But my opinion doesn't matter; yours does. :)\nThirdly, I was in the same position. Hubs and I easily settled on a girl name, but were challenged with boy names. So of course we had a boy. I suggested a name and had a good reason for it (a family name), and he fell in love with it. We decided that would be the name, but it never felt right to me. I would avoid saying it. I would call him by little nicknames to avoid it. Over time, I'd say about 6 months, it grew on me and now I love it. There are only a few other people with the same name, so it's special, but not weird. THat is how Roman strikes me, too. Easy to spell, easy to pronounce, strong, unique, but not overly weird. :) Good luck with whatever you decide to do!", "can_gild": true, "created_utc": 1493510589, "distinguished": null, "edited": false, "id": "dgxeiv3", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493510590, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "catsinbranches", "author_flair_css_class": null, "author_flair_text": null, "body": "3 things:\n\n1) he is so adorable that for a moment there I was like \"maybe now IS a good time to have a second one....\" but no, it isn't. Must not let the baby rabies set in...\n\n2) in Quebec, there is a law that you can change your child's name without a big complicated process within the first... 30 days? I think it's 30 days. That law exists because sometimes people think they had the perfect name, and then the baby arrives and they don't want that name anymore. Totally normal. I don't know if the rules are the same elsewhere, but my point is that it exists because it's relatively common.\n\n3) when my son was born, I really questioned if we had picked the right name. It was a name that I had come up with and managed to win my husband over to loving it too. But once he was born, I really struggled with it. I'm so glad we didn't change it though. He's 18 months now and running around being mischievous and his name fits him so well.  I think what maybe made it difficult at first was that it just felt WEIRD to call him by name. He was basically a cute little potato. Always very alert, but still it felt weird to talk TO him rather than about him, and to call him by name. That went away a bit at a time, and honestly I totally forgot about it until I read your post.\n\nAll in all, if you feel you need to change it and you find another name you love, go for it. If you're really struggling to find another name you love, consider that you very rarely meet a stranger and thing \"wtf, that name doesn't work for you at all!\" and maybe you're not feeling the name yet because he doesn't look like you pictured him and you need to adjust (like when you hear someone talk and they don't sound as you expected, it takes a moment to adjust), that's ok too. ", "can_gild": true, "created_utc": 1493510663, "distinguished": null, "edited": false, "id": "dgxekj0", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493510664, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jeshef", "author_flair_css_class": null, "author_flair_text": null, "body": "Liam is short for William, what do you both think of William?\n\nPerhaps seek a non-family mediator for you and your husband to discuss the issue with.  A lot of big parenting decisions will come up over the years and you have to work together. ", "can_gild": true, "created_utc": 1493510681, "distinguished": null, "edited": false, "id": "dgxekzb", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493510683, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "tabathafortis", "author_flair_css_class": null, "author_flair_text": null, "body": "Something to consider in talking about this with your SO is that you've already gone rogue with one name. I can see why he would be putting his foot down about changing it again. I would be furious if my husband had chosen a name I knew I hated for our son's middle name without my blessing.", "can_gild": true, "created_utc": 1493510906, "distinguished": null, "edited": false, "id": "dgxeq2j", "link_id": "t3_68b6w4", "parent_id": "t1_dgx7xvu", "retrieved_on": 1493510906, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "SugarandSass", "author_flair_css_class": null, "author_flair_text": null, "body": "He is so precious! My first thought when I saw him was Rowan, actually. Rowan Asher sounds perfect to me. \n\nWhen my daughter was first born, I said to my husband that she didn't look like an Isla. She definitely grew into the name for me, but it took a few weeks. ", "can_gild": true, "created_utc": 1493510938, "distinguished": null, "edited": false, "id": "dgxeqtu", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493510939, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "broux4800", "author_flair_css_class": null, "author_flair_text": null, "body": "I just remember Roman to be John Brady who kept coming back on DOOL.  Good luck with the name tho.", "can_gild": true, "created_utc": 1493511213, "distinguished": null, "edited": false, "id": "dgxexjn", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493511214, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jubilee5", "author_cakeday": true, "author_flair_css_class": null, "author_flair_text": null, "body": "Me three. ", "can_gild": true, "created_utc": 1493511264, "distinguished": null, "edited": false, "id": "dgxeyyl", "link_id": "t3_68b6w4", "parent_id": "t1_dgx5e4r", "retrieved_on": 1493511265, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "malpow13", "author_flair_css_class": null, "author_flair_text": null, "body": "I absolutely love the name and just physically speaking I think he definitely looks like a Roman. I was torn between two names for my little girl and ended up going with the one my husband  liked better. I used to I call her the other name outloud just to see how it felt and sometimes I'd wish I'd have gone with the other, but that feeling passed and now that she's 4 months I couldn't see her as anything else.\n\nI think the social security office gives you a month to change it without all the paperwork hassle though? I remember something about \"30 days\" when it came to that part but I don't remember what it was in reference to.\n\nHe's gorgeous btw!! ❤️❤️❤️", "can_gild": true, "created_utc": 1493511499, "distinguished": null, "edited": false, "id": "dgxf54s", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493511499, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "something_simple1852", "author_flair_css_class": null, "author_flair_text": null, "body": "In my defense, if I didn't put down his middle name he just wouldn't have one at all. And a couple of weeks before we had gotten into a little dispute about the middle name and I said something along the line of \"you won't even give me the middle name!\" And he said \"you already have the middle name!\" Also, he really wanted a first name that started with an \"R\" because of a ring that is being passed down through his family. If he would have said no when I told him I was putting it down I wouldn't have done it. Decisions had to be made. ", "can_gild": true, "created_utc": 1493511505, "distinguished": null, "edited": false, "id": "dgxf5az", "link_id": "t3_68b6w4", "parent_id": "t1_dgxeq2j", "retrieved_on": 1493511506, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1493511791, "distinguished": null, "edited": false, "id": "dgxfcmm", "link_id": "t3_68b6w4", "parent_id": "t1_dgxf5az", "retrieved_on": 1493511792, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "not_a_muggle", "author_flair_css_class": null, "author_flair_text": null, "body": "Ok first, he's absolutely adorable. Like what a freakin cute little guy! \n\nWhen I was expecting first I just knew his name would be Nathan. That's what I called him in secret, and although my husband and I ended up with a shortlist 3, there was no question that he was Nathan. Until he came out dark haired and just pretty much not looking anything like I imagined a Nathan would lol. So, I totally get how you're feeling, that your little guy just doesn't fit the image in your mind! \n\nI agree with the other mamas here though - your little dude can totally take up the mantle of Roman. It might \"fit\" better when he's older, and in the meantime I'm sure he'll pick up some nicknames. I hardly ever call my oldest by his whole name, which is similar in sound to Roman, but by a short version of it. ", "can_gild": true, "created_utc": 1493512171, "distinguished": null, "edited": false, "id": "dgxflr4", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493512172, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Ponyo-Ham", "author_flair_css_class": null, "author_flair_text": null, "body": "It's never too late to change a name. \nI would give it a bit longer to really see how you feel. \nHe is so handsome. He has very strong features and I could definitely see him being a Roman. \nIt's hard to finalize a name- it's something that will be with them forever! My kids have very 'out there' names and with the first I had a bit of regret. He's 3 now and I couldn't imagine him by any other name. ", "can_gild": true, "created_utc": 1493512260, "distinguished": null, "edited": false, "id": "dgxfnwk", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493512261, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "anniemg01", "author_flair_css_class": null, "author_flair_text": null, "body": "I felt that way at first, but got used to it.", "can_gild": true, "created_utc": 1493512858, "distinguished": null, "edited": false, "id": "dgxg29d", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493512859, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "wiseco8", "author_flair_css_class": "blue", "author_flair_text": "Kai 12-05-2015", "body": "He's beautiful! I like the name Roman, too. What's his middle name? Lots of folks go by their middle name, or even nicknames. ", "can_gild": true, "created_utc": 1493513622, "distinguished": null, "edited": false, "id": "dgxgkcl", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493513624, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/12, 1/15", "body": "I had a similar experience. In my case, we both agreed on a fairly ladylike, sophisticated name when she was born. But once her personality began to show, I felt really badly that I hadn't chosen our other option, a quirky, energetic name. \n\nA couple years down the road and while the other name still fits her personality better, I can't imagine her not having her current name. And I still have hope that grown up her will fit the name better!", "can_gild": true, "created_utc": 1493514705, "distinguished": null, "edited": false, "id": "dgxh9q9", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493514706, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "awkward_thunder", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it's normal to feel regret for a name if it doesn't fit the baby. It's funny because my son is roman! It suits him so I don't have the same problem but I always feel weird calling my kids by their chosen names at first because they're new and I'm still getting to know them. The the same way with any new peeps I meet. \n\nAs for a new name, I say change it if you are comfortable doing so. As for a new name. The first name that came to mind when I saw him (so cute❤️❤️) was Alastair.  ", "can_gild": true, "created_utc": 1493514889, "distinguished": null, "edited": false, "id": "dgxhdv0", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493514890, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1493515231, "distinguished": null, "edited": false, "id": "dgxhll1", "link_id": "t3_68b6w4", "parent_id": "t1_dgx7ulp", "retrieved_on": 1493515232, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "twentiesgirl", "author_flair_css_class": null, "author_flair_text": null, "body": " Think roman fits really well! He's gorgeous. ", "can_gild": true, "created_utc": 1493515385, "distinguished": null, "edited": false, "id": "dgxhp1d", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493515385, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mleftpeel", "author_flair_css_class": null, "author_flair_text": null, "body": "He totally is!", "can_gild": true, "created_utc": 1493515760, "distinguished": null, "edited": false, "id": "dgxhxyv", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8hwk", "retrieved_on": 1493515762, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "icantevenodd", "author_flair_css_class": null, "author_flair_text": null, "body": "The only Roman I've ever known was blonde! ", "can_gild": true, "created_utc": 1493516049, "distinguished": null, "edited": false, "id": "dgxi4ic", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493516050, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1493516311, "distinguished": null, "edited": false, "id": "dgxiaho", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493516313, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "gazork_chumble_spuzz", "author_flair_css_class": null, "author_flair_text": null, "body": "Babies' faces and features change a ton during the first few years of life. When my son was born he looked exactly like my brother's newborn photos. It was freaky. But it didn't take long before he started looking a lot like my husband. For years, everyone who knew Mr. Gazork would exclaim that our son looked just like he did when he was a child. Now my son's on the cusp of his teen years and he looks rather a lot like me - he's got his dad's nose and mouth and freckles, but my eyes and hair and cheekbones. \n\nYour husband probably is a little sad, and that's okay. Everyone wants to see their likeness in their child. But I just bet that if he's patient, in time his son will show signs of his dad's heritage too.  :)   ", "can_gild": true, "created_utc": 1493516528, "distinguished": null, "edited": false, "id": "dgxifbq", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8f45", "retrieved_on": 1493516528, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "athwartthelotus", "author_flair_css_class": null, "author_flair_text": null, "body": "First off, he is adorable! Second, it's ok to not like his name, but I think it suits him just fine. However, is there a nice name you could call him? Or just a pet name that you call him when your cuddling with him? I'm a teacher and you'd be surprised how many kids don't go by their legal name. They go by a nick name or some version of another name, it's very common. If it helps you to do that, I'd go for it! ", "can_gild": true, "created_utc": 1493517232, "distinguished": null, "edited": false, "id": "dgxivbr", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493517233, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "riverrchic", "author_flair_css_class": null, "author_flair_text": null, "body": "Just to give you a different perspective: One of my friends changed her baby girl's name when she was 4 months old. She felt totally weird about it, as you do, but also felt strongly that her name was wrong. That little girl is now 3.5 and I don't think anyone remembers her as her old name - her new name totally suits her and it was definitely the right decision for her mama.\n\nI know that may not help you, but just so you know you're not alone and it IS possible to change his name, especially if you can find a name both you and your husband like.\n\nI saw in another comment your husband wanted an R name. Have you considered Rowan? He totally looks like a Rowan to me (but that's my brother-in-law's name and they have the same coloring so I'm definitely biased!)", "can_gild": true, "created_utc": 1493517288, "distinguished": null, "edited": false, "id": "dgxiwkm", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493517289, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Mimama58", "author_flair_css_class": null, "author_flair_text": null, "body": "Love this", "can_gild": true, "created_utc": 1493517543, "distinguished": null, "edited": false, "id": "dgxj2fx", "link_id": "t3_68b6w4", "parent_id": "t1_dgxbhb4", "retrieved_on": 1493517543, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cucurucho78", "author_flair_css_class": null, "author_flair_text": null, "body": "You mention you like the idea of a hooligan child,  Romulus, founder of Rome, according to legend was raised by a she-wolf as a baby. As a young man overthrew andfounded Rome. You may want to skip the part of Romulus murdering his twin Remus though.", "can_gild": true, "created_utc": 1493519444, "distinguished": null, "edited": false, "id": "dgxk90g", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493519446, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "plinking_zombies", "author_flair_css_class": "brown", "author_flair_text": "Two kids", "body": "This name is only going to become increasingly awesome as he grows up.   He looks like a romantic movie lead and the name fits.   ", "can_gild": true, "created_utc": 1493520972, "distinguished": null, "edited": false, "id": "dgxl64s", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493520973, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "impatientingrid", "author_flair_css_class": null, "author_flair_text": null, "body": "I went through something very similar and hated my sons name for the first year. I wanted to change it but a few people made me feel guilty about it. He's now 5 and I can't imagine him with any other name. Fits him perfectly. With all that said, I think your son totally looks like a Roman!", "can_gild": true, "created_utc": 1493521095, "distinguished": null, "edited": false, "id": "dgxl8s6", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493521095, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Spiceypopper", "author_flair_css_class": null, "author_flair_text": null, "body": "Oh my! What a handsome babe!! I like many other of the ladies like the name Roman after seeing him, I wasn't sure when hearing your disdain and the story but after seeing him, I can see how your DH feels that way. I also thought since it is really close to the name, what do you think of Ronan? I kind of felt that name fit him as well, and was really close to the original, but to me felt different enough. \n\nI kind of felt that way with our daughter, my DH loved the name Lucina, and I just wasn't in love with Lucy. But it really grew on me, and I barely call her Lucy and at, maybe find a nickname variation that you like to call him until you get used to the name and a bit more past the PP hormones. I could see calling him Romey.", "can_gild": true, "created_utc": 1493523131, "distinguished": null, "edited": false, "id": "dgxmhcn", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493523132, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ClownDancer", "author_flair_css_class": null, "author_flair_text": null, "body": "What a beautiful baby!! My cousin changed her baby's name after like 6 months. Also, my aunt changed her 'baby's' name when he was like 2.  So, if it doesn't feel right, change it, it's no big deal. ", "can_gild": true, "created_utc": 1493523433, "distinguished": null, "edited": false, "id": "dgxmnpf", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493523434, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "ClownDancer", "author_flair_css_class": null, "author_flair_text": null, "body": "I think you should just change it to Ben. What does your husband think?", "can_gild": true, "created_utc": 1493523549, "distinguished": null, "edited": false, "id": "dgxmq57", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8kcl", "retrieved_on": 1493523550, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "disappointedpanda", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm sorry you feel that way!  I honestly think a lot of mothers feel some degree of insecurity immediately after choosing a name.  I hope you find a solution that brings you peace.  If you haven't thought of these as nicknames yet, you could try diluting Roman to another name like Romeo or Manny.  Best of luck OP, and congrats on your beautiful son!", "can_gild": true, "created_utc": 1493523824, "distinguished": null, "edited": false, "id": "dgxmvpc", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493523824, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "julsdc", "author_flair_css_class": null, "author_flair_text": null, "body": "I kniw at least 2 Romans who are blonde and blue eyed. He makes the name not the other way around! It's his name. Any name would have been his.", "can_gild": true, "created_utc": 1493523906, "distinguished": null, "edited": false, "id": "dgxmxc1", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493523906, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "toritxtornado", "author_flair_css_class": null, "author_flair_text": null, "body": "he is absolutely adorable. i think he totally looks like a roman. ", "can_gild": true, "created_utc": 1493524008, "distinguished": null, "edited": false, "id": "dgxmzei", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493524023, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "iaminsamity", "author_flair_css_class": null, "author_flair_text": null, "body": "When my son was first born I felt like that. I get flickers of feeling that way now (he's 2) when I say his name, porter. I get compliments on it all the time but sometimes it feels wrong. But mostly it feels right. ", "can_gild": true, "created_utc": 1493527014, "distinguished": null, "edited": false, "id": "dgxoler", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493527015, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Brovaries80085", "author_flair_css_class": null, "author_flair_text": null, "body": "My Italian heritage husband and I also names our baby roman. Same situation with it being the only name we could agree on... guess what, haha, came out with my red hair. \n\nHe really has grown into it and I can't imagine him any other name.", "can_gild": true, "created_utc": 1493527890, "distinguished": null, "edited": false, "id": "dgxp1gn", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493527891, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Brovaries80085", "author_flair_css_class": null, "author_flair_text": null, "body": "I think it suits him too. He is just the cutest. \n\nI call mine Rome all the time. If that feels better.", "can_gild": true, "created_utc": 1493527932, "distinguished": null, "edited": false, "id": "dgxp272", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493527932, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DONTTELLMEshowme", "author_flair_css_class": null, "author_flair_text": null, "body": "A beautiful name for a beautiful boy.  I think it's very fitting!", "can_gild": true, "created_utc": 1493528497, "distinguished": null, "edited": false, "id": "dgxpc1n", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493528497, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "madeofstarlight", "author_flair_css_class": null, "author_flair_text": null, "body": "First, he's adorable. I also love the name. \n\nI, too, battled with my daughter's father about a name for her. We couldn't settle on one. He suggested one and I said \"fine\". It took me a year to get used to her name and a while later to actually like it. It suits her, and I don't make it common knowledge my feelings that I used to have. ", "can_gild": true, "created_utc": 1493528594, "distinguished": null, "edited": false, "id": "dgxpdpa", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493528595, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "becausefrog", "author_flair_css_class": null, "author_flair_text": null, "body": "I grew up with a blond haired blue eyed Roman. He was the captain of the football team, and the boy that made all the girls swoon. I don't think anyone ever thought it was wrong for him to be named Roman because he was fair instead of dark.\n\nAlso, many babies completely change their coloring. Infants born with thick black hair shed it to grow up blonde, but also blonde babies may end up much darker - my husband was born blonde, but by about age 4 he was a very dark brunette, almost black hair.", "can_gild": true, "created_utc": 1493529546, "distinguished": null, "edited": false, "id": "dgxptpg", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493529547, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yuriathebitch", "author_flair_css_class": null, "author_flair_text": null, "body": "Looks like you got a lot of comments but just wanted to say I love the name Roman, it was on our theoretical baby name list years ago and it suits your son well :)", "can_gild": true, "created_utc": 1493529756, "distinguished": null, "edited": false, "id": "dgxpx3e", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493529756, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yuriathebitch", "author_flair_css_class": null, "author_flair_text": null, "body": "I have blonde hair but had black hair from birth until around the end of the first year I think? It definitely happens!", "can_gild": true, "created_utc": 1493529849, "distinguished": null, "edited": false, "id": "dgxpyle", "link_id": "t3_68b6w4", "parent_id": "t1_dgxptpg", "retrieved_on": 1493529850, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "shaynami", "author_flair_css_class": null, "author_flair_text": null, "body": "There are tons of people who have one name but are called something else. Just start calling him by his middle name or something and it will stick. ", "can_gild": true, "created_utc": 1493530419, "distinguished": null, "edited": false, "id": "dgxq7si", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493530420, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rainydaybear", "author_flair_css_class": null, "author_flair_text": null, "body": "Not that my two cents has any bearing but Roman Asher is such a totally great name, and he suits it in my opinion.", "can_gild": true, "created_utc": 1493533638, "distinguished": null, "edited": false, "id": "dgxrkdv", "link_id": "t3_68b6w4", "parent_id": "t1_dgxf5az", "retrieved_on": 1493533638, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rainydaybear", "author_flair_css_class": null, "author_flair_text": null, "body": "I wish this wasn't so damn true", "can_gild": true, "created_utc": 1493533712, "distinguished": null, "edited": false, "id": "dgxrlgk", "link_id": "t3_68b6w4", "parent_id": "t1_dgxbhb4", "retrieved_on": 1493533713, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "RogueHolly", "author_flair_css_class": null, "author_flair_text": null, "body": "That kid is like... tiny baby model level gorgeous. Seriously. Well done! lol.  :)", "can_gild": true, "created_utc": 1493535447, "distinguished": null, "edited": false, "id": "dgxs90z", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493535448, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yuna1881", "author_flair_css_class": "blue", "author_flair_text": "Alex Ray 9/17/11 l Baby Boy # 2 Due 7/17/17", "body": "He is just perfect. \n\nMy advice is to try and say his name more, avoiding using his name may be whats making it feel so unnatural to you. Try calling him by name and see if it really does start to make sense and fit him. ", "can_gild": true, "created_utc": 1493536179, "distinguished": null, "edited": false, "id": "dgxsikc", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493536180, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "little_green_lamb", "author_flair_css_class": null, "author_flair_text": null, "body": "How do you like his middle name?  I battled my ex on my son's name and ended up giving him my first choice as s middle name.  Once we divorced, when my son was 2, I started using his middle name and had his daycare do the same.  All of our family, including my ex, had no problem switching.", "can_gild": true, "created_utc": 1493540043, "distinguished": null, "edited": false, "id": "dgxtttg", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493540044, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "boredgoldfish", "author_flair_css_class": null, "author_flair_text": null, "body": "Similar for me, both my girls got referred to as \"bub\" or \"baby\" for the first few months, and I found it especially hard with my first - but by 6months, I couldn't imagine them with any other name! For the record, Roman is adorable, and I think his name totally suits him x", "can_gild": true, "created_utc": 1493545812, "distinguished": null, "edited": false, "id": "dgxviyt", "link_id": "t3_68b6w4", "parent_id": "t1_dgx85sz", "retrieved_on": 1493545813, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Oblivinatior", "author_flair_css_class": null, "author_flair_text": null, "body": "I agree. I don't get the whole \"see what they look like once they're born\" because newborns look like potatoes, but he totally looks like he could be a Roman. ", "can_gild": true, "created_utc": 1493551716, "distinguished": null, "edited": false, "id": "dgxxapy", "link_id": "t3_68b6w4", "parent_id": "t1_dgxeyyl", "retrieved_on": 1493551716, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Zeomoderate", "author_flair_css_class": null, "author_flair_text": null, "body": "He's absolutely just gorgeous. I don't have much advice for this but I have this fear also, our son won't be here for another 3 months but I have this exact fear, I'm trying my best to have at least three names, hopefully we can decide on one but in all honesty I think I'll wait until he's in my arms to land a name. ", "can_gild": true, "created_utc": 1493556648, "distinguished": null, "edited": false, "id": "dgxzaie", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493556649, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "bandgeek_foreves", "author_flair_css_class": null, "author_flair_text": null, "body": "I looked at him and immediately thought Alistair!\n\nHe is stunning, by the way", "can_gild": true, "created_utc": 1493556926, "distinguished": null, "edited": false, "id": "dgxzf7k", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493556928, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "fiveohhhstang", "author_flair_css_class": null, "author_flair_text": null, "body": "Before our daughter was born my husband and I each had a name, we talked it over and eventually settled on the name my husband chose (Lily).  As soon as she was born I thought \"oh my god she doesn't look like a Lily! She looks like a Madison!\" (The name I had). I had a gut feeling about it,  but it faded quickly and now that she's 5 I couldn't begin to imagine her as a Madison.  She's definitely a Lily. I say you should leave his name,  I think it suits him and in a couple of years you won't be able to imagine him as anything but Roman. :)", "can_gild": true, "created_utc": 1493559499, "distinguished": null, "edited": false, "id": "dgy0qm1", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493559500, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kaceface", "author_flair_css_class": null, "author_flair_text": null, "body": "Firstly, I wasn't in love with my son's name (and objectively still am not) but it definitely grew on me. My son is 5 and I can't imagine him being called anything else. So your thoughts on the matter might change.\n\nSecondly, when my son was first born, I immediately wished we had stuck with our first name choice. It was a family name from my side, and my son was born looking SO much like my father and not my husband. But within 4 months, he totally lost that appearance and now looks nothing like my father. So even though he might not \"look\" like a Roman now (I disagree), he will probably change his appearance quite a bit in the first year alone.\n\nLastly, I'm not sure if this is an isolated trigger, but it sounds like you're having a *lot* of anxiety. I would suggest thinking about how you feel about everything else going on in your life right now. If you find that you're feeling anxious about other things as well, I really suggest you talk to your doctor. Postpartum anxiety is the oft-neglected sibling of PPD, and you don't need to suffer!", "can_gild": true, "created_utc": 1493563255, "distinguished": null, "edited": false, "id": "dgy2xqe", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493563256, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "suchasunnyday0013", "author_flair_css_class": null, "author_flair_text": null, "body": "I had the exact same thing happen when my son was born. My husband and I discussed names for what seemed like forever and finally decided on one after about 7 months into the pregnancy. Our daughter had a unisex name and we wanted to follow that trend and give our son a unisex name as well. While his name is definitely a boy's name it's not the most masculine name out there. I assumed he would be born weighing about 9 pounds like his sister had, so I didn't think too much about his name not fitting him in those terms. When he was born at 12 pounds, I had three distinctive thoughts: \n1. There is my beautiful baby boy! \n2. Holy crap that kid is huge!\n3. Oh no, we have chosen the wrong name! \nTo me, he didn't look like the name we had chosen for him in the slightest and it gnawed at me. I asked everyone what they thought and everyone tentatively agreed that he didn't really match his name because he was born so big and brawny, like he should have been named Bruno or something hyper-masculine. Also, because we had already told virtually everyone in the world his name before he had even graced us with his presence, I felt foolish to back peddle and name him something different at the time of his birth (a silly notion of course). He could have gone by his middle name as it would have suited him or even his first and middle initials, but I hated that idea. I was terrified this kid would grow up with a complex about his name or identity and he would never forgive his mother for her indecisiveness or at the very least, her inability to chose a decent name for her son. Obviously that is an over-exaggeration but in my mind at the time I was so scared that I had somehow started the wheels of some awful life long identity crisis. In reality, my son is now almost two and he fits his name to a tee. I could not imagine him as anything else but the name that I had so painstakingly agonised over. My point is that it is ultimately up to you whether or not you can imagine your son with the name you had chosen for him, but as someone who has been there I am very happy that I stuck with my son's original name. \n\nYour son is gorgeous by the way and I think that he definitely could be a Roman. :)\n", "can_gild": true, "created_utc": 1493563839, "distinguished": null, "edited": false, "id": "dgy3blv", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493563840, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "yourgirlsamus", "author_flair_css_class": null, "author_flair_text": null, "body": "This may not be true for your baby but I thought I'd throw it out there, my besties baby is biracial. She's white and the daddy is Hispanic. When her son Liam was born he looked really pale and light haired. BUT he was also in a dark womb for 9 months and didn't go outside much soon after being born. By the time he was two his hair had turned brown and his tan was spot on Hispanic. Things change. Your sweet baby could very well end up looking a lot note like your husband in the future. ", "can_gild": true, "created_utc": 1493566142, "distinguished": null, "edited": false, "id": "dgy4urm", "link_id": "t3_68b6w4", "parent_id": "t1_dgx8f45", "retrieved_on": 1493566143, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jewelree", "author_flair_css_class": null, "author_flair_text": null, "body": "I had/still have the same feelings. We made my son my husbands Jr because he always dreamed of it but I feel like I never got the experience of choosing and naming my son. My son goes by the middle name (my idea) so at least their was some choice but I still feel like I missed out on a special part of having a baby and he's probably the only one we will have. I have gotten used to it now at 20 months out, just still sad sometimes.", "can_gild": true, "created_utc": 1493581421, "distinguished": null, "edited": false, "id": "dgygcpz", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493581422, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "steffigeewhiz", "author_flair_css_class": null, "author_flair_text": null, "body": "That baby is ridiculously adorable! That being said, I think his name fits him very well! For what it's worth 😄", "can_gild": true, "created_utc": 1493594482, "distinguished": null, "edited": false, "id": "dgyq6vg", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493594483, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lost-Arrow", "author_flair_css_class": null, "author_flair_text": null, "body": "Congrats!! I think that I was in a similar situation as you were. My SO and I had already picked out two names, Christopher (after my deceased father) and Denise (his now deceased mother) for our boy/girl,  whatever the baby may be. Baby turned out to be a girl and as much as I loved my MIL Denise I couldn't imagine giving my child an old name and calling her that regularly.  So our compromise was that I got to make her middle name a \"J\" so she could go by DJ, or she could choose to go by Jordan as she got older. Happy compromise, right?\nFast forward 14 months and I call her Denise more than anything else. Her personality and everything just fits that name so well. So with time I think you'll see the Roman in him.  If you wanted to, you could take my route and give him the nickname R.J or something, it may work for you too!", "can_gild": true, "created_utc": 1493683898, "distinguished": null, "edited": false, "id": "dh0baub", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493683899, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lost-Arrow", "author_flair_css_class": null, "author_flair_text": null, "body": "Totally just read more comments to find out his middle name is Asher. That is a flipping amazing name! Call him that!", "can_gild": true, "created_utc": 1493684114, "distinguished": null, "edited": false, "id": "dh0bh4s", "link_id": "t3_68b6w4", "parent_id": "t1_dh0baub", "retrieved_on": 1493684116, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_LiterallyAnybody_", "author_flair_css_class": null, "author_flair_text": null, "body": "What was your criteria for choosing a name? \n\nWe grounded our kids names in something related to them.. family names, astrological connections, name meanings, etc.\n\nI wonder if you can either find deeper meaning in his name, or someone with his name that could give it a better connotation for you. Or a slight shift to something similar, but different enough to be a new name. He could pull off Roman, but he could also be a Rowan/Rowen. He's an Aquarius, right? So names inspired by that would be names like Alden, Charles, Colin, Corwin, Galen, Sage, Loman, Winter. \n\nAt worst, changing his name at a month old is not an uncommon thing to do. ", "can_gild": true, "created_utc": 1493734581, "distinguished": null, "edited": false, "id": "dh136av", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493734582, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kllyjansen", "author_flair_css_class": null, "author_flair_text": null, "body": "FWIW, I felt something similar when our son was born.  It's very difficult to find a name that both parents love, so everyone compromises.  We had narrowed it down to 3 names by the time he was born so that we could choose the one that most 'fit' him.  Ultimately we just chose our favorite because it was so weird assigning a name to him.  I barely said his name for the first 3 months and wondered (without really worrying about it) if we had chosen the wrong name.  We just called him a million nicknames... \"the baby\", \"babboo\", \"chunka-chunk\", \"monkey\", etc.  Then, slowly and without me realizing it, he grew into his name and that's what we call him.\n\nWhat's more, I do think he looks like a Roman!  \n\nYou can change it if you want to... he's not going to know the difference... but it's possible that any name you try on feels weird for awhile.  It's so much easier naming a pet than it is your child!", "can_gild": true, "created_utc": 1493749305, "distinguished": null, "edited": false, "id": "dh1ga1q", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493749306, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kmfoh", "author_flair_css_class": null, "author_flair_text": null, "body": "I think he looks like a Liam! Or even a Rian (Ryan). I do not see \"Roman\" but I seem to be the minority. It sounds like you really want to change it, so if it were me I would just go for it. He is YOUR baby. You deserve to like his name! ", "can_gild": true, "created_utc": 1493965813, "distinguished": null, "edited": false, "id": "dh5naj2", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1493965814, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mikeerb", "author_flair_css_class": null, "author_flair_text": null, "body": "My daughter is Eleanor Louise. TOTAL granny name. And when she was first born, I though Eleanor was too proper a name for her (she was silly right from the start), but now I call her Ellie or Ellie Lou a majority of the time, which is perfect! And \"Eleanor Louise\" in mean mom voice has the perfect amount of authority behind it. Haha!", "can_gild": true, "created_utc": 1494125883, "distinguished": null, "edited": false, "id": "dh8aymu", "link_id": "t3_68b6w4", "parent_id": "t1_dgx822t", "retrieved_on": 1494125884, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "naecakes", "author_flair_css_class": null, "author_flair_text": null, "body": "What about Rowan? He looks a bit like a Rowan and it's very similar to the current name. ", "can_gild": true, "created_utc": 1494208710, "distinguished": null, "edited": false, "id": "dh9n1i3", "link_id": "t3_68b6w4", "parent_id": "t3_68b6w4", "retrieved_on": 1494208711, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}