{"submission": {"approved_at_utc": null, "author": "spacebun3000", "author_created_utc": 1489298137, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_164bkr", "banned_at_utc": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1497492496, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/6hc5oe/everyone_guilting_me_about_co_sleeping/", "gilded": 0, "id": "6hc5oe", "is_self": true, "is_video": false, "locked": false, "media_embed": {}, "num_comments": 56, "over_18": false, "permalink": "/r/Mommit/comments/6hc5oe/everyone_guilting_me_about_co_sleeping/", "retrieved_on": 1500142822, "score": 60, "secure_media_embed": {}, "selftext": "I have a 7 week old and since day 1 he has slept on my chest. It is soothing for both of us, is our bonding time, and it's easy for night time feedings. He also sleeps through the night this way and I love it. The problem is that strangers, friends, and family always ask me if he is sleeping in his bassinet or crib yet but my son hates it and screams and freaks out in it. When I explain this everyone says cosleeping is dangerous or say things like it will ruin my marriage because the husband and wife need space. My husband doesn't mind at all but everyone is making me feel so so guilty and like I am a bad mom endangering my son.\n\nDoes anyone else cosleep? How do you do it safely?\n\nMy son sleeps on my chest with a sheet on us. I have a king sized bed and we sleep in the middle with my husband to one side and a blanket rolled on the otherside as a bumper. My plan is to cosleep until my son is 3 months or whenever he feels ok to sleep in his crib. Is this ok? ", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "self", "title": "Everyone guilting me about co sleeping", "url": "https://www.reddit.com/r/Mommit/comments/6hc5oe/everyone_guilting_me_about_co_sleeping/"}, "comments": [{"author": "AubreyWatt", "author_flair_css_class": null, "author_flair_text": null, "body": "Read the book Sweet Sleep for recommendations on safe sleeping. Hard mattress, ditch the sheets if possible and just wear pajamas, make sure you're sober when you sleep.\n\nFor anyone you're worried about judging you, just sidesweep the question - I always said something like \"Oh, we have a pack n play\" which isn't a lie, we just don't use it! I don't​ care who knows anymore, though, bedsharing has been a lifesaver for our sleep and we're going to transition to a Montessori floor bed soon. ", "can_gild": true, "created_utc": 1497493349, "distinguished": null, "edited": false, "id": "dix6tk8", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497493349, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "AubreyWatt", "author_flair_css_class": null, "author_flair_text": null, "body": "And yeah, it put a damper on sexy times for a while but now I can sneak out of bed once she's asleep and we use another bed for that. Nine months now and the only sleep dep I ever had was back when I was trying to force her to sleep on her own.", "can_gild": true, "created_utc": 1497493514, "distinguished": null, "edited": false, "id": "dix6xsn", "link_id": "t3_6hc5oe", "parent_id": "t1_dix6tk8", "retrieved_on": 1497493515, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Qwertyz13", "author_flair_css_class": null, "author_flair_text": null, "body": "I only coslept a little with my daughter during her first 6 weeks, and did all my research for safe sleeping online in a fit of desperation to get her to sleep, period (so I'm not an expert). I thought sleeping on the chest was still a big \"no no?\" That was my only concern.\n\nOtherwise, it was the One Thing I said I wouldn't do, and now #2 is coming and I have a cosleeper, but I'm also prepped to make my bed safe for cosleeping again if necessary. ", "can_gild": true, "created_utc": 1497493779, "distinguished": null, "edited": false, "id": "dix74oj", "link_id": "t3_6hc5oe", "parent_id": "t1_dix6tk8", "retrieved_on": 1497493780, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "AubreyWatt", "author_flair_css_class": null, "author_flair_text": null, "body": "Not sure about on the chest, we always did side lying and I don't remember what the studies said. ", "can_gild": true, "created_utc": 1497493956, "distinguished": null, "edited": false, "id": "dix79dm", "link_id": "t3_6hc5oe", "parent_id": "t1_dix74oj", "retrieved_on": 1497493957, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "frigid_bones", "author_flair_css_class": null, "author_flair_text": null, "body": "http://www.llli.org/sweetsleepbook/infographic\n\nYou'll be fine. ", "can_gild": true, "created_utc": 1497494615, "distinguished": null, "edited": false, "id": "dix7qwk", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497494616, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jelly_Bin", "author_flair_css_class": null, "author_flair_text": null, "body": "I coslept till around 6 months. I felt intensely aware of my daughter, and am admittedly a light sleeper. She slept on my chest and then would be next to me. It was so easy for nursing, and she slept so well. I really felt safe. Anytime you hear about terrible things with cosleeping it seems a parent is inebriated. \n\nAfter 6 months we transitioned to crib with cry it out, but I still took her with me around 3am when she woke up to nurse. I guess I'm all over the place with mixed parenting styles. I am a firm believer in whatever works for you! \n\nShe's 3 now and a great sleeper. Hope this helps your conscience.", "can_gild": true, "created_utc": 1497494738, "distinguished": null, "edited": false, "id": "dix7u4l", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497494739, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Qwertyz13", "author_flair_css_class": null, "author_flair_text": null, "body": "We did side lying too. It worked well to go from nursing to that, and then I could even wiggle away so I was in a safer position to sleep next to her.", "can_gild": true, "created_utc": 1497494760, "distinguished": null, "edited": false, "id": "dix7up1", "link_id": "t3_6hc5oe", "parent_id": "t1_dix79dm", "retrieved_on": 1497494761, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kninjaknitter", "author_flair_css_class": null, "author_flair_text": null, "body": "Just lie. It's honestly easier than dealing with people and their own issues with it. \n\nOh yeah. Sleeps great. \n\nI've coslept with both of my kids at various points and had to lie plenty of times to just avoid idiotic conversations. ", "can_gild": true, "created_utc": 1497495077, "distinguished": null, "edited": false, "id": "dix82u6", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497495077, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "floppy_cloud", "author_flair_css_class": null, "author_flair_text": null, "body": "I've coslept with all three of my kids and plan to do so with the forth when she is born. I never had any problems. They all slept on my chest while I slept on my back when they were younger or slept cradled in my arm if we slept on our sides. I breastfed them and it was so much easier and better for us. \n\nWhen they started taking naps for a decent period of time, I would lay them down in the crib for nap time so that they would get accustomed to it.\n\n Likewise, when they stopped needing to eat every hour or so and began sleeping for 4 to 5 hours at a stretch during the night (around 6 months) I would start them off in the crib and when they woke up in the middle of the night to eat I would take them in bed with me and feed them. \n\nBy 9 or so months they were sleeping the whole way through the night in their crib. It was a pretty smooth transition. \n\nIf anyone has a problem with it, it's their problem.  Tell them it's your child and your family and you don't tell them how to live their life, so they should respect your parenting style and kindly mind their own business.  \n\nYou do what is best for you and your family. Literally billions of people throughout history coslept with their children and many still do today and there is nothing wrong with that at all. It helps the mom and baby bond with eachother and has also been shown to help regulate the baby's breathing and heartbeat while they're sleeping. \n\nBest of luck to you and your family and congratulations on your baby boy! ", "can_gild": true, "created_utc": 1497496724, "distinguished": null, "edited": false, "id": "dix981t", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497496725, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "MekuDeadly", "author_flair_css_class": null, "author_flair_text": null, "body": "Are they going to get up every three minutes to rock a baby back to sleep, place back down like a live bomb, take two steps and repeat and never sleep?\n\nNo, and neither are you because you're choosing to co-sleep :)\n\nTry to not let people mom guilt you- they arnt the ones raising your baby, you are and you're doing a great job at it. Everyone else can shove it. ", "can_gild": true, "created_utc": 1497496969, "distinguished": null, "edited": false, "id": "dix9e0z", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497496970, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1497497691, "distinguished": null, "edited": false, "id": "dix9vkp", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497497692, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "doctoremdee", "author_flair_css_class": null, "author_flair_text": null, "body": "Tell them you'll probably stop by the time he gets married", "can_gild": true, "created_utc": 1497497692, "distinguished": null, "edited": false, "id": "dix9vla", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497497693, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Angrylillis", "author_flair_css_class": null, "author_flair_text": null, "body": "Lie to them. \"He sleeps great\" and do t share the details. I co sleep with. OTH of my kids, currently 2 years and a 6 month old. Learn about safe sleep environments and all of that. Get educated and you will know how to avoid the things that are dangerous about it. \n\nAnecdotally my kids day care has recently become a safe sleep school. All the babies have to use sleep sacks and the teachers have to put them down on their backs. I'm pissed because my daughter is only getting 3 naps a day that last 30 min max. If they used a blanket and placed her on her side she would take a good 2 hour nap each time. But they can't because the state says it's unsafe. Gah. ", "can_gild": true, "created_utc": 1497497852, "distinguished": null, "edited": false, "id": "dix9zei", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497497854, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "luna108", "author_cakeday": true, "author_flair_css_class": null, "author_flair_text": null, "body": "You are not a bad mom. And if you're doing it safely (and clearly looking to do it more safely since you're here asking others for tips) you have no reason to feel guilty!\n\nMy little guy is nearly 1 year and we've co-slept his whole life. Initially we did it because my body was physically healing so slowly and it was too hard to get up every hour or two to nurse him during growth spurts. Sidelying nursing was a game changer, I could roll over and fall asleep every time. I think we all slept better this way, which made our days easier to handle.\n\nI'm usually pretty reserved but being a parent changed that in some ways, and I have no problem telling people why we choose to bedshare (among other personal parenting choices) because we do it safely and I've done my research. I love it. My husband and I didn't really discuss when it would end, and it is naturally still happening without affecting our marriage.\n\nTo do it safely: When he was newborn he was on our king size between us on his his blanket with a waterproof mattress pad beneath it. My husband and I would use different blankets, I kept mine waist-high and wore a warmer top when needed, LO didn't have a blanket. We kept all pillows and blankets away from him. Since maybe 8 months on he shares our duvet no problem, but pillows are off to the side. These days (since crawling) he starts the night in his crib in his room, until first wake up, then he joins us.\n\nYou don't have to justify your parenting choices to anyone. You certainly don't have to feel guilty about bedsharing if it feels right for you.", "can_gild": true, "created_utc": 1497498572, "distinguished": null, "edited": false, "id": "dixagb3", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497498572, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pomeloforest", "author_flair_css_class": null, "author_flair_text": null, "body": "We co-slept with our first until he was just over 2.5y and we will again with #2 whenever she decides to show up (get out baby!) until she's ready to move to the big kid bed with her brother. \n\nFor the first month baby slept between us mostly in my armpit. We had a rolled up towel between baby and hubby so that he'd feel the towel before reaching the baby. Mama has the hormones to stay aware of baby. I breastfed on demand and because he was a summer baby we had a lot of skin to skin. I would actually wake up just moments before him for every feed so I could go pee first.\n\nFrom 1mo-18mo we had the crib side-cared to our queen bed. We waited that long to attach it because it took a month for me to be able to crawl into bed after the delivery. Baby would nurse and I'd slide him back to his mattress. If he was teething or sick then he spent more time on our mattress, if all was well he was content on the crib mattress. Around 10mo he started going to his bed on his own after nursing at bedtime. It was also great for those middle of the night party times because I could make a wall with my body so that I could feel if he came out of the crib and I didn't have to be fully awake. \n\nFrom 18mo- 2.5y we had our queen mattress in the floor with a twin mattress. Toddler slept on his bed most of the night and if he needed more snuggles he'd climb over me and sleep between us. I night weaned soon after he turned 2 and we were able to continue Co-sleeping comfortably.\n\nSoon after night weaning we started talking about getting a big kid bed and that he'll have toys in his bedroom (the second bedroom had been used as a play room until he moved in there). He helped choose the bed, helped put it together and started sleeping on his own really easily. We talked about it for a good 6 month before actually doing it so he was really expecting it and was very excited. On the first night he called me twice and I snuggled him back to sleep and within a week he was sleeping all night on his own. He still comes into our bed occasionally in the middle of the night and we're 100% OK with that. Sometimes he just needs extra snuggles.\n\nSo, those people who are trying you that your newborn needs to be on their own? No. You know your baby and what they need. Baby is still so new and still in that 4th trimester. They need so much touch and love at this point because that's all they know. When you're ready, baby can transition to its own bed or own room but don't let others make that decision for you. ", "can_gild": true, "created_utc": 1497499533, "distinguished": null, "edited": false, "id": "dixb2b6", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497499534, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "onekindsistah", "author_flair_css_class": null, "author_flair_text": null, "body": "My six year old son has turned out fine so far.  I co slept for a few months after swearing I wouldn't.  It's tough if your breastfeeding a newborn to get any sleep if you don't.  You're a parent, do your research, do what works for you and ignore the critics.", "can_gild": true, "created_utc": 1497499660, "distinguished": null, "edited": false, "id": "dixb582", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497499662, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "oakhearth", "author_flair_css_class": null, "author_flair_text": null, "body": "This is phase two of our nightly Co sleep.  Phase one is nursing.\nhttp://imgur.com/yFWsk9t\nThen I let her fall into a deep sleep. \nThen i scooch her up more into the empty space at the head of the bed and scooch my pillow further away. \nFor her first nurse at about 3am I scooch her to the other side of the bed,  flip to my other side and scooch my pillow over to where she was.  I think I often fall asleep with her at the best at that feeding.  If not I move her up again. For the 6am nurse I basically put hey back into the starting position like the photo.  \n\nMattress and box sping are on the ground. *there is no padding on the mattress and little to no sinking, dips, ruts. I keep the sheets and light quilt below my armpits.\n\nI think with my fist I left him in one spot and flipped over him.  \n\nI would caution against having hubby in same bed as baby. Mine sleeps like a rock and just had no awareness of where the baby is in bed. If you do you might need to find a safe way to add separation. I don't think a pillow barrier would be safe.", "can_gild": true, "created_utc": 1497499788, "distinguished": null, "edited": false, "id": "dixb81u", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497499788, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1497500769, "distinguished": null, "edited": false, "id": "dixbtky", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497500770, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dathyni", "author_flair_css_class": null, "author_flair_text": null, "body": "\"how's she sleep?\" \"Like a baby,\" with a cold hard stare. I've had to resort to that because my now 1 year old still wakes a lot at night and people keep asking about her sleep and I am over hearing the replies. We also started bedsharing more and when you start that at 9 month it's interesting what people have to say. \n\nCome up with your short, simple answer, repeat as necessary. ", "can_gild": true, "created_utc": 1497500787, "distinguished": null, "edited": false, "id": "dixbtzi", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497500788, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lizzymum", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah, it was shocking to me how many people I personally know who coslept with their babies and just sort of lied about it or skirted the truth before I admitted to doing it myself. The big problem is that they don't separate out the dangerous things from the safe ones. Moms that drink or do drugs until they pass out are put in the same category as sober ones. \n\nSo yeah, you basically want a firm flat surface without anything soft baby can reach. What's the difference between an adult mattress and a baby one, really? It's not voodoo here. Keep sober, keep away suffocation hazards. Couches are a no-go because they have that soft back babies can get trapped in. Sleep meds are a no-go. Siblings that can't follow the rules, dogs that can't follow the rules, probably shouldn't sleep next to baby either. \n\nFor your specific situation, if you wanted to make it safer, you could have yourself wear a cardigan or open hoodie on your chest and baby wear clothes and not have the sheet on him. The bed could be lowered to be closer to the ground. Some people swear by pool noodles under the sheet as bumpers, and some people get those toddler barriers to tuck in the side of their bed. I wouldn't worry about the baby sleeping on your chest, everything I've heard has said that the rise and fall of the mother's breathing helps baby regulate their breathing, so it's not at all the same sids risk as sleeping face down on their own. As long as baby won't fall far if you startle awake or something.\n\nAnyway I'm still cosleeping at 8 months. I've got the crib side-carred and am hoping I can slowly transition her as she becomes developmentally ready. If she doesn't transition on her own by the time she's walking and talking (one ish??) I figure I won't feel terrible about enforcing a transition to her own bed, because she'll be able to walk herself to my bed if she needs me.  ", "can_gild": true, "created_utc": 1497501349, "distinguished": null, "edited": false, "id": "dixc5sx", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497501349, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "CraftyMcSandbags", "author_flair_css_class": null, "author_flair_text": null, "body": "I cosleep, and my daughter is 19 months old. We tried so hard to keep her in a bassinet for the first three or four weeks, and it was honestly the worst. We were so tired and pissy every day. We never got any sleep, and it just felt dangerous, me getting up a million times in the night exhausted, falling asleep feeding her in a chair or something. So one day I just pulled her into bed with mr to nurse, and we never looked back. We are trying to transition her to a daybed now, Lord help us. Anyway, people will give you their opinions. I just kind of smile and nod, then keep doing what I'm doing.", "can_gild": true, "created_utc": 1497501356, "distinguished": null, "edited": false, "id": "dixc5yg", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497501357, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Allikat4101", "author_flair_css_class": null, "author_flair_text": null, "body": "We fought something fierce with lo weeks 1-4 because I swore no co sleeping.  Then cue in law visit and the only way I could get him to sleep was to feed him (bottle) a couple ounces while propped up (i suspect silent acid reflux).  Because my bed isn't big enough and we had guests in the guest room, it was Kiddo and i camped out in the nursery floor.  After guests left I slept in the guest room with kiddo from weeks 4-10.  Around week 8 moved him into pack and play because when I for up to pump I started to rouse him.  Eventually moved pack and play back into the master bedroom but I think we're starting to dabble in sleep regression so I've spent a few nights this week co sleeping with kiddo in first room again because it's the only way to get him to sleep and still get some myself. ", "can_gild": true, "created_utc": 1497501519, "distinguished": null, "edited": false, "id": "dixc9bd", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497501520, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Answer_the_Call", "author_flair_css_class": null, "author_flair_text": null, "body": "I co-slept with my daughter for the first three months of her life. We had no problems and I slept lighter than I ever have before in my life. I was always subconsciously aware of her next to me even while asleep. We moved her to a crib next to our bed at three months only because she  is an active sleeper and moves around a lot. She began to fuss too much while I was holding her so crib it was. She'd wake up in the middle of the night to be fed, I'd grab her, nurse her, and put her back. Worked great for us. ", "can_gild": true, "created_utc": 1497502476, "distinguished": null, "edited": false, "id": "dixcstq", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497502477, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "kittehwolf", "author_flair_css_class": null, "author_flair_text": null, "body": "Coslept until four months at the advice of our lactation consultant. We would put him down for daytime naps during the day in his bassinet around two months, then for all sleeping around three months. He preferred sleeping alone after that and the transition to crib was a cakewalk. Although once you transition, you need to be consistent. The four month regression is huge but the eight to ten month leap lasts forever. Even though I occasionally missed the closeness of cosleeping, we couldn't mess up our sacred schedule. Kept us sane :)", "can_gild": true, "created_utc": 1497503271, "distinguished": null, "edited": false, "id": "dixd8d6", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497503272, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "namaste_yo_self", "author_flair_css_class": null, "author_flair_text": null, "body": "We co slept with both our littles. The eldest was out of our bed by 6 months. Our youngest one is scheduled to move out of our bed a little before his second birthday if all goes according to plan. \n\nThe way we went about it was we used an arms reach co sleeper connected to our King bed when they were newborns. At some point they outgrew the arms reach and we put a mesh king sized bed rail on my side of the bed in its place. For naps we used a Lotus or Guava travel crib that allows me to nurse baby to sleep while laying down beside him or just pretend to sleep until baby is asleep, then I would sneak out and zip baby in. Naps on the go happen in the Ergo baby carrier. \n\nCo Sleeping isn't for everyone. There are some nights I miss the traditional marriage bed, but there are alternatives that have worked well for us. As I see the time approaching to transition my littlest one out of our room, I am so thankful for the time that we have had together. The snuggles and first morning giggles are priceless. They don't stay little forever. Also not having to get out of bed and walk down the hall in the middle of the night is pretty great too. ", "can_gild": true, "created_utc": 1497503472, "distinguished": null, "edited": false, "id": "dixdcai", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497503473, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Cayterri", "author_flair_css_class": "lightcoral", "author_flair_text": "2010 and 2013", "body": "We coslept with both our kids until they were 3 or so. (Yeah, years.) I felt very guilty until I learned about it a bit more - now I'm glad we coslept and would easily make that choice if we had a third baby. I learned to avoid the subject *but* later found a lot of support and interest among unexpected friends and family, too. ", "can_gild": true, "created_utc": 1497503975, "distinguished": null, "edited": false, "id": "dixdlwm", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497503975, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "World_Navel", "author_flair_css_class": null, "author_flair_text": null, "body": "We cosleep with both our kids (4 mo son and 3.5 yr daughter).  When our daughter was about 2.5 or so, we got a twin bed to put next to our full, but now daddy sleeps on the twin while mommy and kids sleep on the full.  Our daughter goes to sleep late (almost as late as we do) but she's a great sleeper.  We plan to let our kids decide when they want to stop cosleeping.  (Mommy, who grew up in China, coslept until about when she was finishing grade school.)\n\n[NaturalChild.org](http://www.naturalchild.org/articles/sleeping.html) has some great articles on cosleeping and other aspects of attachment parenting.", "can_gild": true, "created_utc": 1497505977, "distinguished": null, "edited": false, "id": "dixem2r", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497505978, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1497508077, "distinguished": null, "edited": false, "id": "dixfljl", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497508078, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "mainstreetmama", "author_flair_css_class": null, "author_flair_text": null, "body": "We didn't co-sleep at first but around 4 months we started waking up during the night crying. This became a new thing that I feel was due to teething. One night I tried co-sleeping and he slept for 8 straight hours!! We never looked back. Sometimes you have to do what's best for baby and mom, and mom needs sleep too. Unfortunately, I don't really voice our co-sleeping bc there's such negativity around it and I don't want to eye roll at ppl more than I already have to. We're 11 months now and who knows when we will transition back to his room, but we decided to take it one day at a time. I'm really over the whole \"mom shaming\". ", "can_gild": true, "created_utc": 1497509412, "distinguished": null, "edited": false, "id": "dixg753", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497509413, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DrAwesomeSauce101", "author_flair_css_class": null, "author_flair_text": null, "body": "There is definitely a stigma against bedsharing, SIDS has made many parents scared. I went to a workshop about SIDS and safe sleeping, the midwife running the workshop was very supportive of bedsharing. There are safe ways to cosleep and there are unsafe ways to have baby in a cot. \n\nI'm currently cosleeping with my 5 month old, we all get so much more sleep and are less cranky. I think a non sleep deprived and happy mother makes me a better mum. Many mums don't want to talk or advertise their bedsharing because they feel like a bad mom or doing something unsafe. \n\nYou do what is best for you, your baby and your family. If its cosleeping, fantastic. You are not a bad mum if you chose to cosleep. ", "can_gild": true, "created_utc": 1497511272, "distinguished": null, "edited": false, "id": "dixgz7v", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497511273, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pineapple_mango", "author_flair_css_class": null, "author_flair_text": null, "body": "Yeah I lied all the time. Even to the doctor. No doctor we don't cosleep lol", "can_gild": true, "created_utc": 1497511460, "distinguished": null, "edited": false, "id": "dixh1wr", "link_id": "t3_6hc5oe", "parent_id": "t1_dix82u6", "retrieved_on": 1497511461, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "body": "[removed]", "can_gild": true, "created_utc": 1497511998, "distinguished": null, "edited": false, "id": "dixh9o7", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497511999, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "PiperZepp", "author_flair_css_class": null, "author_flair_text": null, "body": "People joke about \"oh he'll stop by college\" but my 8 year old newphew still sleeps on his dads chest every night, . He insists it be skin to skin and both parents go robbed at 8 pm. They have no social life and haven't been on vacation in 8 years. So... avoid that?", "can_gild": true, "created_utc": 1497513431, "distinguished": null, "edited": false, "id": "dixhtsh", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497513432, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "pregnantsuomeksi", "author_flair_css_class": null, "author_flair_text": null, "body": "Hi. We've coslept for over a year now, since my son was born. We all love it. Everyone gasps and asks about my husband and Is relationship, as if there is literally no other place in the house to be intimate. I used to be kind of embarrassed about it because i got so much judgement about it but now I just tell them \"Well we conceived him on our couch so we've just continued there!\" As long as you're doing it safely there's no room for anyone to judge you. You do you. ", "can_gild": true, "created_utc": 1497519475, "distinguished": null, "edited": false, "id": "dixk16d", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497519476, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "DearestToMyHeart", "author_flair_css_class": null, "author_flair_text": null, "body": "I started cosleeping when my daughter was around 4 months old and I wish we had done it earlier. She's almost 18 months old now and it's been great, she sleeps better, I sleep better, she can nurse easily if she wants and her waking up face is too adorable. \n\nAt first we didn't use any blankets, just a light sheet, my bed is also on the floor so I'm not worried about falls", "can_gild": true, "created_utc": 1497525152, "distinguished": null, "edited": false, "id": "dixm9f0", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497525153, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "shmushmayla", "author_flair_css_class": null, "author_flair_text": null, "body": "I did the same thing! My daughters 13 weeks now and spends most nights in her bassinet now but when she was newborn she hated it. Everyone's gonna judge you for something, unfortunately. Just do what works for you!!", "can_gild": true, "created_utc": 1497525418, "distinguished": null, "edited": false, "id": "dixmdrp", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497525419, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "jmurphy42", "author_flair_css_class": null, "author_flair_text": null, "body": "We cosleep, but we waited until baby was about 6 months. We've gotten rid of the blankets, moved the mattress to the floor and replaced it with a really firm one, and have the crib side-carred to the bed. We always put him down in the crib at the beginning of the night and he'll move around depending on wakings and nursing, but frequently he's happy to roll back over into the crib. ", "can_gild": true, "created_utc": 1497527900, "distinguished": null, "edited": false, "id": "dixnlah", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497527901, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "trixiepixiegirl", "author_flair_css_class": null, "author_flair_text": null, "body": "We bed shared with my daughter starting a week after we left the hospital. She is the worst sleeper and the only way I was getting any sleep was with her curled up into me and nursing constantly. Bed sharing has been going on since the beginning of time!\n\n I'm lucky to live in a community where a lot of people either bed share, side car a crib, or have those little bassinet things that stay in bed with mom and dad. I never got a lot of push back on the issue other than my in-laws because they had never seen it done, but I have no problem telling people that what I do parenting wise is really none of their concern.\n\nI didn't put her under any blankets if I could help it, just in warm pajamas. My husband would freak out periodically and sleep on the couch the first couple months, but after he realized that I never slept deeply enough to allow him to rollover on baby he came back to our bed.\n\nI'd just tell people \"baby is sleeping fine, thanks\" and leave it at that, or change the subject. It really isn't anyone else's business, if it works for you and your family that is all that matters :)\n\nGood luck! Listen to your instincts and to hell with people who give you crap about something that doesn't affect them in any way", "can_gild": true, "created_utc": 1497528529, "distinguished": null, "edited": false, "id": "dixnxcq", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497528531, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "t5pg2017", "author_flair_css_class": null, "author_flair_text": null, "body": "I definitely think this is the best advice here. The gradual transition is the most important part and will make getting your child to sleep on his own much easier than other parents have it. I personally didn't do this but I have done a lot of research on it and agree wholeheartedly with this sentiment. You do whatever works for you, mama. As long as you aren't endangering your children or doing anything illegal, your parenting style is your business and your business only.", "can_gild": true, "created_utc": 1497532594, "distinguished": null, "edited": false, "id": "dixqhaq", "link_id": "t3_6hc5oe", "parent_id": "t1_dix981t", "retrieved_on": 1497532595, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "itsybitsybug", "author_flair_css_class": null, "author_flair_text": null, "body": "We did it for the first five months. It worked well since she ate so frequently. Everyone got more sleep. Since bug was not yet rolling I slept in the middle, husband on one side, bug on the other. I slept on my side kind of surrounding her. Kept her far from pillows or sheets. I usually left one hand on her so I could feel her at all times. I sleep pretty light so there was little worry that anyone would move without me knowing. If I felt too tired or if I had drank we couldn't do it and she would have to go in her rocker, or my husband would stay up and hold her. He is a night owl so I would get a few hours sleep while they etched kungfu movies. Sometime closer to six months she became OK with her crib which was in our room. So she would start out there and come to our bed when hungry. When she started giving up night feedings we moved our bed out, and she has been in her own bed in her own room since. She occasionally sleeps with me when she is having a rough night. \n\nYou do what you must to remain functioning. Co-sleeping makes a lot of sense those first few months. As long as you do it correctly it can be very safe.", "can_gild": true, "created_utc": 1497533377, "distinguished": null, "edited": false, "id": "dixr1m5", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497533378, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "sloanerose", "author_flair_css_class": null, "author_flair_text": null, "body": "We bedshared from 6 weeks to just after 6 months. Lifesaver for me!!! It was the only way my LO and I got any sleep. My husband and I slept separately during that time and my husband did not care. Fully supportive, he was the one who suggested it in the first place! I just ignored people who gave me shit for it or just wouldn't discuss his sleeping. We sleep trained at 6 months and now LO (8 mos) goes down in the pack n play next to our bed around 7:30 and comes into bed with husband and I when he wakes for his first night feed anywhere from 2-5AM. It works well for us. ", "can_gild": true, "created_utc": 1497536585, "distinguished": null, "edited": false, "id": "dixtm60", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497536585, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "butterflycyclone", "author_flair_css_class": null, "author_flair_text": null, "body": "We co-slept for 10 months and are now attempting the transition into his own crib in his room. LO is attached to us so much that we didn't have any other option. He had to be held to get him to sleep as a newborn. The only thing I wish I would have done is transition him to the crib sooner. We could have started at 9 months but I wasn't ready. I have this gut feeling that once he can walk &amp; open doors, he'll be back in our bed. ", "can_gild": true, "created_utc": 1497538930, "distinguished": null, "edited": false, "id": "dixvoak", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497538930, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "NerdCrush", "author_flair_css_class": null, "author_flair_text": null, "body": "My son slept on my chest for the first 2 years of his life. Do what's right for you. \n\nThe one currently being assembled will sleep in a box in our bed because I'm nervous that daddy is a heavy sleeper. \n\nPersonally, I've started being snarky with advice. \"Oh wow! I didn't know you had gotten a degree in pediatrics. Congrats!!\" ", "can_gild": true, "created_utc": 1497539636, "distinguished": null, "edited": false, "id": "dixwbop", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497539637, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Farmers-wife", "author_flair_css_class": null, "author_flair_text": null, "body": "If it works for you and you feel safe then do it. You know there are dangers people even give babies blankets or stuffed animals when they sleep in crib so yea. Me personally I couldn't because I was too terrified of sids so my guys slept separately (some nap times they slept together since I was awake and nearby) just because I was way to scared  to do it differently. No matter what you do you will be judged so just try to be as safe as you can be. Also I know I toss and turn a lot while I'm asleep that's another reason my kids aren't allowed to sleep in my bed. ", "can_gild": true, "created_utc": 1497543615, "distinguished": null, "edited": false, "id": "diy02vi", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497543616, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "isthatcatparty", "author_flair_css_class": null, "author_flair_text": null, "body": "I *wish* I had coslept for the first 7 months. I was afraid of it because of what I'd heard, but one night I wanted sleep and she slept with me and omg I actually got better sleep from that point on. If I ever have another baby, I'll be cosleeping from the get-go. ", "can_gild": true, "created_utc": 1497544452, "distinguished": null, "edited": false, "id": "diy0vq5", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497544454, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "TicklingKittens", "author_flair_css_class": null, "author_flair_text": null, "body": "Pardon my French honey...\n\nBut fuck them. \n\nYou need sleep, baby needs sleep, baby needs snuggles. All of the above are fulfilled by co-sleeping. I co-slept with my girl and it was the best thing I ever did. Started in the hospital, terrified the whole time that the nurses were gonna give me shit about it but they didn't. It's easiest, and provided you are safe about it, (sounds like you are) it's a  healthy practice. The naysayers are sheep who listened to naysayers and now want you to suffer too.", "can_gild": true, "created_utc": 1497548110, "distinguished": null, "edited": false, "id": "diy4cei", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497548110, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "LuminousLux", "author_flair_css_class": null, "author_flair_text": null, "body": "I co-sleep with my 4 year old son. I have split custody with his dad, and it helps him mitigate the time that he is away from me. He has never not slept with me, since day 1. \n\nI haven't had anyone criticize me or think twice about it, but if someone did, they can go eff themselves, both my middle fingers in the air. Not going to let anyone tell me what is best for my son. ", "can_gild": true, "created_utc": 1497548132, "distinguished": null, "edited": false, "id": "diy4d5s", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497548133, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "i_izzie", "author_flair_css_class": null, "author_flair_text": null, "body": "Major problem with cosleeping. When your babe gets bigger you'll wake up with your boob out and not remember how it happened ;). Seriously we coslept with all three of our kids I don't know how people get any sleep if they don't cosleep. Having to get up to nurse would suck.", "can_gild": true, "created_utc": 1497549112, "distinguished": null, "edited": false, "id": "diy5aqa", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497549113, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "UchihaDivergent", "author_flair_css_class": null, "author_flair_text": null, "body": "My wife and I are still \"co- sleeping\". Our little guy is fourteen months old now. We take turns, if he wakes up to eat or needs a diaper change then he sleeps on me for a while. If you sleep like a rock sure it could be dangerous. However I feel it is an essential part of a babies development that society is trying to infringe upon. It is none of their business how you raise your child. Is it hurting the baby? Not at all! In the near future we will adjust him to sleeping in a crib. \n&lt;3 ", "can_gild": true, "created_utc": 1497551440, "distinguished": null, "edited": false, "id": "diy7i5b", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497551441, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "UchihaDivergent", "author_flair_css_class": null, "author_flair_text": null, "body": "Lmao.\nWe would never do that! ", "can_gild": true, "created_utc": 1497551504, "distinguished": null, "edited": false, "id": "diy7kax", "link_id": "t3_6hc5oe", "parent_id": "t1_dixh1wr", "retrieved_on": 1497551505, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "flibbles", "author_flair_css_class": null, "author_flair_text": null, "body": "I coslept my twins.  I'll fill you in on a dirty secret.. a lot of mom's do. I did because apnea and babies almost dying. It kept them alive and kept me from dying of sleep deprivation.\n\nPeople can judge all they want, but many cultures consider cosleeping normal. \n\nThat said I never brought it up, and told most people I slept on the floor in the nursery.", "can_gild": true, "created_utc": 1497553721, "distinguished": null, "edited": false, "id": "diy9mq3", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497553722, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "dreezyforsheezy", "author_flair_css_class": "orange", "author_flair_text": "Boy Jan 12, 2014; Baby2 June 2016", "body": "I'm still lying on my second kid and she's a year old", "can_gild": true, "created_utc": 1497560144, "distinguished": null, "edited": false, "id": "diyfip9", "link_id": "t3_6hc5oe", "parent_id": "t1_dixh1wr", "retrieved_on": 1497560146, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "rosefoxberry", "author_flair_css_class": null, "author_flair_text": null, "body": "I have a five year old and a two year old and they both sleep with us. They are able to nap without us but they have never sleep on their own at night. We don't mind. It hasn't changed our marriage at all except maybe for the better as we get good sleep! Luckily our moms go with the flow and the few times we've been away from our children, our moms have slept with them. We cosleep very safely. There are dangerous ways but we were educated going into it so we know how to sleep together safely. ", "can_gild": true, "created_utc": 1497564255, "distinguished": null, "edited": false, "id": "diyj1r4", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497564257, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "_LiterallyAnybody_", "author_flair_css_class": null, "author_flair_text": null, "body": "I love cosleeping. \n\nFor us what worked best was to have a spot in the middle of the that was the \"baby spot,\" we have this low-loft pillow that I would put his upper body on, and then I would typically sleep with my head on the pillow beside him and a hand on his belly or right beside it so I could feel his chest moving, and I get to use a pillow (sort of) without risk of putting it on him. As they get older it gets easier. We consider it a \"family\" bed for the most part now that they're older. They're almost 4, and 6, and the rule is we do bedtime routine in their bed, and if they wake up later in the night they can come in with us. \n\nIt's only dangerous if you're not interested in safety. No drinking, smoking, medications of any kind. No tucking him down into blankets, putting him against a wall, etc. Take precautions and trust that you know what you're doing. This is how normal people raise babies - the \"new tradition\" of separating babies and parents is not normal or healthy.", "can_gild": true, "created_utc": 1497565875, "distinguished": null, "edited": false, "id": "diykd5v", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497565876, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Jewelree", "author_flair_css_class": null, "author_flair_text": null, "body": "Coslept every night until my son was 6 months and I transitioned him to the crib in his room. Only took 15 minutes of crying for him to fall asleep because everything else in his routine that day was normal. He would still wake up every 2-4 hours for nursing but that time slowly extended as he wasn't smelling me next to him. He took every single nap in my (or husbands) arms until 7 months after he was used to night sleeping in crib. \n\nI just wouldn't volunteer the information to other people. I'd say he's a great sleeper (because he was in my arms and next to me) and leave it at that. ", "can_gild": true, "created_utc": 1497566336, "distinguished": null, "edited": false, "id": "diykqdy", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497566337, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "craiden", "author_flair_css_class": null, "author_flair_text": null, "body": "Every kid is different. Families are different.\n\nYou do what works for you.\n\nMy kids did not sleep through the night until they were a little older than 2. Co sleeping is how I survived. \n\nMy friends have kids that never liked Co sleeping. \n\nWe did what worked for us.", "can_gild": true, "created_utc": 1497573992, "distinguished": null, "edited": false, "id": "diyqfyq", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497573993, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"author": "Lizziloo87", "author_flair_css_class": null, "author_flair_text": null, "body": "I cosleep. And I was the insufferable NON parent who used to be sooo against ever doing it. Well, I had my son and he would not be out down alone. For the first  month of his life he laid on my chest too. Then now he is 12 weeks and he lays next to me most of the night and the other parts he's either awake eating, on my chest (usually near the morning) or if he will let me he's in his bassinet. \n\nI do it safely as possible. He gets no blankets and pillows are away from him, I wear my hair up, never go to bed drunk, high, or under the influence of any sleep aid while he's in the bed. \n\nIt's one of those things I did a complete 180 on after he arrived. I haven't felt sleep deprived yet and it works for us. ", "can_gild": true, "created_utc": 1497668252, "distinguished": null, "edited": false, "id": "dj0i1mu", "link_id": "t3_6hc5oe", "parent_id": "t3_6hc5oe", "retrieved_on": 1497668253, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}