{"submission": {"approved_at_utc": null, "author": "sadlerswells", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1499709625, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/6mg63q/am_i_right_in_assuming_that_even_in_liberal/", "gilded": 0, "id": "6mg63q", "is_self": true, "is_video": false, "locked": false, "media_embed": {}, "num_comments": 65, "over_18": false, "permalink": "/r/Mommit/comments/6mg63q/am_i_right_in_assuming_that_even_in_liberal/", "retrieved_on": 1502088363, "score": 89, "secure_media_embed": {}, "selftext": "I have spent some time lurking in various parenting related subs include /r/daddit, /r/mommit and /r/parenting. The thing that struck me about daddit was that most of the content consisted of images of kodak moments. It was mostly along the lines of \"my kid just did something cool or funny so here's a picture of it\". There is very little discussion there compared to mommit. I would wager that it's mostly the mom who is taking care of the kids while the dad works. I get that is what usually happens in most societies, but I wonder if it's right that it's always the mom who has to stay home and look after the kids and never the dad. Is that how it is in your household?", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "self", "title": "Am I right in assuming that even in liberal households, it's usually mom who does the majority of caring for the kids?", "url": "https://www.reddit.com/r/Mommit/comments/6mg63q/am_i_right_in_assuming_that_even_in_liberal/"}, "comments": [{"approved_at_utc": null, "author": "keeksg", "author_flair_css_class": null, "author_flair_text": null, "body": "We both work, and we both take equal care of our son. I tend to be more involved with sleep-related issues, which is a carryover from when I used to nurse. Other than that, there is nothing that my husband won't/can't do for our son.\n\nWhat is different is that I am more likely to research and question things. He'll notice that little dude is struggling with something and we'll talk about it, but I am more likely to reach out for answers. It doesn't lessen his involvement as a father.", "can_gild": true, "created_utc": 1499710295, "distinguished": null, "edited": false, "id": "dk1b5ji", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499710297, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "KrisNobi", "author_flair_css_class": null, "author_flair_text": null, "body": "I work 40hrs whereas my husband works 30. When we're both at home, he tends so do the most caring and I am take care of clearing the table, making the bottle before bed etc. \nSo I guess it's the opposite for us. I also usually refer to him for questions on the kid.", "can_gild": true, "created_utc": 1499711050, "distinguished": null, "edited": false, "id": "dk1bvlu", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499711051, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Temmon", "author_flair_css_class": null, "author_flair_text": null, "body": "We're pretty liberal, and he does an extremely good job of day-to-day childcare (he watched our daughter most of the weekend while I sat around being tired and pregnant, for example).\n\nHowever, I do almost all the research and trying to figure things out until I ask him to help, which often takes reminders. For example, trying to get her to sleep better when she was younger and not sleeping. I also took the lead on weaning and will shape what potty training looks like. Partly because I am a SAHM, so I'll be primarily implementing it, but also because he just doesn't think about that kind of stuff.\n\nIt's really funny to compare our Reddit accounts. Mine's all baby this and husband that, although I have some other places I post. His is largely video game and his interests focused. I've noticed the same things about the subs.", "can_gild": true, "created_utc": 1499711223, "distinguished": null, "edited": false, "id": "dk1c1md", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499711224, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "JordanFox2", "author_flair_css_class": null, "author_flair_text": null, "body": "That seems to be the case a lot. I am a stay at home dad and I do 99% of the stuff around the house and take care of 2 boys. I actually unsubbed from daddit because of the reasons you mentioned! Its all just Kodak moment bs. You will find that there are more of us involved dads lurking here than you would imagine. \n\nMe staying home has really worked well this far as our youngest is really wild and strong willed. My wife has a hard time handling him and tends to loose her cool while I stay frosty all day long. Having been in the army nothing really bothers me anymore. ", "can_gild": true, "created_utc": 1499711768, "distinguished": null, "edited": false, "id": "dk1cjpa", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499711775, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "greengleam", "author_flair_css_class": "blue", "author_flair_text": "Baby Boy 4/9/16", "body": "My husband and I both work fulltime. My MIL moved in with us to be our son's fulltime caregiver. When we are not at work though, I would say I generally spend more time with our son. I like taking him to music class, the park, the lake, reading him books, etc. My husband joins us sometimes, but he never does these things independently. I don't know if this is proving your point or not, but that's how it is at our house anyway. We are both liberals btw.", "can_gild": true, "created_utc": 1499711831, "distinguished": null, "edited": false, "id": "dk1clu5", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499711833, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "RunningInTheFamily", "author_flair_css_class": "green", "author_flair_text": "g/b twins 4/17/16", "body": "I look after the kids way more than my husband. He works, I am searching for work. Seems fair enough. It'll shift once I am back at work.  \n\nTo be honest though, mothers do the majority of childcare in all cultures. ", "can_gild": true, "created_utc": 1499711885, "distinguished": null, "edited": false, "id": "dk1cno8", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499711886, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Gluestick05", "author_flair_css_class": null, "author_flair_text": null, "body": "That's how it is for us.  I straddle a weird not-quite-working, not-quite-SAH line (full time grad student with very flexible responsibilities), but baby daddy has repeatedly assured me that he will not be able to take on more child responsibilities when I return to work-work in the fall.  He's not the worst, we're working together to make things better for both of us, but his idea of the default division of labor is definitely rooted in socialization/sexism.", "can_gild": true, "created_utc": 1499712663, "distinguished": null, "edited": false, "id": "dk1deen", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499712664, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "schillbean", "author_flair_css_class": null, "author_flair_text": null, "body": "We are wildly liberal but I (mom) am definitely the default parent.  If my husband and I are both home with the kids (which is pretty rare, we're on different schedules), he's puttering around the house doing stuff while I'm doing the caring.  He'll also just run out to the store, errands, etc, with just an \"I'm heading out,\" no \"you got the kids?\"  \n\nHe is head and shoulders above my dad in terms of how involved he is, but I am 100% the person who deals with school stuff, doctor/dentist appts, who has to be at what activity, shopping for them, etc.  If I need him to take them somewhere because I can't get out of work, I just pop it on his calendar and then confirm about 20 times what he needs to do and take.\n", "can_gild": true, "created_utc": 1499712961, "distinguished": null, "edited": false, "id": "dk1dohb", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499712963, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ImJustAGirl14", "author_flair_css_class": null, "author_flair_text": null, "body": "In my liberal house where we both work fulltime, it comes down to our interests and personalities more than anything. \n\n\nMy husband is a right brain creative, active, goofball, so he does more of the playing and activities. I'm a Left Brain, Type A, planner, so I spend more time organizing, researching, and nurturing (solving problems). \n\n\nThis naturally puts us into traditional gender rolls, but I don't think either one of us would want to trade places with the other.", "can_gild": true, "created_utc": 1499713939, "distinguished": null, "edited": false, "id": "dk1elme", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499713940, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "a_cup_of_t", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband and I both work full time. Childcare is split pretty evenly now that she is 3. When she was a baby I did the majority of childcare but he made up for it by doing more cooking and cleaning. We have a pretty equal split of responsibilities in our house. This isn't typical according to statistics I've seen. But every household has different circumstances. ", "can_gild": true, "created_utc": 1499714063, "distinguished": null, "edited": false, "id": "dk1epto", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499714064, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "arreybaby", "author_flair_css_class": null, "author_flair_text": null, "body": "Right now dad goes to school 3 days a week and I work when he's home. But until 4 months ago he was working. And LO would come to work with me as a nanny. But now I'm a chef and she can't come haha", "can_gild": true, "created_utc": 1499714913, "distinguished": null, "edited": false, "id": "dk1fio8", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499714914, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "archaeogeek", "author_flair_css_class": null, "author_flair_text": null, "body": "I love the question. We are a two-mom family. I'm the default parent for sure. She carried them though (no easy feat- twins!). \n\nIt has just worked out this way because I have a flexible schedule, I grew up in a family with lots of cousins and kids around, babysat since I was 12, and just generally am more comfortable with kids. \n\nShe's a nurse and her job is demanding. She's a great parent and very present. We do most things together, but I do pickup and dropoff from school, am home with them for about an hour before she gets home. She makes their lunches every day and we share chores.  All that said- I do Dr, Dentist, teacher/school stuff (except conferences we do together), IEP meetings, haircuts, and am usually the one they call when they need or want something.  ", "can_gild": true, "created_utc": 1499715220, "distinguished": null, "edited": false, "id": "dk1ftbi", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499715221, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "littledinos", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is nothing like the stereotype that you see everywhere, not in any way whatsoever, to the point where I wonder what planet I must have married him from. He does a majority of the housework despite working way more than full-time. I work a more regular full-time and otherwise mostly take care of our still-nursing toddler. We take equal responsibility and initiative for household/family matters, and have never once argued or even disagreed about someone not doing their fair share.", "can_gild": true, "created_utc": 1499715367, "distinguished": null, "edited": false, "id": "dk1fya6", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499715369, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "sortaplainnonjane", "author_flair_css_class": null, "author_flair_text": null, "body": "Well, probably.  Not in our house, though.  Until very recently, I had a high stress, well-paying job and he was a SAHP.  He decided to re-join the work force so we moved and I left my job.  Now he works and I'm a SAHM for the short-term future.  Honestly, he's better suited for this than I am.  \n\nMy contribution is more behind the scenes.  Making sure she has the right vaccinations, appts, toys, bed, classes, etc etc.  ", "can_gild": true, "created_utc": 1499716896, "distinguished": null, "edited": false, "id": "dk1he2o", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499716896, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ClaraTheSouffleGirl", "author_flair_css_class": null, "author_flair_text": null, "body": "Not the case in our house. We both work fulltime, we devide things equally. I'll mow the lawn, he'll change a poopy diaper or do laundry. The next day it is reversed. He can work more from home than I do so sometimes he spends more time with the kids than I do. Other days he has to leave early and do the morning rush on my own. \n\nOnly difference in the beginning has been the research done, I did the main work there. But I was also still at home on maternity leave back then, so it was logical. \n\nI think I owe a lot of it to bottlefeeding. Though not intentionally with the first one, it has given him the opportunity to reallu bond with them. We had a system on nights that I would breastpump while he would bottlefeed the baby. \nThough it didn't help the milkproduction, it did help him to become an equal caregiver. Which he really wanted to be. \n\nI often see dads elbowed away from there children by both the mom other female relatives. There is this notion, also in female heads, that man can't do these things as well as women, which I find very sad. I think if we gave them the opportunity, more men would like to be involved with their kids to that degree.", "can_gild": true, "created_utc": 1499717169, "distinguished": null, "edited": false, "id": "dk1hn3o", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499717170, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Bdg13", "author_flair_css_class": null, "author_flair_text": null, "body": "I guess we are liberal, however we are a 50/50 household. There are days I don't even change a diaper, clean, or anything else that I assume is Mom work. My husband is Active duty Military and I am part-time worker and we have 4 kids, 20 months to 10 years. ", "can_gild": true, "created_utc": 1499717183, "distinguished": null, "edited": false, "id": "dk1hnli", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499717184, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "misterbator", "author_flair_css_class": null, "author_flair_text": null, "body": "This is us as well. He works out of town 4 days a week so I do a lot of single mom parenting and he is fantastic on the day to day care and is her primary care giver when I am at work. But most of the research and strategizing falls on my plate. I do work less hours than him and am the one to recognize when behaviour warrants new strategies and am the one to implement them but I'm sure I would also be in that role if our work hours were equal.", "can_gild": true, "created_utc": 1499717193, "distinguished": null, "edited": false, "id": "dk1hnxg", "link_id": "t3_6mg63q", "parent_id": "t1_dk1c1md", "retrieved_on": 1499717194, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AnyOlUsername", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm in the UK, I like to think I'm fairly liberal.\nI work full time, my husband is a stay at home dad who does the majority of childcare in his own dad daddish way.\nHe does all the school runs. I keep us financially secure.", "can_gild": true, "created_utc": 1499718354, "distinguished": null, "edited": false, "id": "dk1iqvk", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499718355, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Miss_Awesomeness", "author_flair_css_class": null, "author_flair_text": null, "body": "This probably doesn't answer your question but I'd say my husband does a pretty decent job of always being there. He puts my son to bed 50% of the time, makes dinner  when he wants, etc on top of working, while I stay at home but my husband is terrified of the car seat. He just terrified of putting my son in the car seat wrong. I do the majority of work in our house but my husband does more than my step dad did.", "can_gild": true, "created_utc": 1499718384, "distinguished": null, "edited": false, "id": "dk1irwq", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499718385, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Angel3", "author_flair_css_class": null, "author_flair_text": null, "body": "Right now, I work 40 hours a week and my husband works 50 hours+, and I can honestly say he does at least 50%.  He does all the baths, gets him dressed for bed, and since I leave earlier than him he also gets our son ready every morning and gets him to daycare.  We switch off nights for bedtime stories.  He also does laundry and vacuums.  I brush our son's teeth at night, get him dressed after his bath, do dishes, cook, and do the scrubbing cleaning.  I don't think I'd be happy in a relationship where it all fell to me.  It's our kid, not just my kid, and it just makes sense that we would both care for him together.", "can_gild": true, "created_utc": 1499718930, "distinguished": null, "edited": false, "id": "dk1ja6g", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499718931, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AppleCider17", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm fortunate that my fiancé is very hands on with our son and a very considerate partner, but yes I absolutely do most of the childcare and housework. To be fair he works and I'm on a year long maternity leave, but I'm also planning our wedding almost exclusively. He shows up when I tell him to. Yes, it's frustrating. Not sure this will ever change because I have expressed how much I have on my plate and he does help me but I always have to ask for the help. It's a weird dynamic. I am resigned to the fact that gender roles are just unbalanced at this point. ", "can_gild": true, "created_utc": 1499719111, "distinguished": null, "edited": false, "id": "dk1jgar", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499719112, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "_keyring", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm the mom in a liberal household. I'm the default parent but I'm a stay at home mom and my husband works full time. He makes way more money than I ever could so this is the way we've divided responsibilities. If I made more money, it would be the other way around. \n\n", "can_gild": true, "created_utc": 1499719698, "distinguished": null, "edited": false, "id": "dk1jzv1", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499719699, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Super901", "author_flair_css_class": null, "author_flair_text": null, "body": "Dad in very liberal household here. \n\nWife has been the breadwinner for the last few years, I have been the caregiver. I have literally thousands of hours more time spent with the kid than she does.\n\nWe split chores pretty evenly, but I'm the cook and do all the house repairs, renovations, etc. All in all it's been a pretty good arrangement.\n\nBut speaking for my contemporaries, I think the classic division of the sexes is still in play, for the most part. ", "can_gild": true, "created_utc": 1499719813, "distinguished": null, "edited": false, "id": "dk1k3s6", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499719814, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "danstermeister", "author_flair_css_class": null, "author_flair_text": null, "body": "I think there is a natural inclination, regardless of culture or political leaning, to have this as the 'norm'.\n\nI think it has to do with two main areas\n\n- **the pregnancy and birth bonds**. Mom has spent ~9 months with baby inside, part of it moving around. And then the miracle of childbirth can have an overwhelming affect on the person doing as opposed to the person witnessing it. \n\n- **the first few weeks of a child's life where Mom is recovering from the birth and Dad is busy keeping the rest of the world from crumbling in on them**. This is usually a completely pragmatic decision based on capability and bandwidth between the Mom and Dad. Then, as much human behavior seems to model, these roles turn into patterns of behavior that extend past the recovery period. Sometimes '*life*' makes that transition from ~80/20 to 50/50 difficult to impossible.\n\nNever disregard the effect stress can have on complacency regarding a less-than-ideal situation. Before the couple knows it, they're acting out the more 'traditional' roles 'because ruts', regardless of their previous perspectives on them. \n\nAdd to this the breastfeeding aspect that some have, and Mom may have a stronger psychological bond than Dad with the child merely because they are forced into positions of care that Dad cannot possibly replicate (*without formula, anyway*). That will always put Mom at an advantage for increased empathy/sympathy/concern towards the child/children. \n\nAdd to this multiple children, poverty, environmental stressors (*like Grandma lives with the family, or more than Grandma*) and you can have something that appears traditional but is really just pragmatic, nothing more. **Many couples are just people forced into positions they'd rather not be in, but do it because that's what it takes to make it work at all.**\n\n**Personal Note**\n\nAs a liberal Dad (*voted for Barak twice! I love that man!*) I personally took it to heart that I didn't want to fall into the traditional roles that Mom and Dad fall into. It was based on my assumption that the vast majority of parent couples before me did it because of their ignorant assumptions of the 'proper roles' of women and men that insulted women. \n\nHowever, I can say now with two little ones under toe in under a year, that Mom and I do what we do because that's how we can get it done best for our boys. Mom could 'work' as well or better than I could, and in fact is now looking into ending her career hiatus earlier than we first considered she might. Alternately, I could easily be a SAHD and she could be the single breadwinner in our family- I'd love that! But it didn't start out that way, and for a while after our start it became insane to consider re-aligning things simply for the sake of re-aligning them so as to not appear 'traditional'. Instead, we continued to do what worked until we saw the light of day (*Irish twins will keep you buried for at least a year and half!*). Also, every decision made was made based on what worked best while keeping as many options away from it open as we could (*in case the decision didn't pan out well*). Sometimes that looks to outsiders as a traditional conservative family, and we couldn't be any further from that :)", "can_gild": true, "created_utc": 1499720301, "distinguished": null, "edited": false, "id": "dk1kk43", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499720302, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "chefymum", "author_flair_css_class": null, "author_flair_text": null, "body": "I'm not sure what you mean by \"liberal\" here. For our family at least the decision as to which person takes care of the kids during the day is based solely on earning potential, not political leanings. We have what you would call a traditional family situation and even though I have more education than my husband he makes several times what I ever could in my field so his job/career takes precedence. That said, he is a very hands on dad when he is home. He did probably 80-90% of the night stuff with all 3 of our kids and he changes as much or diapers than I do. As far as household stuff, we split the chores up in a way that works for us.", "can_gild": true, "created_utc": 1499724205, "distinguished": null, "edited": false, "id": "dk1nzyw", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499724207, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "mrstry", "author_flair_css_class": null, "author_flair_text": null, "body": "We definitely started out the same way -- likely social conditioning from BOTH of our households growing up. Luckily we both are Redditors, and I was able to view the horror stories of other families and was able to use that to look at my own situation. Even though my husband is an amazing person, we both fell into the \"traditional\" roles -- we both cared for baby pretty equally but still favoring me, and household chores fell to me. We both work full time jobs. \n\nI put my foot down. We had a lot of unsuccessful conversations at first but he slowly started to see my view. I was responsible for the \"mental load\", most chores, and most baby stuff. He just had to work, help with baby, and I should \"ask\" if I need help with the chores. We are slowly working on helping each other, pulling our equal weight, and also realizing BOTH of our workload has doubled... We are both doing more... That just comes with having a kid. And feeling burnt out ourselves doesn't mean the other person isn't helping, either. \n\nIt's a balancing act and we both try to call each other out when necessary. ", "can_gild": true, "created_utc": 1499724501, "distinguished": null, "edited": false, "id": "dk1o8x9", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499724501, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "preciousfairyvagina", "author_flair_css_class": null, "author_flair_text": null, "body": "My husband is a truck driver and is gone a lot so I am the sole care giver most of the time. Right now he's home for a few weeks because I am 38 weeks pregnant and is doing a lot of the primary caregiving. He's perfectly capable and amazing as a dad but because of our situation the majority does fall on my shoulders most of the time. ", "can_gild": true, "created_utc": 1499724854, "distinguished": null, "edited": false, "id": "dk1ojcg", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499724855, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "catdoesthat", "author_flair_css_class": null, "author_flair_text": null, "body": "On the flip side: we are fairly conservative, and, while I'm a typical SAHM, we know several similarly conservative (I can name 4 separate couples off the top of my head) families in which the mom has a full time career and the dad is a full time caretaker. I'd bet there are more dads in /r/mommit than we realize because they tend to stay silent.", "can_gild": true, "created_utc": 1499728756, "distinguished": null, "edited": false, "id": "dk1rnh7", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499728757, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "BrokeWhoregan", "author_flair_css_class": null, "author_flair_text": null, "body": "It comes down to the fact that most men still make more money than most women, and tend to hold jobs that are more demanding and something you'd call a 'career' while a lot of women still just have a 'job'. Obviously this isn't always the case, but commonly. So even in a liberal and anti-gender role household, logistics dictate that if one of them has to quit, it's probably going to be the mom, and if they both go to work, it's probably going to be the mom with the flexibility at work to take off early when kid is sick, move to part time for a little while, etc. It's also further complicated by the demands of breastfeeding, when that occurs. Because of this parents tend to naturally fall into primary and secondary parent roles unless they're REALLY diligent about avoiding this.\n\nIt's unfortunate, I think most of us want a 50/50 ideal, but that is unlikely to impossible until women are equal wage earners in the majority of cases.", "can_gild": true, "created_utc": 1499729050, "distinguished": null, "edited": false, "id": "dk1rvm3", "link_id": "t3_6mg63q", "parent_id": "t3_6mg63q", "retrieved_on": 1499729052, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Overwine", "author_flair_css_class": null, "author_flair_text": null, "body": "This is spot on how things have worked out between my husband and I. ", "can_gild": true, "created_utc": 1499729928, "distinguished": null, "edited": false, "id": "dk1sk2d", "link_id": "t3_6mg63q", "parent_id": "t1_dk1epto", "retrieved_on": 1499729929, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "firefannie", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I do all of the research, but he takes care of the baby while working from home for himself.  He never posts things online, it's all me posting, but he's the one implementing a lot of the things I figure out.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502141924, "distinguished": null, "edited": false, "id": "dlaw5pv", "is_submitter": false, "link_id": "t3_6mg63q", "parent_id": "t1_dk1c1md", "retrieved_on": 1502141925, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}