{"submission": {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1501836475, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/6rj7ny/is_using_restraints_ever_justified/", "id": "6rj7ny", "is_self": true, "is_video": false, "locked": false, "num_comments": 70, "over_18": false, "permalink": "/r/Mommit/comments/6rj7ny/is_using_restraints_ever_justified/", "retrieved_on": 1502306815, "score": 6, "selftext": "[removed]", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "suggested_sort": null, "thumbnail": "default", "thumbnail_height": null, "thumbnail_width": null, "title": "Is using Restraints ever justified?", "url": "https://www.reddit.com/r/Mommit/comments/6rj7ny/is_using_restraints_ever_justified/", "view_count": null}, "comments": [{"approved_at_utc": null, "author": "GalwayLass", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "What age is your son?  If he's older than eight, he's old enough to understand and know that it's a normal procedure and they touch to check for abnormalities.  If he's a tween/teen, this has gone way too far without him stepping up, being responsible and doing what needs to be done (for all of 2 minutes).  Talk to him about it.  Letting him, or you, pass it off any longer, because it's awkward, isn't doing anything for his health.\n\n\nRestraints shouldn't be the first option, but if it was my kid refusing, I'd do whatever needed to be done.  As a cancer patient myself, these physical checks are the key to catching issues early and having a fighting chance.  Let him know, he can be compliant or that restraints will be used.  It's his choice which path he takes, but it still is going to happen.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501837451, "distinguished": null, "edited": false, "id": "dl5f6ga", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501837452, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Oh god...I feel really bad now. He is 11, so that means you would say it's definitely gone way too far? Ughhh I know I've been kind of bad about it, but I didn't think it had already gotten out of hand... but you definitely have me freaking out a little bit as an ex-cancer patient and mother yourself! (Congratulations on beating cancer btw!)\n\n\nI definitely don't think restraints will be the first option, I am still hoping they don't even need to be used! But isn't he likely going to freak out completely if I even mention them? Should I wait until we're already at the doctor's to let him know that whether he cooperates or not, he's getting checked?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501837977, "distinguished": null, "edited": false, "id": "dl5fdhr", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5f6ga", "retrieved_on": 1501837978, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "GalwayLass", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sorry 😐 my intent was not to make you feel bad, but rather, I wanted to alert you to the seriousness of the situation and relay/reinforce that time is always a factor.  My kids were 2 &amp; 4 when I was diagnosed, and I can be very pleased with the swift medical care I received.  \n\n\nUltimately, it seems as if he's avoiding an uncomfortable situation, and we all do that and procrastinate from time to time.  However, when it comes to medical issues, the best options are only available at the onset.  You have a bad cough, you see a doctor... long before you get pneumonia.  Catch cancer early, and survival rates are much higher.  Best case, absolutely nothing is wrong at all, and all the talking about it is more uncomfortable than the exam.  The build at this point must be exponential for him.\n\n\nAs far as when to tell him, you know him best.  I'm a preparer, so I talk and explain so my kids (now 5 &amp; 7) have realistic expectations.  One loves the dentist, one HATES! it to the point, we spend 2 weeks mentally prepping him and letting him know that it's his choice to cooperate and make it quick, or no cooperation and lots of crying and trauma (for everyone), which only makes it all the more difficult.  The last time was the best we've ever seen from him: no tears and about 80%-85% cooperative. 👍  Plus bribery... the more cooperative the better the prize/toy.\n\n\nYour son is likely scared, that's okay.  What needs of his can you meet to help him?  Does he want you in the room? to look away?  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501840720, "distinguished": null, "edited": false, "id": "dl5gdu6", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5fdhr", "retrieved_on": 1501840721, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It's ok, I really appreciate your replies! I think part of my feeling bad about it is that my intuition is telling me it isn't going to be that easy to go through. And maybe that's my fault because I let it slide for so long? But I think I am just dreading having to actually have him put in restraints. I am not even sure I'm prepared for that. How do you handle seeing your kid crying and struggling?? I am having a hard time with it even though I know it might be necessary, I want to make sure I do the right thing.\n\nI really have tried talking to him and letting him know that it is something that all boys get done, and he is going to HAVE to do it at some point, but it doesn't seem like he takes me seriously. We haven't even gotten to a point where I know whether he would rather I be in the exam room or not because he just doesn't want to talk about it. I'm  feeling like I'm going to have to spring it on him when we're at the doctor's office, but isn't that kind of dishonest of me?\n\n\nI also feel totally lost because I've often him practically every bribe imaginable but he won't accept anything, he always tells me something like, \"mom, there's nothing that would be worth letting a doctor do that...\" it's frustrating, but it also makes me think that his sensitivity is maybe THE factor. So how am I supposed to get around that? It seems like there isn't much I can do to make him any less physically sensitive.\n\nI guess in my mind I just keep wondering, is it ok to make him get checked even if he hates it? It sounds like from your experience that I do need to. It also sounds like it gets better over time? Did things get easier/better for your kid after their first experience at the dentist?\n\nThank you so much for your insights! It does help a ton to have another mother reinforcing the seriousness of all of this!\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501841622, "distinguished": null, "edited": false, "id": "dl5gq6y", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5gdu6", "retrieved_on": 1501841622, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "sugarpumpkin334", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Oh my god don't use restraints to check his balls. If it's necessary, talk to him about why, when and how it will happen, let him write down a list of questions for the Dr and make an appointment. I would consider getting something prescribed for his anxiety just for the day, like some people do for the dentist. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501842123, "distinguished": null, "edited": false, "id": "dl5gxnm", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501842124, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "kniob26", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Another thing to think about is possible sexual abuse in his past. Could that be contributing to his fear? 11 years old seems too old to remain so paranoid about this. \n\nI don't think the benefits of cancer screening outweigh the risk of restraining an 11 year old. You could always ask him if he feels any lumps in his testicles, if you are worried about cancer. More common testicular problems would be infections of the region or a hernia. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501842668, "distinguished": null, "edited": false, "id": "dl5h5iv", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501842670, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I feel horrible about it as well! But I don't know what else to do exactly!\n\nWe have been to several doctors exactly as you described. They described what they would be doing, why the checkup was important, and that all boys get it done. But when it comes to actually getting a testicle check done (like the doctor asks him to pull his underwear down to be able to check him), my son has either bolted out of the office, or, even worse, physically lashed out and hit one of the doctors to stop them from checking him and then run. I've had to hunt him down in parking lots several times.\n\nI've sat down with him multiple times to explain why it's important as well, but I don't think he takes me very seriously because he is so hung up on his sensitivity, which only makes me more worried about it.\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501842792, "distinguished": null, "edited": false, "id": "dl5h7ca", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5gxnm", "retrieved_on": 1501842793, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Well, that was also part of why I have him seeing a therapist. Both his therapist and I are pretty confident that he hasn't had any sexual abuse in the past (thank God!). I was also super worried about that. But unfortunately maybe something happened and it is just incredibly deeply repressed? I don't know how we would figure it out exactly, though so I don't know how to think about that aspect entirely.\n\n\nUnfortunately, I can't even get him to do self-checks like that because he has said that his testicles are too sensitive for him to touch and he can't really feel them because it's too much to handle. But other than that he insists he is \"fine\". I would like to believe that, but at the same time, can I trust him to be sure that he is fine aside from this weird issue with the sensitivity?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501843065, "distinguished": null, "edited": false, "id": "dl5hbgg", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5h5iv", "retrieved_on": 1501843067, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "GalwayLass", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'm not one for blindsides or ultimatums either.  I'm more of a tell it like it is, now let's get this shit done, so we can go have some fun.  Bribery only works as a motivation.  Along with bribery, I've tried to instill that the reward for good behavior is connected to being about them learning to be responsible, and the bribery only lasts for so long for said event.  Yes, it totally gets better, because they desensitize to the situation.  \n\n\nIf bribery is off the table, it's just time to get it over with.  If he's more grip and rip or if he's going to pull a runner on you and not show up than spring it on him.  If he's understanding and not an outburst kind of personality than this is a step toward growing up.  Just like monthly at home breast exams for females, males should be checking their own testicles.  The important part is both males and females get familiar with their bodies and are more aware of any changes.\n\n\nPersonally, I'd talk to him and lay all the issues and risks, like cancer, on the table, and let him express his concerns.  All you/the doctor needs is about **100 seconds** of his time, cooperative time; that's all.  It's embarrassing; we get it.  Teaching our kids to look after their own health and be aware of changes is integral to them growing up into healthy individuals and bringing those concerns to us parents is really important.  Are his issues also because it is or has been a female doctor?  Then, make light of it.  Have him ask him/her how many handful of testes they've held in her career.  Really, these doctors are professionals and went to school for a long time just to look at people's junk all day long.  Does he fear that he'll ejaculate on the doctor?   Won't be the first one, and not the youngest either.\n\n\nIf you get nothing out of him, leave him with this:  The *idea* of embarrassment or fear is a ticking timebomb 💣 when it comes to health issues.  **His life is worth 100 seconds, and so is your sanity.**", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501843998, "distinguished": null, "edited": false, "id": "dl5hpvm", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5gq6y", "retrieved_on": 1501843998, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "sugarpumpkin334", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That must be really hard, I'm sure a sedative would be better than restraints though, then you can get it over and done with. Would he let you do it if you knew what you were checking for? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501845866, "distinguished": null, "edited": false, "id": "dl5ikgl", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5h7ca", "retrieved_on": 1501845867, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Unfortunately, I don't think so :/ We have tried that approach before when he attacked the doctor for trying to approach him to initiate the check.\n\n\nHe will have some anti-anxiety medication, but I am still worried it might not be enough. The doctors are extremely against using anything overly heavy (there are apparently not only physiological factors at play, but legal ones from what a few doctors have told me).", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501846390, "distinguished": null, "edited": false, "id": "dl5itrk", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5ikgl", "retrieved_on": 1501846392, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "SirSie", "author_flair_css_class": "green", "author_flair_text": "Twins and a big sister", "banned_at_utc": null, "body": "If they are so sensitive, why aren't you getting them checked anyway?\n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501857495, "distinguished": null, "edited": false, "id": "dl5qr0c", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501857496, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "StuffyMcFluffyFace", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'd say it's important to get over this hurdle not just to be able to do these checks, but in the event that he's in an accident or has trauma on or near his testicles, it would be a real hinderance if he's physically resistant to receiving help. What if he needs surgery and they want to put in a catheter? \n\nYou might want to ask over in /r/daddit or another sub where people more familiar with testicles might have some ideas. \n\nI wonder if using exposure therapy would help him, and maybe using a therapist that utilizes that within cognitive behavioral therapy. Essentially they would help him identify the most extreme anxiety-inducing situation, and then work his way backwards (what's slightly less anxiety inducing?) all the way to something that doesn't cause anxiety, for example just sitting and talking about something unrelated. Once they have everything labeled, they start exposing him to the least anxiety-inducing situations (maybe something like, sitting and talking about getting checked), and as he becomes more comfortable, more tolerant of situations, they introduce more and more elements. For adults it's usually spread over 6-12 weeks.  Here's a little more about it: https://www.kidsinthehouse.com/special-needs/mental-health-disabilities/exposure-therapy-for-children", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501857888, "distinguished": null, "edited": false, "id": "dl5r3we", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501857890, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'm not exactly sure what you mean? I guess the answer is probably, well, it seems like he is really going to hate it, and maybe I've just been too nice about it :/", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501858054, "distinguished": null, "edited": false, "id": "dl5r9bl", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5qr0c", "retrieved_on": 1501858055, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I don't think it is a general aversion to getting help since he hasn't had any other problems with doctors for the most part. He has even taken things like vaccines and trips to the dentist really well!\n\nHis therapist definitely took him through some exposure therapy, but not to the extreme of actually getting checked obviously. That is part of the reason I'm at this crossroads because his therapist things that he's come about as far as he can just talking about and visualizing it to reduce the anxiety. She thinks it's pretty much come down to his physical sensitivity, and that having him actually get checked would be the final step in exposing him to it, so either we will find something wrong (hopefully not, but who knows at this point), or at least push him to get used to the sensitivity. She actually thinks I should definitely be pushing him to get checked every year to help desensitize him to it and normalize it. Maybe I am just dreading the initial push too much at this point?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501858734, "distinguished": null, "edited": false, "id": "dl5rvqc", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5r3we", "retrieved_on": 1501858735, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "StuffyMcFluffyFace", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Can he handle dropping his pants and letting someone look in the direction of his testicles from 5 feet away?\n\nAlso proper exposure therapy involves the actual element of exposure and is beyond visualization, so I'm not surprised that hasn't helped.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501858933, "distinguished": null, "edited": false, "id": "dl5s2bd", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5rvqc", "retrieved_on": 1501858935, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Well, yes, he doesn't enjoy it, but he can. Although it's mostly been a string of outbursts and running, the last doctor he saw convinced him to drop his pants/underwear and just have a look. But as soon as touching was brought up he pulled them up and bolted.\n\n\nHow would exposure therapy progress in this kind of case though? Should his therapist be...touching him? Somehow that sounds bad/weird to me, but maybe it's true?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501859263, "distinguished": null, "edited": false, "id": "dl5sd68", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5s2bd", "retrieved_on": 1501859264, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "StuffyMcFluffyFace", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Being allowed to touch someone for medically-related reasons is licensed by state, and therapists typically are not licensed to touch, so I imagine the therapist would have to be more creative, like getting the doctor involved.\n\nBut with exposure therapy you get to the level of tolerating the current situation before progressing to the next. Considering that touching/examining the testicles is the most extreme situation for your son, I would guess there would be many previous steps prior to that. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501860530, "distinguished": null, "edited": false, "id": "dl5tl1c", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5sd68", "retrieved_on": 1501860550, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; If they are so sensitive, why aren't you getting them checked anyway?\n\nThis was my thought too.  If this part of his body is so sensitive, I'm going to want to know WHY it's so sensitive.  If it is painful to touch someone's arm and there's no obvious indicator that it should hurt, you're going to get it checked out - despite the fact it's physically uncomfortable.  \n\nMy concern is that there *is* something actually wrong that needs to be found so it can be treated. \n\nStart slow if you have to.  We're going to look with our eyes.  Then I'm going to ___. (We and I being the doctor)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501864940, "distinguished": null, "edited": false, "id": "dl5xst6", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5r9bl", "retrieved_on": 1501864943, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Well, the last time a doctor tried that he let her take a look, but pulled up his underwear/pants quickly and bolted out of the office faster than we could grab him when she got to the part where she said she was going to touch his testicles.\n\nI guess it's just time to face the reality of having to make it happen at this point.\n\nI think for some reason in my head it just seemed different than an arm or something because it's a \"private area\" you know? I really appreciate your comment, it helps frame it better in my mind. I kind of feel like an idiot about it now.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501865703, "distinguished": null, "edited": false, "id": "dl5yjqf", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5xst6", "retrieved_on": 1501865704, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "DON'T feel bad.  \n\nWe (both as parents and as a society) spend so much time freaking out about private areas that it is natural to feel triggered about the idea of forcing your child to let someone touch and look at their genitals... If this person *wasn't* a doctor and you weren't asking for medical advice, you'd be flamed for considering restraining your child so they could look at his testicles!\n\nHold his hands.  Be there with him.  And explain to him that the doctor has to examine him BECAUSE of the sensitivity.  He may fight it... he probably will... but like many others have said, if he's this sensitive, it could be a symptom of something much more serious than \"Don't touch me.\"  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501866906, "distinguished": null, "edited": false, "id": "dl5zqfh", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5yjqf", "retrieved_on": 1501866906, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "seraphin22", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "There are justified times for restraints (autism, mental disabilities, suicidal), but I personally don't think that an 11 year old who is very influenced right now by sexual stuff and their body should be restrained to force someone to touch their testicles. \n\nWhat steps have you taken before when he has gone to be examined? Have you physically held him still? Has he been sternly told that's enough and to sit still and respect the doctor and you? \n\nHope you can figure something out :) \n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501867323, "distinguished": null, "edited": false, "id": "dl6051b", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501867325, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "_ShortGirlProblems_", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "This is tough.  I hate the idea of restraining a child for something like that.  I like the idea of kids having bodily autonomy and making decisions about who touches them and who they touch.  BUT it sounds like something could be medically wrong.  Have you explained to him that his hyper sensitivity is not normal and they need to check to see if something is wrong?  Not to scare him, but he sounds like he's old enough to maybe explain the reason.  It could help him feel better.  Could you get him to promise not to lash out at the doctor and trust him to keep that promise?  Have you asked him if he'd be more comfortable with a male or a female doctor, maybe?  Give him some say in how and when it's going to happen?  It really seems like it needs to happen.  I guess I'd go with the idea of \"this is happening, but you can make some of the decisions\".  Maybe if he knows it's inevitable he'll make the choice not to have restraint.  Maybe he could get some sort of stress ball to squeeze or something?  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501870685, "distinguished": null, "edited": false, "id": "dl63dyr", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501870686, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "patch171", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Listen, this needs to be done. Having testicular sensitivity so severe that he cannot perform a self-check is worrying. He is 11. He does not know what \"fine\" is. This has built up into a phobia. Talk to him about what needs to happen, but you are the parent. Part of that is to make sure that he is healthy. You are doing a good job that you are addressing this with a therapist, but this has gone on too long. You would not let painful sensitivity in any other part of the body go on without a doctor's assurance. \n\nWhy did he begin therapy? Did he start therapy because of this issue? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501870796, "distinguished": null, "edited": false, "id": "dl63hqh", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5hbgg", "retrieved_on": 1501870797, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I think I would tell him thst he absolutely HAS to get them checked. This is not something he has a choice about. But what he CAN choose is the method. Acknowledge that it is hard for him,  that he is scared, that he doesn't want to be hurt. He and the doc can maybe come up with a way for him to communicate during the exam. He can announce his pain levels every 30 secs, and if it gets to above a 5, the doc will give him a 60 sec break and try again. Tell him that he will have to stay still during the exam. Offer him the restraints as a tool to help with that.  This is something he has to do. He can try it without restraints, or he can choose the restraints to help him stay still.  It is a terrible thing to have to hold your child down for a medical procedure. My 4 yr old nephew has serious illness and my sister has to restrain him for IV at least once a month. For your son, the lesson that we sometimes have to do hard things to take care of our bodies is a good one. He is old enough to be in on some of the conversation, but he is NOT old enough to make the decision about kid it gets done.  I do think restraints are appropriate, and even helpful, in this case.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501874188, "distinguished": null, "edited": false, "id": "dl66orw", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501874190, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "melissarose8585", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I can speak from a child's perspective somewhat - I had a dental phobia, a mouth full of cavities, and ended up being restrained for fillings. After I realized the numbing stuff worked I was cool with it. No trauma from the retraints now and I understand why it was done.\n\nI know my parents hated the choice, but  they had also tried everything else and it was a serious medical situation that needed taken care of. I cried, yes. I was pissed. But I'm over it and it was necessary. THIS is necessary. Try everything else but this needs to be dealt with. Think about the consequences - sports physicals, sexual activity, medical needs like prostate checks. He can't live with this fear.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501874324, "distinguished": null, "edited": false, "id": "dl66teg", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501874326, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Reddifarii", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Ok I'm gunna be the one to say it.... maybe he feels like he's not supposed to have them in the first place and he's embarrassed about it? I'm going trough something similar in my family also. Please don't attack me lol", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501879858, "distinguished": null, "edited": false, "id": "dl6bw12", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t3_6rj7ny", "retrieved_on": 1501879859, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That is some kind of a relief to hear! Thank you!\n\nI think part of my worry here is that something like this could be traumatizing long-term, and it makes me feel a lot better to know that it most likely won't be. I mean, the doctor I'm taking him to has said it's not like he is the only boy ever who has had a similar issue, and she told me that even when she has used restraints to be able to perform testicle checks that the boys usually forget about it pretty quickly after they get over the initial checkup, but part of me feels like that's just the doctor trying to be reassuring. I mean, how could it not be a little traumatic, you know?\n\nDo you feel like crying related to the restraints would just be a sort of visceral response, not necessarily a deeply emotional one?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501897115, "distinguished": null, "edited": false, "id": "dl6ou22", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl66teg", "retrieved_on": 1501897116, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Thank you so much for this reply, I think this is the kind of thing I need to hear. I sincerely appreciate it. I guess it's time for some tough love, and I have to accept that. I really like what you said about talking about the restraints as a tool FOR him to be able to help him stay still. It seems so simple, but I never really thoughts about it! Even though his doctor did mention that a huge part of why she would recommend restraints would be related to the fact that he might be physically incapable of staying still, which could mean hurting her, or himself while getting checked, but I didn't really think of spinning it to my son that way for some reason! That's great!\n\nI am still worried about having to exercise the option, but I am definitely going to try this, and hope that he agrees. It sounds crazy, but maybe he would actually want the help of restraints if he views them like this? Maybe he's just been afraid of not being able to be still and cooperate properly because he simply can't.\n\nI am beginning to agree that he can't decide how he gets checked, though. But when would you say I should tell him he absolutely has to get checked? Only once we're in the exam room?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501897604, "distinguished": null, "edited": false, "id": "dl6p5z8", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl66orw", "retrieved_on": 1501897606, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Thank you for saying this, I really needed to hear it in some sense. I think the fact that it has to do with his testicles has really kind of clouded my judgment a bit more than I have wanted to admit. I'm also having a hard time bracing myself for if he really does fight it all the way. Like is he going to understand why I am just standing there holding his hand while the doctor checks him instead of letting him out of something he hates getting done?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501903639, "distinguished": null, "edited": false, "id": "dl6t1b3", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl5zqfh", "retrieved_on": 1501903640, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I also really struggle with the idea of restraints, but other doctors, his therapist, and I have all explained the reasoning for him. I don't know if he would promise not to lash out, but I am not sure I would trust his promise even if he was willing to make it based on his past behaviour, which often seems to be driven by impulse more than anything. But I do know that he would prefer a \"lady doctor\" for whatever reason, I'm not sure why, but at least the specialist I booked his appointment at is a female, so I am hoping that that is something!\n\nI really hope you're right that just letting him know he has the choice not to be restrained, but that he doesn't have the choice not to get checked will be enough to get him to cooperate, but...my mother's intuition is kind of telling me it won't be so easy :/\n\nI like the stress ball idea, I'll pick one up to bring with us!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501903959, "distinguished": null, "edited": false, "id": "dl6t84y", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl63dyr", "retrieved_on": 1501903960, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Yes, I've tried being stern with him before, but it seems like he loses control of himself when it comes to the point of a doctor needing to touch him. I've tried holding his hands at his sides, but when he freaks out he can break free, or he's way too volatile for the doctor to check him safely.\n\nSo both of those options are out, unfortunately :/\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501904111, "distinguished": null, "edited": false, "id": "dl6tbcs", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6051b", "retrieved_on": 1501904112, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "seraphin22", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That's shocking. I'm very sorry. I think maybe restraints are fair at this point if he can't control himself.  Sorry you guys are having to go through this.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501907220, "distinguished": null, "edited": false, "id": "dl6v30x", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6tbcs", "retrieved_on": 1501907221, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I love what one of the other commenters said about putting it to him as offering restraints as a tool and letting him make the choice for how he is examined.  He gets examined either way - that part he doesn't have a choice about, but at least he has some say.  \n\nThe choice is the red or blue shirt.  He's wearing a shirt either way, but he gets some sense of control over which shirt he's wearing... \n\nSometimes it's easier to think things through by putting a less triggering topic in play.  Testicles - everything comes up red flag.  Arm/clothing choice... quite a bit less sensitive in subject matter, so easier to logically think through the process.  \n\nI wish you luck, Mom - this can't be an easy process to be going through, but has to be done for the health of your son &lt;3", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501908285, "distinguished": null, "edited": false, "id": "dl6vnry", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6t1b3", "retrieved_on": 1501908286, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Thank you, I really appreciate your support!\n\nI know, it's really shocking to me, too, so I am trying my best to accept it for what it is, sigh. I feel like Monday is not going to be a fun day.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501908966, "distinguished": null, "edited": false, "id": "dl6w0si", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6v30x", "retrieved_on": 1501908967, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; I wish you luck, Mom - this can't be an easy process to be going through, but has to be done for the health of your son &lt;3\n\nThank you so much for this! I am so grateful for the support! It's hard for me to come to terms with, but the support here has been great. I also really loved the idea of framing the restraints as a tool for him to help stay still. I can't believe I didn't think about that before!\n\nYou're right, when you put it in the context of \"does he need to wear a shirt?\" it seems obvious that the answer is yes. I am feeling better about having made his appointment at least. But I still feel like it isn't going to be a very fun day for either of us. Sigh.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501909128, "distinguished": null, "edited": false, "id": "dl6w3sd", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6vnry", "retrieved_on": 1501909129, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It won't be a fun PART of your day.  Plan something big for afterwards  - go for frozen yogurt or bowling... Do something that is a special treat for him to help take away the yuck of the day.  \n\nThe appointment will suck, but afterwards, (a) he'll have accomplished something that scared him before, (b) you'll be able to get some answers, and (c) FRO-YO!!\n\nLet us know how it goes after the appointment - we're all rooting for you here!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501910216, "distinguished": null, "edited": false, "id": "dl6wnnp", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6w3sd", "retrieved_on": 1501910217, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I was actually planning on letting him hang out all day/night with some of his friends after the appointment. I feel like he isn't going to want to be around me for a while if I have to let the doctor use restraints. But would it be better to do a mutual activity with him you think?\n\n\nI really, really appreciate everyone's support, it helps to have a bunch of other mom's rooting for me! I'm really glad I stumbled upon this place!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501910902, "distinguished": null, "edited": false, "id": "dl6wzxs", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6wnnp", "retrieved_on": 1501910903, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Agrees_withyou", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Hey, you're right!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501910907, "distinguished": null, "edited": false, "id": "dl6x01m", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6wzxs", "retrieved_on": 1501910908, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "About what?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501911025, "distinguished": null, "edited": false, "id": "dl6x25f", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6x01m", "retrieved_on": 1501911026, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "melissarose8585", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I mean yeah, I cried. I was upset. My mother immediately explained why I was restrained and stayed by me. She even asked me if I felt that, partially through, I could continue without them. When I said yes they removed the restraint, gave me a Walkman, and it went smoothly. With music and medication I ended up asleep!\n\nI would say crying will be part of it but it needs to be done. It's getting around how you both handle what will be, at first, a sense of betrayal that will matter. My mom did it through other options and letting me resume control.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501915251, "distinguished": null, "edited": false, "id": "dl6yyz4", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6ou22", "retrieved_on": 1501915252, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "melissarose8585", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Also - full disclosure. My restraints were straps on my arms and a lead vest  used for adult xrays to hold me down. I couldn't move at all. My head was secure in some sort of thing so I couldn't turn it either.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501915461, "distinguished": null, "edited": false, "id": "dl6z29p", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6ou22", "retrieved_on": 1501915462, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "You know your, son better than I do, so you might be able to answer that better than me. If it were me, I would probably not wait until the exam room because that is a tough thing to drop on him without any warning. It doesn't give you time to plan and strategize how he is going to get through it. That being said, the anxiety it may cause telling him early might be worse.  Personally, I don't like surprises. I like to know what is going to happen.  So, thinking a kid might feel the same way, I would likely tell. Then it is a series of choices.  \"You can walk up to the office, or we can get someone to carry you kicking and screaming.  Which do you prefer?\" You can try it workout the restraints, but it might be bettrr/safer for you to stay out with the restraints. If you move during the exam,  you will need restraints, and thou might not be able to control if you move or not.\" He is going to need to find a way to dig deep and find the inner emotional stamina to get this done. Your job is to be very firm that it is going to get done no matter what (do NOT waver!) but find the right combo of supports, bribes and choices that will get him there. He isn't going to want other people to see him kicking and screaming.  He is going to want to walk in there dignified. Reward him with something he wants.  Give him choices where a mature and dignified option is the way to go, but if he doesn't choose it, it's happening anyway no matter what.  Because taking care of our bodies is paramount. He needs you to give him that firm boundary. Your job as a mom is to teach him to get health concerns checked out no matter what. If he doesn't learn this,  his life could be at risk somewhere along the line.  Compassion, support, firmness.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501920340, "distinguished": null, "edited": false, "id": "dl70wn7", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6p5z8", "retrieved_on": 1501920341, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "_ShortGirlProblems_", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'd go with your gut then and have him restrained.  I hate the idea, but I'd also be mad at myself if I let something wrong go untreated in my kid.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501940840, "distinguished": null, "edited": false, "id": "dl78nhu", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6t84y", "retrieved_on": 1501940841, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I would do something special with him for a little while after then you can still let him have a day with his friends.  For my son (5) taking that time where I don't have to be the bad guy to remind him that I can be his friend too is important - especially after something big like this.  \n\nGo for Fro-Yo and roller skating (or whatever he enjoys!) for a couple hours and then he can go out with his friends after - of have friends come hang out for a slumber party.  \n\nHe may not want to be with friends either - he might feel violated if it comes to needing the restraints :( ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1501947733, "distinguished": null, "edited": false, "id": "dl7d6dc", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6wzxs", "retrieved_on": 1501947734, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Do you think that I should start him off in the restraints and see if he will calm down if we let him out of them?\n\nHaving a bit of last minute anxiety. I've been trying to make the weekend as fun and relaxing as possible for him (and me), but I just tentatively brought up the idea of testicle checks earlier today and he totally shut down on me. I just let it go, and am pretty sure I am going to go with the path of not telling him what we're actually going to the doctor for on Monday at this point.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502011258, "distinguished": null, "edited": false, "id": "dl8gj8x", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl78nhu", "retrieved_on": 1502011259, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'm trying to make this weekend extra pleasant for both of us as well. But I tried just bringing up the subject of testicle checks earlier today and he was completely closed off about it, so I am having some last bits of anxiety, and I don't think I will tell him that his appointment is actually for a testicle check on Monday :/\n\n\nDo you honestly think he is going to feel violated?? That sounds like such a traumatic word, I don't know how to feel about that! Especially if it might be so bad he couldn't even be around his friends :/ How am I going to transition to being \"good guy mom\" if I have to make him get checked with the restraints? I feel like he's going to want to be as far away from me as possible even if I want to do something nice for him after. How do you think I could explain to him that I had to do it if it comes to that point? Should I just reiterate that it's something that all boys need to get done and he's not alone?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502011507, "distinguished": null, "edited": false, "id": "dl8glz3", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl7d6dc", "retrieved_on": 1502011507, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Agrees_withyou", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Hey, you're right!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502011671, "distinguished": null, "edited": false, "id": "dl8gnsc", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8glz3", "retrieved_on": 1502011672, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I appreciate this comment so, so much! I have been working on making the weekend fun and relaxing for both of us, but (as I've mentioned in a couple of other comments) I tried to bring up the general subject of testicle checks today and my son was super closed off about it. So I deflected and let it go, but now I'm pretty sure I will have to get him to the doctor without letting him know that he's going for a testicle check as much as I would like to prepare him. I think it is almost guaranteed that he will run on me. I'm almost worried maybe I made him a little suspicious by bringing it up today at all :/\n\n\nI really enjoy your explanations, and am going to take some of your phrasings to heart. You're right, I really have to learn to just be completely firm about this and not let him make any excuses. But I am just dreading the possibility that his fear might overpower him, and seeing him carried into the office kicking and screaming would be an absolute nightmare. Do you think it would honestly be ok for me to have nurses do that if I can't get him inside for some reason?\n\nIf it comes down to the worst case scenario, another commenter said he might end up feeling violated, what could I tell him afterward? I am not the meanest mom in the world, so I feel like he is going to completely hate me if it comes down to it! :( I know I have to be firm, but how can I explain that I had to have people carry him in kicking and screaming and that I let him be strapped down while a doctor touched him in his private parts?? I am REALLY hoping it doesn't come to any of that, but I just feel like I need to have SOMETHING prepared for if it does. I totally get compassion and support, but I am afraid I am new to the tough love kind of firmness that this whole situation requires. Sigh.\n\nDo you think it would help to just reinforce that it's something all boys get done? Would it be better to tell him that I wanted the doctor to check him to make sure he didn't have something extremely wrong? Or do you think it might be better to lie a little bit and suggest that because of school requirements and the doctor pushing for it, and all the other boys having it done, it was kind of out of my control? I realize maybe that's me wanting a little bit of a cop out, but I also feel like maybe he won't see me as so much of a \"bad guy\" who betrayed him if he thinks I was sort of forced into taking him?\n\nI'm sorry if I am sounding a little crazy. Just having some final jitters, but tomorrow is going to be a really fun day for him, so I am looking forward to it. I honestly appreciate any tips you might have, though, you seem way more experienced and wise about this than I am! I really appreciate it more than you can possibly know!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502012147, "distinguished": null, "edited": false, "id": "dl8gt1u", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl70wn7", "retrieved_on": 1502012148, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "How do I handle the sense of betrayal?? I am getting a little worried that the other mothers here are throwing around words like \"violated\" and \"betrayal\". Am I really going to do something violating and betraying to my son?? Is there anything I can do alleviate that in your experience? Some of my ideas from another comment:\n\nDo you think it would help to just reinforce that it's something all boys get done? Would it be better to tell him that I wanted the doctor to check him to make sure he didn't have something extremely wrong? Or do you think it might be better to lie a little bit and suggest that because of school requirements and the doctor pushing for it, and all the other boys having it done, it was kind of out of my control? I realize maybe that's me wanting a little bit of a cop out, but I also feel like maybe he won't see me as so much of a \"bad guy\" who betrayed him if he thinks I was sort of forced into taking him?\n\n\nI sincerely appreciate you sharing your experiences with me, it's a huge help and it's probably not super easy to share either!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502012283, "distinguished": null, "edited": false, "id": "dl8guk4", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6yyz4", "retrieved_on": 1502012283, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Hey, sorry, I didn't see this comment somehow! I am not totally sure what you mean, but I think something like that would have been revealed and dealt with during the course of his therapy?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502012343, "distinguished": null, "edited": false, "id": "dl8gv6t", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl6bw12", "retrieved_on": 1502012343, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Yes, having him carried kicking and screaming, restrained and examined could very well be a nightmare for both of you. Oh well, too bad. It's something you have to do. You both need to find the inner fortitude to get this done. And you, mama, need to find it first. Yes, you need to get him in there by any means necessary. If it means calling security and getting help, so be it. You HAVE to do this.  Call the office and ask what the options are if you can't get him in the door. As for him feeling violated,  it might happen. I feel violated every time I go to the dentist. I hate having someone mucking about in my mouth,  telling me to floss more. Sometimes we have to do things we don't like or that don't feel good to take care of ourselves. Your son isn't going to hate you,  but he might be upset with you. Again, oh well. Kids get upset with their parents. You can't make him being upset a roadblock to his health and wellbeing. Tell him whatever you want. The truth, \"they are super sensitive and we have to get them checked out\", a partial lie \"Everyone has to get this for school\", or a total lie, \"let's go for icecream\", but get him there.  Again, you know your kid better than I, but if it were me, I'd go for a version of the truth. I know you don't want to be \"the bad guy\" in his eyes,  but honestly  (and with compassion), you are being the bad guy now by not getting a medical need of his taken care of. Not only does he have an issue that could be serious,  you have taught him that medical issues can be ignored. You might want to do a therapy visit for yourself to investigate some of this.  How can you best serve your son? By being afraid of being the bad guy, or by doing what needs to be done no matter how hard it is on you? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502020757, "distinguished": null, "edited": false, "id": "dl8jnb5", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8gt1u", "retrieved_on": 1502020759, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "_ShortGirlProblems_", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "You know your kid best.  I think I'd personally prefer to tell my kid, but I don't know your kid or how he'll react.  My main concern with not telling him is that he's not going to trust you in the future.  I'm sorry, you're really stuck between a rock and a hard place on this.  Is there something fun or rewarding you could plan to do afterwards?  Ice cream, a trip to the zoo or a museum, or picking out a new toy?  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502028470, "distinguished": null, "edited": false, "id": "dl8nfoj", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8gj8x", "retrieved_on": 1502028470, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I don't know about you, but personally, I feel slightly violated every time I have to get a pap smear... I do it because it's for my health, but that doesn't mean I enjoy it... for someone who has a history of sexual abuse, what is a routinely unpleasant experience for me may be a traumatic event for them because they have a specific sensitivity (mental in this case) to any kind of contact to their genital region.  With any kind of exam to that area - even for someone who doesn't have a specific hang-up about those body parts - there is a small amount of violation that happens.  For a child who has an especially sensitive reaction to even the *idea* of someone coming in contact with his genitals, honestly, feeling violated that Mom is forcing him to be touched there isn't far fetched - it's a reasonable conclusion.  \n\nAnd yes, it is a traumatic word, because based on your description of his past reactions, it seems reasonable that this may be a traumatic experience for him (I'm sorry, keeping it real).  \n\nThe reason I say he may not want to be around friends is because it could cause a level of embarrassment for him - and maybe I'm over-reaching with that theory - I'd let him take the lead on inviting friends over/going out.  \n\nMy explanation to him would be that you and your doctors are very concerned by how sensitive that area is for him and you need to make sure it's not something more that's medically wrong.   This is something that everyone - boy or girl - go through to make sure they are fully healthy... I believe, based on what I've seen for my 5 year old son, that the amount of physical touch during a testicular exam for a child is fairly minimal and really is more about visual inspection than physical manipulation, but *some* touch is necessary.  You ARE being the \"Good Guy Mom\" restraints or no because you are doing what is best for your son and his health.  \n\nIt's a bitter sandwich.  Awesome weekend with mom, unpleasant experience, something extra special with mom.  It doesn't take away the upset, but it also helps to soften the blow.  \n\nThe reason you are going to a specialist is because they are familiar with handling this kind of situation.  They know how to approach the patient and how to reduce the trauma factor for their patient.  \n\nMom - You're going to be alright.  Your BOY is going to be alright.  You just need to stand strong, motherhood isn't for the feint of heart.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502037461, "distinguished": null, "edited": false, "id": "dl8tw6u", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8glz3", "retrieved_on": 1502037463, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "melissarose8585", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I truly don't know how to help on that part. I wish I had better advive but my kiddo is only 2 (currently he forgets my betrayals after I give him a cookie). \n\nI do hope it goes well!\n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502083976, "distinguished": null, "edited": false, "id": "dl9sl79", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8guk4", "retrieved_on": 1502083978, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Fingers crossed for tomorrow!\n\n\nFinding it a little harder to sleep than I would like, but trying to get into strong mom mode.\n\nDo you really think it might be traumatic, though? Is this going to affect him forever? How will I justify that if nothing major ends up being wrong?\n\nI really appreciate you framing it as me being the good guy by making him get checked, but I can't help being a little worried that I might be doing something that will affect him forever.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502091773, "distinguished": null, "edited": false, "id": "dl9w8qv", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8tw6u", "retrieved_on": 1502091774, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I think he definitely won't be cooperative if I tell him, but I'm already apparently accepting that I may be traumatizing him for his health, so can I really afford to pile on a total break of trust on top of that?? Ahh, having some last minute jitters even though I am trying my best to relax and get into strong mom mode for tomorrow, sigh.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502091847, "distinguished": null, "edited": false, "id": "dl9w9tb", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8nfoj", "retrieved_on": 1502091848, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Thank you for saying all of this, I really, really do appreciate it. I guess I never looked at it the right way, as in me being the bad guy already by NOT making him get checked. I feel like I have been more concerned about the nightmare it's going to be for HIM. I mean, can I really justify having my little boy carried into a doctors kicking and screaming and restrained for his most private parts? What if nothing is even really wrong? Am I going to traumatize him for life by doing this, and for nothing potentially?\n\nTrying my best to get into strong mom mode for tomorrow. Your comments have been a HUGE help, though, thank you!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502092091, "distinguished": null, "edited": false, "id": "dl9wdgq", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dl8jnb5", "retrieved_on": 1502092092, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Yes, it really does suck. Like \"hardest thing you'll have to do\" kind of suck. Hopefully there IS nothing wrong.  That would be the best outcome.  Have you done a risk analysis? What are the risks of not getting him checked out? What kinds of conditions could cause his symptoms? How serious are they? What are the long-term consequences? If the benefits of getting him checked out outweigh the risks of getting him checked out (emotional trauma, physical pain) then you have to do it. If there is no  likelihood that something is wrong, then maybe you don't have to do it. What do the doctors say?  Do you trust them?  Maybe you need a pre-appointment with the doc to get some questions answered, have a plan, and build some trust. If you are going to the appointment with him today,  remember he is going to take his cues from you. Stay strong,  calm, matter-of-fact, firm and supportive for him,  even if you are dying on the inside. Fall apart later,  when he isn't around.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502105965, "distinguished": null, "edited": false, "id": "dla1pp9", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl9wdgq", "retrieved_on": 1502105966, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "_ShortGirlProblems_", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Good luck!  Hopefully it goes ok!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502109797, "distinguished": null, "edited": false, "id": "dla3og2", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl9w9tb", "retrieved_on": 1502109798, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "PS - it isn't going to traumatize him for life.  Kids are resilient. With you guiding him through it, he can learn how to view it as a struggle, but one for a positive reason. My 4 year old nephew has been through so many medical interventions that he didn't want - screaming \"no\" in a completely heartbreaking way,  and he is one if the most vibrant, positive,  humor-filled, life - loving kids I know.  Your boy will be just fine. The exam might be hard,  but it won't give him permanent emotional trauma.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502111794, "distinguished": null, "edited": false, "id": "dla4wn6", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl9wdgq", "retrieved_on": 1502111796, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Take a breath, Mom!! \n\nIf nothing is wrong, then you'll be able to get direction for figuring out what to do next.  It might be that you continue with therapy, it might be that you end up going into more exploitative medical procedures.  \n\nI truly don't think that if it is initially received as traumatic, it will be short lived, but I wouldn't be surprised if the first little bit there's some \"stuff\".  \n\nI'm thinking about you and Alex today - hope everything goes well - you never know, he might surprise you!!  Let me know how today goes :)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502123061, "distinguished": null, "edited": false, "id": "dlaea4n", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dl9w8qv", "retrieved_on": 1502123062, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Ok, we will be going in in just a few hours, just wanted to say thank you again for the push to be strong, and the reassurance that I am not going to permanently traumatize him.\n\nHe's been to quite a few appointments previous to this one that he ran out of, and I know that although there are many benign conditions on the table, unfortunately, some form of cancer is also on the table. And of course I trust the doctors, and every one that I've talked to thinks he needs to get checked. I've just been hoping he would get over it on his own, or that I might find a doctor who had a different opinion, but here we are. We can't wait any longer, we have to get him checked today. so hopefully, it will turn out that he is ready.\n\nDoing my absolute best to put on the \"firm mom\" mask.\n\nThank you! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502123642, "distinguished": null, "edited": false, "id": "dlaeu6v", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dla1pp9", "retrieved_on": 1502123643, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Okay. Good luck mama! Sending you strength and love. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502123752, "distinguished": null, "edited": false, "id": "dlaexzm", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dlaeu6v", "retrieved_on": 1502123752, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Thank you!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502123758, "distinguished": null, "edited": false, "id": "dlaey8a", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dla3og2", "retrieved_on": 1502123759, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; I truly don't think that if it is initially received as traumatic, it will be short lived, but I wouldn't be surprised if the first little bit there's some \"stuff\".\n\nWas this a typo, or do you really think that it won't be just a small/short-lived traumatic thing for him if it ends up being traumatic?\n\nThank you for thinking of us today, though, putting on my firm mom mask and trying to prepare as much as possible. The weekend was really fun for both of us at least!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502123967, "distinguished": null, "edited": false, "id": "dlaf5er", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dlaea4n", "retrieved_on": 1502123968, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "YES, sorry!! TYPO... I DO think it would be short lived!!!!! So sorry - not trying to freak you out.  \n\nMy brain was going between \"I don't think it'll be PTSD inducing\" and \"I think it will be short lived.\"  (Pregnancy brain at it's finest at the worst timing!)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502125572, "distinguished": null, "edited": false, "id": "dlagoz3", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dlaf5er", "retrieved_on": 1502125573, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Oh, thank you! Whew!\n\n\nYou do think there will be some small stuff, though, but hopefully just a few minutes or a day of feeling awkward, right?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502126217, "distinguished": null, "edited": false, "id": "dlahbhv", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dlagoz3", "retrieved_on": 1502126218, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justme753", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "If anything at all, it wouldn't surprise me.  I would just let him take the lead for how it plays out after the appointment.  \n\nJust talk it out with him.  Let him express any anger or upset that he needs to, and make sure he understands this was because he needs to be kept healthy and that if his body is as physically sensitive as he lets on, you *have* to make sure it isn't something more serious than a sensory disorder/condition.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502129275, "distinguished": null, "edited": false, "id": "dlaka1j", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dlahbhv", "retrieved_on": 1502129296, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lizzydgreat", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "How did it go?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502191938, "distinguished": null, "edited": false, "id": "dlbq5mt", "is_submitter": false, "link_id": "t3_6rj7ny", "parent_id": "t1_dlaeu6v", "retrieved_on": 1502191940, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AlexsMomNeedsHelp", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I really appreciate you asking, I just posted an update, you really played a particularly helpful role, so thank you so much! I think this is the link to the update:\n\nhttps://www.reddit.com/r/Mommit/comments/6se945/are_restraints_ever_justified_part_ii_how_things/", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1502206469, "distinguished": null, "edited": false, "id": "dlc0xot", "is_submitter": true, "link_id": "t3_6rj7ny", "parent_id": "t1_dlbq5mt", "retrieved_on": 1502206476, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}