{"submission": {"author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1508289111, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/77377x/dadditor_needs_help_from_mommitors_post_pregnancy/", "id": "77377x", "is_crosspostable": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 83, "num_crossposts": 0, "over_18": false, "permalink": "/r/Mommit/comments/77377x/dadditor_needs_help_from_mommitors_post_pregnancy/", "pinned": false, "retrieved_on": 1508370471, "score": 28, "selftext": "[removed]", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "default", "title": "Dadditor Needs Help From Mommitors (post pregnancy change In Wife)", "url": "https://www.reddit.com/r/Mommit/comments/77377x/dadditor_needs_help_from_mommitors_post_pregnancy/"}, "comments": [{"approved_at_utc": null, "author": "morticia-addams", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sounds like she’s dealing with serious post Partin depression OR anxiety. I’m not really sure how you should go about getting her help but it’s clear she needs some ASAP.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508289762, "distinguished": null, "edited": false, "id": "doioyz4", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508289763, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Lt_Uhura", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Dont wait for pop psych diagnoses and prognoses here. GET PROFESSIONAL HELP PRONTO. This is not going to get better by itself and likely will get dangerous physically, as well as psychologically. She needs help. NOT normal. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508289783, "distinguished": null, "edited": false, "id": "doiozne", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508289784, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "mirukushake", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Postpartum depression can often manifest as anger (it definitely did for me), and depending on how well your LO sleeps, the sleep deprivation on top of it does not help. She may not take it well, but I think you need to gently as possible (and not at a time when you are fighting) suggest she go see a trusted doctor and have things checked out. She will probably not like it, but it may also help to have her mother or a friend suggest it as well.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508289977, "distinguished": null, "edited": false, "id": "doip5up", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508289980, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "A few notes for context:\n\n* Baby is exclusively breastfed. She doesn't take bottles, otherwise I'd have been helping with feeding long ago. My wife feeds her on demand, which I support. Her leaving our baby with me so she can have her own time is, frankly, impossible. Yes, I know how terrible that is.\n\n* Her baby-waking-up-in-the-middle-of-the-night routine involves her getting her out of the bassinet, taking her to the nursery to change her diaper, going to the living room to feed her, burping her, and giving her time upright to prevent spitting up and to fall asleep. It's a routine she developed and wants to keep in place. Every single time I woke up when she was getting our baby out and I asked if she wanted my help she gave me a very clear “No” with her head. She didn’t want any interruptions in the routine. We agreed that if she *does* need my help that she is to wake me up and I’ll take over. This has happened once, maybe twice, in the past couple of months.\n\n* She is a stay-at-home mom. I am at work at a full-time job M-F. She has her own personal business that she manages in her “own time” (obviously that’s a very relative term and I absolutely recognize that). She does what she can with our baby as far as activities outside the house are concerned, but anything she does must involve our daughter, so she’s doing kid things and not adult things. To reiterate, leaving our baby with me isn’t an option since she is exclusively breastfed. We have no friends or family here to help us. It’s us and that’s it. This also excludes daycare, which we can’t afford here anyway.\n\nWhen she isn't being overwhelmed with whatever makes her behave this way she is a terribly good person. She's a great mother who loves our daughter and is always looking for thing to help enrich her development. Her \"real\" self is nothing like the person I am living with now, but *this* person believes that she *is* the real version of her, and that her awful thoughts and feelings are genuine.  I don't believe it. We have our differences, and things haven't always been peachy keen, but that's nothing really extraordinary.  We used to hold hands, kiss, call each other by pet names, laugh and smile together. From the very day we got home from the hospital that all virtually completely disappeared.\n\nTo be fair, I know and am well aware that you're only getting my \"side\" of this; surely if she were to tell her perspective it would sound much different.\n\nI would like to get some insight into this. I know I'm not the only man who has experienced this kind of change in behavior. I wrote a nearly identical post in /r/Daddit and someone PMed me with a story so close to mine it was uncanny; I hadn't told the details I posted here, which made it more unreal.\n\nIs this PPD? Is it just the hormonal imbalance that's still working itself out? Both? Neither? I know you can't get inside her head, but this is my experience and I'm relaying it the best I can trying to be as objective as possible.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290045, "distinguished": null, "edited": false, "id": "doip85l", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508290047, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I hate to say this, but I know she won't be receptive at all. If her mother suggests it (or anyone else, for that matter) it would scream that I told them what was going on, which she would interpret it as me just talking bad about her behind her back.\n\nShe won't admit that she is wrong in any of this, so getting her to admit that she needs help is, I believe, virtually impossible.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290460, "distinguished": null, "edited": false, "id": "doipls8", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doip5up", "retrieved_on": 1508290462, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I know what you mean, but I'm not really looking for any kind of fake, clinical diagnosis. I want to know what women who have been through an experience like this (on my wife's side, that is) have to say about how they felt, what made them feel better, what it took for it to go away, how long it took to go away, etc.\n\nI'm relegated to handling this on my own. Admitting she needs help is an insult to the ego of this version of her; that would mean she was wrong, and that her horrible behavior is/was unjustified, and that's flat out unacceptable to this version of her.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290686, "distinguished": null, "edited": false, "id": "doiptdi", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiozne", "retrieved_on": 1508290687, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MrsStickMotherOfTwig", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Overnight diaper changes shouldn't be necessary for a 4 month old unless baby has pooped or has a rash. That combined with leaving the room with baby will wake baby up further and make overnight waking a habit instead of a needing something issue. And if baby wakes out of habit it's harder to get baby to stop that.\n\nThat aside, it sounds like your wife has something going on that needs professional help to deal with. We aren't able to diagnose her but her doctor can. Could you maybe go to your baby's next doctor appointment with your wife and bring up that you think she might need some help? The first few months she should be getting screened for PPD/PPA at baby's appointments as well (a questionnaire she needs to fill out plus a discussion with the doctor).", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290733, "distinguished": null, "edited": false, "id": "doipuy2", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doip85l", "retrieved_on": 1508290735, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "mirukushake", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Well, beyond calling the police and getting a psych hold on her, she has to help herself. It will take a while (it took me almost 8 months PP!) but you need to be consistent. When I got into a \"mood,\" my husband would say \"I don't think this will be a productive conversation. We will come back to this later.\" and physically leave the house. It gets hard to get yourself worked up when there is no target.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290749, "distinguished": null, "edited": false, "id": "doipvhb", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doipls8", "retrieved_on": 1508290750, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Did you go through PPD yourself? If so, can you recall your line of thinking when you were not yourself?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290772, "distinguished": null, "edited": false, "id": "doipw89", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doioyz4", "retrieved_on": 1508290774, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "kellomi", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sounds like a postpartum hormonal imbalance or exhaustion, but I wouldn't jump to conclusions. \n\nOne thing to consider: are you sure there havent been any major shifts in your behavior towards her? A lot of people tend to be lazy when they have a stay at home spouse, expecting them to pick up the slack. Does she need help? Is she saying anything about wanting more from you, or hinting at it?\n\nA good place to start is a couple's counseling session. That way, you'll have someone to moderate the discussion and help you gain insight into what's going on. If it is a postpartum hormonal imbalance (like old or ppa), its a safe space to suggest she seek further help.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290787, "distinguished": null, "edited": false, "id": "doipwps", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508290788, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "DD-VG", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I agree with the other commenters, you need to take her to see a doctor for PPD.  If this had been posted last year, I'd have thought this was a post from my husband. Your wife sounds very similar to how I was after my son was born. I was angry a lot over dumb things, and feeling like I had to do everything myself. \n\nGet your wife some help. Suggest she make an appt during a good time and offer to go with her if you can. Good luck!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290871, "distinguished": null, "edited": false, "id": "doipzft", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doip85l", "retrieved_on": 1508290872, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "epiphanette", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Obviously we can't diagnose your wife over the internet, but this is showing enough red flags for PPD that it would be downright irresponsible to not address it. \n\nIt sounds like getting her help is going to be really really hard. Could you maybe write her a letter?  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290886, "distinguished": null, "edited": false, "id": "doipzx3", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doip85l", "retrieved_on": 1508290888, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; It gets hard to get yourself worked up when there is no target.\n\nThat's a fair point, and it's what I used to do when she would get to her worst pre-pregnancy (it was a much more watered down version of her worst now). That would have been difficult last night (well, morning...2AM), but it's something I can easily forget when she's telling me she's seriously going to divorce me and keep our daughter from me as much as possible.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508290987, "distinguished": null, "edited": false, "id": "doiq362", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doipvhb", "retrieved_on": 1508290988, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MaaMaaMaaMaa", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I would not jump straight towards depression and anxiety. If you start the conversation off with those words, you will more than likely not have a positive outcome. \n\nShe is a new mom who is probably in need of a good rest. Could you offer to watch the baby for a few hours so she can nap or go have some alone time? Or maybe ask if she would be interested in a spa day?\n\nMaybe start asking what she needs. Does she need a glass of water while she is nursing? Or maybe help with a diaper change? Just ask. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291508, "distinguished": null, "edited": false, "id": "doiqjyn", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508291509, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ChemNerd19", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Can you get her to marriage counseling? Any counselor should be able to help come to terms with any post partum issues she may be having while not having to suggest this to her yourself and it come off as condescension. Hopefully she would take the idea of marriage counseling as a show of respect to her that you want to deal with issues. \n\nAlso, if she were posting, I would suggest cosleeping. When done properly, it is very safe and allows the mom to be much more rested.  Maybe that is something you can bring up. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291529, "distinguished": null, "edited": false, "id": "doiqkld", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508291531, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "tsfd7", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Just in terms of the exclusive breastfeeding: can she pump milk at some point during the day so that you can feed the baby during one or two feedings? The baby would still exclusively be getting breast milk but it wouldn't always have to come straight from mom, and that would give her the ability to leave the baby.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291645, "distinguished": null, "edited": false, "id": "doiqo96", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doip85l", "retrieved_on": 1508291646, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I really do try to help as much as possible.  It gets to be counterproductive, though, as I spend so much time trying to get things done for her/us/the house/baby/etc that I miss other things (obviously because there's a limited amount of time, effort, resources, and physical presence). In no way do I expect her to do everything.\n\nAs far as my behavior towards her is concerned, I honestly can't come up with anything. I get reeled into her fights sometimes, but I try to get myself out of them. However, as I noted above, I lose if I participate or not.\n\nI've suggested counseling; we went before she was pregnant and our last session was shortly after finding out she was pregnant. We literally didn't have the time to go anymore. She rejects the idea because we'd have to have the baby with us. I'd love to go to counseling, but she flat out refuses.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291705, "distinguished": null, "edited": false, "id": "doiqq5c", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doipwps", "retrieved_on": 1508291706, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That's amazing that you can relate to my perspective. Seriously. Did you one day just wake up and feel totally different? What did it take? If I could get her into therapy I would, believe me.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291796, "distinguished": null, "edited": false, "id": "doiqt2a", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doipzft", "retrieved_on": 1508291797, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "morticia-addams", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "My situation was a little different...my first daughter’s father had cheated on me and we were not together by the time she was born. I was constantly irritable with him for obvious reasons aside from any medical reason. \n\nHowever, I do have severe generalized anxiety disorder (diagnosed years after having my first) and unchecked it means I’m *extremely* irritable and not myself. That being said, I sought out help on my own...I’m not exactly sure what my reaction would have been if my husband had urged me. That’s so tricky.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291895, "distinguished": null, "edited": false, "id": "doiqwa3", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doipw89", "retrieved_on": 1508291897, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "You're absolutely right about diagnosing her being impossible, and it's not what I expect. But I do appreciate relayed experiences. It helps shed some light onto things.  It helps me understand that she's not alone in changing so drastically, and I'm not alone in the chaos trying to make sense of it all.\n\nYou're absolutely right: getting her help is next to impossible. Writing her a letter is an interesting idea. Would you have been receptive to that?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508291949, "distinguished": null, "edited": false, "id": "doiqy3s", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doipzx3", "retrieved_on": 1508291950, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'm certain that if she answers PPD questionnaires she isn't being objectively honest. She certainly doesn't believe she has a problem, so she won't say she does.\n\nWhat I meant about diaper changes was that she checks and if it's needed she does that before feeding her. I agree that the complexity of her routine actually contributes to the problem slightly. However I apparently wake up our baby with snoring, and things as simple as plugging my phone's power cord into my phone. Baby can sleep fairly well for the most part, but apparently I wake her up with things I do in my sleep.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292180, "distinguished": null, "edited": false, "id": "doir5d3", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doipuy2", "retrieved_on": 1508292181, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "epiphanette", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I don't think you have many better options. If you frame it very carefully as \"I love you and I want you to be happy\" then you might get through to her. But remember her perception of reality is off if she's suffering from PPD. She may be 100% incapable of seeing what's wrong. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292354, "distinguished": null, "edited": false, "id": "doiramx", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiqy3s", "retrieved_on": 1508292355, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "epiphanette", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Btw I would crosspost this to r/beyondthebump simply because it's a much bigger group.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292434, "distinguished": null, "edited": false, "id": "doird2d", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508292435, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'm always asking (to the degree that I'm not annoying) if I can do this or that for her. On her good days she'll give me a pleasant yes or no. On her bad days it's almost always a no so that she can make things difficult for herself just to complain about it later (a little self-fulfilling prophecy).\n\nRegarding getting her out for a spa day, like I said: it's out of the question. Baby feeds often, exclusively breastfed. Will not take a bottle.\n\nTrue story: my wife won't take naps. I suggest it all the time. She says they just make her groggy the rest of the day.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292480, "distinguished": null, "edited": false, "id": "doireik", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiqjyn", "retrieved_on": 1508292481, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "brindlepigdragon", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Have you asked her if she is depressed? I didn't experience ppd BUT I believe that is because I was already on medication for depression and anxiety, which I started a few months before becoming pregnant. When I was depressed I felt totally trapped in an inescapable loop of unhappiness. That trapped feeling made me often shut down and occasionally lash out. I finally went to the doctor for help after my mom and husband (in separate conversations the same weekend) asked me if I was depressed and begged me to get help. I'm sooo glad I did.\n\nWhen the baby was born, I spent the first several weeks feeling trapped. My life was no longer mine to control and well meaning suggestions to help (pumping so others could bottle feed) felt like more work and burden and made me feel like I was failing at being a mother. Thankfully I knew how to recognize the signs of depression in myself and talk with my husband when I felt completely overwhelmed.\n\nYour wife's actions toward sound like they are becoming abusive and probably a symptom of depression or anxiety. It's extremely unlikely that either of you are equipped to deal with this without professional help, of which there are several options.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292701, "distinguished": null, "edited": false, "id": "doirl7l", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiptdi", "retrieved_on": 1508292702, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "bluemarly626", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Question for you, who’s giving the baby the bottle when it is offered? My husband and I found that it was hard for him to give my son, who was exclusively breastfeed, a bottle. It took some patience and time. And maybe the baby going a little hungry sometimes u til he realized that that’s where his food was coming from. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292987, "distinguished": null, "edited": false, "id": "doiru48", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doireik", "retrieved_on": 1508292989, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "bluemarly626", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Question for you, who’s giving the baby the bottle when it is offered? My husband and I found that it was hard for him to give my son, who was exclusively breastfeed, a bottle. It took some patience and time. And maybe the baby going a little hungry sometimes u til he realized that that’s where his food was coming from. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508292991, "distinguished": null, "edited": false, "id": "doiru7k", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doireik", "retrieved_on": 1508292992, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "She won't go. Since we'd have to have our baby with us she says that's absolutely out of the question.\n\nI know she won't co-sleep. We're much too cautious for that. We're on the same page with this one.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293326, "distinguished": null, "edited": false, "id": "dois4hf", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiqkld", "retrieved_on": 1508293328, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "We've tried, but baby refuses a bottle. We've tried different bottle types and different nipples. Zero success.  Believe me: I wish I *could* feed her, for my wife's sake. I'd do it in a heartbeat.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293416, "distinguished": null, "edited": false, "id": "dois76l", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiqo96", "retrieved_on": 1508293417, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "BlackCoffeeFox", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Have she been seeing her OB? Maybe if a doctor told her she needs to talk to a professional she would consider it. This change in her doesn't sound healthy or like normal \"hormones working themselves out\". I didn't have PPD, but I do struggle with PMDD, anxiety, and depression that will manifest as rage at my husband. Since working with a doctor and getting on meds life has been so much better for the whole family.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293515, "distinguished": null, "edited": false, "id": "doisa7i", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508293517, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Thanks for being so open and honest. I genuinely appreciate that.  You're absolutely right: it's tricky to bring up. No one, and I mean no one else sees this side of her. It gets to the point where I want hidden cameras installed everywhere just so people will believe me when she puts on her super-composed mask and makes me look crazy.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293559, "distinguished": null, "edited": false, "id": "doisbjw", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiqwa3", "retrieved_on": 1508293559, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "UnicornToots", "author_flair_css_class": "purple", "author_flair_text": "Baby Girl - 09.07.15", "banned_at_utc": null, "body": "You need to call her obgyn and tell them you're concerned your wife may have PPD and/or PPA. Tell them everything you put in this post, including the additional details in your comment.\n\nI personally went through PPD (though it exhibited itself differently than what you say your wife is doing; I was self-loathing and depressed, while your wife seems manic). When I think back to what I was thinking and saying and feeling, it's scary in retrospect. I was not myself AT ALL. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293657, "distinguished": null, "edited": false, "id": "doisenn", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508293658, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Flewtea", "author_flair_css_class": "lightcoral", "author_flair_text": "12/12, 1/15", "banned_at_utc": null, "body": "I can't quite tell what you mean by this post overall. But you are *not* on your own--there are doctors who can give you guidance. If you try to handle it on your own, things could continue to get worse. Don't let her get to the point that she does something she'll regret later. Don't let the whole first year of her child's life be lost to her in a fog of hormones.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293731, "distinguished": null, "edited": false, "id": "doisgza", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiptdi", "retrieved_on": 1508293732, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Ejt80", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Regardless if she has PPD, are you taking the majority of the load of keeping house? Cleaning, laundry, cooking? These are the things that help lighten the load that women in general feel after baby. Looking after the baby is a full time job that never stops. So aside for getting her help for PPD I would be doing everything I possibly could to take the load from her shoulders. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293774, "distinguished": null, "edited": false, "id": "doisicr", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508293775, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That's very perceptive. Knowing her she still might think I was being condescending. I believe her perception of reality is *definitely* off. For example, baby needs medicine for reflux, liquid administered orally with syringe.  I *always* do it in the evenings since she does it in the mornings when I'm at work (weekends I usually do both). Tonight, after trying to fight with me, she came into the kitchen with our baby.  I offered to give her her medicine, as I always do in the evenings, and somehow I was being \"petty\" about something (I didn't hear it all; she said something while walking away, and I was tuning her out at that point). How she came to me being petty about something is so far beyond me.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293870, "distinguished": null, "edited": false, "id": "doislhb", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiramx", "retrieved_on": 1508293871, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MaaMaaMaaMaa", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "At four months, it's possible to have the baby on a schedule that includes sleeping through the night, nursing at certain times during the day, and solid naps. \n\nMaybe talk to your pediatrican about sleep training and a nursing schedule. \n\nAt four months, I was beat. My back was hurting so bad from nursing that I had to do physical therapy. My husband took over sleep training while I shower or went work out. I couldn't listen to him crying. It hurt me too much. So my husband did everything. Three days later, he was sleeping great and so was I. \n\nI also stopped feeding on demand per my doctor's recommendation. So he ate maybe 5 times a day versus 8 or 9. Each feed was longer so he was still getting enough milk. \n\nAll of this could be difficult to tell her so maybe try a third party like a night nurse (basically angel nurses that are expensive but so worth it) or a pediatrican. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293883, "distinguished": null, "edited": false, "id": "doislx0", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doireik", "retrieved_on": 1508293884, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Ooooh. Thanks! I just might do that.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508293907, "distinguished": null, "edited": false, "id": "doismpd", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doird2d", "retrieved_on": 1508293910, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "buckittt", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I went through the PPA, not as intense as what it seems your wife was going through. I am already predisposed to anxiety and depression to begin with, so I've had years of kinda knowing what *signs* to look for, but, admittedly, more the depression than anxiety. I also knew from a very young age that my family has a history of mental illness, so I was lucky to understand that I was most likely going to encounter it myself as well.\n\nWhat I didn't know until very recently is that my anxiety manifests in EXTREME anger. I became a horrible nag. I literally HATED my partner, and could only see what he was doing wrong. Just two weeks ago I was seriously considering the timeline in which I would leave him. Now? Two years from now? Could I survive four years of nursing school and THEN leave him? \n\nI ended up talking to my dad about it. He could see a lot of my mom in me, especially right then. Talking to dad helped me de-escalate my own situation. I also ended up talking to the WIC office I was visiting, because I was having suicidal thoughts. That ended up with me being escorted to the behavioral clinic THAT DAY, no matter how politely I declined. They made sure I got an intake appointment and a follow up THAT DAY. Now, I'm seeing a regular therapist. I still think its absolute bullshit that I had to slide into the Low Income bracket to qualify for Medicaid which covers mental health services 100%, when I was working full time with employer sponsored insurance, I wouldn't have been able to do that. Regardless, I am taking control of my mental health, because my partner (who works full time to support me going to school, plus our 3 month old baby) and our daughter deserves it.\n\nIf you can't broach the subject with her, see if you can tell a family member of hers to reach out. If you do talk to her, stay calm. Stay understanding. Say, \"I feel.\"\n\n\"I understand you're angry. I feel hurt that someone I love so very much and want to see happy would do things to hurt me. I want to help you feel better.\"\n\nOr, something along those lines. Your mileage may vary. My partner isn't very sentimental, so I don't get supportive sentences like that. I have to navigate my feelings on my own and really be the bigger person. Your wife may not be able to do that right now. It's going to be hard. I'm so very sorry, I've been that angry rage beast, and I feel so terrible for what I did and said during that time.\n\nTry and get her into therapy. If you have to enlist the help of a trusted family member, someone she will listen to, (Her mom or dad maybe?) Please enlist their help. Remind her every day that you love her, and praise her for the good things she does. \"I'm so proud of you for all your hard work. I love you, even when you don't think you love me. You are doing an amazing thing right now, and you are so incredibly strong.\"\n\nAgain. I'm so sorry. I hope this was at least a tad bit helpful dad.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508294069, "distinguished": null, "edited": false, "id": "doiss23", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doipw89", "retrieved_on": 1508294072, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Have you looked at a [checklist for PPD](http://postpartumprogress.org/2011/02/the-symptoms-of-postpartum-depression-anxiety/).  I like that one because it's in plain English.  Youve described several of the symptoms in your post.\n\nYou might show it to her when she's in a good mood.  \"Honey, I love you and I know adding the baby has been such a big change in our lives, but I'm worried about you.  I've looked at this list and it looks like you've been suffering from sleep deprivation or PPD.  Will you look it over with me?\"\n\nMy kids were exclusively breastfed at this age and it's not *impossible* to get away.  At that age, my kids went about 3 hours between feedings (except at evening time, then all bets were off).  That meant I had 2 hours to get away from baby.  At first, I did stuff inside while hubby took he baby for a walk around the block.  We built up to baby staying with the i laws while I went \"grocery shopping\" a block away.  Your wife could meet up with friends for coffee/lunch/a movie and you could be close by with the baby just in case.  Think lunch at a mall while you push the kiddo around in a stroller.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508294107, "distinguished": null, "edited": false, "id": "doistcv", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508294109, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508294297, "distinguished": null, "edited": false, "id": "doiszf1", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508294298, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "catby", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": " This is most definitely ppd.  Depression doesn't always manifest itself as being sad, quite often its mixed or jumbled emotions, or just not being able to control your feelings. \n\nI have dealt with depression since I was a teenager.  I'm currently being medicated after a hard bout with post partum anxiety.   The first time I was medicated for depression I was very hesitant to seek help until it got really bad because I wasn't sad, I was angry.   Anger bordering on rage from morning to night.   Everything made me angry, everyone made me angry.   At the drop of a hat I could get into an argument with anyone.   It was hell and no one seems to talk about depression being more uncontrolled emotions than just sadness.  What you have described sounds exactly like what depression was for me. \n\nUnfortunately she might not be receptive to hearing this.   Be soft with her, even when she's at her worst.  She's probably feels terrible right now and she's going to feel terrible as she comes out of it too.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508294575, "distinguished": null, "edited": false, "id": "doit81z", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508294577, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; and well meaning suggestions to help (pumping so others could bottle feed) felt like more work and burden and made me feel like I was failing at being a mother.\n\nThat's a very interesting point you make. That's definitely understandable, PPD or not. Of course, it's not applicable to us now, but the idea in general is worth having planted in my mind.\n\nTrapped also sounds applicable to her. She can't get out and do anything that isn't specifically for the baby, really. She has no family or friends here (same as me), so she has no other real adults to talk to.  Having to lose all but one of her clients for her personal business due to being unavailable while I'm not able to take care of baby is surely tough, too.\n\nI know...I honestly do know that things aren't easy and that she's had to give up so much for this.  It really seems like she's directing all of that sadness and resentment at me since there's no one else to do it to.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508294932, "distinguished": null, "edited": false, "id": "doitiql", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doirl7l", "retrieved_on": 1508294933, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I was giving her the bottle. The point was to get her to accept me feeding her a bottle. At this point it's too little, too late. She's past the window of when you really should work with them on bottles.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295009, "distinguished": null, "edited": false, "id": "doitl1f", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiru48", "retrieved_on": 1508295010, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justanothergal17", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; me insight into this.\n\nHave you tried Dr Browns Natural flow? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295133, "distinguished": null, "edited": false, "id": "doitor5", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_dois76l", "retrieved_on": 1508295135, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "justanothergal17", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "In the most loving way.. maybe write her a note or leave her notes here and there telling her how much you love and care about her.... My husband randomly leaves notes by the changing station so i find them in the middle of the night.. Makes you feel appreciated...\n\nShe DEFINITELY needs to get some help. It's not easy to ask for because I was so \"i can do it all\" attitude myself but I gave in because otherwise I don't think I could keep my sanity.\n\nAlso even more importantly it is SUPER dangerous for your daughter if your wife is overtired and not paying attention. I know that is something that has scared me into reality and made myself get help from my hubby and my mom who is fortunately with us.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295399, "distinguished": null, "edited": false, "id": "doitwmj", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508295400, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "bluemarly626", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Never give up. It’s never too late. It took some time, as most things do with babies, but my husband successfully took care of our son part time when I went back to work. \nThe point is though, you need to try your best to get your wife some professional help. The first time I suffered from PPD, my ex-husband thought I was faking it. It’s not a joke and should not be taken lightly. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295459, "distinguished": null, "edited": false, "id": "doitydy", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doitl1f", "retrieved_on": 1508295460, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "EmotionalDayLaborer", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "This is almost certainly ppd or ppa. I think it can manifest in very individual ways and it may not look the way you think it's supposed to. Even those of us who never address it with a hcp probably could have benefited from professional assistance. You need to help her get help. And she probably won't be receptive to it, so you may have to bring it up 1 million times until the 1 millionth she is ready to hear you. Everyone else has already told you this and you say she won't accept it, but I don't know what answer you think you're looking for. There is no silver bullet for this.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295699, "distinguished": null, "edited": false, "id": "doiu5mh", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508295701, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "EmotionalDayLaborer", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "And further are you doing a decent job at those things? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295759, "distinguished": null, "edited": false, "id": "doiu7cu", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doisicr", "retrieved_on": 1508295761, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "brindlepigdragon", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It sounds weird and your wife may not respond the same way, but just going grocery shopping the first time was so freeing for me. That trapped feeling eased considerably just with doing that chore. Getting dressed to leave the house, drive the car, and interact with and around adults in that setting helped feel like myself again rather than just Squirtle's mom. I also prefer when visitors hold the baby while I do chores for the same reason.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295906, "distinguished": null, "edited": false, "id": "doiubno", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doitiql", "retrieved_on": 1508295907, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lotusmariposa", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Your wife's story sounds very similar to what I went through post partum - things that helped for me apart from therapy for PPD and PPA, was sleep training (this saved my sanity), and baby schedules and having Dad help out with every waking. I refused his help at night profusely too, but he woke up anyway - so all I had to do was literally feed the baby, and he burped and kept the baby upright and put him back to sleep. \nSleep training was the biggest change for us though because I was able to sleep for longer and it reset my mood. Feel free to reach out if you'd like more deets on what worked for us. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508295961, "distinguished": null, "edited": false, "id": "doiudaj", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508295964, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Eloquent_Macaroni", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt;I'm always asking (to the degree that I'm not annoying) if I can do this or that for her. \n\nDon't ask, just help. Her managing your contributions is just one more thing on an endless list of her responsibilities right now. \n\nI agree with the commentor here who hesitates to jump to PPD. Everyone on Reddit loves to diagnose any new mom who fails to shit rainbows all day with PPD. She might just be exhausted and feeling resentful towards you. I'm speaking from experience here. Post partum hormones might be making her dislike you... don't take it personally, she'll even out over time. \n\nOf course no one should completely discount the possibility of PPD, I'm just saying it may be simpler than that. \n\nA tip for bottle feeding: baby might not take a bottle from mom, or even if mom is nearby. Try it by yourself with her in the other room. But bottle feeding just means she'll have to pump, so it's not much of a stress relief unless it's letting her get out of the house. \n\nDo other things. Change diapers, do baby's laundry, cook dinner, wash dishes, take out the trash. Whatever else you can do. During night wakings, can you do everything except the feeding? You get up, check diaper (if that's what she wants done, though might not be necessary at this age unless there's poop), then hand baby off for a feed. Afterwards, you hold the baby upright and get baby back to sleep. \n\nGet your wife rested and take a little responsibility off her plate. If she's still a different person, then I'd be worried. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508296319, "distinguished": null, "edited": false, "id": "doiuob6", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doireik", "retrieved_on": 1508296319, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Onto_new_ideas", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It isn't ever too late to work on bottles. If your wife leaves for 5 hours and leaves you a bottle the baby will either eat or will go hungry a short while. 5 hours won't kill a 4 month old, or even do more than annoy. Get your wife out of the house. Get her a massage. Have her grocery shop. Anything. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298007, "distinguished": null, "edited": false, "id": "doivzy0", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doitl1f", "retrieved_on": 1508298009, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cornflakegrl", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "So listen, if this continues to escalate you can always call the cops and tell them you're worried she'll harm herself.  That may be what it takes to get it addressed.   But honestly I doubt it.  I had PPD and if someone could have shown me the way to help I would have taken it.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298457, "distinguished": null, "edited": false, "id": "doiwbso", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doipls8", "retrieved_on": 1508298460, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "She hasn't seen her OB yet, only the follow-up with the midwife shortly after baby was born (one week, I think?).  At least this is as far as I know. She's never mentioned seeing her OB, only the pediatrician.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298547, "distinguished": null, "edited": false, "id": "doiwe49", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doisa7i", "retrieved_on": 1508298547, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Royele1004", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'm so sorry your little family is going through this! It sounds like Postpartum depression and anxiety, I'm not at all a professional but only speaking from experience. I experienced some heavy postpartum depression (PPD)  after my first daughter. My poor baby and husband had to endure a lot from me. \n\nIs she confiding in you about anything she is going through mentally? We all can experience PPD differently but I remember my mind literally being so chaotic And I couldn't even think. My anxiety was always super high and one little thing would set me off to the point of suicide threats. I went from being horribly sad that I wasn't a good mother or wife to hate to manic joy and back to sad all the time. The scariest though was the very dark thoughts that were very crippling and intrusive. Has she ever mentioned any thing about wanting to harm herself, you or the baby? It sounds so scary and I'm sorry to be so dark and ask personal questions but I had wished someone would have talked to me and my husband about how real and dark PPD is. \n\nIf I can stress anything though it's that the most important thing is you must reach out to a medical professional immediately for for your wife's and babies safety.  She doesn't sound like she is able to right now but you are witnessing all of this and out of love for your little family you can reach out and get help for her. Reaching out in the way you already have to this community is so awesome and shows the concern and love you have. You are doing awesome and such a great husband and dad! Please remember to keep fighting for your family and remember you guys can get through this! \n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298626, "distinguished": null, "edited": false, "id": "doiwg9h", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508298626, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "So while you were experiencing PPD, you weren't aware that you were different, right? And when you came out of it, so to speak, you could look back objectively and see that you were someone else?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298628, "distinguished": null, "edited": false, "id": "doiwgby", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doisenn", "retrieved_on": 1508298630, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I wonder if she sees it that way, losing this time of our daughter's life to a fog of...hormones, or PPD, or whatever.  Or rather, I wonder if she *could* see it that way.  It's a very good point to chew on. Thank you.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298735, "distinguished": null, "edited": false, "id": "doiwj74", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doisgza", "retrieved_on": 1508298737, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I do what I can, and by that I mean I'm incapable of doing anything when I'm at work, and when I'm home after work I'm doing everything I can. On the weekends I find myself in hot water for doing too much, and while I think I'm helping I'm apparently keeping her from doing things. But I can't win, 'cause I know that if I don't get them done she'll be upset about *that*.\n\nShe's stay-at-home so she takes on a lot of household chores, but that's part and parcel of the limitations of physics and time. I literally cannot be at work and at home at the same time, and there are only so many hours in a day to get things done. Believe me, I try.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508298917, "distinguished": null, "edited": false, "id": "doiwnzd", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doisicr", "retrieved_on": 1508298927, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "We're...err, *she's* gradually letting her sleep longer and longer through the night. Starting the process, at least. She just had her 4 month checkup and was at a very healthy weight, heavy enough to not have to be woken up for feeding. Instead of cutting her off cold turkey she's going to slowly increase the time she lets her sleep.  Knock on wood, but she (our baby) is actually pretty good about sleeping....fairly good? Pretty fairly good. How about that?\n\nI imagine she hurts a lot. One of the gifts I got her for her birthday (which is Tuesday, so she hasn't gotten it yet) is an in-home massage session. That way she can schedule it, and I can tend to baby while she gets her massage.\n\nI'm not sure about the feeding. As far as feeding on demand I believe it's what she *wants* to do. I don't think she feels like he *has* to.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508299246, "distinguished": null, "edited": false, "id": "doiwwln", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doislx0", "retrieved_on": 1508299272, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I haven't read through this whole list, but holy moly thank you for it! And I sincerely appreciate the suggestion for approaching her about it. It's a good starting point I think I can work with. :)\n\nWe have no friends or family here, so getting together with people isn't really a......thing. But leaving the house is something she needs. We have yet to find a way she can do it yet, though.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508301613, "distinguished": null, "edited": false, "id": "doiygr4", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doistcv", "retrieved_on": 1508301613, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "BlackCoffeeFox", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Any of those three (Midwife, OBGYN, Pediatrician -- heck even her regular doctor) could suggest it to her. If you talk to them and tell them you are worried about her and feel she won't listen to you if you suggest getting help, I'm sure they could at least ask her questions about how she's feeling and how daddy is doing with everything, so they can try decipher what's going on.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508301801, "distinguished": null, "edited": false, "id": "doiyl3e", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiwe49", "retrieved_on": 1508301802, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "snoogle312", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "As pretty much everyone else has posted, this sounds like PPD or PPA. Her doctor should be aware of how things are in your house, not just for the sake of your relationship but also for her and your child's well-being. You should being meticulously documenting these encounters as it could be very helpful in discussing this with her later, helpful for her doctor or, in the very unfortunate situation that any legal matters arise. OP the threats that she has issued sound very serious. Someone else posted about removing yourself from the situation but honestly, after thinking about it more it made me afraid for what might happen if she doesn't have you to take her frustrations out on, or if she becomes manically focused on hurting you in anyway. Seriously, this is looking like it's going in a very, very bad direction and her primary care physician needs to be aware of it. I think her parents should be brought in the loop as well. Even if she knows you told them. Let them know that you are very worried about her. In the end I'm sure she will thank you for doing this, but you have to resign yourself to the fact that she isn't going to thank you or respond well to pretty much anything you say right now.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508302408, "distinguished": null, "edited": false, "id": "doiyyej", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508302409, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Tommy_Riordan", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It does sound like PPD, which you obviously can't fix on your own, but here are some suggestions for ... not setting her off, I guess? \n\n- takeout or dinner delivery.  The last thing a mom who's been home all day caring for a baby wants to hear is \"what's for dinner?\"  I would have happily throttled my partner every time he asked that question.  You bring dinner home, you make her eggs and toast if you can't cook fancy, you hold the baby while she eats.   \n\n-  she needs to leave the house by herself.  A haircut, pedicure, lunch with a friend, anything that gets her out on the weekends is good.  Baby will be fine for an hour or two without boob on demand, and she will get some room to breathe.  She can feed baby right before she leaves and as soon as she gets home.  \n\n- are you being as involved as she will let you?  Do you bathe the baby, play peekaboo and make silly faces at her, buy her little gifts and clothes?  Do you go to her dr appointments and keep yourself up to date on stages and appropriate growth and development?  I had PPD that manifested as anger, and seeing my partner manifest a very active interest in the baby would have gone a VERY long way in calming me.  A lot of new dads have said that it can be hard to feel attached to a very young baby, who you're just meeting for the first time, while to a new mom she feels like she's \"known\" the baby for months and can find it very upsetting if her partner doesn't immediately show adoration or if her partner talks about the baby like an object.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508302623, "distinguished": null, "edited": false, "id": "doiz2yw", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508302624, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "marrakesh", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Is your wife able to get any exercise? Any walks with baby in the stroller? Can she go to the gym for an hour while you watch the baby?\n\nWhat does your wife do to connect with other moms? Does the library offer a baby storytime? Any local babywearing groups she could check out? Any mom groups in the area where she can get out for a cup of coffee or just go for a walk? Even with a young baby, there are mom groups to connect with for socialization.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508316392, "distinguished": null, "edited": false, "id": "doj51qw", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508316392, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Minnim88", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "While I do think it's fair for SAHP to do more of the household chores, I don't think that should really apply when there's a baby this young. Taking care of the baby is a full-time endeavor, especially when breastfeeding on demand.\nI also wonder about the mental load. Is she the one in charge of knowing what needs to be done? When you're doing things, does that look like you saying \"what do you need? How can I help?\" or does it look like you grabbing the vacuum because you noticed the floor is dirty? In the first scenario she has to keep track of what needs to be done. Of course, if she is the one carrying the mental load, and you suddenly start doing that too, it can throw her off balance.\nYou sound like you're trying and want to do whatever it takes. But you also sound like you are denying her lived experience. She is having a tough time, sure, but just writing it off as (essentially) hysteria plays into a long history of silencing women. And it sounds a bit like you're looking for headpats and to be told it's not your fault, it's all just her being mentally ill.\n\nI'm not doing a good job explaining, sorry! Basically: this time is very hard for new mothers, and she deserves to be seen as a competent person who is just having a tough time due to the lack of sleep and Independence that is inherent to this time. Anything you can do to allow her to feel like a person again is good. You can't take baby for a long time, but could you take him for a nice walk in the neighborhood? A visit to baby playtime somewhere? Baby is old enough that he doesn't need to eat all the time, and if you stay nearby so you can head home and have her feed him quickly if need be, he should be fine. How often has it been just you and the baby? When it is (or when you take baby on the weekend), do you make every effort to take care of him yourself or do you shrug and say 'he wants you' at the slightest fussing? \n\nTl;Dr: this time is genuinely hard for any new mom, don't write her experience off as mental illness. Be an active participant in taking care of baby and the household, so she can feel like a person again.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508317232, "distinguished": null, "edited": false, "id": "doj5bz6", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiwnzd", "retrieved_on": 1508317233, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Lt_Uhura", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It may be PPD, or could be previously low levell bi-polar, or, or.... Point is, do not try to diagnose yourself. Just make the call for help. Even PPD can be lethal if severe enough and untreated. She does not have to feel this bad. There are treatments. The longer you let it go om, the more risk - tobher, to you, and to baby.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508321189, "distinguished": null, "edited": false, "id": "doj6n77", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doip85l", "retrieved_on": 1508321190, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Lt_Uhura", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sorry, your snoring is not the problem. Spme babies are lighter sleepers, but most benefit by having exposure to regular household noise while sleeping. Thry acclimate. She is acting extreme and your silence will not fix this. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508321690, "distinguished": null, "edited": false, "id": "doj6tde", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doir5d3", "retrieved_on": 1508321695, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "UnicornToots", "author_flair_css_class": "purple", "author_flair_text": "Baby Girl - 09.07.15", "banned_at_utc": null, "body": "No, I didn't realize at the time that I was being irrational at all. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508322409, "distinguished": null, "edited": false, "id": "doj72yt", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiwgby", "retrieved_on": 1508322410, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "500Hats", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "May I make further suggestions?\n\nIf she is persuaded to seek help, the next step is an appointment with her OB.  She can tell him \"I took a PPD quiz and had concerning results\".  It's probably easier to hand the completed checklist to the Dr than to recount what will feel like ways she failed as a mom.\n\nGood luck to you both!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508324985, "distinguished": null, "edited": false, "id": "doj839u", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiygr4", "retrieved_on": 1508324986, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "She doesn't confide anything like that in me. She always says she's fine, when clearly she's not. The best I can get is when she has a breakdown and cries and tells me more specifically why things are so hard for her (all the while insinuating that I don't have it hard at all).  She's never said anything about harming herself or our baby, and I couldn't ever see her hurting her.\n\nI appreciate your kind words about me, thought to be fair I'm not doing a very good job of highlighting any of my own flaws. I'm clearly coming from a personal and biased perspective, and while I genuinely do believe everything I'm saying is objective, I'm not above admitting that I'm quite capable of missing things.\n\nI love this community, the Daddit &amp; Mommit community as a whole. I can't believe how much feedback I've gotten here. I have no one to really turn to here that could give me any kind of personal, honest insight into what's going on. This has been positively overwhelming. So really, thank you very much.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508326593, "distinguished": null, "edited": false, "id": "doj8tls", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiwg9h", "retrieved_on": 1508326594, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Oh, wow, this is great. You all are seriously giving me such good suggestions. That little angle of having them ask how *I'm* doing would be really insightful. She doesn't go see anyone, and I don't know why. Just the pediatrician. If she sees an OB or PCM she certainly doesn't tell me. I just might reach out to the pediatrician, but our baby just had her 4 month checkup and doesn't have her next until 6 months. It's something I'll keep in mind for sure, though. At this point she seems like my only hope.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508326801, "distinguished": null, "edited": false, "id": "doj8x72", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiyl3e", "retrieved_on": 1508326802, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "You know I've actually \"rationalized\" my sticking around through this stuff by saying to myself that I need to be here for her to abuse or else she would do something worse with all of the negative feelings she has inside. She'll say that my being out of her life/gone/etc. would solve everything because I'm the root of all of this negativity. As I said to someone else this is a different person than my real wife. Not 100%...but about 80% different. Everything is amplified. That being said, I'm on the fence about walking out and taking a time out.  When I used to do it there was no baby. Now that there is it does make me worry. I genuinely don't believe she'd hurt her. As a matter of fact one of her tactics (and not an uncommon one) is to be awful to me, and then turn around and very blatantly be nice and loving to our baby. I'm not saying she *shouldn't* be nice and loving to the baby, but it's clear what she's doing, going over the top to make it look like she isn't the problem.\n\nIf she actually saw her PCM or OB I'd contact them, but she doesn't. And I'm curious: is that even possible? Is there some sort of HIPPA law that would prevent them from talking to me about her? It sounds like it would be a thing, but I obviously could be wrong.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508327268, "distinguished": null, "edited": false, "id": "doj95hz", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiyyej", "retrieved_on": 1508327268, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Oh no, I am as involved as I can possibly be. The *last* thing I feel is unattached. My daughter- ........Being a father is the one thing I have always wanted most in life. I love my baby more than life itself. I feel attached at the soul to her. She is my absolute world.\n\nAnd that is why my wife knows she can get to me by threatening me with divorce. Being in a liberal city, and being a woman, her chances of getting full custody, or close to it, are *extremely* high. Apparently women can do no wrong, and women know they can get custody even if they're full blown Casey Anthony.  Good fathers are commonly kept from their children by courts wildly sympathetic to women and cold to men. It blows my mind how no one even talks about this. Anyway, I'm rambling. The point is: I love my daughter more than anything else.  I want to spend all the time in the world with her. I hate having to give her up for meal time, even though she obviously needs it! I just want to hold her and feel her pressed against me and kiss her cheeks and the top of her head and listen to her baby babble, and make her smile and laugh.... Being at work and away from her is so hard, and my wife doesn't even acknowledge it.\n\nI can't really attend most appointments because of work. She doesn't have too many now anyway because she's healthy and only needs to be seen at her bi-monthly checkups. Hell.....my wife got mad at me for always bringing myself up when it came to her doing things with her. While I'm at work she takes her to story time at book stores and libraries (where someone reads books to kids), takes her to little events and classes, and does things here at the house with her. I used to always mention that I wish I could be a part of it all, and she got mad at me for \"making everything about [me]\" and supposedly not letting her \"have\" that with her.  Apparently my interest in her and being involved *must* mean that I want hers to be diminished. She does have a very zero-sum game mentality, though, so it's not surprising that she would respond that way. And of course it's quite alright for her to talk about everything *she* gets to do with our baby.\n\nIf I could get her to leave the house I would. She won't leave the baby here since she worries about the baby being hungry. She flat out won't do it. And even if I suggest that she feed her and go somewhere, she'll ask what the point is.  \"If I have to be back in an hour, what do I have time to do?  It'll take me 20 minutes to get somewhere, and 20 minutes to get back, so, what, I should leave to do something for a whole *20* minutes?\" While she *does* have a point, she's also working against herself. She complains about never being able to leave, but rationalizes a way out ever being able to do so. I think it's some self-fulfilling prophecy thing where she has to be able to complain about something and be able to play the victim card, and cry about how everything is so hard for her. No mention of how she brings a lot of it on herself, but hey, who am I to say anything, right?\n\nMaybe I could get her some takeout or delivery. She's vegan, and I'm not (not even vegetarian), so I'm not as in tune with what she can eat (plus she's having to restrict certain things like soy to avoid upsetting baby's belly). It wouldn't hurt to just ask if she'd want it at all, but like most other things I wouldn't be surprised if she gave me an exasperated sigh about how she *can't* have it because of....reasons.\n\nI feel like I live in Crazyland.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508328439, "distinguished": null, "edited": false, "id": "doj9rti", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doiz2yw", "retrieved_on": 1508328439, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "snoogle312", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Even if they aren't seeing her regularly they will have insight and resources you won't find here as well as possibly being able to offer actual hands on aid in sone capacity. Again, bring her parents in to the situation. Stress to them your concern for her when you speak to them. When you do cone to her with these concerns be as gentle and calm as possible but be prepared for her to respond with anger because from what it sounds like that's just how she responds to you now. Depending on how she acts with her family it may be beneficial to hace them present for a mini-intervention to convince her to seek help for PPD.\nSome of your following responses seem to indicate that she may have an unhealthy fixation on your child. My son is 2 and my husband was struggling with beginning treatment for depression right before and after he was born so I attempted to do everything myself. I tried to do all the night wakings, put him to sleep, cook meals, clean etc. This is very hard and leaves a person pretty exhausted and irrational. Even single parents are able to and relish getting a couple hours away from the baby. It is normal and healthy. Her perceived inability to do so may indicate something deeper. \nYou've said you don't think she would hurt your daughter and that's good but then you really don't know what she's like when you aren't there just as others don't know what she's like with you when they aren't there. That said I don't know either so I could ne completely off the mark on that one. But what about herself? Do you have any concerns over the possibility of self-harm? What about yourself? She clearly has rage issues concerning you, is there a possibility of her trying to hurt you?\nAn important thing to keep in mind about PPD and PPA is that these are medical issues that can not be resolved through discussion alone or waiting till it goes away. The best thing you can do for your family now is to find a way to convince her to seek help. There is no shame in this. Involve family. Involve friends even. Make sure she understands she is loved, supported, and most importantly, that she shouldn't be ashamed or judged. This is no different than seeing a doctor to receive treatment for an infection or other ailment.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508339000, "distinguished": null, "edited": false, "id": "dojhsa7", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doj95hz", "retrieved_on": 1508339001, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "To be clear, I'm asking if anyone who has experienced PPD can relate or tell me if they think it's what she is going through. I never claimed it myself. It's also irresponsible to say that her borderline violent behavior should be tolerated lest it be \"silencing women.\" That's nonsense. If I did *any* of the things to her that she did to me I'd be in jail. Period.\n\nI'm not looking for headpats. I'm looking for clarity. How could someone change so drastically and behave so hysterically out of nowhere? If you're telling me that's just because of her loss of Independence as a new mom then your standards of acceptable behavior are apparently very low.\n\nAnd what of the experience of new dad's? Is mine to be denied to allow her to treat me like this? How many other women on here have said themselves that they behaved like this and admitted that it made life hell for their family? It's not saying they're bad women, they're relating their experience and telling me they've been there and that she needs help. Should I ignore that and let her go on like this?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508346051, "distinguished": null, "edited": false, "id": "dojomyh", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t3_77377x", "retrieved_on": 1508346083, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Absolutely. But when you did finally come out of it you could look back and see it, right?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508346221, "distinguished": null, "edited": false, "id": "dojosvd", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_doj72yt", "retrieved_on": 1508346223, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "UnicornToots", "author_flair_css_class": "purple", "author_flair_text": "Baby Girl - 09.07.15", "banned_at_utc": null, "body": "Definitely. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508347245, "distinguished": null, "edited": false, "id": "dojptk4", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_dojosvd", "retrieved_on": 1508347246, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Did you happen to make any *major*, irrational decisions during that time? I mean things like divorce and such.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508350866, "distinguished": null, "edited": false, "id": "dojtgc4", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_dojptk4", "retrieved_on": 1508350880, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "UnicornToots", "author_flair_css_class": "purple", "author_flair_text": "Baby Girl - 09.07.15", "banned_at_utc": null, "body": "I thought about running away and actually began writing down a list of things to pack. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508350981, "distinguished": null, "edited": false, "id": "dojtke3", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_dojtgc4", "retrieved_on": 1508350982, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "punchyouinthenuts", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "What kept you from going through with it? My wife is saying she's going to be filing for divorce, etc. It seems so irrational and over the top. I have no idea how to get through to her.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508351083, "distinguished": null, "edited": false, "id": "dojto3p", "is_submitter": true, "link_id": "t3_77377x", "parent_id": "t1_dojtke3", "retrieved_on": 1508351084, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508351228, "distinguished": null, "edited": false, "id": "dojtti7", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_dojto3p", "retrieved_on": 1508351229, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Tommy_Riordan", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I think you do live in Crazyland.  I'm sorry.  Your situation sounds totally different from mine.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508713435, "distinguished": null, "edited": false, "id": "doqrnfi", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doj9rti", "retrieved_on": 1508713436, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "DD-VG", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sorry, this is late.  I didn't see your message.  My husband had been telling me to see someone for a while, but I brushed him off, and I dunno just one day during the umpteenth crying spell that day I realized I needed help.  I wish you luck!  It will get better.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1508800114, "distinguished": null, "edited": false, "id": "dosjsls", "is_submitter": false, "link_id": "t3_77377x", "parent_id": "t1_doiqt2a", "permalink": "/r/Mommit/comments/77377x/dadditor_needs_help_from_mommitors_post_pregnancy/dosjsls/", "retrieved_on": 1508800115, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}