{"submission": {"author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1511813059, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/", "id": "7fxzpl", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 77, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/", "pinned": false, "retrieved_on": 1511887922, "score": 49, "selftext": "My wife is extremely hardworking and she is struggling with stress and anxiety.  We have a 3 year old son and a 6 month old son.  In the past 6 months we have had 10 various DR's visits regarding our 6 month old's hearing loss issues and now moving forward into more visits with hearing aid fittings.   \nThat stress alone is hard, but she transferred to a new school at the end of her recent maternity leave for her teaching position and that has added a longer commute and all the stress of trying to learn a new school and meeting/exceeding administration and parent expectations for her position.  Her new position is more rewarding, but she pays for it in added stress and she doesn't have as much planning as she used to.  She can't pump as much as she did with our first son, and it really makes her feel like she is dropping the ball.  \nShe also has a second job that is normally rewarding that keeps her out 2 nights a week and can add several weekend requirements and a lot of extra work in December.  With all of her current stress she is thinking about quitting the second job, but she is worried that this feeling is only temporary and she would really regret it long term. \nWe also have added stress with her mother keeping the boys for a couple days a week.  It does help us financially and she is great with the boys, but we have to pat her ego and deal with her throwing major and unwarranted fits on a weekly basis. We have talked about moving them to full time day care, but it would only make the relationship worse with her and her mother and the kids would really take a hit.  \nAll of that being said, she is having a hard time balancing it all.  I am there to help with the kids and house stuff, but she finds that she is just failing at a lot of small tasks that she normally handles.  This time of year is extremely hard on her, and I am thinking that if we can get through the next couple of weeks, she will have some time off and her next semester will be easier and her stress and anxiety will diminish.  \nShe did have added anxiety and depression during her pregnancy, that she didn't have during her first pregnancy.  She took some safe antidepressants and it helped a bit with the anxiety, but it made her feel foggy and tired.  The added tired feeling wasn't that big of a deal because she was already tired from being pregnant.  Shortly after the baby was born her hormones started to adjust and she started feeling a lot better and stopped taking it.  She feels a little bit like she did during pregnancy, but it's not as debilitating.  She doesn't want to take the medication now because she feels like it would be counter productive because the added fatigue of the meds would just limit her even more.\nI wish we had enough money so only one of us had to work, but it's just not an option.  \nI love my wife and I do everything I can. I can feel all the stress as well and it hurts me knowing how defeated she feels. She asks that if you have any ideas for dealing with fatigue and stress, to please let us know.  Does it get easier?   Thanks for any advice/thoughts.", "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "thumbnail": "self", "title": "My wife wanted me to ask if any other working mothers with young kids have any tricks to deal with extreme fatigue/mommy brain?", "url": "https://www.reddit.com/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/", "whitelist_status": "promo_adult_nsfw"}, "comments": [{"approved_at_utc": null, "author": "thedifficultpart", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Can she try a different medication temporarily?  Holidays are rough for stress and anxiety.  And the new drive, new routine she's trying to adjust to is hard!  Do you guys need her to have the second job?  Would she be able to spend more time planning or spending time with the kids/ you?  I personally would want to cut out the second job myself if I could.  As for daycare, I love it if you have a good one bc of the socialization it provides for the kids with peers. Honestly wish I had started my daughter sooner.  If you do go that route, I would stress to mil that is why you are enrolling them.  Baby brain did go away for me after about two years.  I'm back in it now with second kid so sorry if this was incoherent.  Some time to yourselves helps if you can make that happen once or twice a month.  Hang in there.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511816916, "distinguished": null, "edited": false, "id": "dqf8opf", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqf8opf/", "retrieved_on": 1511816919, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "hottoddy4me", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Honestly, exercise, coffee, and sleep. If I didn't have those 3 things, I would be looney tunes. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511817311, "distinguished": null, "edited": false, "id": "dqf92y1", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqf92y1/", "retrieved_on": 1511817335, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "poseyspointers", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It gets easier than harder than easier . Im in the mkddle of chaos 3 kids 9,6 &amp; 18 mo &amp; two Pups &amp; were in the middle of moving ...my daughrer got croup and the boys ans I the flu . Needless to say we havent slept in weeks. The house is half packed although it looks like a Tornado went through it \nI drink alot of coffee , chase my toddler and spend most of my day running off my feet . But the more I excercise the better I feel and the less tired I am . I also make sure I eat a HUGE balanced Breakfast it makes all the difference . Also I find im most productive in the am so Ill do most of my tasks then . Also I accept I wont get to it all and thats okay . The house doesnt have to be sparkling clean . Im sure kf she asks your 3 year old how happy they are youll realise your doing a much better job than you ever thought. Give yourself some credit . Relax and let her have time to herself and you as well . And always make time for DATE NIGHT!! As for pumping ...I have 3 absolutely brilliant &amp; healthy Formula fed kids..and as for Mommy Brain get a Big Calendar and Cork Board and app on her phone.....as long as we bave kids to worry about that will never go away . As for her mom watching the kids , you know best not her \nThree is a Hard age they will test you and manipulate ..but 9 going on 18 hes too cooll for mom or anything ...they grow up way too fast !! Just take it one day at time", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511817366, "distinguished": null, "edited": false, "id": "dqf94xb", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqf94xb/", "retrieved_on": 1511817381, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "nudgenotnudge", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "My kids are all older now, but we have 5 and somehow made it through. Sometimes I look back and am amazed that we did it though. \n\nThe things that got us through was to really just drop a lot of our expectations of ourselves. Nobody has a clean house with little kids. Nobody has everything together with little kids. Nobody has perfect meals with little ones We expected so much more of ourselves than was necessary. When I talk to my kids now (they are between 18-25yrs) they remember really crazy stuff we did. They remember dancing with me in the kitchen. They remember the dumb books we read (Everybody Poops?! What was I thinking??) They remember breakfast for dinner and dragging a mattress into the living room for pizza a movie. To me, I did those things because I was too tired to actually cook or because they were under my feet when I actually made it into the kitchen. To them, they were great adventures. \n\nAs for fatigue, make sure she goes for a checkup with her doctor. Get her B12, her Vit. D, Iron and her thyroid levels checked. What I thought was fatigue and anxiety was actually thyroid disease and anemia. \n\nAs for the other stuff, caffeine helped me get through. Caffeine and napping with the kids. There is nothing wrong with napping from 5:00 to 5:30 then starting dinner at 6:00 if she needs to. If it takes a 5 dollar Starbucks on the way home from school, then go for it. I remember my husband taking the kids to the movie and he would promptly fall asleep in the middle of it. They all survived. \n\nAt this point with your children being so young, it's a matter of just hanging on for dear life. Just hanging in there with whatever means necessary and doing whatever you can do to squeeze a little bit of joy out and sleep in when you can. \n\nIf you have to sleep with the baby in the room, do it. Don't feel bad. If you have to nap in front of a Disney movie, do it. If you need another cup of coffee or tea or god forbid a diet coke at 4pm, do it. \n\nIt will get easier physically. In a few short years you will be yelling at them to wake up, I promise.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511819675, "distinguished": null, "edited": false, "id": "dqfbgpq", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfbgpq/", "retrieved_on": 1511819677, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I don't know of any other medications that she's has discussed with her doctor.  The one she did take during pregnancy was considered low risk for pregnancy and breastfeeding.  It's kind of a catch-22 as far as the job. If we knew for sure that her mom could handle the kids until they started school then we could afford for her to quit the second job. Currently our oldest does go to take care 2 days a week and he loves it.  But with the relationship with my mother-in-law she could decide at any moment that she doesn't want to do it anymore and the second job isn't the type of job that she could get again if she decided she wanted to work it again.  We don't really get any time to ourselves or date nights. Because our family helps with the kids during the week they're not really into watching the kids on the weekends.  We could put them in a full-time daycare but that would hurt relations with our family and then our financial situation would be really affected which would also keep us from having any sort of date opportunities.  I'm not trying to seem negative or depressing or anything it's just the way things have been going.  We could roll the dice and she could quit and just hope that everything works out.  In all honesty the second job would relieve stress for her on Mondays and Tuesdays for a couple hours but in the whole scheme of things I don't know if it would really help. She gets to work with some colleagues that also understand what she's going through and I think it's rewarding..  if she didn't do it I think she would go home and do house work.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511820009, "distinguished": null, "edited": false, "id": "dqfbsnw", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqf8opf", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfbsnw/", "retrieved_on": 1511820013, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I'll talk to her about the formula idea. We do supplement now a little bit. I think she was really hoping to get through flu season just to help with our youngest.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511820075, "distinguished": null, "edited": false, "id": "dqfbuzx", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqf92y1", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfbuzx/", "retrieved_on": 1511820077, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ELRochir", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "This is great advice!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511823064, "distinguished": null, "edited": false, "id": "dqfengd", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfbgpq", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfengd/", "retrieved_on": 1511823065, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MCFF", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Dude I’m exhausted just reading about your wife’s schedule. 2 kids, 2 jobs, a high maintenance mother and all the little tasks around the house. No wonder she’s stressed. \n\nYou say you’re doing all you can- is that really true? Can you take on some more of those little tasks around the house? Make sure she gets time off? Tell her she’s doing an amazing job? All those things can take the anxiety down a lot.\n\nMy gut instinct is to say to lose the second job, at least for a while. Is it something she can leave for a while and pick back up when things settle down? She needs some downtime.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511823325, "distinguished": null, "edited": false, "id": "dqfew02", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfew02/", "retrieved_on": 1511823326, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Yeah I'm pretty good at helping out around the house.  I could try and help a little bit more when I can. She does have anxieties about the house needing to be a certain way before she can relax. Everyone tells her that she needs to let little things go with the house, that with kids things are just going to be messy for a while. She's backed off a bit but it's still hard. If she has energy she is not going to focus on herself until she feels like chores are done.  I feel like I help more than the average husband.  I don't tell her that, I'm not asking for a reward or anything.  But based off your comment I just want you to know that I do a lot. When she is doing her second job I do everything.  I feed the kids bathe the kids read to the kids pick up after the kids.  I get the kids up in the morning and I take them to my mother-in-law's before work. On the days that my wife doesn't have her second job we're a team. When do everything together and we don't really rest until both of us are done. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511824762, "distinguished": null, "edited": false, "id": "dqfg6m6", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfew02", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfg6m6/", "retrieved_on": 1511824764, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Unfortunately if she leaves it's very unlikely that she would be able to go back in the future. It's one of those jobs that is sought-after and people don't usually leave for a long time. She's been doing it for 10 years.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511825323, "distinguished": null, "edited": false, "id": "dqfgous", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfew02", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfgous/", "retrieved_on": 1511825372, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Munchkinny", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Diet is critical in this situation. Most people will be inclined to start eating junk food, but it’s even more important to eat healthy now. Lots of plant based meals, healthy starches and minimize sugar intake. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511825668, "distinguished": null, "edited": false, "id": "dqfgzy7", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfgzy7/", "retrieved_on": 1511825670, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MCFF", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "“based off your comment I just want you to know that I do a lot”\n\nI’m sorry, it was totally not my intention to suggest that you laze about while she toils. I can see how it could come across that way! Thank you for pointing out that you two try to equalize the chores. And you obviously care enough about her well being to look for ways to make her life easier.\n\nSometimes it’s just really hard- especially when there is a new baby. I think it look us a good year to find our groove after our second was born. But I’m approaching your post as a mom who dealt with post partum anxiety and I could never do all the stuff your wife is doing. I just am not that energetic a person.\n\nAlso it’s the holidays- even the ones among us who love this time of year feel the pressure. But I’d say as long as she’s not feeling depressed or constantly anxious, it’s reasonable to kind of “white knuckle” it through to the new year.\n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511828159, "distinguished": null, "edited": false, "id": "dqfj6az", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfg6m6", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfj6az/", "retrieved_on": 1511828160, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "redidnot", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Ok why are you the one helping around the house? That implies it belongs to her and you can do bits and pieces as required. Flip that shit. You now own the housework schedule, meal planning and shopping and the kids drs appointment schedule. You also own keeping track of the kids clothes and whether or not they have enough x in the right size, packing away and storing or donating the stuff that’s too small. You now also completely own the kids social calendar, birthday parties and associated gift giving.  Delegate specific tasks to your wife and don’t give her another task until she’s finished the the first one. She’s now helping you around the house. \n\nIf you can’t do it then the expectation she can is unrealistic and you need a cleaner and possible a house keeper. \n\nIf you’re not sure what I’m talking about google “the mental load”.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511828367, "distinguished": null, "edited": false, "id": "dqfjcph", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfjcph/", "retrieved_on": 1511828368, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "bluelily17", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Dude that's a lot! Hugs to both of you. \n\nThese are how I work through things:\n\nI survive on coffee. I don't have much time for exercise but I walk the dog to daycare sometimes to pick up my toddler after work. Eating healthy is actually a really important too. \n\nAnd it's totally ok to use formula. I understand feeling like you have to pump and the want of being able to do that for your kid, but you also have to consider your health. \n\nHaving other moms to vent to, having time for yourself, and not feeling guilty about making time for yourselves or to rest is important.  \n\nBeing willing to call a sitter over, even if your not leaving the house so you can do things is ok. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511828750, "distinguished": null, "edited": false, "id": "dqfjod4", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfjod4/", "retrieved_on": 1511828752, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Cucurucho78", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": " Can you hire a cleaning lady to come once or twice a  week? What about downsizing your house to get a home with a lower mortgage? I'm a teacher too (7th grade) and have a toddler. I took a year off after having her so we sold our house and bought a smaller, more affordable one. Now I'm back to work but only part time, mornings. \nI agree with the other commenters who suggest she cut back on work and fuel her body with nutritious foods.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511830097, "distinguished": null, "edited": false, "id": "dqfktf0", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfktf0/", "retrieved_on": 1511830098, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "song_pond", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; helping out around the house\n\nYou don't help. You live there too. It may be contributing to her stress that although you do a lot of chores, she's the one who is the \"manager,\" so to speak, of the household stuff. Perhaps with her working two jobs, a lot of her fatigue may be relieved if you told her \"okay, you don't have to make sure I do my part. Just do what you can and I'll pick up the rest.\"\n\nI'm glad to hear that you work as a team with chores. I'm only suggesting this as it's a \"trend\" that has been identified in modern relationships, and you know your family better than I do. You'll know better than me if it applies to you or not.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511830099, "distinguished": null, "edited": false, "id": "dqfkthm", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfg6m6", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfkthm/", "retrieved_on": 1511830100, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "albeaner", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "The first step is setting realistic expectations for yourself. She's got to drop her second job. And you both owe it to yourselves to put the kids in full time daycare (check out r/JustNoMIL if you need to a little push to grow spines).\n\nHaving a full time daycare situation with reliable schedules and professionally managed (i.e. not your problem) providers is an amazingly huge relief. I can't even emphasize that enough!\n\nBut self-care is something that most moms take years to figure out. I myself took several years to realize that I should say 'no' way more often than I do. She might also need counseling if she is having a hard time standing up to her mother, but you should first and foremost be doing what is best for your FAMILY.\n\nSave the child-watching from your MIL for weekends when her time with her grandkids also allows you and your wife some time alone. (And yes, you should spend some of it together, but encourage your wife to do things solo, too - or just take a nap or sleep in.)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511830152, "distinguished": null, "edited": false, "id": "dqfkv59", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfkv59/", "retrieved_on": 1511830154, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "annaswims", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "There’s a difference between “helping with” the house and kid stuff and “being equally responsible (or more)”  for that stuff.  Start keeping track of what could/should to be done. \n\nDo you schedule doctor’s appointments? Do you notice when the kids need new clothes/shoes?   Do you remember when people have special events like birthdays and get a gift/card?  When it’s date night, would you find a babysitter and make the plans?  Do you make a meal plan for the week. That stuff all adds up and is mentally draining.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511830435, "distinguished": null, "edited": false, "id": "dqfl3mq", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfl3mq/", "retrieved_on": 1511830435, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "blacksockdown", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I did the grandparent-caregiver thing and it was HARD!\n\nI enjoy getting to pick up my kid, share a few pleasantries and get on without worrying about appeasing my family member. If you don't know how to \"fire\" her mom, say that you want your little ones to have more social development with other kids. It's a valid thing to desire and our son has developed a lot from that alone. \n\nBeyond that, find a way to reassure her that you've got this and can take care of a lot more of the household management. For me, it helps if my husband does something to show his progress on something.\n\nIt sounds like one more thing to add, but therapy may help her sort through her emotions too.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511832434, "distinguished": null, "edited": false, "id": "dqfmund", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfmund/", "retrieved_on": 1511832435, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "a_cup_of_t", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "You make a good point. I read an article recently that talks about the \"manager\" role in the house and how the mental stress of that can be taxing even if you're physically sharing half the chores. Things like scheduling doctors appointments, reminding a caretaker that Child needs her medicine, asking Spouse to clean xyz... this is added pressure that usually falls on the mother. I'll see if I can find the article. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511833462, "distinguished": null, "edited": false, "id": "dqfnsgt", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfkthm", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfnsgt/", "retrieved_on": 1511833464, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Curi0usgrge", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "So you know she wants the house a certain way before she can relax. So do everything you can to make that happen. I am the same way, it’s that if I let it go it just means more work down the road. Get into a routine to do the 10 mins of cleaning before both of you relax. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511833499, "distinguished": null, "edited": false, "id": "dqfntqd", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfntqd/", "retrieved_on": 1511833501, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "song_pond", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That's the article I had in mind too, but I don't remember enough about it to find and link it.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511833767, "distinguished": null, "edited": false, "id": "dqfo2fu", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfnsgt", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfo2fu/", "retrieved_on": 1511833767, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Ok, my wording isn't perfect.  Please don't dissect my words.  I am a great father and partner.  I cook, clean, shop, surprise her and the kids with flowers and treats.  She constantly calls me her rock and says she wouldn't be able to do any of this with out my support.  She asked me to write a post asking for advice from other mothers and I took a lot of time to explain how She feels.  If  she wanted advice on how to get her husband to help more, then I think she wouldn't have asked me to do it..  lol. I understand that assuming I'm not doing enough seems like low hanging fruit, but it's not what we are struggling with.  If I have to go into detail on my schedule and stresses in detail the way I went into detail about hers, then I will, but I think some of you are transferring some of your own frustrations into me.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511834602, "distinguished": null, "edited": false, "id": "dqfotq6", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfkthm", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfotq6/", "retrieved_on": 1511834603, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "sortaplainnonjane", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "You can google it by searching for \"the mental load.\"  :)  \n\n[Here's the comic that made the rounds a while ago.](https://www.theguardian.com/world/2017/may/26/gender-wars-household-chores-comic)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511834710, "distinguished": null, "edited": false, "id": "dqfoxbk", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfo2fu", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfoxbk/", "retrieved_on": 1511834711, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "xixi4059", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "For me, it was all about survival mode during that first year. We ate more take out. I didn’t exercise as much. Our house wasn’t as clean. I drank a lot of cofffee. It was hard but we survived. I had to learn to let some things go which is super difficult to do!! It sounds like from what you’re saying is that your wife’s current situation is not sustainable and something has to go. Maybe that second job is not good right now and/ or maybe there are some other things that could help her free up her time. It’s great to want to do it all but sometimes it’s not realistic.\n\nAlso encourage your wife to spend some time taking care of herself. For me, I would take short walks at work to get out and take breather. Sometimes I’d lay on the floor of my office and take a short nap. \n\nOh, and if she isn’t already, she may want to check in with her doctor regarding the stress and anxiety. \n\nHope things get better for y’all. \n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511834760, "distinguished": null, "edited": false, "id": "dqfoyyx", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfoyyx/", "retrieved_on": 1511834762, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "We so think that full time day care would help with current stress, but we feel like it will  add new stress.  For a decent day care for our 2 kids in our area, we would have to spend $1500 a month, and we could just barely manage it, but we would live paycheck to paycheck and if a car broke down or an AC went out we would be up a creek. We also wouldn't be able to do anything for ourselves and wouldn't be able to provide any fun adventures and surprises that we like to give our kids.  Right now we are saving as much as we can trying to build savings so that maybe when our oldest turns 4 and youngest turns 2 we can put them in full time day care.  Our oldest was born in November, so he won't get to start kindergarten until he is about to turn 6, so that adds several months of extra child care.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511835167, "distinguished": null, "edited": false, "id": "dqfpcsp", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfmund", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfpcsp/", "retrieved_on": 1511835169, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "squidgirl", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I’m a mom of an almost 3 year old, working at a high school and going to grad school. Coffee helps, and my husband does so much. Our son is in daycare. I deal with my own anxiety and depression all the time and it’s really difficult.\n\nA couple things that helped: I took the free EdX online course on the science of happiness. Your wife might not have time for that right now but I highly recommend one of the books called “The How of Happiness”  by Sonia Lyubomirsky.\n\nPeople are notoriously bad at figuring out what makes themselves happy. Taking the “person activity fit diagnostic test” helped me narrow down the chapters to focus on to get the most benefit and start with only a couple of activities so it wasn’t overwhelming. Have your wife fill it out, figure out the scores and have her focus on her top two activities(I’m not affiliated with this guy but using the direct link to the pdf here): http://www.edbatista.com/files/2014/Lyubomirsky-Person-Activity-Fit-Diagnostic.pdf\n\nAlso get her to read or listen to the audiobooks for any of Dr. Brene Brown’s books. I really love “the gifts of imperfection” and it has helped so much in the way I deal with life. Check out any of the TED talks with Brene and also the “10 guideposts for wholehearted living”. Empowering but also sobering stuff. We’re all wired for struggle but we can learn how to manage it better and believe that we are worthy of love and belonging at the same time.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511835613, "distinguished": null, "edited": false, "id": "dqfprzm", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfprzm/", "retrieved_on": 1511835614, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Ro_in_the_room", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Everyone has given great advice, so I’d only add: meditation. Ten minutes a day helps me cope (I have a nearly three year old and a four month old). ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511836848, "distinguished": null, "edited": false, "id": "dqfqxqq", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfqxqq/", "retrieved_on": 1511836849, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "babs_is_great", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "My suggestion: quit breastfeeding. Making it to six months is amazing. Also let your wife quit her second job. Hire a maid service and a lawn service. Tell your wife to stop doing her hair every day if she does that and stick it in a bun. \n\nIf you can get an au pair, they are worth their weight in gold. Do it. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511838972, "distinguished": null, "edited": false, "id": "dqfsttj", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfsttj/", "retrieved_on": 1511838974, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "amprhs612", "author_flair_css_class": "purple", "author_flair_text": "mom of two (5&amp;4)", "banned_at_utc": null, "body": "Your wife sounds exactly like me for all 3 of our kids. Mombrain is real... but now, it's something we laugh about (\"OMG when is real brain coming back so we can find all the remotes again!!\") Don't stress! My hardest part was not killing my husband every time he slept or ate a full meal or got to leave for work. Remember how much you love each other and just make promises that it will get better and you both will still love each other. As far as her stress, shuck it out the window. Dishes or bath? Bath. Laundry or watch TV on sofa. Yep - GOT it is. Don't feel guilty about a dirty house! We all have dirty houses... some just hide it better. And work related stress - my husband and I talk about work to each other so we don't let it stress us out. We bounce ideas, good days, bad days, and worries off of each other. This helps tremendously! If he knows I have a big project coming up, he'll pick up a pizza on the way home or take the kids to the park. Most articles say leave work at work. We felt like that was more work than talking about it. Open up the lines of communication. I know my husband doesn't want to hear about me taking tons continuing education classes... I don't want to hear about reprogramming the server. But it's something he's excited about and needs extra cool down time. Just like I need quiet and cool down time after all the tests. \n\nTLDR: you guys are a team in every way. Be each other's cheerleader, partner, and best friend. \n\nSounds like you're on the right track - good luck!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511839326, "distinguished": null, "edited": false, "id": "dqft4ix", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqft4ix/", "retrieved_on": 1511839327, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "song_pond", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Awesome, thank you!!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511839741, "distinguished": null, "edited": false, "id": "dqfth3n", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfoxbk", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfth3n/", "retrieved_on": 1511839743, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "amprhs612", "author_flair_css_class": "purple", "author_flair_text": "mom of two (5&amp;4)", "banned_at_utc": null, "body": "It took many years for me to be able to relax when I know that there are dishes in the sink or laundry to fold. I'm a list person so I made a list. Every time I crossed something off, I would reward myself with a break. There's alllllllways going to be laundry and dishes and garbage and shoes everywhere. But there's not always going to be a sweet baby to rock and snuggle. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511839762, "distinguished": null, "edited": false, "id": "dqfthpe", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfg6m6", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfthpe/", "retrieved_on": 1511839763, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "secretchiquita", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "+1 for cleaning lady. I work a demanding job, am in grad school, and have two littles. The state of disarray in the house was adding to my anxiety. We started with cleaners 1x/week and now they come every other week. I scheduled them for Fridays so when the weekend started my to-do list was sooo much shorter. Was great for my marriage too as my husband didn't have to carry so much around the house either.\n\nI also have started time blocking - certain times for certain tasks. That way I don't get so overwhelmed by all that needs done. I know there's a time set for that Thursday, so I don't have to worry about it now.\n\nAlso sleep, healthy eating, and support from other moms.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511839853, "distinguished": null, "edited": false, "id": "dqftkdl", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfktf0", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqftkdl/", "retrieved_on": 1511839854, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511840337, "distinguished": null, "edited": false, "id": "dqftys2", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqftys2/", "retrieved_on": 1511840358, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511841122, "distinguished": null, "edited": false, "id": "dqfulz3", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfotq6", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfulz3/", "retrieved_on": 1511841123, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Radiant_Radius", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Even if you think you’re helping around the house a lot, even more than most husbands, please read this article and look at yourself objectively. https://www.theguardian.com/world/2017/may/26/gender-wars-household-chores-comic", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511841960, "distinguished": null, "edited": false, "id": "dqfva0x", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfotq6", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfva0x/", "retrieved_on": 1511841962, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Radiant_Radius", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Just curious - do you want to post your time blocks calendar? I just love getting to see how other working moms structure their lives. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511842427, "distinguished": null, "edited": false, "id": "dqfvmyv", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqftkdl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfvmyv/", "retrieved_on": 1511842428, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "bowsnotbros", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I use a B12 vitamin and it helps a lot! I also use a supplement called 5-HTP and that has made a big difference as well.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511844273, "distinguished": null, "edited": false, "id": "dqfx0ul", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfx0ul/", "retrieved_on": 1511844274, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "not_just_amwac", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt;she finds that she is just failing at a lot of small tasks that she normally handles.  \n  \nDo you know what, specifically, those things are?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511845100, "distinguished": null, "edited": false, "id": "dqfxlak", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfxlak/", "retrieved_on": 1511845101, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "DriveTimeTexting", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "This. This is so true.\n\"You didn't ask me to.\"\n\nArg!\n\nMy therapist told me I should stop. And just give my spouse a chance to be competent. Things have been better...but I just sent him a reminder email to schedule the baby's Dr appointment...  Specifically on a day he can take her. \n\nI've had to take my days for her cranky post immunization afternoons enough. He can take a turn. \n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511845579, "distinguished": null, "edited": false, "id": "dqfxwqk", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfoxbk", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfxwqk/", "retrieved_on": 1511845581, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "DutchTwin", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "[This](https://www.pathospilates.com/single-post/Pilates-on-Prenatal-Fatigue) might help", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511847084, "distinguished": null, "edited": false, "id": "dqfyven", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfyven/", "retrieved_on": 1511847085, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Again, this isn't me.  I am very proactive and help lead our house hold.  I don't sit back and only do what is asked of me.  It's kind of frustrating that hours after I post multiple comments about my role not being an issue, more people continue to give the same thoughts and those comments get multiple upvotes. I hope it's just people not really taking the time to read my other comments and just commenting off the first thing they see, because I am feeling borderline insulted.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511847224, "distinguished": null, "edited": false, "id": "dqfyygd", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfva0x", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfyygd/", "retrieved_on": 1511847225, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Usually small things like misremembering or even writing the wrong dates and times for certain things.  Not getting normal work load done at work.  Forgetting milk at work, or pump parts at home.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511847554, "distinguished": null, "edited": false, "id": "dqfz5u3", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfxlak", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfz5u3/", "retrieved_on": 1511847556, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "neonroxy", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Wine, lots of wine. But seriously it will get easier. Under 1 was the toughest for me with my second son. Honestly I take a bit of time to recharge myself. An hour or so to nap, read a book, get my nails done, hair cut, coffee, massage. Just let her know the best advice I got was that I can’t do it all. She sounds like the kind of mom/woman who doesn’t stop til it’s all done. Dishes will be there, laundry will be there, papers to grade will be there! People who judge you by the mess you house is don’t understand the true value in where and how you spend your time. It’s ok for her to let something go so she can get to bed earlier. And allow her to be a little selfish here and there! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511847570, "distinguished": null, "edited": false, "id": "dqfz66p", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfz66p/", "retrieved_on": 1511847595, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "mrrrt", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I’ve come to realize over the years, one of my biggest stress relievers.. it doesn’t have to do with changing my schedule or lightening my work load. It has to do with positive reinforcement. My mother is one of the most positive individuals I’ve ever met, she see the good in everything. Being able to vent to someone that LISTENS, and then have them recognize and express something positive about the situation makes it all so much more bearable for some reason. For instance, you could remind her how this is all temporary- the kids will get older and go to school and she will have much more free time. Or reminding her how all of the work she is doing is going to be essentially worth it. This is just what helps me, a little tip that can stretch a long ways. Keep up the team work , you guys sound like a power couple !", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511847760, "distinguished": null, "edited": false, "id": "dqfza9m", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfza9m/", "retrieved_on": 1511847761, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "not_just_amwac", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "That's perfectly normal for me, and I'm a stay-home mum. It's 10000% understandable for her to forget things sometimes.\n\nI'm assuming you help her out if she tells you she's forgotten something? :)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511848133, "distinguished": null, "edited": false, "id": "dqfzifp", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfz5u3", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfzifp/", "retrieved_on": 1511848135, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I do my best. The days that she has her second job, I get the kids home, cook, bathe, and get the kids down.  About the time I am saying good night, she walks in.  She usually eats and if I already have the baby down, she pumps while I start picking up the to explosion.  At this point it's already 8 and we both finish up that last few things.  The days that she doesn't have her second job differ.  Those days the work load at home is easier, but she usually vents more about stress at work.  Sometimes we can spend an hour a day talking about her stress  rather than actually taking time to relax.  She works so hard, that she can't turn it off.  I think that if she thinks/worries about her problems when she has free time that she feels like she is being proactive or some how planning/brainstorming.  It's hard for me to help her relax.  I have to find the balance.  If I try and be too blunt about her not needing to worry, then it would come across as if I thought her concerns were dumb.  If I go too far into the rabbit hole with her, then we waste a lot of time re hashing the same things that causes her to end even more frustrated and tired.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511848687, "distinguished": null, "edited": false, "id": "dqfzukg", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfntqd", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqfzukg/", "retrieved_on": 1511848689, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I do this all of the time.  Some days it helps, but sometimes she doesn't want to hear it.  Sometimes if I am trying to be too optimistic or positive, she feels like she's not being heard.  It's hard to know what she needs  Sometimes she wants a little tough love and what to know that she is over reacting.  Sometimes she just wants me to listen and acknowledge her concerns.  Sometimes she wants my advice and some help.  I think that's really most women though.  It's all about knowing what is wanted in the moment and that's hard.  I usually get it right 7 out of 10 times.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511849296, "distinguished": null, "edited": false, "id": "dqg07rd", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfza9m", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg07rd/", "retrieved_on": 1511849297, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "mycoldfeet", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Maybe she's looking to have Reddit tell you what she doesn't want to, because it'll lead to an argument. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511852888, "distinguished": null, "edited": false, "id": "dqg23sx", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfyygd", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg23sx/", "retrieved_on": 1511852889, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "hedonistjew", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Does your wife drive to work? I drive about an hour and some weeks that's my only alone time. I use it to relax. It's cliche but I started listening to podcasts to help transition my focus. I find that on days when I don't transition my focus I'm scattered at work because I'm still in Mommy-mode and if I'm worries about work, I'm not a very with-it mom those days.\n\nI also created what ~I~ Pinterest calls a battlestation.  It is a white board with a calendar for two weeks out, a more detailed weekly calendar/schedule with appointments, times, meal plans, etc, and an even more detailed daily schedule for my daughter (food/sleep/play). I also have a list of chores I update every three days (frequency varies). If my husband has 15 minutes he does a task on the task board. He can check the schedule if he is confused about something or wants to schedule something. All without having to check in with me. \n\nYou say your wife had 2 jobs, but she actually has 3. I think on most (but not all) families the burden of household management falls on the moms. So having the board helps to empower my husband to make decisions and contribute without me micromanaging. \n\nThe organization helps with Mommy brain a lot. And doing something like listening to podcasts or books while driving to re-focus helps be present with what you need to be doing. Meditating helps, too, but it's not for everyone. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511853057, "distinguished": null, "edited": false, "id": "dqg26px", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg26px/", "retrieved_on": 1511853058, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Rick3tyCrick3t", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Wow, there's lots going on here, no wonder she's tired!! It does get better, yes, but in order for that to happen, she needs to let go of the \"mom guilt\" we all carry. Encourage her to take time to do things for herself. She can't be at her best if she's always putting herself last, something many of us moms do pretty consistently. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511853257, "distinguished": null, "edited": false, "id": "dqg2a4e", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg2a4e/", "retrieved_on": 1511853259, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "lifeasapeach", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": " This is it. If she can't let stuff go around the house, it may be because she knows it'll just pile up for her later.  I clean more than my spouse, but he always cleans on Tuesdays due to his schedule. So when I have a bigger workload, I don't have to stress about letting the cleaning go a bit, cuz it'll be done on Tuesday, at least.  \ndo you have a shared family calendar that you regularly check and help add appointments or reminders? If not... that's a bad sign as far as being an equal partnership. Again not referring to workload, but responsibility. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511854638, "distinguished": null, "edited": false, "id": "dqg2x3n", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfkthm", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg2x3n/", "retrieved_on": 1511854639, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "tectonicus", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt;It does help us financially and she is great with the boys, but we have to pat her ego and deal with her throwing major and unwarranted fits on a weekly basis.\n\nFits need to stop. Either the kids go to daycare, or you sit down with the mom and tell her that you need her help to help your wife.\n\nSecond: House cleaner. 2-4x per month - seriously. No more cleaning of bathrooms or kitchen floor mopping - not just the process of *doing* it, but also the process of *keeping track* of it. I swear it will help. You find the house cleaner, schedule the cleaning, take charge.\n\n(3) How do you divide household labor now? Could you make the divisions more explicit, so that (for instance) you handle all laundry, so that she never has to think about it? It sounds from your description like you do your share of the work, but she may still be keeping the work that you do in her own mental space. There's a huge level of freedom in letting go of that. (e.g., being aware that the oil needs changing in the car and that someone else did it is different from just being able to drive the car and never think about the oil.)\n\n(4) What happens at night with the 6 month old? Is she up a lot at night to do feedings? Could you switch to co-sleeping, or do some formula feeding, or something so that she gets more sleep?\n\n(5) What happens with food? Meal planning, shopping, cooking, clean up. Is there a way to make this simpler? Is she eating nutritious, tasty meals? Sometimes it helps to divide this up by weeks, so one person is in charge of meal planning for one week, and another person the next. Or, maybe you could do some bulk meal prep on the weekend together? Or, I've heard good things about the InstaPot (combination slow cooker/pressure cooker) - would it be worth investing in something like that? Could you guys switch to disposable plates etc. for a little while just to cut down on stuff to do?\n\n(6) Does she ever get time at home by herself, or are there always kids there? Could you or your MIL take the kids out for an afternoon and let her just be alone to do whatever she wants - whether that's watch a Netflix episode, take a nap, or even catch up on cleaning (if that's what she needs to do to feel satisfied)? My greatest moments of stress are when I just need *space* around me, and it doesn't help for my husband to encourage me to go out, because I want that space to be silent and in my own apartment. Even just an hour of being alone with no one else there and nothing to do can help me reset.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511859433, "distinguished": null, "edited": false, "id": "dqg4vrn", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg4vrn/", "retrieved_on": 1511859433, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Cerridwyn", "author_cakeday": true, "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sorry for all the hate. I don't know what it is about parenting Subs but there seems to be a lot of hate towards husbands. Not all husbands sit on their butt. many are equal contributors in the house which it sounds like you are. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511864892, "distinguished": null, "edited": false, "id": "dqg6t6h", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfyygd", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg6t6h/", "retrieved_on": 1511864893, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Cerridwyn", "author_cakeday": true, "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Just my opinion on daycare. I have a baby and since he started daycare he has been sick constantly. We are at the doctor several times a month and often the household will catch whatever he has. In the long-term daycare may be very beneficial but expect in the short-term you may all be passing around colds and viruses for a few months. \n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511865097, "distinguished": null, "edited": false, "id": "dqg6von", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg6von/", "retrieved_on": 1511865097, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "No, trust me. Our communication is fine.  If anything she just wanted someone to encourage her to quit the second job or to try meds again.  She asked me to do it, because she doesn't like Reddit.  I have tried to get her into it, but she stumbled into WTF and saw a gif of kids being hit by a car.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511869975, "distinguished": null, "edited": false, "id": "dqg8pur", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqg23sx", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg8pur/", "retrieved_on": 1511869975, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Curi0usgrge", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": " What talking to you about the stress helps her relax. The other thing to think read about is emotional labor.  Especially with the holidays coming up. The stress of coming up with ideas and not over spending, doctors appointments, meal planning and other things. \n\nWhat things do you rehash and get mad about? That might help to find ideas to help.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511870230, "distinguished": null, "edited": false, "id": "dqg8tpv", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfzukg", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg8tpv/", "retrieved_on": 1511870230, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "aggravatingyou", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "She has too much on her plate. She needs to release some baggage to lighten the load. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511870682, "distinguished": null, "edited": false, "id": "dqg90rm", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg90rm/", "retrieved_on": 1511870682, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Nothing really.  I quietly get frustrated that even the few times a week that we have a moment that we could rest and let it all go she feels the need to re hash the same anxieties about doing a good enough job at her new job or not making enough milk, or just drama with her mom.  I always tell her that she can stop breastfeeding, but she really enjoys it, she just hates pumping.  This is our last baby so she wants to enjoy it.  Before kids we argued about silly things, but after kids we vent out our days, but rarely argue.  I guess my biggest argument is not getting enough attention physically or emotionally and I rarely bring it up. She can go weeks without asking me how my work is going even though we talk about hers everyday and can go months without physical affection.  I'm sure I'll get torn up and the comments about even mentioning this but I never guilt her.  I've never once made her feel like she was obligated to do anything ever for me and I've done such a good job at making her feel that it's okay, she doesn't ever feel obligated and when she is stressed,I am the last thing on her mind. I'm glad that she doesn't have to worry about me but overtime it hurts.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511872283, "distinguished": null, "edited": false, "id": "dqg9rp8", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqg8tpv", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg9rp8/", "retrieved_on": 1511872285, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Pethoarder4life", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "This. I hate having to manage my husband's time, but he desperately needs it. We have spent years working out systems for ourselves to help lower my stress level associated with this. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511872665, "distinguished": null, "edited": false, "id": "dqg9ygh", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfnsgt", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqg9ygh/", "retrieved_on": 1511872666, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AnnOnimiss", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Sounds like supermom is going hard.   Having more stress and anxiety on top of it means it's even more important to carve out some time for her to unwind.  You mention you guys talk about her stress for an hour instead of relaxing, is her venting a way for her to relax?  Would doing some stretches together while you're chatting be more effective? Having a longer commute can be an opportunity to relax and listen to some podcasts, do some meditative breathing or mindfulness exercises.\n\nI had trouble not taking work home too, and to deal with my anxiety I'd write down my concerns in a check list and stick them in my planner to worry about later (like scheduling a time for my worry).  Then I could focus on relaxing.  Sometimes I'm only able to \"turn it off\" doing a guided meditation.  I like\nQuiet Mind Cafe on YouTube.\n\nGood on you for cooking and helping with the kids.  Having a strong supportive partner makes all the difference.  Hope you're doing a meal prep day to streamline things.  It's a lot less stressful when you don't have to worry about feeding everyone.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511874198, "distinguished": null, "edited": false, "id": "dqgas4d", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgas4d/", "retrieved_on": 1511874199, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MamasaurusVex", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Came here to say exactly this", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511877128, "distinguished": null, "edited": false, "id": "dqgclcb", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfkthm", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgclcb/", "retrieved_on": 1511877130, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "soawhileago", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Reading through your comments, her stress isn't the second job, and it isn't household division of chores. It's childcare with an emotionally unstable provider. MIL is obviously overwhelmed as well.\n\nFull time is a no-go, but just a couple day break might make all the difference for your wife and her mom.\n\nIs there anyone you can trust (or pay) to provide care just 2 days a week?    Other family? A friend? Someone from church? A free local program like headstart? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511877535, "distinguished": null, "edited": false, "id": "dqgcvl1", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfpcsp", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgcvl1/", "retrieved_on": 1511877537, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "luciavdh", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "If it were me, I'd quit the second job.  I'm a single mother to 4 kids and I work full time and I'm in grad school so it is *possible* to make it all work, but my life is exhausting and I'm spread so thin I mostly want to die.  Her schedule sounds relatively similar to mine, minus a few kids and plus a few days of work (I'm a nurse, full time is only 3 days).  Unless you're completely relying on her second income, I really can't see how it's worth the extra stress and time commitment.  \n\nAlso, maybe she should talk to her doctor about a different med.  Wellbutrin is safe for breastfeeding and doesn't cause fatigue-- it's somewhat stimulating and gives more energy.   ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511877677, "distinguished": null, "edited": false, "id": "dqgcz9v", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgcz9v/", "retrieved_on": 1511877678, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "The oldest goes to daycare 2 days a week.  On days that my mil is not feeling well it whatever, I either take off or have other family cover.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511877819, "distinguished": null, "edited": false, "id": "dqgd2wc", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqgcvl1", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgd2wc/", "retrieved_on": 1511877820, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "soawhileago", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Is there somewhere else the youngest can go on those days as well? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511879024, "distinguished": null, "edited": false, "id": "dqgdyvo", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqgd2wc", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgdyvo/", "retrieved_on": 1511879031, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "laelgh", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "From another mom feeling stressed, thanks for the advice!  In addition to your food-related suggestions, just wanted to add:\n\nConsider getting a meal service.  We love ours because it means that we (1) don't have to plan meals, (2) cut down on grocery store trips, (3) spend less mental energy while cooking because we don't have to work out the timing, (4) are eating healthier and more adventurous food.  Baby (10 months) eats whatever we're eating and it is surprising what he likes! \n\n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511881159, "distinguished": null, "edited": false, "id": "dqgfp0v", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqg4vrn", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgfp0v/", "retrieved_on": 1511881161, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "givemecookies456996", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "I don’t have any amazing suggestions, I just want to commend you for being a great partner. Thank you for looking out for your wife. You sir, are a wonderful man. The biggest of high fives to you. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511882169, "distinguished": null, "edited": false, "id": "dqggk93", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqggk93/", "retrieved_on": 1511882170, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "laelgh", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Regarding Mom-brain: I'm finally getting back my mental capacity about 10 months post-partum.  It is directly related to the amount of uninterrupted sleep I get at night.  My little one still doesn't typically sleep through the night but starting about 1 month ago he has the occasional 7-hour straight sleep.  I never know when that 7 hour stretch is going to happen...so the key is to go to bed early (9:00 p.m. is the earliest I can manage) on the days when I don't have to catch up on work in the evening.\n\nAnother 'trick' that we're super happy about is our Google home/philips hue combo.  It has stopped the spread of so many colds/illnesses through our home.  It is worth it for just that reason.  We have one of the color-changing bulbs in the nursery and set it to a dim red during night-time feedings and diaper changes.  This means that baby stays in sleep mode longer (a.k.a. is easier to put down at night).  Bonus:  the home/mini can be used as an ambient noise machine with about 10 different sounds and a nice fade-out when finished.  Nap duration increased once we figured that out.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511882236, "distinguished": null, "edited": false, "id": "dqggmcm", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqggmcm/", "retrieved_on": 1511882236, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "IrshDncr", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Man, I get where she is coming from. While I only have 1 kid (1.5 yrs), I have a full time day job, own a dance school, and sit on a few Boards as well.\n\nAnd honestly, sometimes the exhaustion (Lo still not sleeping - my FitBit says I average 4 hours /night) is almost too much. \n\nI try to find ways of fitting in exercise (I take the stairs every morning, 12 floors) as that boosts my energy levels. I do drills with my kids at dance, and find ways to turn playing with my little one into exercise for both of us. I also try to do some meditation/pranayama every night before bed (read: lay in bed and do a brief meditation or some breath work, yes I often fall asleep while doing this). \n\nI've found if I can do prep-work on the weekends (get some slowcooker/premade meals ready) it really helps the rushed feeling during the week and makes me feel more in control. \n\nThat being said, I wouldn't be able to do it without my DH. We tag team getting ready in the morning (I get dressed while he is still sleeping, I get LO dressed while he makes breakfast&amp;coffee, then I feed LO while he gets dressed). \n\nAlso, while I try to eat healthy and balanced I've found that taking vitamins and some supplements is helpful. \n\nWhen I first went back to work after mat leave in the Spring; while I was functioning, it was a close call to exhaustion. She helped me with some supplements for energy and balancing my nutrient intake. \n\nBest of luck to you both!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511887590, "distinguished": null, "edited": false, "id": "dqgln1b", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgln1b/", "retrieved_on": 1511887591, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "nanor", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Just wanted to post to let you know that just the fact that you're reaching out on here shows that your a good husband and father. \n\nThis may be counter intuitive, but as a working mom that just ended a seasonal job (summer-end of fall), all I can say is for her to barrel through and try not to worry about the small stuff. Now that my second gig is over I actually feel a little bored to be honest. It's hard to unwind at night not having to think of so much, like planning for the next day, making sure all my ducks are in a row.\n\nShe sounds like a strong women, she'll get through it. If in fact it is just seasonal and will come to and end soon. If this schedule was constant, with no end in sight, yeah I'd say lose something. Either send the kids to daycare (which I may suggest anyway so they can get socialization), or quit the second job.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511888387, "distinguished": null, "edited": false, "id": "dqgmfcf", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfg6m6", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgmfcf/", "retrieved_on": 1511888389, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Curi0usgrge", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "This is more about you than you know.  You feel that you are the last person she has time for.\n\nI get her breastfeeding issues while that lead to not wanting to be touched.  Her body is still all out of whack. \n\nI feel like I could not be affectionate without having to turn down my husband. \n\nOne thing that really helped us is hugs.  It must be at least 10 seconds.   It would be just making dinner in the kitchen and taking a minute to hug. \n\nAlso give it time the first year is very hard.  \n\nMaybe talk to family that you to see if they would take the kids during the day and go Christmas shopping together.  It doesn’t have to be a night date and you can just relax. Maybe tell her no work talk. ;)\n\nGood luck. \n\n\n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511890160, "distinguished": null, "edited": false, "id": "dqgo7af", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqg9rp8", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgo7af/", "retrieved_on": 1511890161, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It's not me.  She has never been an affectionate person.  Her parents used to joke about how the only time she would give them hugs as when she was crying.  It's just how she's wired. This isn't anything new. Honestly it's more that she feel so comfortable knowing that I don't expect it from her that it really is just the last thing on her mind.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511893060, "distinguished": null, "edited": false, "id": "dqgr7kz", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqgo7af", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgr7kz/", "retrieved_on": 1511893061, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MamasaurusVex", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It's hard to hear but take some time away and come back and read through all of the work that has been done for you in this thread. There's a lot of good stuff. You keep refusing anything that is asking for your own self reflection. There are a lot of factors at play here and one of them is you. \n\nWith all of the words you've used to describe your experience, you've never responded to one of the mothers here with \"thanks\", whether or not you liked what they had to say. \n\nThis is what we're talking about when we talk about emotional labor. All of the work that been done here that you are acting entitled to.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511897301, "distinguished": null, "edited": false, "id": "dqgvlzl", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t3_7fxzpl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgvlzl/", "retrieved_on": 1511897320, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "num1zero", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "Yes there are a lot of good things here.  My wife and I have been looking at them in great deal. We're now considering adjusting our daycare situation and she's thinking about dropping the second job.  At first when she started to read some of the comments about me needing to reflect and help more she felt positive that they were women out there looking out for her. Then she started reading more and more and her positivity turn into anger.  We're taking notes on the good posts but I'm probably going to delete the post later because she's getting upset on the direction this is going.  ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511898117, "distinguished": null, "edited": false, "id": "dqgwg7w", "is_submitter": true, "link_id": "t3_7fxzpl", "parent_id": "t1_dqgvlzl", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqgwg7w/", "retrieved_on": 1511898118, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "secretchiquita", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "It'd be hard to post, but a summary of how I'm working now -- I block 3 hours at work weekly for my \"Weekly Review\" going through all my email, phone messages, notes, projects and open items. I keep a to-do list and each day block time for the most important things to get done. I also block time for email and am trying to keep to those times - I found I was in my email way too much and it was stressing me out. I set time a couple days a week for \"home tasks\" too - reading school newsletters, rsvp to birthday parties, thank you notes, school forms, whatever. That way I'm not doing it all week. I also set time for phone calls with family and friends that otherwise fall to the bottom of the list. It's helped me learn to say no because if something doesn't fit in the calendar clearly I can't do it.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1511995733, "distinguished": null, "edited": false, "id": "dqj3sxx", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqfvmyv", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqj3sxx/", "retrieved_on": 1511995734, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "mycoldfeet", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "body": "&gt; My greatest moments of stress are when I just need space around me, and it doesn't help for my husband to encourage me to go out, because I want that space to be silent and in my own apartment.\n\nThis is exactly how I am. My husband tries to take our son out for half a day at least once a week (usually Saturday mornings), and it helps my stress levels immensely (let's be real, those mornings are my *sanity!*). ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1512111685, "distinguished": null, "edited": false, "id": "dqlkrjg", "is_submitter": false, "link_id": "t3_7fxzpl", "parent_id": "t1_dqg4vrn", "permalink": "/r/Mommit/comments/7fxzpl/my_wife_wanted_me_to_ask_if_any_other_working/dqlkrjg/", "retrieved_on": 1512111686, "score": 1, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}