{"submission": {"author": "MariahNicole1216", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1iz46z6u", "can_mod_post": false, "contest_mode": false, "created_utc": 1536073678, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/", "gilded": 0, "id": "9cwgpa", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 60, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/", "pinned": false, "pwls": 6, "retrieved_on": 1536073678, "score": 49, "selftext": "Disclaimer: I really don't want any negative comments, and I hope nothing I say offends people. These are my opinions/feelings and I'm searching for answers from people who know the mom life best. \n\nSo for years and years, I've known I don't want children. I've avoided children for as long as I can remember. When family members were born, I always begged my mom to not make me go to the hospital or have to hold the baby. I've always been way more of an animal person than a baby person. I don't 'hate' children, it's just that being around them makes me a little uncomfortable.\n\nThat was all fine and dandy to me for a while until I met my SO who absolutely wants kids. He loves kids, grew up helping take care of his sibling/cousins and doesn't see his life without him. We've been together 5 years now and while he knows I'm not completely gung-ho, I'm not sure he understands the extent of my aversion. As we get older and I feel that we will likely get engaged soon, I can't help but constantly think about the expectation to have children in the next few years. The more I evaluate, I realize that I don't necessarily hate the idea of having older children. I think I'd like being a mom to school-aged children, especially when they get into their teens (I was a high school teacher for a little bit, so this makes sense), so maybe I just don't feel warmly to younger children.\n\nAlso, child birth absolutely scares me and I don't imagine myself feeling that immediate bond to a stranger who is now going to absolutely take over my life. I hate the idea of giving up my life as I know it and spending every penny I work for on my child. I don't see myself loving anything as much as I love my dogs. Everyone says these feelings will develop but what if they don't? What if, because I love my SO, I decide to have children and I regret it? I also think about the environment implications of having more children, and is it fair to force them to grow up in a world where the future is a little murky? \n\nDid anyone feel this way but now loves being a mom? Would anyone be willing to admit that they regret their decision (I think it's possible to love your children but regret that you had them at the same time)? I don't know what answers I'm looking for but typing this out was therapeutic nonetheless. I think I want to be a person who wants children and I'm hoping you guys can turn me....", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_subscribers": 38759, "subreddit_type": "public", "thumbnail": "self", "title": "To have or not to have?", "url": "https://www.reddit.com/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/", "whitelist_status": "all_ads", "wls": 6}, "comments": [{"approved_at_utc": null, "author": "JustGingerIt", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1jogba7", "banned_at_utc": null, "body": "I didn’t know if I wanted children. I had a great life, adored my dog, everything was so good. I never felt an urge to have kids. At all. But after a lot of talks we decided to “see what happens.” My husband wanted kids, and we were getting older (mid-30’s). Now we have a six month old and I’ve never been happier. As cheesy as it sounds, every day is a delight. Pregnancy was not so fun, but the baby more than made up for it. I can never regret having her, my heart is bigger, and I still love my dog.\n\nGood luck, whatever you decide. :)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536074776, "distinguished": null, "edited": false, "id": "e5dowv4", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dowv4/", "retrieved_on": 1536074777, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AnaTheHated", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_h5a2f", "banned_at_utc": null, "body": "I was really ambivalent about having children. I ultimately decided to have a child. I still don't like other people's kids, but I feel an insane love for my kid. I think a lot more people feel that way than you think. However, since you say you like older kids, and are concerned about population-related environment impact, what about fostering/adopting? ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536075721, "distinguished": null, "edited": false, "id": "e5dpz2o", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dpz2o/", "retrieved_on": 1536075722, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "msalberse", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_2ft3z", "banned_at_utc": null, "body": "My SIL was adamant. She never wanted children. Her spouse was on the fence. As more nieces and nephews joined the family, she started to wonder. \nHer daughter just turned eight and they are best friends. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536076491, "distinguished": null, "edited": false, "id": "e5dqv2w", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dqv2w/", "retrieved_on": 1536076493, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Masqueraver", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_6a56y", "banned_at_utc": null, "body": "I think every child deserves to be 100% wanted and loved. Would you rather not have a child and live your life that you're already happy with, and maybe come to regret not having one, OR would you rather risk having a child and regretting that, and then being stuck with a child you resent? \n\nIt's possible that getting pregnant and having your own child will prompt enough hormone changes to make you absolutely happy to have a child. But it's also possible that it won't. I wouldn't take the gamble if I were in your position. \n\nIf you feel more comfortable with the idea of older children, you should look into fostering or adopting. Your local government most likely has a program that can make this easier for you. If your husband is the kind of person that makes a stink face and says \"I couldn't love them the same,\" then that's not a guy I would want to have kids with anyway.\n\nYou may benefit from a visit to /r/fencesitter", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536078365, "distinguished": null, "edited": false, "id": "e5dszvb", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dszvb/", "retrieved_on": 1536078366, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ugghyyy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1vmk5qsw", "banned_at_utc": null, "body": "I’m not sure your age but me and my husband were on the fence about having kids. I’m older than he is and I told him if we were to have one it would need to be soon. \n\nI will admit that I was extremely hesitant because I was used to a certain lifestyle. (I’m not rich or anything) it was just nice to go to bed late when I feel like it, wake up when I wanted or go to bed early, etc (I love sleep). So at 35  I became pregnant, I was completely nervous throughout the pregnancy on whether I would bond with my lo, if I would be happy being a mom, and the amount of work it entails.\n\nI’m now 6 months in to being a parent, but when I laid eyes on my little dude I was in love. Yes there are days where I just want to run away because I can’t take all the crying, I can’t get my housework done, and I’m still paying off the hospital bills, but I do love him. I’m scared of what the future holds for us, but also curious to see his development. \n\nOne of the hardest things I’ve come to find of being a parent is having to share him with relatives. So instead of seeing family members once every few weeks or so, I’m stuck seeing them once a month. I like my space and I’m not to fond of people being all over my kid and having to interact constantly with people.\n\nHowever, if you have major doubts about parenthood I don’t think it would be to wise marrying this person, it’s not fair to either of you or the child you may bring into this world. There are others out there who feel hot sentiment, and honestly there is nothing wrong with not wanting a child. Just don’t have one for someone else, because you may resent your spouse and the child. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536079700, "distinguished": null, "edited": false, "id": "e5duj8v", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5duj8v/", "retrieved_on": 1536079700, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MariahNicole1216", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1iz46z6u", "banned_at_utc": null, "body": "Thank you for suggesting that sub. I did not know it existed! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536079936, "distinguished": null, "edited": false, "id": "e5dut7q", "is_submitter": true, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dszvb", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dut7q/", "retrieved_on": 1536079937, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "jfager16", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_153ze5", "banned_at_utc": null, "body": "Hey there :) so it sounds like you were pretty much child free until you met your spouse. Screw anyone putting pressure on your in the next few years, those people don’t have to raise the small person. I would say something like “oh well since you want to know about my sex life, do you have any tips on anal?” I mean, even tho I have a kid, those people annoy the fuck out of me. Like hellllooo, my sex life is none of your business... ok moving on. \n\nThis is something that you really really need to reflect on for yourself. Having a child because your partner wants kids....just isn’t fair to the child. If you resent the child, then that kid could potentially have major issues as they grow. Kids know when the love isn’t genuine or given freely. OR you could have a kid and be absolutely blown away by how incredible it is. That being said, if a child is even an option, you need to be prepared to go all in. \n\nIf deep down you know you do not want kids and you know your partners life goal is to be a father, then you two are probably incompatible long term. You may have a kid and then hate your spouse because you feel like he forced you to do something that you didn’t want in the first place. Having a child is far more than just you/child relationship. It changes the dynamics completely. \n\nPersonally, I don’t like any kids other than my own. My kid is cool as fuck, she’s well tempered and funny and I just fucking love her...that kid in the grocery store that’s whining about a candy bar, ugh. I’m not necessarily a person that loves kids. Just mine. \n\nHopefully I don’t sound like a dick. \n\nThis was long. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536080725, "distinguished": null, "edited": false, "id": "e5dvq2c", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dvq2c/", "retrieved_on": 1536080726, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "keekeroo2", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_186jl5i6", "banned_at_utc": null, "body": "I never understood when people would say kids were the best thing to ever happen to them, or having kids made them a better person. Kids seemed like a lot of work and most kids are annoying (to me). \n\nBut then I got pregnant and had my first (a girl) and yep, I became a better person, more understanding, compassionate and caring. I'm more patient with everyone. How a little baby does that to you, who knows. \n\nThen I got pregnant again and had a son. And life just keeps getting better. We spent the long weekend visiting a farm, went to the zoo, then the beach, out to eat and played in the rain. I've never been so happy. And so far from the person I was before kids. \n\nThere were plenty of not great moments along the way. My body is unrecognizable. My marriage has changed. My work priorities and promotion trajectory have shifted. But I'm still happier with kids. \n\nYou've got to commit to it, because every moment of every day now revolves around them, not you. But it's truely a life changing process. \n\n\nAll this being said, if you feel like that change would make you unhappy, don't have kids. Babies turn into adults and they need love and attention to grow into good people! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536082410, "distinguished": null, "edited": false, "id": "e5dxnef", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dxnef/", "retrieved_on": 1536082412, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Br0k3n_W0lfie", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_jjrt3", "banned_at_utc": null, "body": "I never liked babies. I thought they were loud and never agreed to their cuteness.\n\nI didnt want children because I thought it was egoist to bring a new child into the world, especially with everything that is happening environmentally speaking.. \n\nThen I met my husband and for some reasons... he gave me faith in the future. He wanted his own kids to be able to live everything, every phases. I fell pregnant soon after getting married and ... well\n\nTurns out I dont like babies, however, I love MY baby. My life is different and she actually gave me an incentive up TRULY change the way I do things. It was easy for me to say I cared about the environment and that I wouldnt bring a child into this world for them but also because it would increase my contribution to the environmental pressure. Well... because of her, I realized I wasnt doing nearly enough for our childrens futur... I am now slowly transitionning to a zero waste life style, all her clothes were used clothes, I use cloth diapers, I want to learn to sow so I can reuse stained clothes and craft new things using old things... \n\nMy life has a new meaning. Because of her, I truly want us to do well as a species and changed the way I do thing instead of accepting the statu quo, convincing myself I cared although my actions were almost nonexistant... \n\nThis is my experience anyway... but yes, I know some moms that are miserable and hate the baby phase... I took a chance and love it but it was a risky bet. Although, I had a feeling it would be fine because of the way I cared for my cat and my dog... I always bonded very well with animals and I think it says something about someone you know.. \n\nGood luck in your decision making. It is not easy and have long lasting consequences, thats for sure...", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536082439, "distinguished": null, "edited": false, "id": "e5dxoko", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dxoko/", "retrieved_on": 1536082440, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "AngelFish2015", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_125w3rb4", "banned_at_utc": null, "body": "I’ve always wanted kids, but after having my first one it’s been a wake up call to how intense being a mom can be. It’s a lot of work when they’re little.\n\nThere is always the possibility of fostering older children, there is always a need for that!\n\nWhat is most important is being upfront and honest with your SO about your feelings and discuss it together! It’s necessary to be on the same page, especially as you take big steps forward.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536082815, "distinguished": null, "edited": false, "id": "e5dy3v2", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dy3v2/", "retrieved_on": 1536082816, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "silentmystarship", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_5v9g9xp", "banned_at_utc": null, "body": "When we got married, neither of us wanted kids. As we approached 30, my husband realized he did. I still didn’t. But I looked at it similarly to you: having older kids sounded nice. In the big picture, I want to have a family, to be friends with a grown daughter the way I’m friends with our parents. \n\nPregnancy was terrible, and I cried a lot because I still wasn’t convinced I’d made the right decision. But since meeting our daughter, I’ve never regretted it. Life is different, my body is different, and i still feel like I’m mourning them a little... but I’m so happy I get to know this little girl. \n\nBut I also know I’ve been lucky. I didn’t have a ton of stretch marks. My bosses have been supportive. She’s been an easy baby. \n\nI do think looking long term is the way to approach it. When you’re 60, what do you want your life to look like?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536083353, "distinguished": null, "edited": false, "id": "e5dypo2", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dypo2/", "retrieved_on": 1536083354, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MsScienceTeacher", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1499p1oj", "banned_at_utc": null, "body": "I always wanted to be a mom. That being said,  the instant bond and love for the baby was not there for me, which is omw thing you mentioned being afraid of. It took some time (a few weeks?). You may experience the same,  it's not uncommon,  despite what everyone outwardly admits. Dont worry about the love, it follows. But it will be the biggest change in your life and it lasts forever. Please be sure, and open up to your SO about your reservations.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536083943, "distinguished": null, "edited": false, "id": "e5dzdn4", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dzdn4/", "retrieved_on": 1536083944, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MsScienceTeacher", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1499p1oj", "banned_at_utc": null, "body": "Well said. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536084102, "distinguished": null, "edited": false, "id": "e5dzk1h", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dxnef", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5dzk1h/", "retrieved_on": 1536084102, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cthorn231", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_kxvltk5", "banned_at_utc": null, "body": "One of my girlfriends was a lot like you. Her husband wanted children and she didn’t, for many of the same reasons that you described. They had a child anyway. The dad does most of the care-taking. He stayed home from work to watch the baby so the mom could keep pursuing her career. He does all the play dates, etc. He basically became the “mom.” My girlfriend didn’t have to give up her career or her social life (she enjoyed solo travel before having a baby and still goes off on her trips). She loves her daughter and likes being a mom but this arrangement works best for their family. I don’t know if that helps you or not but perhaps it’s something to think about. :)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536084618, "distinguished": null, "edited": false, "id": "e5e04s6", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e04s6/", "retrieved_on": 1536084619, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "morelikecrappydisco", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_f4jjc", "banned_at_utc": null, "body": "I really think you should really want children and be sure you are ready to be there for them unconditionally before you have them. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536084745, "distinguished": null, "edited": false, "id": "e5e09ul", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e09ul/", "retrieved_on": 1536084746, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "JoNightshade", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_7k30e", "banned_at_utc": null, "body": "I was not a baby person. Or a kid person, honestly. I still do not really care for other people's children. I was absolutely terrified that having a baby of my own would wipe out my own identity, because suddenly the baby would be all that mattered. I knew a bunch of women who absolutely adored being a mom and wanted more babies, etc., and I was terrified of becoming like them, some sort of brainwashed zombie mom. \n\nNone of those things happened. Pregnancy SUCKS. I still am not thrilled with other people's kids, although I know how to handle them. But when my first child popped out and they put him on my chest, I fell deeply, permanently in love. SO SO SO in love. And I realized that parenthood is not a job or a duty, it is first and foremost a relationship with another human being. Which you created. It's so amazing. \n\nI didn't lose my identity, although life did revolve around \"keeping baby alive\" for a number of years. Right now, my second and final child just started kindergarten, and for the first time since my oldest was born 8 years ago I feel like I am finally returning to my \"old\" self. But I'm a better, stronger, more loving and forgiving and empathetic version of me than I ever would have been without kids. Parenthood is a huge challenge, and it's not the only challenge or greatest challenge life can give a person, but it's something that can make you better and stronger if you chose to embrace it. \n\nAnd honestly, you do not have to be a mom like \"everyone else\" is a mom. I'm not. And honestly I think being more detached from my kids on a day to day basis gives me an edge in terms of being effective at discipline. My kids are secure, happy, functional human beings, and I'm really proud that I had a huge hand in that. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536084756, "distinguished": null, "edited": false, "id": "e5e0ab5", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e0ab5/", "retrieved_on": 1536084757, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "snuitfracks", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_4fdq2gc", "banned_at_utc": null, "body": "I had pretty much zero maternal instinct until the minute my first was born.  I chalk it up to hormones, but it was insane - just pure, immediate, intense love for this little human as soon as he was born.  Those feelings have never gone away and I absolutely love being a mom, which caught me completely by surprise.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536084866, "distinguished": null, "edited": false, "id": "e5e0equ", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e0equ/", "retrieved_on": 1536084868, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "squaregarden916", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_mv2d5", "banned_at_utc": null, "body": "My husband and I had a lot of discussions about having kids due to the same reasons you listed. We ultimately decided to have kids (I’m pregnant with my second...and last) because we decided we wanted the experience of helping kids learn and experience all those things we enjoy. I’m not a particularly mushy parent (I felt no connection during pregnancy or right after birth), but I have enjoyed being a parent.\nIn regards to the childbirth aspect, I recommend doing a little research. I was a little scared too but had a perfectly fine unmedicated birth with a midwife. I feel like everyone wants to tell the horror stories, and that’s all that’s depicted on TV. When you’re informed and know your options, it makes that whole ordeal a lot more empowering.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536085326, "distinguished": null, "edited": false, "id": "e5e0xdl", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e0xdl/", "retrieved_on": 1536085328, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "hammyprice", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_da103", "banned_at_utc": null, "body": "I was a weird mix of you and your SO, loved kids when I was younger but was very against having my own. Until it was very clear that my own SO wanted kids badly. We have a 3 yr old girl and she’s the best decision I’ve ever made. She will be an only child... so that was my compromise. We’re very happy and I’m glad I stayed open to to idea of kids after swearing in my younger years I wouldn’t. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536085340, "distinguished": null, "edited": false, "id": "e5e0xwv", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e0xwv/", "retrieved_on": 1536085341, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "inclinedtothelie", "author_flair_background_color": "", "author_flair_css_class": "purple", "author_flair_richtext": [], "author_flair_template_id": "3a82f61e-4c22-11e1-855e-12313d2c1af1", "author_flair_text": "Evil Genius, Age 11, F", "author_flair_text_color": "dark", "author_flair_type": "text", "author_fullname": "t2_51fft", "banned_at_utc": null, "body": "Hi, \n\nBackground: I had my daughter when I was 19. She just turned 11. \n\nI love my daughter very much, but if I had to make the decision over again, I would not have a child. This is not because she is not a wonderful kid, it's just more difficult than I ever thought, far more expensive, and entirely draining. Every moment centers around my child. Can I make plans? Can I stay up late? From what I have for dinner to what I wear centers around my child. \n\nI decided I would not have more children a few years ago, and my husband (we got married 2 years ago) agrees that is the best decision. If we decide we want more children in the future, we will adopt or foster. Is this an option for you? You could try to get a child in the age range that you prefer. It is very difficult to find placement in the foster care system for older children, so you could be making a huge difference in a child's life as well. \n\nI highly recommend sitting down and having this conversation with your SO before you get engaged. Talk to him about your extreme aversion to children. Be blunt. See where he stands. It is not fair to either of you to move forward with different expectations of what a marriage will involve. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536085686, "distinguished": null, "edited": false, "id": "e5e1bni", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e1bni/", "retrieved_on": 1536085687, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "thesongbirdy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_4g90o", "banned_at_utc": null, "body": "I was on the fence, as well. One night, we figured out how old we would be when our first kid (if we had one) would leave the house, and we decided we might as well try and see what happened. I didn't think I'd love any creature as much as I loved my dogs, either. \n\nPregnancy wasn't terrible. C-section was fine. Postpartum was tough, just because your body goes through so much change (nursing was hard for me and I took it personally).\n\nI'm not going to lie, the first 3 months were tough for me. I didn't love my son right away. I don't think I really started loving him until the 3-4 month mark. I changed a lot in that time and so did my husband, both for the better. We've become better communicators, both with our son and other adults. \n\nMy son is 2.5 now. I still love my dogs very much. They are a part of my family and will always be. But my capacity for loving increased as my love for my son grew. Come to think of it, I think I love my husband even more now than I did when we were married.\n\nBudgets can fly out the window if you're not careful, even with a healthy child. Nowadays, we try to be as minimal as possible when it comes to buying anything.  It is good for our pocketbook, and I think it might be good for our son, too. When he gets a new toy, we pick out 1-2 to give away. We rarely get overwhelmed with stuff anymore.\n\nI worry sometimes about the world that I've brought my son into. But my hope is that I can raise him into being a human being that will change the world around him for the better in whatever ways he chooses. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536085868, "distinguished": null, "edited": false, "id": "e5e1j1a", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e1j1a/", "retrieved_on": 1536085869, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": "dark", "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536086254, "distinguished": null, "edited": false, "id": "e5e1yo0", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e1yo0/", "retrieved_on": 1536086256, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "tba85", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_7hi1k", "banned_at_utc": null, "body": "Have an open and honest discussion with your SO. Don't sugar coat your feelings and let him share his. You can ask for advice or try to relate to someone who has had similar feelings, but you won't know how you'll feel having a child until you do it. You also won't know if you'll regret now doing it until it's too late. I would also suggest you talk to a professional. You're teetering on doing something you might not want 100% for someone you love. You might be considering having a child because you love him and know that's what he wants. Would he pass on having children because he knows you don't want any? Are either of you prepared to bend that much for the other? Is it fair to either one of you to bend? Whatever you decide, you need to make sure you're emotional ready to stand by that decision. Good luck sweetie! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536086667, "distinguished": null, "edited": false, "id": "e5e2fn6", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e2fn6/", "retrieved_on": 1536086668, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "dinorawro", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_4pekv4", "banned_at_utc": null, "body": "&gt; I hate the idea of giving up my life as I know it  \n&gt; I can't help but constantly think about the expectation to have children \n&gt; What if, because I love my SO, I decide to have children and I regret it?\n\nOut of everything you've said, these three things stand out to me as flags you should really consider. \n\nHaving a child changes your life, for some more than others, but changes your life nevertheless. Things will never be \"the same\" once you add a child, regardless if they are younger or older. You have to think about someone other than yourself, for the rest of your life, and be okay with that. \n\nAlso, I'm a firm believer that no one should have a child to make someone else happy. If the only reason you have a child is to make your partner happy, there is a high chance that you will regret having that child and resent your partner for it. And then everyone is miserable -  you, your partner, and the child. \n\nI think you need to really be honest with yourself about your feelings toward becoming a parent and maybe even talk with a professional about it. Examine why you feel like there is this big pressure and expectation on you to have kids (is he putting this on you?), how you feel about it, and how you want to react. And then tell your partner those thoughts and feelings and work together to see if you can both live with whatever conclusion you've come to. \n\nBest of luck to you. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536086766, "distinguished": null, "edited": false, "id": "e5e2jm2", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e2jm2/", "retrieved_on": 1536086767, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "NewWestM", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_eljv1ys", "banned_at_utc": null, "body": "I have never wanted kids, I'm not a baby person, and I was really upset when I found out my SO wanted kids when we were early in our relationship. I knew he was the one I wanted to marry though and had to make a decision on whether to carry on in this relationship or break it off, since it wouldn't be fair to him to stay together especially since he was getting older. I knew having a child for him was a bad idea, that I would need to want it myself, otherwise I'd regret it and resent him and life would be miserable eventually. So I embarked on a journey (not to sound too corny) to really dig into what I wanted in life, what my core values were, what my calling was. I saw a counsellor, I took on a variety of new volunteer opportunities, and I journaled a lot. I came round to adopting first, but SO was pretty against it, he wanted his own biological child. So I rolled my eyes and went back to the drawing board. I had some good conversations with women in my field who told me their children were the best thing, and there was one who told me to just get over it, they weren't going to ruin my life. That actually helped me get over the final hump. That and my sense of competition -- watching SO's friends have babies and figure out how to parent and decide on schools, etc, made me want to do it too so I could do it better, lol. \n\nSo here I am now, with a 2 month old, and no regrets. I also believe I would have zero regrets if I'd chosen a childless path. That said, from the moment I found out I was pregnant I found my career ambition levels had dropped. I'm not sure how that will play out in the long run. \n\nAlso, when a friend asked me at 8 months pregnant what part of parenthood I was looking forward to most, I said, When they're 18 and moving out of the house. I'm still looking forward to that, but I'm enjoying my infant so much more than I thought I would and finding myself looking forward to all of the next 18 years. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536087942, "distinguished": null, "edited": false, "id": "e5e3v38", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e3v38/", "retrieved_on": 1536087943, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "NewWestM", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_eljv1ys", "banned_at_utc": null, "body": "Totally agree with your last observation there!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536088258, "distinguished": null, "edited": false, "id": "e5e47wf", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e0ab5", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e47wf/", "retrieved_on": 1536088259, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "aerodynamicvomit", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_14xk21", "banned_at_utc": null, "body": "Hi! For most of my life I thought kids-eww. Didn't want any. Eventually met my now husband and realized part of my aversion was previous partners... I didn't want their children. Husband? I'd have his spawn. So that flipped one switch.\n\nI, too, preferred animals. Even worked in animal hospitals. Compared human babies to puppies, etc.. one thing that actually flipped another switch for me was watching my goat doe teaching her kids how to goat. I had a legit sky opening above epiphany, like this is why people have kids!\n\nAnother switch flipped just with age. I turned thirty and realized I was on a timeframe. If I couldn't have kids because my junk was broken that'd be one thing, but I couldn't just \"time out\" because I got caught up with work and life.\n\nI have always felt like I could do older children/adolescents but would struggle in the baby phase due to lack of logic, rational thought etc.. I have nearly 4 month old and I gotta say, my fears were unfounded. How do you even play with a potato? Turns out you just do random crap until they smile then you repeat that thing until something else makes them smile, repeat. Like lately, all I have to do is wiggle her feet and Bam, baby smiles. And you'll do anything for a damn baby smile. I was also worried I wouldn't bond, because wtf do I have in common with a newborn baby? But it just happens. There's a lot of complex hormone and biological stuff going on that really supports the whole process. \n\nAlso there's a lot of stuff you don't need, a lot of money that doesn't need to be spent. Big baby, like big wedding, like big pharma - there's a lot of advertising and hype. \n\nIf you want to talk let me know. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536088628, "distinguished": null, "edited": false, "id": "e5e4mql", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e4mql/", "retrieved_on": 1536088629, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "portugobo", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_b0ijf", "banned_at_utc": null, "body": "I was very much like you a few years ago. I wasn’t interested in babies, I’m pretty unemotional and definitely not maternal at all. But I’ve been with my husband a long time and gradually, we both grew to decide we should have children. I knew that when I was middle aged, I wanted to have children and to have them, I had to have a baby around this age. I hope that makes some kind of sense - I’m trying to say I didn’t necessarily want a ‘baby’. Pregnant was a breeze but the birth was awful and I had some kind of hormonal/mental breakdown after birth or postnatal depression or whatever you want to call it. It was truly the hardest, most awful time of my life and I was convinced I had made a terrible decision and be one of those mothers you hear about who abandon their families. \n\nBut I was lucky and it lifted naturally at 4 months pp when I got my first period (I do not react well to hormones man). And now, the bond with my son is everything you are told having a child is. I love him an indescribable amount and would suffer through the bad parts ten times over to have him. Anyway I’m massively rambling but the point is, just really sit down and think about what you want. Not just now but when you’re older. It’s an unfortunate fact of womanhood that we have such a short space of time to make huge decisions due to our biology. \n\nAlso a final note: if you search on other parenting subs, there are stories of true regret at having children but I’d say they are fairly rare? It’s very common to regret the decision in the first year or so because it is hard flipping work! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536088861, "distinguished": null, "edited": false, "id": "e5e4wff", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e4wff/", "retrieved_on": 1536088862, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "DumpTruckTaco", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_zy3hsti", "banned_at_utc": null, "body": "I was the same. Husband went baby crazy. Told him only if he took leave and I went back to work. Had my kid, he stayed home for a few months. she's great. \n\nI have a lot of fun with her And the spouse Really bonded with her so they get on well. \n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536089048, "distinguished": null, "edited": false, "id": "e5e544v", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e544v/", "retrieved_on": 1536089048, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ShelIsOverTheMoon", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_wa9sf", "banned_at_utc": null, "body": "I always wanted children. Plural. At one time, I wanted 4 of them. I had my first 2 years ago, and my husband and I are discussing a second one, but. \n\nIt's turned out to be way harder than I thought. I have very little free time for myself. I get overwhelmed, stressed, anxious, and angry.\n\nIt's more work than I have ever done in my life. More than writing my thesis, more than any job I've ever had, more work than anything I'd ever experienced. I'm tired all. the. time. I don't know how to relax anymore. My mom brain has a background process that is always listening for and worrying about my son. So I don't sleep as deeply, I'm never worry-free, I can't let go of my stress. On top of these negative feelings is the guilt for even having them in the first place.\n\nI am fundamentally changed forever. It's profound, and it's probably honorable, but it's also boring (as in, I'm often bored with the tasks of motherhood, and also a boring person to everyone else because it's all I do now), and tiring.\n\nIt's worth it to ME, because I adore children in general, and my son adores me. He's like, the president of my fan club. And I'm his biggest fan too. I love my son, I'm finally coming to terms with motherhood and what it means for my life and my identity and my relationship. I'm finally having fun. But it took almost 3 years to get here (I'm including pregnancy because mine was healthy but unpleasant).", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536089421, "distinguished": null, "edited": false, "id": "e5e5js1", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e5js1/", "retrieved_on": 1536089422, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "vicklelikespickles", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_z8fyul2", "banned_at_utc": null, "body": "I think it's common to look at other people's kids and think \"eh, not for me\". I know my mom never liked other people's kids either. She was surprised how much she loved her own though. Similarly I didn't want kids growing up. I just couldn't see myself taking care of someone else. Well, one day I find out I'm pregnant and I tell my husband... I knew I couldn't go through with an abortion, I didn't see that as an option (not because I'm against abortion but it just wasn't something I could see myself going through with). But this was very unexpected pregnancy because I was on BC. \n\nI just let things happen, I think because I was in such shock of my pregnancy. I didnt have a strong connection with my son while I was pregnant either. I saw how other mommies rubbed their bellies and talked to them. How there were posts all over Facebook about how they couldn't wait to see their baby. I didn't feel any of that. I guess because I still, to the very last day of my pregnancy, couldn't imagine having a kid of my own. Well anyway, of course I fell in love with him after giving birth! He's the most important person in the world to me. I'm not gonna get all mushy now but definitely I've changed my perspective lol. Motherhood is crazy! ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536089956, "distinguished": null, "edited": false, "id": "e5e65r1", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e65r1/", "retrieved_on": 1536089957, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "WinningAlwaysWinning", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_18535ibe", "banned_at_utc": null, "body": "&gt;If your husband is the kind of person that makes a stink face and says \"I couldn't love them the same,\" then that's not a guy I would want to have kids with anyway.\n\nIn fairness to him, this is hardly an unusual attitude. Even as someone who wants to adopt/foster on principle, I accept the great majority of people prefer biological children to adoption. I'm not sure it's reasonable to scorn people for a strong biological instinct.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536090502, "distinguished": null, "edited": false, "id": "e5e6sm3", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dszvb", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e6sm3/", "retrieved_on": 1536090503, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cactusjunejudy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_13mgz9", "banned_at_utc": null, "body": "My husband always wanted kids. I was indifferent but took the plunge once we felt we were old enough and money was stable enough. It’s cliche but it’s the best thing that ever happened to me. Babies are hard, toddlers are hard in a different way, but for me there is so much love and joy, it outweighs the difficult parts.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536090957, "distinguished": null, "edited": false, "id": "e5e7bp3", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e7bp3/", "retrieved_on": 1536090959, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Elcamina", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_ai102", "banned_at_utc": null, "body": "It is true that having your own kids doesn’t mean you will start enjoying other people’s kids, your own kids are a part of you and you are biologically wired to love them, but other people’s kids can still be annoying, gross and sometimes they smell bad. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536091275, "distinguished": null, "edited": false, "id": "e5e7oud", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dpz2o", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e7oud/", "retrieved_on": 1536091275, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MariahNicole1216", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1iz46z6u", "banned_at_utc": null, "body": "That last part really makes sense to me. I'm not sure if I could picture my 60 year old life without children...", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536091349, "distinguished": null, "edited": false, "id": "e5e7rvd", "is_submitter": true, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dypo2", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e7rvd/", "retrieved_on": 1536091350, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cucumbermoon", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_13scvm", "banned_at_utc": null, "body": "That's what did it for me. I've never cared for babies, but I love having a family, and I realized that if I didn't have children, eventually I wouldn't really have a family anymore.\n\nAnd just to add, since you mentioned the instant love thing, I did not feel any love for my son when he was first born. It scared me, how little I felt for him at first. But he was a stranger, and I was healing from childbirth, and newborns are weird, alien potato-people. The love grew slowly. Now he's eight months old and I've never felt so passionately in love with anyone.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536091983, "distinguished": null, "edited": false, "id": "e5e8i4s", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e7rvd", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e8i4s/", "retrieved_on": 1536091984, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Elcamina", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_ai102", "banned_at_utc": null, "body": "The desire to have kids can come out of nowhere, I never really wanted to have children before my sister in law got pregnant and suddenly I felt like “maybe we should have a kid too” and have not regretted it for a second. Before that I didn’t really have any wrong feelings one way or the other and always felt uncomfortable around other people’s babies (still do but less). Handling your own child is very different and you get to control the situation and your motherly instincts take over very quickly. The benefit of having your own child is you get to be reminded of yourself as a child, and experience so many new things, it’s an adventure for sure. The one thing no one warned me about though was how much anxiety an older child can bring out in you as they start doing more things on their own (first days at school, first sleepovers with friends, going away with grandparents to the cottage for a week). I try to keep it reeled in but I miss them and worry about them when they are out of my reach. Being a parent is hard but also very enjoyable.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536092458, "distinguished": null, "edited": false, "id": "e5e91ha", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e91ha/", "retrieved_on": 1536092459, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cucumbermoon", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_13scvm", "banned_at_utc": null, "body": "Same here; no instant rush of love. Very little love for the first month or so. But now, eight months in? Wow! So much insane love.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536092481, "distinguished": null, "edited": false, "id": "e5e92fk", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dzdn4", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e92fk/", "retrieved_on": 1536092481, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Elcamina", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_ai102", "banned_at_utc": null, "body": "My mom likes to remind me of how I used to always tell her how much I hated babies and she never thought she would get to be a grandma, now she has two granddaughters. Not liking other people kids means nothing in regards to how you will feel about your own kids. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536092644, "distinguished": null, "edited": false, "id": "e5e9976", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e9976/", "retrieved_on": 1536092645, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cucumbermoon", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_13scvm", "banned_at_utc": null, "body": "&gt; And you'll do anything for a damn baby smile\n\nOh my God, I am such a smile junky. I don't think I've ever felt more alive than when I get a hit of that sweet baby smile.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536092799, "distinguished": null, "edited": false, "id": "e5e9fm7", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e4mql", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e9fm7/", "retrieved_on": 1536092801, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "MsScienceTeacher", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1499p1oj", "banned_at_utc": null, "body": "I wish more people talked about this.  When I didn't feel it right away, I felt defective.  My DH really helped by taking about it growing for him,  then I was finally able to talk about it. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536092869, "distinguished": null, "edited": false, "id": "e5e9ikq", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e92fk", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e9ikq/", "retrieved_on": 1536092870, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "epiceyeroll", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_g8z9y", "banned_at_utc": null, "body": "If anything, I think I love our dog even more since having a kid =P.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536092971, "distinguished": null, "edited": false, "id": "e5e9mru", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dowv4", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e9mru/", "retrieved_on": 1536092973, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "cucumbermoon", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_13scvm", "banned_at_utc": null, "body": "Yes, me too. I make a point to say that I didn't love my son right away whenever it comes up because I wish I had heard someone - anyone - say that before I experienced it. I would have felt so much less anxiety about it if I'd known how common it is.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536093016, "distinguished": null, "edited": false, "id": "e5e9omh", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e9ikq", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5e9omh/", "retrieved_on": 1536093017, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": "dark", "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536094427, "distinguished": null, "edited": false, "id": "e5ebar9", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ebar9/", "retrieved_on": 1536094428, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "BabySloth4", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1nauwcfh", "banned_at_utc": null, "body": "I always thought I wanted kids. Then I got into my early to mid 20s and didn’t want them. I wanted to travel and do whatever. I also didn’t want to bring a child into this crazy world. I started dating my husband and he wanted kids. I wasn’t set on it yet. Then as we got more serious I realized I did want children with my husband. I knew he’d be a good father and I felt it was the right next step. Last October we decided to let things happen. I figured it’d take a while. Nope. Got pregnant right away. I was worried about our lives changing, but I was so excited!! We had our son 6 weeks ago. Life is hard and different, but I wouldn’t change it. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536096036, "distinguished": null, "edited": false, "id": "e5ed38u", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ed38u/", "retrieved_on": 1536096038, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "ljuvlig", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_3yqno", "banned_at_utc": null, "body": "I think people tend to be really black and white when it comes to children. Like you either have to think it’s the most amazing thing ever or it is a choice you will regret for the rest of your life. But like most things, it’s shades of gray. Most people do end up with an overwhelming love for their children. And most people also have those days where they regret it. It’s just probably the second isn’t spoken about as much. \n\nHaving kids is hard. There’s no two ways about it. It’s without a doubt the hardest thing I’ve ever done.  There are times when I am so so tired and just long for a moment to myself. And I think about how before I had kids I had so much time to obsess about myself (in good and bad ways). So I do have moments of regret or what-if but I would never change my choice. It’s hard but deepening in all the right ways. \n\nClaire Wineland said “Life isn't just about being happy... It's about what you're making of your life and whether you can find a deep pride in who you are and what you've given.” That’s parenting to me. Not every moment is happier. But every moment is more meaningful. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536096888, "distinguished": null, "edited": false, "id": "e5ee0w4", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ee0w4/", "retrieved_on": 1536096890, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Midnight_Clover", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1zxv7evf", "banned_at_utc": null, "body": "I also did not feel that instant love with my son. I did not cry when I first saw him. My husband did. I felt like a cold hearted bitch but I wanted nothing to do with him when he was first born. My husband did everything the first week of his life. Then it was my turn to take care him. I literally cried all day the first time I had to take care him myself. The second day I was better and then the third day something clicked. Now 10 months later, I love son more than I ever thought was possible. He is my reason for living and I love being a mom. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536101886, "distinguished": null, "edited": false, "id": "e5ej9cl", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dzdn4", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ej9cl/", "retrieved_on": 1536101887, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Pethoarder4life", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_wlyq1", "banned_at_utc": null, "body": "Stories from the things I've experienced:\n\nI adore my kid. I really do. I am very glad she exists. That being said, I regret every part of getting pregnant and having a baby. I wish I would have never decided to just see what happens and have one. It was a horrifying experience. Lots of things went wrong with the pregnancy and she had a ton of issues as a baby. She's a very wonderful toddler now, but it will take her years to recover from what happened, if she ever fully recovers. You have no idea what kind of kid you are going to have, so I would highly advise not getting pregnant unless you are very prepared for having something you did not expect. No amount of love for my child will make up for what was lost those few years. I will probably never be as successful as I would have been professionally and I've had to get through some intense things to cope with this. \n\nI have known many couples who separated amicably because one side not want the same big life things. It was hard, but in the long run they were all happy with their choices. The ones who wanted kids have them with partners who want kids and Visa versa. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536102804, "distinguished": null, "edited": false, "id": "e5ek6ep", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ek6ep/", "retrieved_on": 1536102805, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Masqueraver", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_6a56y", "banned_at_utc": null, "body": "I didn't say it was an unusual attitude, I said that I wouldn't want to have children with anyone who thinks this way. \n\nAlso, I don't think there is actually any scientific evidence that humans have a biological instinct to breed. We just assume there must be one because the societal pressure is so strong. IMO there is societal pressure to do a lot of things I don't necessarily agree with doing.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536102850, "distinguished": null, "edited": false, "id": "e5ek803", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e6sm3", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ek803/", "retrieved_on": 1536102850, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "dstam", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_721xo", "banned_at_utc": null, "body": "I haaaated kids when I was younger and I honestly still don’t like them much, I’m 37. I always said my parents would have to rely on my sisters for grandkids and I’d never have them and blah blah. It wasn’t until I met my (now) husband that I even remotely considered it. \n\nI’m now Mom of 3 and I do really like it. Way more than I thought I would. For sure there’s times I wanna get in the car and drive the heck out of here, but those thoughts are fleeting. I’ve tried the stay-at-home thing and that’s definitely not for me! But working and spending quality time with my kids is very rewarding. \n\nIt’s a huge decision. No amount of hanging with other people’s kids will help. I love my kids but generally feel awkward around other kids. \n\nChild birth was great in my opinion, I did three drug/intervention free but I took a 12 week course for that 😂 I also loved breastfeeding once I learned how and that was great for bonding. I can’t tell you you’ll love it. But you’ll probably get fulfillment from it. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536102969, "distinguished": null, "edited": false, "id": "e5ekc5e", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ekc5e/", "retrieved_on": 1536102970, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "wonderskillz5559", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1n22e92a", "banned_at_utc": null, "body": "I wasn’t sure if I wanted kids ever... I just wanted to ride and compete horses. I never thought I’d love anything as much as I loved my horses. Then got pregnant via “vacation sex”(the first time ever without contraception) and was SHOCKED. I  had a miscarriage at almost 12weeks, and was amazed at the emotions, the pain of losing someone I didn’t even know. I committed to making that spring/summer my  most epic, intense, and fearless competition season ever. I wasted a major “last hurrah for a while”. I’ll cherish that season and those memories for ever and ever. In fact the only thing I cherish more is my now almost 2yr old daughter❤️", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536104713, "distinguished": null, "edited": false, "id": "e5em1lb", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5em1lb/", "retrieved_on": 1536104714, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "EatYourCheckers", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_oe9vg", "banned_at_utc": null, "body": "&gt; and I still love my dog\n\nThis is wonderful. \n\nMy experience was a little different. Baby #1, dog definitely got demoted to dog. But baby #3 loved dog so much, and she loved him so much, that I loved them both the more for it. I am so sorry that she passed away when he is a toddler and won't remember her, because he was truly obsessed with her and she truly watched over him. Maybe she still does!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536106068, "distinguished": null, "edited": false, "id": "e5endj9", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dowv4", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5endj9/", "retrieved_on": 1536106069, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "fox__in_socks", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_15omcyym", "banned_at_utc": null, "body": "Yup, this ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536106703, "distinguished": null, "edited": false, "id": "e5enzpn", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dxnef", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5enzpn/", "retrieved_on": 1536106705, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "EmotionalFix", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_dl24ivr", "banned_at_utc": null, "body": "I have always wanted to be a mom and I love being a mom so far. However, my husband has not always wanted to be a dad. We got together in college and for a long time he didn’t know if he wanted kids ever and certainly said he didn’t want them before he was 30. However the more time he spent with our nephew and niece the more open to fatherhood he became. We just had our first 3 weeks ago and my husband was actually more excited than me for little ones arrival. You could end up like him. Or you could always foster/adopt older kids. There is a high need for parents to adopt older kids and that could be a great way for you and your SO to have kids without you having to give birth. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536108140, "distinguished": null, "edited": false, "id": "e5epea2", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5epea2/", "retrieved_on": 1536108141, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Nashdpotatoes", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_mpjgx", "banned_at_utc": null, "body": "I wish I could upvote this more.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536109311, "distinguished": null, "edited": false, "id": "e5eqk1m", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5dxnef", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5eqk1m/", "retrieved_on": 1536109312, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "fauxfauxfaux22", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_ludkz", "banned_at_utc": null, "body": "&gt;Also, I don't think there is actually any scientific evidence that humans have a biological instinct to breed.\n\nAs a biologist, I disagree. All species (including humans) have been molded into breeders by natural selection. \n\n", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536109421, "distinguished": null, "edited": false, "id": "e5eqnzx", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5ek803", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5eqnzx/", "retrieved_on": 1536109422, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "tolstoy2tinkerbelle1", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_23yf07ha", "banned_at_utc": null, "body": "I'm gonna chime in here from a slightly different direction, because you were curious about regret. I always thought I wanted to be a mom, with a big family, and the kind of house where all the neighbor kids come and go all the time. I had my daughter at 22, and NOPE. One and done. Turns out, I highly value alone time and independence and the freedom to pick up and go from time to time. I don't actually regret it, though. This kid lights up my life and I adore her. If I'd known myself better then, I would have made a different decision, but I'm not sure I *would* know that about myself unless I'd had a child. I'm a very nurturing person by nature, and kids tend to really like me and I like them (my favorites are 4 year olds, the most amazing stuff comes out their mouths). Parenting has been tough for me, the last 12 years, but it's brought me a ton of personal growth and self knowledge I'm not sure I'd have otherwise (not to mention my delightful kiddo, who just keeps getting snarkier and more sarcastic and sardonic as adolescence approaches, and I am so here for it, she cracks me up). I sometimes wish I'd taken more time to make the decision, or I resent the emotional labor of parenthood, but I don't resent my kid and don't really regret it, either. It is what it is. I'm just happy we live in a time and place where it IS a choice.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536112106, "distinguished": null, "edited": false, "id": "e5etd07", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5etd07/", "retrieved_on": 1536112108, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "[deleted]", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": "dark", "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536114916, "distinguished": null, "edited": false, "id": "e5ew3ys", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t3_9cwgpa", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5ew3ys/", "retrieved_on": 1536114916, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Masqueraver", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_6a56y", "banned_at_utc": null, "body": "Isn't that really an oversimplification of natural selection? My understanding is that differential reproductive success is not a directive, just a descriptor for a causal mechanism of evolution. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536126417, "distinguished": null, "edited": false, "id": "e5f5etn", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5eqnzx", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5f5etn/", "retrieved_on": 1536126419, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "LKanarienvogel", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_14vpjx9e", "banned_at_utc": null, "body": "well, we do have an instinct to breed. sex is an instinct and leads to more humans. it's just we modern societies have separated sex and procreation. thus, I agree with you. there is no instinct to have babies as such since that was never needed in any other age before.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536148587, "distinguished": null, "edited": false, "id": "e5fgptu", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5ek803", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5fgptu/", "retrieved_on": 1536148589, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "seraphin22", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_g8r9p", "banned_at_utc": null, "body": "Yeah the husband is allowed to feel and have his own feelings without being scorned for it. It isn't like buying a puppy, this is a big life matter. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536153648, "distinguished": null, "edited": false, "id": "e5fkvqc", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5e6sm3", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5fkvqc/", "retrieved_on": 1536153649, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "uniqueeleni", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_28cz4dp", "banned_at_utc": null, "body": "Every animal (including humans) has two main goals: \n\n1. Survive for as long as possible\n2. Breed as much as possible \n\nThis is like biology 101.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536860046, "distinguished": null, "edited": false, "id": "e5x07de", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5ek803", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5x07de/", "retrieved_on": 1536860047, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}, {"approved_at_utc": null, "author": "Masqueraver", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_6a56y", "banned_at_utc": null, "body": "If that were true, homosexuality would not exist. But it does, in hundreds of species. It's not as cut and dried an issue as people seem to think. I would challenge anyone to come up with some hard scientific studies that prove that anything like natural selection/evolution is an impetus and not a descriptive mechanism. Most discussions of the topic are editorial at best. ", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1536880415, "distinguished": null, "edited": false, "id": "e5xnrow", "is_submitter": false, "link_id": "t3_9cwgpa", "no_follow": true, "parent_id": "t1_e5x07de", "permalink": "/r/Mommit/comments/9cwgpa/to_have_or_not_to_have/e5xnrow/", "retrieved_on": 1536880416, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3"}]}