{"submission": {"all_awardings": [], "allow_live_comments": false, "author": "BushwickOrange", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_47psj5ux", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1563877769, "domain": "self.Mommit", "full_link": "https://www.reddit.com/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/", "gildings": {}, "id": "cgqvmt", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 59, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/", "pinned": false, "pwls": 6, "retrieved_on": 1563877769, "score": 74, "selftext": "New here...\n\nSoon to be first time mom, baby due in November,  I will also be turning 39 shortly before his birth. I just found out that my MIL and my husband's godmother will be paying for/hosting my baby shower. To which I am super thankful! \n\nI don't have a ton of girlfriends, and my closest family lives many states away and with the exception of my sister, no one has been jumping to offer to help plan anything. My family is small and doesn't family well.\n\nI should also prefice this post by stating I suffer from Anxiety and have being taking meds to help manage my anxiety for several years now. Pretty sure the anxiety problems run in the family. (Fun times)\n\nDue to a thyroid problem, I truly didn't think that i would be in the position I currently find myself. While I am not at all unhappy with the situation and have been having a relatively easy pregnancy, I know that I don't like being the center of attention, I also struggle with the idea of people/friends/family (which I have to invite to this shower) buying expensive things for my little growing family because I had sex with husband.\n\nI know, I know,... and have been told from everyone that I'm looking at the situation the wrong way. \n\n\nI guess what I'm asking is there another way to look at this, a perspective that my irrational brain can come to that will allow me to be less anxious, and not so judgemental towards my very sweet/only wants to be helpful MIL?\n\nI also understand  that we can't afford to buy everything on our own. So the fact that husband's family is being generous doesn't go unnoticed. So the phrase \"it takes a village\" is understandable.\n\nMy rational brain can understand that we can't afford all these things that a baby needs, but part of my older more stubborn self is also like why do we need all this stuff. I want to listen to the wisdom for been there, done that mom's because I don't know what I'm doing. But the irrational part of my brain says well you'll figure it out on your own the way you have the whole of your life. Like somehow since I made it this far on my own I can do this first time motherhood business on my own too. Not once until this moment has my rational brain even thought \"why would you even want to do this on your own?\" Like I don't have a choice? (Silly brain)\n\nWhy can't I truly believe and understand that this sweet little baby deserves all the nice things and all the love I feel like I never got? I don't want my little boy to miss out on the love and caring friends and family we have in our lives because I didn't have the greatest upbringing. I know that currently I'm allowing my anxiety to make irrational decisions/ formulate thoughts for me and the baby, and that aren't fair. \n\nI'm sure I'm working through somethings that needs some professional talk therapy. But suggestions or advise is always welcome.\n\nAlso what advise can you give about inviting close friends that live out of state. \n\nIn the age of social media and sharing it's hard to know who is really happy for you that you're having a baby...like how much are they willing to participate, and should I even assume that they would want to.\n\n\nHoping to figure this out before September 😬.\n\nThanks a bunch!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "subreddit_subscribers": 77691, "subreddit_type": "public", "thumbnail": "self", "title": "Struggling with the idea of the Baby Shower.", "total_awards_received": 0, "updated_utc": 1563964146, "url": "https://www.reddit.com/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/", "whitelist_status": "all_ads", "wls": 6}, "comments": [{"all_awardings": [], "approved_at_utc": null, "author": "STPFB", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_3594216r", "author_patreon_flair": false, "banned_at_utc": null, "body": "I don’t have super specific advice, but I can tell you that people love babies. Pretty much everyone goes nuts for them. I didn’t really realise this before having my own and was so surprised by how excited my grumpy uncles, great aunts I haven’t met in years, the receptionist at work, my clients and their parents, people from high school and random people in the grocery store have been. I absolutely wouldn’t worry about people not being genuinely happy for you (ESPECIALLY people who have their own kids. After having a baby I am so overjoyed when people are expecting/have a little one. It’s ridiculous). People also care more about you than you realise. You are already very loved if people want to throw you a shower. \n\nWith that being said - you don’t HAVE to have a shower. I specifically asked for a very small one - less than 10 people, and it didn’t mean we went bankrupt. If you’re truly not comfortable with it you could suggest a small party, a celebratory brunch or even skip it. Babies actually don’t need all the stuff that you’re told they do (I find american culture especially crazy with the baby stuff). Newborns are so little and do basically nothing. They need a place to sleep (which can even be your bed), clothes and diapers. The biggest expense for us was a pram. Maybe formula and bottles if you choose to go that route. They can be bathed in the sink and changed on a pad on whatever surface. My kid is 9 months and all his stuff fits in three drawers and a toy basket and he is very loved still. We don’t have a diaper pail, changing table, tummy time/play mat, specific feeding stuff, we skipped the bassinet etc. People will also still bring you gifts when baby is born. If it’s truly only the stuff you’re worried about then don’t be. \n\nWith that being said - it is so nice to have your village. I recommend that you embrace it, even if you opt not to have a shower. Your baby will be loved by so many people if you allow them and that is honestly the best thing you can do.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563879211, "distinguished": null, "edited": false, "gildings": {}, "id": "eujvmqd", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eujvmqd/", "retrieved_on": 1563879221, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Meowmyy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_31ttn78r", "author_patreon_flair": false, "banned_at_utc": null, "body": "I also hated the idea of baby shower and opted for a sip and see - people come and \"sip\" whatever beverage and \"see\" the baby! Some people do both but I did just the sip and see - I liked that it took the focus off of me and put it onto the baby (which let's be real people care more about in this situation) it also saved me from having random unwanted visitors when coming home from the hospital because there was already a designated time for people to come see the baby! \n\nPeople all told me before that I wouldn't receive as much from people (I didn't care), but this was not the case I think I received the perfect amount and I actually received actual baby items that we needed (we didn't have to buy any of the big items like crib, bassinet, stroller, etc) Many people bought actual baby items before the baby was born and sent them or gifted them when we saw them and then bought the \"fun\" baby stuff (clothes, etc) for the sip and see! \n\nI don't know if this helps you at all but just thought I'd throw the idea out there because many moms who I told wish they had opted for this instead! You can do it however long after the baby is born that you are comfortable with and everyone will be super excited to see the baby and gift you with essentials! It also helped me with people out of town because I didn't feel bad if they came because they were able to meet the baby and not just be thrown into a room of people to awkwardly watch me open gifts!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563881229, "distinguished": null, "edited": false, "gildings": {}, "id": "euk02pq", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk02pq/", "retrieved_on": 1563881240, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "jouleheretolearn", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_mizvp", "author_patreon_flair": false, "banned_at_utc": null, "body": "If the biggest issue you have with the shower is being the center of attention, you can ask your MIL to arrange it so you don't spend the majority of it that way. Also, make it mixed company and make sure hubby is right next to you.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563881360, "distinguished": null, "edited": false, "gildings": {}, "id": "euk0egt", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk0egt/", "retrieved_on": 1563881370, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Babydarlinghoneychan", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_3dgkylu", "author_patreon_flair": false, "banned_at_utc": null, "body": "Hey I  completely understand this feeling. Also due in November. I am not looking forward to a baby shower. My MIL wants to do one, my family is a mess, and I really hate the idea of people being around me knowing and celebrating this intimate and delicate medical event that I wanted to stay private. (Have not even publicly announced our Pregnancy and though some people know now because the bump is obvious, still haven't and will never post it on social media) this was a special private moment for me. I loved how it stayed in my little world at home just me and my husband, no outside stress or opinion. Now that it's out , it's out. It's not so bad, honestly, and now that other people know I've noticed a lot of support and people going out of their way to be helpful. It's a reminder that these people care.\n\nMy compromise with my MIL (who is a doll, btw. Absolutely a light in my life) is that she is throwing a very small baby shower with 10 people where we are serving tea and my favorite easy to make foods. Gift's are not being asked for and registries are not being given (I have made ones for me and my husband for the discounts/ free baby boxes though!) If they absolutely want to give us something my MIL will ask them to give us diapers and wipes. That way we aren't overwhelmed with clothing. It's going to be very informal and be more like an intimate get together with people I am actually pleased to see than people I'm not which helps me relax as I don't feel pressured to put up a cherry disposition.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563881361, "distinguished": null, "edited": false, "gildings": {}, "id": "euk0ekj", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk0ekj/", "retrieved_on": 1563881372, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "owlbeastie", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_196jilms", "author_patreon_flair": false, "banned_at_utc": null, "body": "I like buying baby stuff for people expecting. It's not the same as an adult gift. Plus it's a good way for people who won't necessarily be around much to help with the baby to feel involved in celebrating their existence. I know I didn't get out to socialize until my bean was about 6 mo old, so the shower was more of a last time hanging out with friends and good food for awhile kind of deal.\n\nHaving a shower is actually super helpful. I would not have known about some of the products we relied the most on otherwise! We are still using up some of the things we got a year and a half later!\n\nI also hate being the center of attention so I just stipulated no party games revolving around me and had my husband show up for the gift part so he could help with the thanking people.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563881560, "distinguished": null, "edited": false, "gildings": {}, "id": "euk0tg7", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk0tg7/", "retrieved_on": 1563881571, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "ShuuString", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_22borscz", "author_patreon_flair": false, "banned_at_utc": null, "body": "Oh I was in your boat. I absolutely hate being the center of attention, it will actually send me into panic attacks. I was dreading my shower, up until the moment I walked in the door.\n\nLuckily my sister planned it, and despite being a pretty big extrovert, she worked really hard to take my feelings into consideration. She booked a private-ish room at a cafe that was separate but not closed off, so people were distracted by the hustle and bustle of the restaurant. She picked out specific games that didn't really focus on me too much (baby food tasting, a questionnaire that my husband and I filled out before hand, cards with guess the baby book by emojis lol, a couple others I can't remember right now)\nWe had lunch delivered so people were eating some of the time and drinks were available at the bar if they wanted. The only time everyone attention was solely on me was opening gifts, and even then it's mostly seeing the cute baby clothes and what other people got. I think o had a mimosa.\n\nI pretty much just had to prepare mentally every day leading up. Once I got there I kinda put on my retail face and made nice and chatted a minute or two with everyone. Opening gifts I kinda just didn't make eye contact and tried to draw the focus to the presents. Thanked the people who brought them obviously. I kept reminding myself that most of these women are just excited to see the bump more than anything. All in all it went pretty well but you can bet I was outta there and in my silent car as soon as I could be.\n\nGood luck!! Just remember most of the attention and excitement is not just for you, but the little bub as well, so you're not alone!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563881729, "distinguished": null, "edited": false, "gildings": {}, "id": "euk187o", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk187o/", "retrieved_on": 1563881740, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "feistyfoodie", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_esnwj", "author_patreon_flair": false, "banned_at_utc": null, "body": "I'm expecting our second, and my bff offered to throw me a sprinkle. The idea made me uncomfortable bc our first is not yet 2 so we have all the stuff we need ftmp already, and we don't \"need\" and don't want to seem like we're asking for presents. But she explained to me that many people like me (what? me?) and want to celebrate my baby. So that's how I'm looking at it - people choosing to celebrate my lovely second child with me, not a gift grab and not a \"look at me\" (I'm also a bit shy of being in the spotlight). People want to celebrate you and your child! It's okay to accept that. \n\nAnother commenter pointed out that people love babies and it's true. People get so excited and I didn't really understand until I had my own, how much joy I feel when close friends get pregnant. I honestly was just like... happy for people in the past, but now I'm like we're on this similar journey!! It's so fun and rewarding!!!!! It's very strange but it's true. \n\nHope you embrace and come to terms with that side. Enjoy the ride. Congratulations btw, I'm turning 39a few months after giving birth to this second nugget🤗", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563881767, "distinguished": null, "edited": false, "gildings": {}, "id": "euk1bg3", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk1bg3/", "retrieved_on": 1563881779, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "arielrecon", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_dqr1y5b", "author_patreon_flair": false, "banned_at_utc": null, "body": "It might help to think of it more as a party than as a gift giving spree. Think of some games you’d like to play, there are some hilarious ones, it might make it a bit easier to not feel like everyone is looking at you. \n\nFor my baby shower I invited male and female friends and probably half of those invited showed up. I also had my hubs there, so it didn’t feel like I was the centre of attention alone. (I feel you on not liking that feeling) and we kept it fairly short. Only 2.5 hours and it went quickly. \n\nI know it’s easier said than done, but try not to stress, you’ll either have fun, or it’ll be over before you know it. Good luck mama❤️", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563882088, "distinguished": null, "edited": false, "gildings": {}, "id": "euk1zph", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk1zph/", "retrieved_on": 1563882099, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "DooWeeWoo", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_es8eb", "author_patreon_flair": false, "banned_at_utc": null, "body": "I'm not sure how helpful this will be but I also dreaded having a baby shower. \n\nInstead we opted to do a BBQ with family and some close friends and my husband/MIL just tucked the gifts away for us to open later. No games, nothing that would have been associated with a baby shower. There's also something called a \"sip and see\" for after the baby is born. My friend did this and told me she liked it better because then instead of returning bunches of stuff, they could just outright tell people what they still needed for baby. \n\n\nPeople love babies and will continue to get baby clothes and gifts, but you are the mom and you absolutely DO NOT have to have a shower if it makes you uncomfortable. 💚", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563882094, "distinguished": null, "edited": false, "gildings": {}, "id": "euk204t", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk204t/", "retrieved_on": 1563882106, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "RitchBridge89", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_106jel", "author_patreon_flair": false, "banned_at_utc": null, "body": "For a new perspective: I was obviously pregnant at my baby shower and I had been preparing to have my baby for months, but when I opened that first tiny outfit in front of family and friends, it got real. It's like something clicked and I said \"Wow, I'm really having a baby! I'm really going to be a mom!\" It was an unexpected, but enjoyable experience and feeling to have.\n\nFor out of state invites: if they can and want to, they will. If not, they have a perfect excuse. You should invite whoever will make you happy when you see them at the door.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563882718, "distinguished": null, "edited": false, "gildings": {}, "id": "euk3fy6", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk3fy6/", "retrieved_on": 1563882728, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "mrsbebe", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_55ogjd1", "author_patreon_flair": false, "banned_at_utc": null, "body": "That’s a fantastic idea for someone who doesn’t want to be the center of attention. Then some attention is deflected to dad!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563883166, "distinguished": null, "edited": false, "gildings": {}, "id": "euk4ijp", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk0egt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk4ijp/", "retrieved_on": 1563883298, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "jouleheretolearn", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_mizvp", "author_patreon_flair": false, "banned_at_utc": null, "body": "I did it and spent time in tons of intimate small groups.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563883343, "distinguished": null, "edited": false, "gildings": {}, "id": "euk4xou", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk4ijp", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk4xou/", "retrieved_on": 1563883411, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "mrsbebe", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_55ogjd1", "author_patreon_flair": false, "banned_at_utc": null, "body": "I agree with you, babies don’t need all the fancy stuff. My daughter slept in a laundry basket with a thin pillow in the bottom for the first several months of her life. We were given a lot of hand-me-down items from my aunt and some other family members so we ended up with a lot of things that no one had to buy for us. With that said, it really does take a village. Even if you go the minimal route there are still quite a number of the expensive things that you have to have and help paying for those is very nice. I was 20 when my daughter was born. My husband was still in school and we had no money. If we hadn’t had people supporting us we would’ve been in a very bad way financially.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563883439, "distinguished": null, "edited": false, "gildings": {}, "id": "euk55id", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_eujvmqd", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk55id/", "retrieved_on": 1563883469, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "mrsbebe", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_55ogjd1", "author_patreon_flair": false, "banned_at_utc": null, "body": "Yeah I really like it. And you could make it way less formal than baby showers usually are. Make it a BBQ or something where people come and hang out. You don’t have to have the games and the designated present opening time if you don’t want to!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563883557, "distinguished": null, "edited": false, "gildings": {}, "id": "euk5f4u", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk4xou", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk5f4u/", "retrieved_on": 1563883569, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "ligyn", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_fej3v", "author_patreon_flair": false, "banned_at_utc": null, "body": "I second the idea of a mixed baby shower with my husband and other male guests. I really, really wanted one, but my request got shot down. This is a great time of year for a baby-BQ type of party rather than a traditional shower, so maybe OP will have better luck than I did.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563884178, "distinguished": null, "edited": false, "gildings": {}, "id": "euk6xug", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk0egt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk6xug/", "retrieved_on": 1563884192, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "milkmom90", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_32f9uzhl", "author_patreon_flair": false, "banned_at_utc": null, "body": "Firstly congratulations! \nI agree with previous poster, people love babies, people who never speak to you at work are liable to bring you diapers a random outfit just because. As for friends and family the aunt you only see on Christmas is probably going to want to send your something. Humans are weird. \nIf I were in your shoes, I'd do an Amazon registry (if you get nothing if the list you can take 15% of for anything you but yourself. (I believe it's the same for Target) you can also set it to allow multiple people to contribute and buy you the carseat etc. \nSome people will want to come from our of state but for those that can't this is a solid option. Plus you get to open at home rather than in front of a group. \nAs for the anxiety of the attention - I'd see if hubby would be willing to help open things and him split the focus so you don't feel so spotlighted? Don't read cards out loud - that always pumps me up anxiety wise. And maybe request that the shower is more of a brunch and less of the games and new age stuff that puts you in the center of everyone's attention. Unless you think that would relax you", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563884834, "distinguished": null, "edited": false, "gildings": {}, "id": "euk8hh5", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk8hh5/", "retrieved_on": 1563884846, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "jouleheretolearn", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_mizvp", "author_patreon_flair": false, "banned_at_utc": null, "body": "My friends who were hosting it wanted their husbands, and when I pointed out that without inviting guys it would mostly be female relatives we all barely know they jumped on the idea. We're all a bunch of gamers.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563885239, "distinguished": null, "edited": false, "gildings": {}, "id": "euk9hjj", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk6xug", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euk9hjj/", "retrieved_on": 1563885251, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "anniemg01", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_6ktu1", "author_patreon_flair": false, "banned_at_utc": null, "body": "People are definitely going to buy you gifts, so having a list of things you want would be nice for you.  So you know you would probably get things you prefer.  Also, you can put a range of things in terms of price so that people can buy whatever they feel comfortable with spending.  That might help with the expensive issue part.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563885843, "distinguished": null, "edited": false, "gildings": {}, "id": "eukazo6", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukazo6/", "retrieved_on": 1563886148, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "ezer_kenegdo", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_2iahlez8", "author_patreon_flair": false, "banned_at_utc": null, "body": "I was exactly the same way. Not a fan of being the center of attention and everyone knew how hard it took to conceive him because my husband is a very open person unfortunately,  so I made my wishes very clear. Low key tea party, and I asked for gift cards more than gifts. In the end I had to fight my mom on opening gifts there. As much as people want a thank you, no one including yourself wants to sit for an hour and gush over every onesie. You could request no wrapping paper (for the environment) and just display the gifts in a table for everyone who wants to look at them. You just need a way to make sure you thank the appropriate person for certain things. That way no one feels embarrassed for bringing something small while others go full bore as well. We decorated onesies and did other crafty things like that instead of games. It was just a nice celebration for people to come together. You can make it work.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563886202, "distinguished": null, "edited": false, "gildings": {}, "id": "eukbwck", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukbwck/", "retrieved_on": 1563886404, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "chconnors", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_2v5y3mnu", "author_patreon_flair": false, "banned_at_utc": null, "body": "I would say that, as a first time mom, I felt like I didn’t even know what I didn’t even know. That said, having a baby shower and my friends got me all of their favourite/most used items, it really helped me to sort out what I needed. In the moment you won’t realize you need something until it’s too late sometimes, and it is AWESOME when you can be like “oh yes! XXX got me that! It’s right here”.\n\nSo, if anything, have the baby shower so you can end up with items you never even thought you needed and you will feel more prepared. You can always donate any unused stuff as well after.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563886596, "distinguished": null, "edited": false, "gildings": {}, "id": "eukcxc1", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukcxc1/", "retrieved_on": 1563886691, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "[deleted]", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": "dark", "banned_at_utc": null, "body": "[removed]", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563886616, "distinguished": null, "edited": false, "gildings": {}, "id": "eukcz0e", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukcz0e/", "retrieved_on": 1563886707, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Kspud11", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_12q8b34t", "author_patreon_flair": false, "banned_at_utc": null, "body": "You and I sound very alike in both the struggle of being given gifts and the anxiety of being center of attention during the shower. Luckily my sister is also pregnant so we had a joint shower. But, more than anything, it helped that the people organizing the shower understood how I felt! We ended up doing a “display shower” so my sister and I didn’t have to awkwardly open gifts in from of every, but guests could still oooh-and-ahhh over the cute stuff. We also had activities instead of traditional games - we had fabric markers and bibs to be decorated for anyone that wanted, and wooden blocks and sharpies.  Now our babies have cute bibs and a set of blocks made by loved ones, rather than playing games. Regarding gifts -  I had a hard time creating a registry because I simply felt selfish. But, people will buy gifts no matter what so you should have some say and get stuff you need/like.  Plus, it is nothing you wouldn’t do for your friends and family.\nPS - if you google “display shower” you can get the cute wording for your invitations so guests know", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563886717, "distinguished": null, "edited": false, "gildings": {}, "id": "eukd8m5", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukd8m5/", "retrieved_on": 1563886780, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "wanderlustmom2898", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_42ysj7hi", "author_patreon_flair": false, "banned_at_utc": null, "body": "I get it, I initially hated my first shower for similar reasons, thinking about how silly the whole exercise was. But eventually I just told myself that this actually wasn't about me and was just about the baby. I think it's healthy for people to support the creation of new life and that's what a shower is, a celebration. I don't know if you're religious at all, but new life is supposed to be celebrated in all major religions. It makes sense that people without want to be invested in that new life. Plus, there's a pay it forward element to these things where you'll eventually do the same for someone else, which kind of balances things in my mind.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563886833, "distinguished": null, "edited": false, "gildings": {}, "id": "eukdiw9", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukdiw9/", "retrieved_on": 1563886865, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "akitchenwall", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_gx1qu", "author_patreon_flair": false, "banned_at_utc": null, "body": "I struggled with a lot of the same things with mine. I asked to skip games (besides door prizes) and kept the mindset that it wasn’t about me, it was about my baby and I got excited about how many people were excited to meet/love my new little guy.\n\nNow, years later, I’m SO GLAD I put myself aside and let my community rally around me.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563886895, "distinguished": null, "edited": false, "gildings": {}, "id": "eukdnuc", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukdnuc/", "retrieved_on": 1563886908, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "mai_tais_and_yahtzee", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_gmqdn", "author_patreon_flair": false, "banned_at_utc": null, "body": "You could ask your MIL to have a diaper shower, then people will just bring diapers (which you WILL need) and won't feel pressured to buy big expensive items.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563888272, "distinguished": null, "edited": false, "gildings": {}, "id": "eukh62k", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukh62k/", "retrieved_on": 1563888283, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Amraff", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_3aqyoopt", "author_patreon_flair": false, "banned_at_utc": null, "body": "Second this, you dont *have* to have a shower. My mom offered to throw one but i didnt like the idea. My mom lives in town as goes my brother &amp; his wife (but i *do not* get along with SIL), MIL &amp; SIL live 10 hours away by car. Dont have any girlfrienda except for my best friend, who is trans and wouldn't be be comfortable at a baby shower.  No work friends, no hubs friends wives, nada. So i opted for nothing over a shower that would have depressed me.\n\nThat said, even without a baby shower, people still gave us baby gifts. \n\nAlot of the \"necessities\" this days are honestly just luxuries. We didnt get a change table because we have a very large bathroom counter that fits a change pad, we didnt get a bassinet because we got a babybox instead (and didnt really use it. He preferred a laundry basket with towels in the bottom. Lol) \n\nJust remember, parents raised kids without all these crazy devices for millennia and did just fine. Wipe warmers and baby keurig are expensive and 100% optional so dont feel you arent a good parent because you dont want all the crap your *supposed* to buy", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563889220, "distinguished": null, "edited": false, "gildings": {}, "id": "eukjlpv", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_eujvmqd", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukjlpv/", "retrieved_on": 1563889232, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "AutumnMonth", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_kyrd7", "author_patreon_flair": false, "banned_at_utc": null, "body": "I also hate being the focus of attention, heck I didn't even have a wedding because of how much I hate it. At my shower I thanked everyone for coming out to celebrate my babies, I never thought of it as something for me. Hopefully that mindset will help you as well. \n\nCongratulations!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563889515, "distinguished": null, "edited": false, "gildings": {}, "id": "eukkdk2", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukkdk2/", "retrieved_on": 1563889526, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "destroyersmommy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_vaczhp7", "author_patreon_flair": false, "banned_at_utc": null, "body": "I definitely recommend the mixed baby shower! We did this for our first and it was great. I'm also very uncomfortable at events where I'm the center of attention and generally avoid it whenever possible.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563889548, "distinguished": null, "edited": false, "gildings": {}, "id": "eukkgm2", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk0egt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukkgm2/", "retrieved_on": 1563889559, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "sped-minder", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_njq0izy", "author_patreon_flair": false, "banned_at_utc": null, "body": "I remember having same experience when I was having my first kiddo. Maybe it was seeing everyone smiling at me was some weird sort of validation. Family thew me a small shower for this pregnancy (having a girl after 2 boys) and my sons got to be the center of attention (which was awesome). Still had that same surreal feeling though.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563889695, "distinguished": null, "edited": false, "gildings": {}, "id": "eukktbq", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk3fy6", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukktbq/", "retrieved_on": 1563889877, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "princessoftrash54", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_ddov8yw", "author_patreon_flair": false, "banned_at_utc": null, "body": "I also have anxiety and DID NOT want my impoverished family spending their money to throw ME a party. \n\nSo we compramised threw the party for my spawn. We made it DIY camp out themed and opened it to all genders + ages. I let my tween cousin and teen sister bring all their awkward little friends. We had Smores and tie dyed onsees. I was a whale and really jealous of the kids on my cousin's trampoline but it was a hit! I participated in no games, but I do beleive one was played. It was really more like a celebration for upcoming family growth than one for me.\n\nI cried like 1 baby shower related time (4 total) during it- but it was just a lil overstimulation and all the tweens were very understanding. They brought DIY baby wipes, it was cute", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563889759, "distinguished": null, "edited": false, "gildings": {}, "id": "eukkzr1", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukkzr1/", "retrieved_on": 1563889938, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Panic_inthelitterbox", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_2x5tgldv", "author_patreon_flair": false, "banned_at_utc": null, "body": "Do you enjoy giving gifts to people you love? It’s okay to accept gifts because people like to give them. My husband and I have more than enough income to buy everything we need for our baby, but my dad has 5 sisters, this is the first grandchild on both sides of our family, and I ended up having two showers thrown for me because of distance issues. I just gritted my teeth and made a registry. We had games that could be played individually while people chatted, and nothing that involved me being the center of attention. \n\nI got a few things that weren’t on the registry that ended up being lifesavers so far, which was great. Also, you could put some charitable donations on your registry or ask for just diapers and wipes.  Good luck!!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563890316, "distinguished": null, "edited": false, "gildings": {}, "id": "eukmfqy", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukmfqy/", "retrieved_on": 1563890401, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "LadyRikka", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_s04wd", "author_patreon_flair": false, "banned_at_utc": null, "body": "If you have trouble being the center of attention, look at it this way. The baby shower isn't for you. It's for your baby. Yeah, right now the two of you go hand in hand, but the shower is really to celebrate the baby, buy gifts for the baby, and ogle the baby. Maybe I'm a cynical person, but if you weren't still incubating the child, the baby would be getting all of the attention while you fade into the background handling dishes or trash or something. \n\nSince there are often games at baby showers, you can ask that there not be any games about you or your body, i.e. guessing your weight, how big your belly is, what you were like as a baby, etc. I love baby showers, but I started out with a heavy weight, so I really didn't want people guessing how big I was. My mom and MIL were able to find lots of games that didn't revolve around me.\n\nWhen it comes to the gifts, try to remind yourself that they're for your child. You'll be the one cleaning the bottles, changing the diapers, washing the clothes, but these items will be your child's things. Your baby is depending on you to open and sort all the gifts for them. Did I use everything I received at my shower? No. Did I love everything that was given? Of course not. But I appreciated all of the thoughts and well wishes that already existed for my baby that hadn't even come out yet.\n\nI invited out-of-town family and friends. Some family came from 6+ hours away. But I wasn't upset with anyone not showing up, and I think that they understood that. It's not like it hurts anything to invite them, so if you want to, go for it.\n\nGood luck!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563890676, "distinguished": null, "edited": false, "gildings": {}, "id": "eukndnj", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukndnj/", "retrieved_on": 1563890709, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "MackenzieByrne", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1m0m6bn3", "author_patreon_flair": false, "banned_at_utc": null, "body": "The shower should be about celebrating your growing family and the baby itself, not about you getting presents or being center of attention. People are excited that a new life is coming into this world and that’s something to celebrate. Looking back at photos and memories of the shower is fun for the kids when they get older and for them to see how celebrated they were. Makes them feel special. Put aside your worries and just enjoy yourself!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563890759, "distinguished": null, "edited": false, "gildings": {}, "id": "euknltd", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euknltd/", "retrieved_on": 1563890780, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Cecironch", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_2volvsv4", "author_patreon_flair": false, "banned_at_utc": null, "body": "It is not about you... Your baby is the center of attention\nIf they were thinking about you, they certainly would have thought about your anxiety problems and will to throw this shower\nAlso it's about them, the community, wanting to get involved in the life of, again, your baby, not yours. So sit back and let them have their party. That's what I did and I actually had a good time.\nKeep the stuff you need and sell or donate other things to moms who may also need things for their newborns and don't have a support net like yours.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563891214, "distinguished": null, "edited": false, "gildings": {}, "id": "eukorll", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukorll/", "retrieved_on": 1563891225, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "rosecrowned", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_gylx9", "author_patreon_flair": false, "banned_at_utc": null, "body": "We made our shower not of a “come have fun and hang out with us” event that was co-ed, and found it to be super chill.\nTotally worth having, imo, but understandable about the hesitation!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563891636, "distinguished": null, "edited": false, "gildings": {}, "id": "eukpvvt", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukpvvt/", "retrieved_on": 1563891647, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "DieSchadenfreude", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_5dhdg", "author_patreon_flair": false, "banned_at_utc": null, "body": "People do indeed love babies. Throwing a baby shower is fun for them too. I love picking out baby clothes and baby things. Sharing in your first pregnancy and baby is exciting for them. I feel you on the anxiety thing. I too have struggled with it for years. Have you been seeing someone about behavior modification? It does help. I am on medication too. Honestly having babies threw my anxiety into high gear, and that's when I had to start meds for it for the first time. You may really want family help when the baby comes. I lamented that no family lived close when my 2 and 4 year olds were smaller. Frankly I still wish family was around to help now. Brand new babies are very hard. This will likely be a very challenging yet rewarding time for you. If you have trouble accepting help at times (I do), remind yourself that from a psychological standpoint doing favors and small tasks for someone actually pleases and emotionally invests the giver more than the reciever. I swear, seriously look it up.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563891714, "distinguished": null, "edited": false, "gildings": {}, "id": "eukq40w", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukq40w/", "retrieved_on": 1563891726, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Moogs9", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_9pudb", "author_patreon_flair": false, "banned_at_utc": null, "body": "I have anxiety, too, and absolutely hate being the center of attention, so hopefully I can be of some help. There were a few things we did to combat the anxiety of a shower:\n\n1. We had two showers - one before she was born, and one afterwards (different groups of people, lol). I insisted on having both be coed so my husband could be there. This was partially because it's not just my baby, why should I be the only one who gets to celebrate, but largely because having him there would make me far less anxious. \n2. The pre-baby shower was more typical, but since she was here for the other one, no one cared about us, haha. They all just wanted to see and hold her. \n3. We were fortunate enough to have gotten most of what we needed before she was born, so for the post-baby shower, we asked specifically for diapers and books. No one even wrapped anything, let alone wanted to watch us open gifts. A few people did bring a wrapped gift, but most didn't. \n\nI hope this helps! At the very least, know that you're not alone. The only reason we had any showers was because we are also first-time parents and needed so many things that we couldn't afford on our own. It's a tough spot to be in with anxiety. It's a great way to see how much these people love you, though. You'll get through it :) Feel free to PM me if you need anything!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563892086, "distinguished": null, "edited": false, "gildings": {}, "id": "eukr413", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukr413/", "retrieved_on": 1563892097, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "emoolay", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1tkhy7p8", "author_patreon_flair": false, "banned_at_utc": null, "body": "Im similar to OP in that I have anxiety with the baby shower idea.  My husband and I agreed to have a mixed baby shower since he is also sad about “female only” showers because he loves kids and wants to be the most involved dad.  Perfect!  We are planning on inviting a lot of his friends from work and their significant others if they want to come.  We are probably going to have to do the gift opening, but he’s excited to do the opening since guys rarely get to do that part!  I can be the second holder of the gift which takes some pressure off of the initial reaction for me.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563892652, "distinguished": null, "edited": false, "gildings": {}, "id": "euksogu", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk0egt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euksogu/", "retrieved_on": 1563892664, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "EmotionalFix", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_dl24ivr", "author_patreon_flair": false, "banned_at_utc": null, "body": "As someone else that has anxiety and thyroid issues I feel this deeply. A few tips - ask for them to do it as a couples shower. Perhaps a welcome baby bbq. This way your husband can be there to take some of the attention and with men there showers tend to be less formal.\n\nAlso, perhaps think of it as not being for you but for the baby. You want the baby to have everything you didn’t and this is the start to that. Having the shower is not about saying you can’t do it alone but that you don’t have to. It is a first step to insuring that your baby is surrounded by loving people that they can rely on. It’s a symbol to show that your baby will have the large and close family that you didn’t get to have. \n\nAs far as friends that aren’t close by, send them the invite. You can reach out to them right around when they should receive it to let them know that you do not want them to feel pressured to come or send a gift, but that you want them to know they are an important part of your life and you would like for them to be a part of the baby’s life as well. \n\nYou can also put on the invite “gifts are not expected, but will be appreciated.”  This can relieve the feeling that you are obligating people to get you something. \n\nAs far as, “I don’t really need all this stuff” I suggest looking at several example registries and things we used/wish we had lists that are on this sub. This can give you a better idea of what things you can leave off the registry. \n\nIt’s ok to not want a shower and it’s ok to be nervous about the attention it will put you under. But I would suggest that if your in laws are wanting to help you get ready for the baby, let them. Based on your post this shower is out of love for you, your husband, and your baby. At the end of the day, you accepting the shower is going to allow your in-laws to show their love for the baby you are creating. That doesn’t mean you can’t be nervous or uncomfortable with being in the spotlight during it.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563893472, "distinguished": null, "edited": false, "gildings": {}, "id": "eukv0ta", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukv0ta/", "retrieved_on": 1563893483, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Jolisa92", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_3qwc3yl", "author_patreon_flair": false, "banned_at_utc": null, "body": "If you don't want to have a baby shower you could always make excuses that the pregnancy is too tough, like you're just too exhausted. People can still gift you stuff uf there is no party. In my experience lots of people bring stuff after the baby is born. And for bigger purchases: you could ask your MIL and godmother to get you something for the baby! There is also good second hand sruff or borrow stuff. Some things are needed only for a couple of months. Also, babys don't actually need that much, you are most important to your boy, not stuff :)\nIf you have the party or not: it's ok to be emotional about this. They are all normal feelings and everything is harder while pregnant too...\nHugs", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563894633, "distinguished": null, "edited": false, "gildings": {}, "id": "eukyajn", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eukyajn/", "retrieved_on": 1563894644, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Enigma_Meat", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_7xzag", "author_patreon_flair": false, "banned_at_utc": null, "body": "Hey you sound like me ! I was super anxious about my baby shower having pretty much no friends and what family I do have lives a mildly inconvenient distance away. My mother in law and partners god mom planned the shower and paid for it. I invited every friend I could think of even though I’m not close with anyone. I had one friend show up. Literally one. And some family members. On my partners side, he had well over 50people friends and family. I let him take reins being the more social one anyway. I freak out in any social situation and always need his help completing simple tasks like picking up prescriptions because my anxiety can get so bad. When we we opening presents we did it together but he did all the talking. It was nice to have the spotlight mostly on him and to not have to shout at a crowd of people myself ! But since I was the one who was pregnant of course everyone did want to talk to me. Usually in a party setting I won’t say a word to anyone unless spoken to first. So during this event it was nice having so many people actually come up to me because it gave me the chance to interact and get social. I didn’t get sad about not having any friends or only have one person show up, I focused on bonding with my partners family. We got almost everything we need for the baby and plenty of gift cards to take care of the rest ! The whole thing was such a blessing.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563895448, "distinguished": null, "edited": false, "gildings": {}, "id": "eul0izg", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eul0izg/", "retrieved_on": 1563895462, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "MallyOhMy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_l965mbm", "author_patreon_flair": false, "banned_at_utc": null, "body": "Send invites to your out of state friends, but be sure to include your online gift registry. Maybe you can include an extra insert for those friends saying you know it's unlikely they can come, but you love and miss them and want to include them in your life.\n\nRemember that baby shower participation is voluntary. They don't have to come. They don't have to bring a gift. They choose to.\n\nYour MIL didn't have to throw a shower. She chose to, because she loves you and she wants you to feel celebrated and supported as you bring a new life into the family. And don't discount the excitement she feels that her son and daughter in law are having a baby when they always thought they couldn't.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563896506, "distinguished": null, "edited": false, "gildings": {}, "id": "eul3g8t", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eul3g8t/", "retrieved_on": 1563896518, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "nogiraffetattoo", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_g91jg", "author_patreon_flair": false, "banned_at_utc": null, "body": "Just a small tip - if you do have a shower and there are little kids present (there often are at ours), kids are a great help at taking the gift-opening-focus off of you. You can have them bring you gifts and help open and hold up the thing to show everyone. I found that helpful. I don't like being the center of attention either, but I took it as an opportunity to chat with people, enjoy some good food, and get a bunch of junk for my baby, half of which I returned and exchanged for other stuff that I actually needed/wanted.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563896521, "distinguished": null, "edited": false, "gildings": {}, "id": "eul3hso", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eul3hso/", "retrieved_on": 1563896533, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "JoNightshade", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_7k30e", "author_patreon_flair": false, "banned_at_utc": null, "body": "So, when I was pregnant with my first, my MIL threw me a baby shower. She did not live near me, so family other than my mom wouldn't be coming, and I had like... one friend at the time. Leading up to the thing, I was super anxious because who the hell was even going to show up? It was going to be like a birthday party where nobody showed, you know? Except that my MIL invited like freakin' everyone from her church. And I showed up to a house of almost complete strangers, all of whom just wanted to bless me. It honestly wasn't even about me - in many ways it was them celebrating my MIL becoming a grandmother and sharing in her joy. And that was okay! It was cool! They all welcomed me warmly and we played some games and they gave me lovely gifts and wrote parenting advice on little cards to give me. It was lovely. I totally hear you on feeling like you shouldn't be taking \"free stuff\" from people just because you're having a baby, but it wasn't like that at all. These people WANTED to give me this stuff, they were overjoyed to do so. And now that I'm a mom I understand - motherhood is hard! It really does take a village, and we all have to support each other.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563896656, "distinguished": null, "edited": false, "gildings": {}, "id": "eul3uy8", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eul3uy8/", "retrieved_on": 1563896668, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Hobbelu", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_ai1iy", "author_patreon_flair": false, "banned_at_utc": null, "body": "I had a very similar post when I was expecting my first and I found that this is much more common than you think.  I absolutely hate being the center of attention, and not being able to have wine just made it worse.  We opted for a super casual co-ed backyard BBQ.  We called it a party to celebrate soon-to-be parents, rather than a baby shower and pretty much kept all references to \"baby\" out of it haha.  We had totally normal backyard games, like corn hole, cowboy golf, bocce ball, etc. to entertain people.  \n\nAlso, I have a ton of family out of state and wanted them to feel included but not pressured to send us gifts.  I sent them a copy of our super casual BBQ invite and put a sticker note on the back that said something like \"Hi Family/Friends! We understand that you're probably not going to fly across the country for a celebratory BBQ, but we wanted to share so you know what's going on in our lives.  We hope to see you all soon the next time we visit!  p.s. No gifts please\".  This way people don't think that you're fishing for gifts, but the people who still really want to get you something will just ignore your note and do it anyway.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563897024, "distinguished": null, "edited": false, "gildings": {}, "id": "eul4wcg", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eul4wcg/", "retrieved_on": 1563897035, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "2centsdepartment", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_a6c1u", "author_patreon_flair": false, "banned_at_utc": null, "body": "I'm 42 and single and I had a baby in March. Like you I thought my thyroid issue rendered me infertile. Boy was I wrong. And like you at first I was dead set against a baby shower. I thought that's what you do for young pregnant women not grizzled old ladies like me. Again, I completely missed the mark.\n\nIt turns out my incredibly loving and supportive village truly wanted to shower my baby with gifts. People love babies! Two of my closest friends put the shower together and we had it at my aunt's house and it was 100% the best day of my pregnancy. Weather was gorgeous, I saw old close friends I don't get to see nearly enough of. One of my dearest friends who I hadn't seen in almost 20 years flew out from Florida for the weekend. The whole thing was incredible. My friends ensured it was a stress-free low-key day.\n\nMy situation is a little different because I'm single so I knew I would be relying on the continued support of my village. And I figured if they want a shower I'll let them have a shower. It paid off because it turns out people genuinely love being part of the baby process. I only invited people who wouldn't irritate me or try to take over.\n\nI encourage you to strongly consider having a shower. You will be surrounded by people who love you and want to do something nice for you. It makes people feel good to do nice things. There should be more joyous ocassions in the world, why take one away from your village?", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563897028, "distinguished": null, "edited": false, "gildings": {}, "id": "eul4wop", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eul4wop/", "retrieved_on": 1563897039, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "amore_moon_pizza", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_34a8erbw", "author_patreon_flair": false, "banned_at_utc": null, "body": "I understand your situation. I can’t offer advice but I can share what I’m planning on doing and it might help you find something that works for you.  \n\nI’m an “old” 39yo FTM and I have terrible anxiety when I’m the center of attention and I hate being fussed over.  Also, I’m pretty introverted, non-traditional, and don’t particularly like “all girl gatherings with fun and games.”  \n\nNo showers for me. We don’t need helping buying all the stuff for baby so it was an easy decision from that stand point.   But, I reluctantly put together a small registry for little things on amazon and target if someone wanted to gift us things.  \n\nIm due in October and we are going to do a baby meet and greet for friends after the holidays.  Like a shower but the baby will be the center of attention and not me. Plus, it will be co-Ed.  And probably at a brewery where we cater food. \n\nWe will see my husband’s family at Thanksgiving and planning a trip to my hometown in the spring to see my family (7 hours away).  \n\nDone. All aspects are taken care of. \n\nAlso, no visitors say the hospital. Only my in-laws.  My sister is coming to visits two weeks after we get home.  My mom died 5 years ago and I’m not close with my dad.  Close friends will be invited to our house as we decide when we can handle guests.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563899738, "distinguished": null, "edited": false, "gildings": {}, "id": "eulcuea", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulcuea/", "retrieved_on": 1563899834, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "halfwaygonetoo", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_fntiz", "author_patreon_flair": false, "banned_at_utc": null, "body": "I'm a Grammy now, so I've been on both sides of being the mom and just family. \n\nObviously there are things that you must have: carseat, bassinet or crib, diapers, wipes, clothing, receiving blankets, etc\n\nMost of these things, you are going to need a ton of just to get you through the first month.  For example: a 100 pack of diapers may not even last 2 weeks. Those suckers are expensive. You'll be changing your baby's clothes probably, at least, twice a day, if not more. \n\nAs for the other items that are available: these just make your's and your DH's life so much easier. The easier your lives are, the better you both will be able to concentrate on taking care of your baby. The better parents you will be. \n\nNo, it's not fun to be the center of attention. In regards to the shower, YOU really aren't. Your baby is. You just happen to be holding the baby.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563900060, "distinguished": null, "edited": false, "gildings": {}, "id": "euldrd9", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/euldrd9/", "retrieved_on": 1563900171, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Monztur", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_835l9", "author_patreon_flair": false, "banned_at_utc": null, "body": "I have a 12 week old baby, so pregnancy is pretty fresh in my mind.\n\nPregnant ladies obsess about baby showers. Let me tell you the reality of baby showers:\n\nAll mom's find them awkward. It's almost always for the benefit of the woman hosting it (usually grandma). Just go and play along, it's one weird afternoon and not worth getting in a row with your mother in law. \n\nYou will be expected to make a registry. Treat this as your own shopping list because no one, and I mean no one, is going to buy anything off of it. Everyone will ask you for your registry despite this, and complain until you make one. Accept this and don't be offended, it's one of the unsolved mysteries of the universe.\n\nYou will get nothing but useless newborn clothes, all of which will be for the wrong season and have buttons. Real buttons that you have to do up on a squirming newborn. You will feel obligated to write thank you cards and take photos of your grumpy baby wearing all of these stupid impractical clothes.\n\nWrite the thank you cards before the baby is born otherwise your mother in law will nag you until the heat death of the universe that you never thanked her second cousin Linda who lives in Newcastle for the hand knit new born sweater she made for your July baby. Linda also chain smoked while she knit the bloody thing. Thanks Linda 🖕", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563900445, "distinguished": null, "edited": false, "gildings": {}, "id": "eulewac", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulewac/", "retrieved_on": 1563900581, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "hedonistjew", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_dof6n", "author_patreon_flair": false, "banned_at_utc": null, "body": "Check out kids consignment shops in your area for less expensive baby items. Clothes, basinet, stroller, play mat for later, everything you need you can usually find at a second-hand store. I searched for \"children's consignment + my area code\" on Google. \n\nIf there aren't any near you, look at Mercari and FB marketplace for deals on baby items. \n\nThis will make getting things yourself more affordable and it reduces waste in the environment. \n\nTaking expensive gifts out of the equation could help lower your anxiety about the party. \n\nInstead of gifts, say you want to start a baby book library, that it would be preferred that people get books and write little notes for your babe in them. We did something like that for our first and we have very sweet bed time books with inscriptions from our loved ones now. Excellent keepsake. \n\nAt the shower, have things for the guests to do (like make a baby alphabet book, draw on onesies or bibs, play games like guess the #of candies in a bowl, etc). Make the activities about the baby but not about you. Pinterest has lots of suggestions for this. \n\nIt's your shower, do what you want to make sure you're comfortable. \n\nOr, like others have said, skip the shower. Tell your MiL that you really appreciate the intention but that you're just not comfortable and don't want to suffer from increased anxiety while pregnant. \n\nGood luck!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563900766, "distinguished": null, "edited": false, "gildings": {}, "id": "eulfv6w", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulfv6w/", "retrieved_on": 1563900931, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "dolllllface", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_7vs6s", "author_patreon_flair": false, "banned_at_utc": null, "body": "We did a “babyQ” instead of a traditional shower - my husband had more friends and family nearby that could attend, so we did a co-ed type event instead of a traditional shower (which the thought gave me anxiety for similar reasons as yourself) a relaxed bbq with some yard games and mingling. And then when it was time to open presents, it wasn’t just me in the spotlight; my husband was sitting right next to me opening. \n\nMaybe a less traditional shower would be a better option for you!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563900967, "distinguished": null, "edited": false, "gildings": {}, "id": "eulgghn", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulgghn/", "retrieved_on": 1563901142, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "winslowrose", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_41yo26sj", "author_patreon_flair": false, "banned_at_utc": null, "body": "I had similar feelings about a baby shower, whether or not we needed the stuff, the anxiety and the wanting to do it myself part. I can say that I ended up being very thankful for the gifts bc it saved me many trips to target or Walmart during the newborn phase where you absolutely do not (me at least) want to go out, much less navigate trips with a baby. All the stuff I didn’t use or need or barely used I took to a baby consignment and traded or got credit for new stuff she need or I wanted. \n\nI didn’t know what I needed before she got here. Example 1 of many: I thought we would never need a baby swing, now I’m thankful to baby Jesus I can put her in one for a break here and there.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563901404, "distinguished": null, "edited": false, "gildings": {}, "id": "eulhrih", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulhrih/", "retrieved_on": 1563901825, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Squishedskittlez", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_el4ie", "author_patreon_flair": false, "banned_at_utc": null, "body": "I’ve always seen baby showers as a chance for all the baby’s loved ones to have a chance to help provide the best start for the little one possible. I love giving baby gifts and tried to remember how I felt getting to give something for the baby when I had my own baby shower.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563901602, "distinguished": null, "edited": false, "gildings": {}, "id": "eulidmw", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulidmw/", "retrieved_on": 1563902048, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "littlelenaluna", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_2gbna1gf", "author_patreon_flair": false, "banned_at_utc": null, "body": "I was dreading my baby shower. I felt so fat and ugly and my hair was a disaster. I invited some friends from high school but none of them showed. Only one friend from work came, the rest was family and my moms group of friends. I was so embarrassed and emotional. I was so tired and it was hard being around that many people rubbing my belly. I was 8 months pregnant and I didn’t even have any shoes that fit me anymore so I was barefoot. I was also very poor at the time and I felt I didn’t deserve the baby shower. I never ask for help even when I need it. It was horrible I was crying in my head the whole time. Then when it came time to open gifts it’s hits me. It wasn’t for me. It was all for my baby. I was so thankful and grateful for all the gifts that my baby desperately needed. Without the baby shower I would have surly ran out of diapers, clothes, wipes, baby wash ect. My baby really really needed all of those things. I wasn’t able to provide them all myself so even though I didn’t enjoy my baby shower or all the attention I appreciate the gifts for my baby because they helped us soooo much. As a mother now, there are going to be a lot of situations where you feel uncomfortable or annoyed or embarrassed but you don’t do it for you anymore, you just do it for the baby. Hope this helps good luck", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563902194, "distinguished": null, "edited": false, "gildings": {}, "id": "eulk1a1", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulk1a1/", "retrieved_on": 1563902631, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "snowflake008", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1jzpo7kx", "author_patreon_flair": false, "banned_at_utc": null, "body": "I felt uncomfortable and anxious to the point of vomiting at both of my bridal showers and my anxiety went through the roof when I got pregnant. I had some complications and I was terrified of losing the baby.\n\nSo I declined all baby shower offers from coworkers, in laws, and my family. The people who wanted to host the showers were really pissed off and called me ungrateful, selfish, snotty, stupid, naieve, said I'd regret it, etc. \n\nI was shocked at how many people were supportive though!  So many said they could tell I was anxious at my bridal showers and they didn't want me to be stressed out during pregnancy and they supported my decision.  They sent cards, giftcards, and gifts to my home and I still felt really loved and supported. \n\nLooking back on it now, 8 weeks postpartum, it was absolutely the best decision for my mental health.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563902584, "distinguished": null, "edited": false, "gildings": {}, "id": "eulkt6h", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulkt6h/", "retrieved_on": 1563902958, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "fbc517", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1v2w602e", "author_patreon_flair": false, "banned_at_utc": null, "body": "Just want to add to this because I just wish this could be shouted from the rooftops—you do not HAVE to have a baby shower! Even my closest friends tried to convince me otherwise, saying well just do a small one, or just have people contribute money, or just do a small registry, etc etc—all of these mitigating things that were based around the absolute truth (in their view) that you NEED a bunch of things for baby and it’s stupid to try to buy them all yourself when other people want to buy them for you. \n\nRegistries overwhelm me. We didn’t register for our wedding (we did a charity registry with different orgs that we thought our guests would care about—most of them didn’t donate which we were fine with, we wanted no pressure). People balked at us at first, especially because I was in grad school at the time and husband was a teacher. Why would you turn down free stuff when you’re on such a tight budget?? But in my view we didn’t NEED stuff for the sake of getting stuff, and for our first Christmas married we asked MIL for gift cards (my parents and I don’t do gifts so it’s really just MIL/family that we exchange gifts with) and with those we bought a bunch of house stuff we wanted to start the next chapter of our married lives. Still were smart about it money-wise, but didn’t have to create a huge registry and have EVERY guest buy us something. \n\nFor baby, there was even more pushback. “Okay, maybe you had some house stuff when you got married, but you have NO baby stuff! And there’s SO MUCH YOU NEED!!!” Again, we’re on a budget, but the sheer thought of all the stuff that could just accumulate and take on a life of its own is so overwhelming to me—and pps are so right. You DO NOT NEED THAT MUCH! We both have moms that really want to help, and if left to their own devices would buy literal tons of clothes and toys and different items, and we would drown in a sea of stuff. So, we’re asking that they help us with the few big ticket things (carseat, stroller, crib and bassinet—which the crib and/or bassinet aren’t even necessities if you don’t want to go that route AND the crib we want is $80 at Ikea so not that big ticket, but still). Then we will be picking up the other things as we go (we’ve already hit up yard sales, FB buy/sell/trade, and other sales). \n\nThe thing that I kept thinking about was that, while people love to buy baby things, it’s my feeling that they love to buy “cute” baby things in their style and aesthetic. So the argument about how “you need so many things, let people buy them for you” always bothered me because no one wants to come to a baby shower having just bought a dehumidifier. (NOT a necessity, just an example of a “boring” baby item you may want). They want to come with a set of onesies with cutesy sayings they find funny, or a toy that lights up and plays music. The last time I went to a baby shower I bought a set of gender-neutral onesies from the registry and wrote a sweet card, but felt like a total loser when every other gift she opened was 1) not on the registry and 2) was cool and personalized to the gift-GIVER. Which is fun for them, but as the recipient, it’s not actually serving the purpose everyone says it will. You can, I think, buy for yourself all of the practical things your baby needs, even on a budget, and even without a shower you’ll probably STILL get some cutesy stuff from people here and there, but to me it’s less overwhelming—it’s a one-off gift, it’s not everyone you know feeling obligated to get something from a super long list you felt pressured to make. (If you didn’t feel pressured to make it, and you’re fine with baby showers, then that’s awesome! My issue is just with people who don’t want one being pressured into it. If you’re happy and willing then I’m glad!)\n\nWe still want to celebrate the joy with close family members, and we know they’ll want to buy something, so what we’re hoping to do is ask everyone to bring a favorite children’s book and sign the inside with a message for little one to read every time they read that story! That way it’s still a personal gift, they get to feel connected in their own way, but to me it feels more manageable. I want them to feel involved, I want to share the joy, but I also don’t want to end up with a million “grandma is my homegirl/my aunt is awesome/I get my looks from grandpa” onesies and seventy light up glow worm toys that play music. That’s just what we’re doing and your family may be different! I have a pretty messy side of the family too, and MIL is the one who would be throwing the shower. I totally understand the trepidation you feel and I think it’s good to talk through all the feelings you’re having about baby showers and family and everything they entail! And finally—don’t let anyone make you feel like less THINGS mean baby will feel less loved/happy/cared for/safe. Sorry for the LONG post. \n\nTL;DR: You don’t HAVE to have a shower, even if you’re on a budget. If you want you could ask for a small sentimental gift (book or blanket) from each person in a small gathering to still celebrate the occasion without making a registry. And finally—don’t let anyone make you feel like less THINGS mean baby will feel less loved/happy/cared for/safe. You got this mama!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563902964, "distinguished": null, "edited": false, "gildings": {}, "id": "eullghp", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_eujvmqd", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eullghp/", "retrieved_on": 1563903260, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Radikiyo", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1utnxo1p", "author_patreon_flair": false, "banned_at_utc": null, "body": "I second this! I didn’t want a shower either and we had a sip and see when baby was about 6 weeks old. Made me feel better about people traveling from far away because they at least get to see the little one. Took attention off me too. We had a registry link on the invite (IDK some people have an opinion regarding this etiquette wise, but no one we knew seemed to care- most people didn’t know what a “sip n see” is anyway. And it’s not like a we had a shower AND a sip and see, so having the link on there made sense.)\nWe also asked for second-hand gifts. We used Babylist.com so we could register for whatever.\n\nWe received SO many gifts, many before baby was born. \n\nI know for me at least, at first it seemed presumptuous to have a registry. But now I have a lot of long distance friends and acquaintances that are having babies and I google their registry anyway even though I’m not going to the shower or they’re not having one. And people have done that to us. PEOPLE LOVE BUYING STUFF FOR BABIES.", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563909184, "distinguished": null, "edited": false, "gildings": {}, "id": "eulyq6r", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_euk02pq", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eulyq6r/", "retrieved_on": 1563909195, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Bryleigh98", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_1nxf7ej7", "author_patreon_flair": false, "banned_at_utc": null, "body": "So many babies grow up without anyone to care for them. Seeing physical numbers of people who care for you and your child and want the best for the both of you is nothing to be anxious over. \n\nAppriciate the people who love you, and those people already love your little one without meeting them just because of *you*. Let them celebrate that sex you had with your husband- that beautiful child the two of you made. \n\nYou can do this, mama!", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563909725, "distinguished": null, "edited": false, "gildings": {}, "id": "eum0bq1", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t3_cgqvmt", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eum0bq1/", "retrieved_on": 1563909737, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}, {"all_awardings": [], "approved_at_utc": null, "author": "Meowmyy", "author_flair_background_color": null, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_template_id": null, "author_flair_text": null, "author_flair_text_color": null, "author_flair_type": "text", "author_fullname": "t2_31ttn78r", "author_patreon_flair": false, "banned_at_utc": null, "body": "Yes! I also wasn't sure about a registry but everyone kept asking us to make one! So I did and we really received pretty much everything on it! (We also used Babylist which is amazing!)", "can_mod_post": false, "collapsed": false, "collapsed_reason": null, "created_utc": 1563925956, "distinguished": null, "edited": false, "gildings": {}, "id": "eun9m0o", "is_submitter": false, "link_id": "t3_cgqvmt", "locked": false, "no_follow": true, "parent_id": "t1_eulyq6r", "permalink": "/r/Mommit/comments/cgqvmt/struggling_with_the_idea_of_the_baby_shower/eun9m0o/", "retrieved_on": 1563925967, "score": 1, "send_replies": true, "stickied": false, "subreddit": "Mommit", "subreddit_id": "t5_2s3i3", "total_awards_received": 0}]}